[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/aba/aband/abandon__us_2.mp3","phonsUS":"/əˈbændən/","level":"B2","meanings":[{"def":"to leave somebody, especially somebody you are responsible for, with no intention of returning","examples":["abandon somebody The baby had been abandoned by its mother.","People often simply abandon their pets when they go abroad.","abandon somebody to something ‘We have been abandoned to our fate,’ said one resident.","The study showed a deep fear among the elderly of being abandoned to the care of strangers."],"opposite":"","synonyms":""},{"def":"to leave a thing or place, especially because it is impossible or dangerous to stay","examples":["abandon something Snow forced many drivers to abandon their vehicles.","He gave the order to abandon ship (= to leave the ship because it was sinking).","abandon something to somebody/something They had to abandon their lands to the invading forces.","Much of the land has now been abandoned in favour of more fertile areas to the south.","The town had been hastily abandoned."],"opposite":"","synonyms":""},{"def":"to stop doing something, especially before it is finished; to stop having something","examples":["They abandoned the match because of rain.","The plans for reform were quietly abandoned.","She abandoned hope of any reconciliation.","We had to abandon any further attempt at negotiation.","She abandoned her teaching career in favour of sport.","The government does not propose to abandon the project altogether.","Traditional policies were simply abandoned.","They were forced to abandon the game because of rain.","Work on the new building was finally abandoned.","He abandoned the army for politics."],"opposite":"","synonyms":""},{"def":"to stop supporting or helping somebody; to stop believing in something","examples":["abandon somebody The country abandoned its political leaders after the war.","abandon something By 1930 he had abandoned his Marxist principles.","This principle has now been effectively abandoned."],"opposite":"","synonyms":""},{"def":"to feel an emotion so strongly that you can feel nothing else","examples":["He abandoned himself to despair."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["with gay abandon"]},{"pos":"noun","level":"","meanings":[{"def":"a way of behaving that is not sensible and shows that you do not care about the possible results of your actions or what other people think","examples":["He spent money with careless abandon."],"opposite":"","synonyms":""},{"def":"without thinking about the results or effects of a particular action","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"with gay abandon","def":"without thinking about the results or effects of a particular action","examples":[]}],"phrasal":[],"related":[]}]