[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/abi/abili/ability__us_4.mp3","phonsUS":"/əˈbɪləti/","level":"A2","meanings":[{"def":"the fact that somebody/something is able to do something","examples":["People with the disease may lose their ability to communicate.","This program has the ability to adapt to its user.","Students must demonstrate the ability to understand simple texts.","She has an uncanny ability to predict what consumers will want.","A gentle form of exercise will increase your ability to relax.","I seem to have lost my ability to attract clients.","He has this innate ability to see beyond the range of most people.","The system has the ability to run more than one program at the same time.","Everyone has the right to good medical care regardless of their ability to pay."],"opposite":"inability","synonyms":""},{"def":"a level of skill or intelligence","examples":["Their athletic ability is stunning.","cognitive/intellectual/mental ability","A woman of her ability will easily find a job.","Are you used to teaching students of mixed abilities?","It's important to discover the natural abilities of each child.","I try to do my job to the best of my ability (= as well as I can).","Fox's abilities were soon recognized.","He was a man of extraordinary abilities.","I taught a wide range of abilities.","It is much more difficult to teach a mixed-ability class.","She showed a high level of ability as a runner.","She showed great ability in mathematics.","The school does nothing for children of high ability.","There was a high level of ability among the school leavers.","We will keep you informed to the best of our ability.","Almost everyone has some musical ability."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["-ability","mixed-ability"]},{"pos":"suffix","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/_/_ab/_abil/_ability_1_us_1.mp3","phonsUS":"/əbɪləti/","level":"","meanings":[{"def":"the quality of being able to be or having to be","examples":["capability"],"opposite":"","synonyms":""},{"def":"the fact of having the quality mentioned","examples":["changeability"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]