[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/abl/able_/able__us_2.mp3","phonsUS":"/ˈeɪbl/","level":"A2","meanings":[{"def":"to have the skill, intelligence, opportunity, etc. needed to do something","examples":["You must be able to speak French for this job.","A viral illness left her barely able to walk.","We're still able to get visas to come and go from Thailand.","I didn't feel able to disagree with him.","Will you be able to come?","Are you really willing and able to do what is necessary?","They don't even seem able to see what's good about their ideas.","These families are less able to afford a balanced, healthy diet.","Can you play the piano?","I can hear someone calling.","The podcast can be downloaded here.","Can you/​are you able to come on Saturday?","You’ll be able to get a taxi outside the station.","I haven’t been able to get much work done today.","She’d love to be able to play the piano.","Our daughter could walk when she was nine months old.","I was able to/​managed to find some useful books in the library.","I could find some useful books in the library.","We weren’t able to/​didn’t manage to/​couldn’t get there in time.","I could see there was something wrong.","I could have won the game but decided to let her win.","Local farmers were able to make a decent living selling their produce.","Humans are uniquely able to use true language.","I was just able to make out a dark figure in the distance.","Once you've had some sleep you'll feel better able to cope.","She is not physically able to take care of herself.","Unfortunately they weren't able to come."],"opposite":"unable","synonyms":""},{"def":"intelligent; good at something","examples":["She's the ablest student in the class.","We aim to help the less able in society to lead an independent life.","He was a very able man in business matters.","less able students","She seems very able."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["-able","able-bodied","able seaman","date-able","able seamen","be able to do something in your sleep","not be able to do something to save your life","not (be able to) take your eyes off somebody/something","be able to count somebody/something on (the fingers of) one hand"]},{"pos":"suffix","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/_/_ab/_able/_able_1_us_2.mp3","phonsUS":"/əbl/","level":"","meanings":[{"def":"that can or must be","examples":["calculable","taxable"],"opposite":"","synonyms":""},{"def":"having the quality of","examples":["fashionable","comfortable","changeable"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]