[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/abs/absor/absorb__us_2_rr.mp3","phonsUS":"/əbˈzɔːrb/","level":"B2","meanings":[{"def":"to take in a liquid, gas or other substance from the surface or space around","examples":["absorb something Plants absorb carbon dioxide from the air.","Let the rice cook until it has absorbed all the water.","absorb something into something The cream is easily absorbed into the skin.","Concrete absorbs very little moisture.","Nutrients are absorbed into the bloodstream."],"opposite":"","synonyms":""},{"def":"to take in and keep heat, light, energy, sound, etc. instead of reflecting it","examples":["Black walls absorb a lot of heat during the day."],"opposite":"","synonyms":""},{"def":"to reduce the effect of a physical impact or movement","examples":["This tennis racket absorbs shock on impact.","The bats have graphite shafts that absorb the vibration."],"opposite":"","synonyms":""},{"def":"to take something into the mind and learn or understand it","examples":["It's a lot of information to absorb all at once.","It took me several days to absorb the fact of her death.","They spent a week in Paris just absorbing the atmosphere.","He stood still, absorbing every detail of the scene.","It was great to sit back and absorb the atmosphere.","The information is presented so that it can be readily absorbed."],"opposite":"","synonyms":""},{"def":"to interest somebody very much so that they pay no attention to anything else","examples":["This work had absorbed him for several years.","His work absorbed him completely."],"opposite":"","synonyms":""},{"def":"to make something smaller become part of something larger","examples":["absorb something The town absorbs an influx of tourists every summer.","be absorbed into something The surrounding small towns have been absorbed into the city.","These committees were gradually absorbed into the local government machine."],"opposite":"","synonyms":""},{"def":"to use up a large supply of something, especially money or time","examples":["The new proposals would absorb $80 billion of the federal budget.","My work absorbs a great deal of my time."],"opposite":"","synonyms":""},{"def":"to deal with changes, effects, costs, etc.","examples":["The company is unable to absorb such huge losses."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]