[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/abu/abuse/abuse__us_3.mp3","phonsUS":"/əˈbjuːs/","level":"C1","meanings":[{"def":"the use of something in a way that is wrong or harmful","examples":["alcohol/drug abuse","The system of paying cash bonuses is open to abuse (= might be used in the wrong way).","The legal system is open to abuse.","abuse of something He was arrested on charges of corruption and abuse of power.","What she did was an abuse of her position as manager."],"opposite":"","synonyms":""},{"def":"unfair, cruel or violent treatment of somebody","examples":["child abuse","sexual abuse","reported abuses by the secret police","She suffered years of physical abuse.","allegations of child abuse","six cases of suspected child abuse","allegations of human rights abuses","She was subjected to regular sexual abuse.","The child had taken a lot of emotional abuse.","abuse of prisoners"],"opposite":"","synonyms":""},{"def":"rude and offensive remarks, usually made when somebody is very angry","examples":["to scream/hurl/shout abuse","a stream/torrent of abuse","The man burst into a torrent of foul-mouthed racist abuse.","The team who lost became a target of abuse for angry fans.","They had to endure continual racial abuse.","He was subjected to a torrent of abuse.","Calling someone stupid is definitely a term of abuse."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["child abuse","elder abuse","self-abuse","racket abuse","racquet abuse","solvent abuse","substance abuse"]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/abu/abuse/abuse__us_1.mp3","phonsUS":"/əˈbjuːz/","level":"C1","meanings":[{"def":"to make bad use of something, or to use so much of something that it harms your health","examples":["to abuse alcohol/drugs","He systematically abused his body with heroin and cocaine.","People who abuse alcohol over a long period will develop health problems."],"opposite":"","synonyms":""},{"def":"to use power or knowledge unfairly or wrongly","examples":["She abused her position as principal by giving jobs to her friends.","He felt they had abused his trust by talking about him to the press (= tricked him, although he had trusted them)."],"opposite":"","synonyms":""},{"def":"to treat a person or an animal in a cruel or violent way, especially sexually","examples":["The boy had been sexually abused.","All the children had been physically and emotionally abused.","abused children"],"opposite":"","synonyms":""},{"def":"to make rude or offensive remarks to or about somebody","examples":["The referee had been threatened and verbally abused.","He claimed he had been racially abused.","The striker has been banned for the rest of the season for verbally abusing a referee.","Journalists covering the case have been threatened and abused."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]