[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/aca/acade/academic__us_2.mp3","phonsUS":"/ˌækəˈdemɪk/","level":"B1","meanings":[{"def":"connected with education, especially studying in schools and universities","examples":["high/low academic standards","She had a brilliant academic career.","one of this country's most prestigious academic institutions","improving the academic achievement of all students","The university is renowned throughout the world for its academic excellence.","academic research/researchers","We are deeply committed to safeguarding academic freedom.","He retired from academic life and went into politics.","The academic year usually starts in September.","It is regarded as the top academic institution in the city.","This university will do all it can to defend academic freedom.","academic research","The enrolment criteria are geographical rather than academic.","Our courses cover a range of academic disciplines."],"opposite":"","synonyms":""},{"def":"involving a lot of reading and studying rather than practical or technical skills","examples":["a mixture of vocational and academic courses","people whose skills are practical rather than academic","academic qualifications/subjects","We are looking for practical experience as well as academic achievement.","She had very few academic qualifications.","The writers' approach is not overly academic.","We need to combine academic and applied knowledge.","I wasn't sure I could cope with the academic demands of the course."],"opposite":"","synonyms":""},{"def":"good at subjects involving a lot of reading and studying","examples":["She wasn't very academic and hated school."],"opposite":"","synonyms":""},{"def":"not connected to a real or practical situation and therefore not important","examples":["It's a purely academic question.","The whole thing's academic now—we can't win anyway.","Most of his questions were of an academic nature."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["academic year","non-academic","English for Academic Purposes","academic years"]},{"pos":"noun","level":"B2","meanings":[{"def":"a person who teaches and/or does research at a university or college","examples":["a leading/distinguished/prominent academic","There is much debate among academics about this issue.","Academics are not generally very well paid.","A distinguished academic from America was due to speak that evening.","Many senior academics are taking up positions overseas."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]