[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/acc/accep/acceptable__us_3.mp3","phonsUS":"/əkˈseptəbl/","level":"B2","meanings":[{"def":"agreed or approved of by most people in a society","examples":["Children must learn socially acceptable behaviour.","It is perfectly acceptable for you as an employee to say no.","Are all political groups equally acceptable?","These actions cannot be considered remotely acceptable in a civilized society.","This crosses the boundaries of acceptable conduct.","a grammatically acceptable sentence","socially acceptable terminology","Children have to learn what is acceptable behaviour and what is not.","Divorce is much more socially acceptable than it used to be.","It's just not acceptable to keep people locked up for so long without trial.","We need laws that are morally acceptable as well as effective."],"opposite":"","synonyms":""},{"def":"that somebody agrees is of a good enough standard or allowed","examples":["For this course a pass in English at grade B is acceptable.","Air pollution in the city had reached four times the acceptable levels.","acceptable to somebody We want a political solution that is acceptable to all parties.","It is possible to find a solution that is acceptable to both sides.","Most people found the drink's taste to be highly acceptable.","Her breeding and background made her eminently acceptable in royal circles.","Yogurt is a perfectly acceptable substitute for cream in cooking.","a compromise that is acceptable to both sides","an attempt to make the reforms acceptable to both sides","the only national newspaper even remotely acceptable to the left wing","We must come up with a solution that our customers will find acceptable.","If you think their offer is acceptable, we'll carry on with the sale."],"opposite":"","synonyms":""},{"def":"not very good but good enough","examples":["The food was acceptable, but no more.","Inspectors found that teaching standards were acceptable, but could be improved."],"opposite":"unacceptable","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]