[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/acc/accep/accept__us_1.mp3","phonsUS":"/əkˈsept/","level":"A2","meanings":[{"def":"to take willingly something that is offered; to say ‘yes’ to an offer, invitation, etc.","examples":["He asked me to marry him and I accepted.","accept something Please accept our sincere apologies.","It was pouring with rain so I accepted his offer of a lift.","I am unfortunately unable to accept your kind invitation.","The board of directors accepted our proposal.","She's decided not to accept the job.","Please accept this small token of my appreciation.","accept something from somebody He is charged with accepting bribes from a firm of suppliers.","accept something for something She said she'd accept $15 for it.","I accepted the gift from my sister.","She graciously accepted my apology.","She accepted a bribe from an undercover policeman."],"opposite":"refuse","synonyms":""},{"def":"to agree to or approve of something","examples":["accept something They accepted the court's decision.","The judge refused to accept his evidence.","He accepted all the changes we proposed.","Are you willing to accept the challenge?","accept something from somebody She won't accept advice from anyone.","accept something for something My article has been accepted for publication.","He agreed to let me go early.","They accepted the court’s decision.","The committee unanimously approved the plan.","She just goes along with everything he suggests.","She finally consented to answer our questions.","I had no choice but to accept the committee's decision.","I was very unwilling to accept her resignation.","He would not accept my advice.","These figures should not be accepted at face value."],"opposite":"reject","synonyms":"agree"},{"def":"to take payment in a particular form","examples":["This machine only accepts coins.","Credit cards are widely accepted."],"opposite":"","synonyms":""},{"def":"to admit that you are responsible or to blame for something","examples":["He accepts full responsibility for what happened.","You have to accept the consequences of your actions.","The company cannot accept liability for any damage caused by natural disasters.","The college cannot accept responsibility for items lost or stolen on its premises."],"opposite":"","synonyms":""},{"def":"to continue in a difficult situation without complaining, because you realize that you cannot change it","examples":["accept something You just have to accept the fact that we're never going to be rich.","to be willing/prepared to accept something","Nothing will change as long as the workers continue to accept these appalling conditions.","accept something as something They accept the risks as part of the job.","accept that… He just refused to accept that his father was no longer there.","Some people readily accept that they may have to pay for medical treatment.","He would not accept the fact that his father was dead."],"opposite":"","synonyms":""},{"def":"to make somebody feel welcome and part of a group","examples":["accept somebody It may take years to be completely accepted by the local community.","accept somebody into something She had never been accepted into what was essentially a man's world.","accept somebody as something He never really accepted her as his own child."],"opposite":"reject","synonyms":""},{"def":"to believe that something is true","examples":["accept something I don't accept his version of events.","accept something as something Can we accept his account as the true version?","accept that… I accept that this will not be popular.","I am not prepared to accept that this decision is final.","it is accepted that… It is generally accepted that people are motivated by success.","something is accepted to be, have, etc. something Their workforce is widely accepted to have the best conditions in Europe.","It was true, but hard to accept.","Most people had come to accept that war was inevitable.","The government now accepts the need for change."],"opposite":"","synonyms":""},{"def":"to allow somebody to join an organization, attend an institution, use a service, etc.","examples":["accept somebody The college he applied to has accepted him.","accept somebody into something She was disappointed not to be accepted into the club.","accept somebody as something The landlord was willing to accept us as tenants.","accept somebody to do something She was accepted to study music."],"opposite":"reject","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]