[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/acc/acces/access__us_2.mp3","phonsUS":"/ˈækses/","level":"B1","meanings":[{"def":"the opportunity or right to use something or to see somebody/something","examples":["High-speed internet access has become a necessity.","access to something/somebody You need a password to get access to the computer system.","access to information/services/resources","access to healthcare/education","They are seeking increased access to markets overseas.","to provide/allow access to something/somebody","to restrict/block access to something/somebody","Journalists were denied access to the President.","Many divorced fathers only have access to their children at weekends (= they are allowed by law to see them only at weekends).","Students must have access to good resources.","He was finally granted access to the medical records.","Men and women should have equal access to education and employment.","Some people are being denied access to adequate medical care.","Students have easy access to libraries.","The computer provides access to all the information.","high-speed internet access","universal access to education","There is a need to increase educational opportunities and access to colleges."],"opposite":"","synonyms":""},{"def":"a way of entering or reaching a place","examples":["The police gained access through a broken window.","Many paths have become overgrown, blocking access.","There is easy access by road.","access to something Disabled visitors are welcome; there is good wheelchair access to most facilities.","The only access to the farmhouse is across the fields.","I lived deep in the country, without easy access to shops.","improved access for disabled visitors","A journalist gained access to the star's hospital room.","A judge ruled that the public have right of access to the area.","Access points to the site had been blocked.","Double doors give access to the terrace.","The changes will improve access for the disabled.","The only access was down a flight of steep steps.","The public will once again have access to the castle.","There is wheelchair access to most of the facilities.","You may need to gain access to the space under the floor."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["access road","access time","open access","self-access","access course","direct access","multi-access","public access","random access","remote access","access provider","public access channel","random-access memory","access roads","access times","access courses","access providers"]},{"pos":"verb","level":"B1","meanings":[{"def":"to open a computer file or use a computer system","examples":["Most people use their phones to access the internet.","to access a file/database","It has never been easier to access information.","All employees can access real-time data.","You should regularly change the password you use to access your online accounts.","access something via/through something Their website can be accessed via the link below.","Employees can access repair records, customer histories and forms in real time.","When people travel, they need to access their email.","More people access the Web by phone than by PC.","The electronic library catalogue can be accessed from terminals all over the university."],"opposite":"","synonyms":""},{"def":"to be able to have or use something, especially something that you have a right to","examples":["Being informed is the first step toward accessing better health services.","States need to understand how to access the federal resources that are available.","Businesses often provide their products at a discount in order to access a potential market."],"opposite":"","synonyms":""},{"def":"to reach, enter or use something","examples":["be accessed (+ adv./prep.) The loft can be accessed by a ladder.","The balcony is accessed via French doors from the living room.","Single rooms have private facilities accessed via the balcony.","The village is easily accessed by public transport."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]