[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/acc/accid/accident__us_2_rr.mp3","phonsUS":"/ˈæksɪdənt/","level":"A2","meanings":[{"def":"an unpleasant event, especially in a vehicle, that happens unexpectedly and causes injury or damage","examples":["a car/road/traffic accident","in an accident He was killed in an accident.","One in seven accidents is caused by sleepy drivers.","The accident happened at 3 p.m.","to have an accident","a serious/minor accident","a fatal accident (= in which somebody is killed)","Every year in the United Kingdom more than 4 000 people die in accidents in the home.","a climbing/riding accident","Take out accident insurance before you go on your trip.","I didn't mean to break it—it was an accident.","Their boat sank in a freak accident.","His son died in a tragic cycling accident.","There are a number of accident blackspots (= places where lots of accidents happen) on that road.","We don't know the cause of the accident.","He was badly injured in a motorcycle accident.","He was badly hurt in an accident involving two cars and a lorry.","She met with an accident while on holiday in Spain.","The ambulance took only six minutes to reach the scene of the accident.","The woman was involved in a road traffic accident.","a fatal road accident","It is the first fatal accident to have occurred at the factory.","It's Dad. He's had an accident at work.","She broke her arm in a riding accident."],"opposite":"","synonyms":""},{"def":"something that happens unexpectedly and is not planned in advance","examples":["Their early arrival was just an accident.","It is no accident that men fill most of the top jobs in nursing.","an accident of birth/fate/history (= describing facts and events that are due to chance or circumstances)","This ring has always brought me good luck.","The results could simply be due to chance.","They met through a series of strange coincidences.","Their early arrival was just an accident.","Fate decreed that she would never reach America.","I believe there’s some force guiding us—call it God, destiny or fate.","It's just an accident of history that the city became part of the Soviet Union.","He claimed that Britain was European only as an accident of geography and that its interests really lay with the United States."],"opposite":"","synonyms":"luck"},{"def":"a thing or person that is very likely to cause danger or a problem in the future because of the condition it is in or the way they behave","examples":["Any one of these nuclear plants may be a disaster waiting to happen."],"opposite":"","synonyms":""},{"def":"people say accidents will happen to tell somebody who has had an accident, for example breaking something, that it does not matter and they should not worry","examples":[],"opposite":"","synonyms":""},{"def":"in a way that is not planned or organized","examples":["We met by accident at the airport.","Helen got into acting purely by accident.","It happened, whether by accident or design, that Steve and I were the last two people to leave."],"opposite":"deliberately","synonyms":""},{"def":"a series of unpleasant events caused by bad luck","examples":["The whole affair has been a chapter of accidents from start to finish."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"an accident/a disaster waiting to happen","def":"a thing or person that is very likely to cause danger or a problem in the future because of the condition it is in or the way they behave","examples":["Any one of these nuclear plants may be a disaster waiting to happen."]},{"idiom":"accidents will happen","def":"people say accidents will happen to tell somebody who has had an accident, for example breaking something, that it does not matter and they should not worry","examples":[]},{"idiom":"by accident","def":"in a way that is not planned or organized","examples":["We met by accident at the airport.","Helen got into acting purely by accident.","It happened, whether by accident or design, that Steve and I were the last two people to leave."]},{"idiom":"a chapter of accidents","def":"a series of unpleasant events caused by bad luck","examples":["The whole affair has been a chapter of accidents from start to finish."]}],"phrasal":[],"related":["accident-prone","accident and emergency","road traffic accident"]}]