[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/acc/accom/accommodation__us_2.mp3","phonsUS":"/əˌkɑːməˈdeɪʃn/","level":"B1","meanings":[{"def":"a place to live, work or stay in","examples":["rented/temporary accommodation","Hotel accommodation is included in the price of your holiday.","We may have to provide alternative accommodation for you.","First-class accommodation is available on all flights.","It can be difficult to find suitable accommodation for those in need.","The building plans include much needed new office accommodation.","furnished accommodation","Many old people choose to live in sheltered accommodation.","She lived on her own in rented accommodation.","The council should be able to help families who have no accommodation.","The family is staying in temporary accommodation until their house is rebuilt.","We need more secure accommodation for young prisoners.","You should book your travel accommodations and flights quickly.","I live in rented accommodation.","The prize includes flights plus seven nights' hotel accommodation."],"opposite":"","synonyms":""},{"def":"somewhere to live or stay, often also providing food or other services","examples":["More and more travelers are looking for bed and breakfast accommodations in private homes.","The boat provides reasonable overnight accommodations for four adults."],"opposite":"","synonyms":""},{"def":"an agreement or arrangement between people or groups with different opinions that is acceptable to everyone; the process of reaching this agreement","examples":["They were forced to reach an accommodation with the rebels.","The two countries should be persuaded to work towards some sort of mutual accommodation.","Some accommodation between conservation and tourism is essential.","Ultimately, there are always limits to political accommodation.","accommodation to the harsh circumstances of rural life"],"opposite":"","synonyms":""},{"def":"the way in which the lens (= a part of the eye) becomes flatter or thicker in order to create a clear image of the object that you want to look at","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]