[{"pos":"preposition","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/acc/accor/according_to_1_us_3.mp3","phonsUS":"/əˈkɔːrdɪŋ tə/","level":"A2","meanings":[{"def":"as stated or reported by somebody/something","examples":["According to Mick, it's a great movie.","You've been absent six times according to our records.","Photography is, according to Vidal, the art form of untalented people.","For Vidal, photography is the art form of untalented people.","His view is that photography is not art but merely the mechanical reproduction of images.","Smith takes the view that photography is both an art and a science.","In Brown’s view, photography should be treated as a legitimate art in its own right.","James is of the opinion that a good painter can always be a good photographer if they so decide.","Emerson believed that a photograph should only reflect what the human eye can see.","This bar chart illustrates how many journeys people made on public transport over a three-month period.","This table compares bus, train, and taxi use between April and June.","The results are shown in the chart below.","In this pie chart, the survey results are broken down by age.","This pie chart breaks down the survey results by age.","As can be seen from these results, younger people use buses more than older people.","According to these figures, bus travel accounts for 60 per cent of public transport use.","From the data in the above graph, it is apparent that buses are the most widely used form of public transport."],"opposite":"","synonyms":""},{"def":"following, agreeing with or depending on something","examples":["The work was done according to her instructions.","Everything went according to plan.","The salary will be fixed according to qualifications and experience."],"opposite":"","synonyms":""},{"def":"to do only what you have enough money to do and no more","examples":["We wanted to buy a bigger house than this but it was a case of cutting our coat according to our cloth."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"cut your coat according to your cloth","def":"to do only what you have enough money to do and no more","examples":["We wanted to buy a bigger house than this but it was a case of cutting our coat according to our cloth."]}],"phrasal":[],"related":["according to somebody’s/something’s lights"]}]