[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/ach/achie/achievement__us_1.mp3","phonsUS":"/əˈtʃiːvmənt/","level":"B1","meanings":[{"def":"a thing that somebody has done successfully, especially using their own effort and skill","examples":["the greatest scientific achievement of the decade","sporting/artistic/academic achievements","It was a remarkable achievement for such a young player.","an outstanding achievement","This work is the crowning achievement (= the greatest achievement) of her career.","They were proud of their children's achievements.","He regarded that victory as the crowning achievement of his career.","It's a monumental achievement for such a young athlete.","Rutherford was knighted in recognition of his scientific achievements.","She was given a prize for her achievements in textile design.","The Olympics are all about celebrating sporting achievements.","This award honours/​honors the achievements of American women in medicine.","This conference in itself constitutes a solid achievement.","This was no mean achievement for the government.","To be offered a place at such a good university is quite an achievement.","To be offered this job is quite an achievement.","This is probably his greatest scientific achievement.","This production is the supreme achievement of Opera North's first decade."],"opposite":"","synonyms":""},{"def":"the act or process of achieving something","examples":["the need to raise standards of academic/educational achievement","He won a lifetime achievement award for cinematography.","Even a small success gives you a sense of achievement (= a feeling of pride).","Climbing the mountain gave him a tremendous sense of achievement.","He believes European civilization was the high point of human achievement.","Success should not be measured solely by educational achievement.","The moon landing of 1969 was seen as a high point of human achievement.","Winners are selected on the basis of high academic achievement.","amazing achievement test scores","an impressive record of achievement","low reading achievement in children","standards by which to measure human achievement","the achievement gap between white and minority schoolchildren","two years of consistently high achievement"],"opposite":"","synonyms":""},{"def":"a reward that you can earn in some video games by completing a challenge or level","examples":["If you complete the game in less than twelve hours, you are awarded an achievement at the end."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]