[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/ack/ackno/acknowledge__us_1.mp3","phonsUS":"/əkˈnɑːlɪdʒ/","level":"B2","meanings":[{"def":"to accept that something is true","examples":["acknowledge something She refuses to acknowledge the need for reform.","I have to acknowledge the fact that I am partly responsible.","It's a generally acknowledged fact.","Most people acknowledge the existence of evil.","to openly/publicly/readily acknowledge something","acknowledge that… He does not acknowledge that he has done anything wrong.","acknowledge something to be, have, etc. something It is generally acknowledged to be true.","It was a stupid thing to do, I admit.","She refuses to acknowledge the need for reform.","They recognized the need to take the problem seriously.","He was forced to concede (that) there might be difficulties.","She was reluctant to confess her ignorance.","He confessed to the murder.","Mental illness can exist for years before families are forced to acknowledge the truth.","a truth that is universally acknowledged","Are you prepared to acknowledge your responsibility?"],"opposite":"","synonyms":"admit"},{"def":"to accept that somebody/something has a particular authority or status","examples":["acknowledge somebody/something The country acknowledged his claim to the throne.","The peace settlement effectively acknowledged the country's independence.","be acknowledged as something He is widely acknowledged as the best player in the world.","be acknowledged to be, have, etc. something He is widely acknowledged to be the best player in the world."],"opposite":"","synonyms":""},{"def":"to tell somebody that you have received something that they sent to you","examples":["All applications will be acknowledged.","Please acknowledge receipt of this letter.","I hereby acknowledge receipt of your letter of 25 July.","The company duly acknowledged receipt of the letter."],"opposite":"","synonyms":""},{"def":"to show that you have noticed somebody/something by smiling, waving, etc.","examples":["I was standing right next to her, but she didn't even acknowledge me.","He waved, acknowledging the applause.","They barely acknowledged each other.","He did not even acknowledge the question."],"opposite":"","synonyms":""},{"def":"to publicly express thanks for help you have been given","examples":["I gratefully acknowledge financial support from several local businesses.","He is always ready to acknowledge his debt to his teachers."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]