[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/act/activ/active__us_2.mp3","phonsUS":"/ˈæktɪv/","level":"A2","meanings":[{"def":"always busy doing things, especially physical activities","examples":["Staying physically active in later years can also keep you feeling younger.","Before our modern age, people had a more physical and active lifestyle.","Try to keep active in the cold weather.","I was already healthy and active and fit","Although he's nearly 80, he is still very active.","While housing for the active retired is our backbone, assisted living is a growth area."],"opposite":"inactive","synonyms":""},{"def":"involved in something; making a determined effort and not leaving something to happen by itself","examples":["They were both politically active.","his active involvement/participation in the arts","She takes an active part in school life.","He still has an active role in running the company.","an active participant/member","He is an active member of several professional organizations.","At 50, I'm an active participant in my community.","active in something She remained active in politics until her death.","active in doing something The parents were active in campaigning against cuts to the education budget.","They took active steps to prevent the spread of the disease.","She has been active in local politics for some years.","When did you first become politically active?","a businessman who is equally active in politics"],"opposite":"","synonyms":""},{"def":"doing something regularly; functioning","examples":["Numbers of sexually active teenagers have continued to rise.","These animals are active only at night.","The virus is still active in the blood.","an active volcano (= likely to erupt)","The volcano is highly active.","By the age of 18, 65% of teenagers report being sexually active."],"opposite":"inactive","synonyms":""},{"def":"lively and full of ideas","examples":["That child has a very active imagination.","It's important to remain mentally active after retirement."],"opposite":"","synonyms":""},{"def":"working; in use or able to be used","examples":["The old watermill was active until 1960.","Ensure the website URL is an active link."],"opposite":"","synonyms":""},{"def":"having or causing a chemical effect","examples":["What is the active ingredient in aspirin?","drugs that are active against cancers"],"opposite":"inactive","synonyms":""},{"def":"connected with a verb whose subject is the person or thing that performs the action","examples":["In ‘He was driving the car’, the verb is active."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["active duty","active list","active citizen","active service","active voice","active lists","active citizens"]},{"pos":"noun","level":"","meanings":[{"def":"the form of a verb in which the subject is the person or thing that performs the action","examples":["In ‘She drove the car’, ‘she’ is the subject and the verb ‘drove’ is in the active."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]