[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/add/addre/address__us_2_rr.mp3","phonsUS":"/əˈdres/","level":"A1","meanings":[{"def":"details of where somebody lives or works and where letters, etc. can be sent","examples":["What's your name and address?","I'll give you my address and phone number.","Is that your home address?","Please note my change of address.","There was no return address on the envelope.","(especially North American English) Each entry must include a valid mailing address.","(British English usually) a postal address","Police found him at an address (= a house or flat) in West London.","people with no fixed address (= with no permanent home)","He gave a false address to the police.","I'm afraid there's nobody called Williams at this address.","Please inform us of any change of address.","Please leave a contact address.","Please write your full postal address."],"opposite":"","synonyms":""},{"def":"a series of words and symbols that tells you where you can find something using a computer or phone, for example on the internet","examples":["What's your email address?","The project has a new web address."],"opposite":"","synonyms":""},{"def":"a formal speech that is made in front of an audience","examples":["tonight’s televised presidential address","Several people made speeches at the wedding.","a lecture on the Roman army","a course/​series of lectures","a televised presidential address","She gave an interesting talk on her visit to China.","to preach a sermon","The union leader gave a short but impassioned public address.","an address by the Chancellor of the University","a radio address to the nation","a public address system","The Secretary General delivered the keynote address at the conference.","He gave details of the policy in an address to party members."],"opposite":"","synonyms":"speech"},{"def":"the correct title, etc. to use when you talk to somebody","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["address bar","IP address","address book","return address","forwarding address","Farewell Address","public address system","Gettysburg Address","State of the Union Address","address bars","address books","public address systems"]},{"pos":"verb","level":"B2","meanings":[{"def":"to think about a problem or a situation and decide how you are going to deal with it","examples":["address something Your essay does not address the real issues.","to address a problem/concern/question","The policy fails to address the needs of the poor.","address yourself to something We must address ourselves to the problem of traffic pollution.","In the long run it is far cheaper to address the needs of poor people than to ignore them.","The authors of the book address themselves to the question of unemployment.","The labour movement has always addressed issues of the quality of life.","These concerns were not adequately addressed in the report.","the problems we are seeking to address"],"opposite":"","synonyms":""},{"def":"to write on an envelope, etc. the name and address of the person, company, etc. that you are sending it to by mail","examples":["be addressed The letter was correctly addressed, but delivered to the wrong house.","address something (to somebody/something) Address your application to the General Manager.","Please send a stamped addressed envelope and we will send you a copy of our brochure.","The minister did not reply to my letter although I addressed it to him personally."],"opposite":"","synonyms":""},{"def":"to make a formal speech to a group of people","examples":["to address a meeting/conference","The President has been asked to address the assembly."],"opposite":"","synonyms":""},{"def":"to say something directly to somebody","examples":["address somebody I was surprised when he addressed me in English.","address something to somebody Any questions should be addressed to your teacher.","The book is addressed to the general reader.","He addressed his comments to the chairman.","He never addressed her directly.","All remarks have to be addressed to the chair.","The message was specifically addressed to the younger generation."],"opposite":"","synonyms":""},{"def":"to use a particular name or title for somebody when you speak or write to them","examples":["address somebody There are different ways in which to address a member of the royal family.","address somebody as something The judge should be addressed as ‘Your Honour’.","In Britain, a surgeon is addressed as ‘Mr’ not ‘Dr’.","address somebody by something She did not address him by name.","How should I address her?","Please address my client by his full name, Mr Babic."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]