[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/adj/adjus/adjust__us_1.mp3","phonsUS":"/əˈdʒʌst/","level":"B2","meanings":[{"def":"to change something slightly to make it more suitable for a new set of conditions or to make it work better","examples":["adjust something Watch out for sharp bends and adjust your speed accordingly.","This button is for adjusting the volume.","The brakes need to be adjusted.","adjust something to something Adjust your language to the age of your audience.","It is important to have equipment that can be finely adjusted.","This estimate may have to be adjusted downwards.","Salaries are adjusted for inflation.","Children are sensitive to family attitudes and adjust their attitudes accordingly."],"opposite":"","synonyms":""},{"def":"to get used to a new situation by changing the way you behave and/or think","examples":["They'll be fine—they just need time to adjust.","adjust to something After a while his eyes adjusted to the dark.","adjust to doing something It took her a while to adjust to living alone.","It can be difficult to adjust to being a parent.","adjust yourself to something You'll quickly adjust yourself to student life.","My eyes were still trying to adjust themselves to the strong sunlight.","She will gradually adjust to her new role.","It may take a little time to adjust to the climate here."],"opposite":"","synonyms":""},{"def":"to move something slightly so that it looks neater or feels more comfortable","examples":["He smoothed his hair and adjusted his tie."],"opposite":"","synonyms":""},{"def":"used to acknowledge and apologize for something that causes problems or difficulties and ask people to accept and adapt to the situation","examples":["The store will be closed this afternoon due to staffing shortages. Kindly adjust."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"kindly adjust","def":"used to acknowledge and apologize for something that causes problems or difficulties and ask people to accept and adapt to the situation","examples":["The store will be closed this afternoon due to staffing shortages. Kindly adjust."]}],"phrasal":[],"related":[]}]