[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/adm/admit/admit__us_2.mp3","phonsUS":"/ədˈmɪt/","level":"B1","meanings":[{"def":"to agree, often unwillingly, that something is true","examples":["It was a stupid thing to do, I admit.","+ speech ‘I'm very nervous,’ she admitted reluctantly.","admit to something Don't be afraid to admit to your mistakes.","admit to doing something She admits to being strict with her children.","admit something He admitted all his mistakes.","She stubbornly refuses to admit the truth.","Why don't you just admit defeat (= recognize that you cannot do something) and let someone else try?","I hate to admit it, but I think he is right.","Admit it! You were terrified!","I'm almost ashamed to admit it, but I watch this show.","admit (that)… They freely admit (that) they still have a lot to learn.","You must admit that it all sounds very strange.","She readily admits mistakes were made.","admit to somebody that… I couldn't admit to my parents that I was finding the course difficult.","be admitted that… It was generally admitted that the government had acted too quickly.","be admitted to be/have something The appointment is now generally admitted to have been a mistake.","He admitted to feeling a bit tired.","He freely admitted that he had taken bribes.","He had caused her more pain than she cared to admit.","He was honest enough to admit his mistake in the end.","I must admit that the results were disappointing.","I was scared and I don't mind admitting it.","In the end he'd done a good job, Carol admitted grudgingly.","She dared not admit her fear.","She would be the first to admit that she is very difficult to work with.","Some admit privately that unemployment could continue to rise."],"opposite":"","synonyms":""},{"def":"to say that you have done something wrong or illegal","examples":["admit to something He refused to admit to the other charges.","admit to doing something She admitted to having stolen the car.","admit something She admitted theft.","He refused to admit his guilt.","The hospital has admitted liability for the accident.","admit doing something She admitted having driven the car without insurance.","It was a stupid thing to do, I admit.","She refuses to acknowledge the need for reform.","They recognized the need to take the problem seriously.","He was forced to concede (that) there might be difficulties.","She was reluctant to confess her ignorance.","He confessed to the murder."],"opposite":"","synonyms":"admit"},{"def":"to allow somebody/something to enter a place","examples":["admit somebody/something Each ticket admits one adult.","admit somebody/something to/into something You will not be admitted to the theatre after the performance has started.","The narrow windows admit little light into the room."],"opposite":"","synonyms":""},{"def":"to allow somebody to become a member of a club, a school or an organization","examples":["admit somebody The society admits all US citizens over 21.","admit somebody to/into something Women were only admitted into the club last year."],"opposite":"","synonyms":""},{"def":"to take somebody to a hospital or other institution where they can receive special care","examples":["be admitted to something Two crash victims were admitted to the local hospital."],"opposite":"","synonyms":""},{"def":"to accept that evidence is legally valid and can be presented in court","examples":["Judge Neilson refused to admit the evidence because it had been illegally obtained."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["admit of"],"related":["admit of","admit of something"]}]