[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/adm/admis/admission__us_1.mp3","phonsUS":"/ədˈmɪʃn/","level":"C1","meanings":[{"def":"the act of accepting somebody into an institution, organization, etc.; the right to enter a place or to join an institution or organization","examples":["Hospital admission is not necessary in most cases.","Hospital admissions for asthma attacks have doubled.","the university admissions policy/office","They tried to get into the club but were refused admission.","She failed to gain admission to the university of her choice.","Is there any charge for admission?","There was a steady decline in cinema admissions during the 1960s.","admission to something countries applying for admission to the European Union","Last admissions to the park are at 4 p.m.","He's applied for admission to the local college.","On admission to hospital you will be examined by a doctor.","emergency admissions to hospital","hospital admission rates","to gain admission to one of the best schools","Admission is by ticket only.","Last admission 30 minutes before closing time.","She works in the college admissions office","The country has applied for admission to the European Union."],"opposite":"","synonyms":""},{"def":"a statement in which somebody admits that something is true, especially something wrong or bad that they have done","examples":["He is a thief by his own admission (= he has admitted it).","admission of something an admission of guilt/failure/defeat","admission that… The minister's resignation was an admission that she had lied.","She has made no admission of any involvement in the plot.","She saw his leaving the company as an admission of failure.","This is a clear admission that you were wrong.","By his own admission he should never have driven so fast."],"opposite":"","synonyms":""},{"def":"the amount of money that you pay to go into a building or to an event","examples":["admission charges/prices","£5 admission","What's the admission?","There is an admission fee of $10.","Admission is free and no booking is required."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["general admission","Law School Admission Test"]}]