[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/ado/adopt/adopt__us_1.mp3","phonsUS":"/əˈdɑːpt/","level":"B2","meanings":[{"def":"to take somebody else’s child into your family and become its legal parent(s)","examples":["a campaign to encourage childless couples to adopt","adopt somebody to adopt a child","She was forced to have her baby adopted.","She adopted three children from the orphanage.","We would like to adopt a child.","The child has now been legally adopted.","The couple adopted two children."],"opposite":"","synonyms":""},{"def":"to start to use a particular method or to show a particular attitude towards somebody/something","examples":["All three teams adopted different approaches to the problem.","Our study examined the strategies adopted by patients for seeking information.","The police adopted tighter security measures.","to adopt an attitude/stance/position","We could not agree on the best methods to adopt.","He smiled and adopted a more casual tone of voice.","The new manager adopted a very autocratic style.","The female adopts a more passive role than the male."],"opposite":"","synonyms":""},{"def":"to formally accept a suggestion or policy by voting","examples":["The government adopted a resolution on disarmament.","The council is expected to adopt the new policy at its next meeting.","The U.N. Security Council unanimously adopted the resolution.","The policy has not yet been formally adopted.","What position do you adopt on this issue?","the policies employers adopt towards the labour force"],"opposite":"","synonyms":""},{"def":"to choose a new name, a country, a custom, etc. and begin to use it as your own","examples":["to adopt a name/title/language","Early Christians in Europe adopted many of the practices of the older, pagan religions.","The royal family adopted the name of Windsor early in the last century.","He adopted the dress and manners of an Englishman.","The party adopted its current name in 1965."],"opposite":"","synonyms":""},{"def":"to use a particular manner, way of speaking, expression, etc.","examples":["He adopted an air of indifference."],"opposite":"","synonyms":""},{"def":"to choose somebody as a candidate in an election; to choose somebody as your representative","examples":["She was adopted as parliamentary candidate for Wood Green.","The people adopted him as their patron saint."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]