[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/adv/advan/advance__us_1.mp3","phonsUS":"/ədˈvæns/","level":"B2","meanings":[{"def":"progress or a development in a particular activity or area of understanding","examples":["We live in an age of rapid technological advance.","advance in something Recent advances in technology have made the procedure safe.","recent advances in medical science","major advances in the field of physics","advance on something an advance on the existing techniques","advance towards something an advance towards a better understanding of God","Hindu science made great advances in astronomy and mathematics.","Recent years have seen significant advances in our understanding of the human genome.","The design incorporates the most recent technological advances.","We need more money if we are to make any further advances in this area of science.","rapid advances in science and technology","two major advances in orthopaedic medicine","At this time there were a number of major advances in the field of physics."],"opposite":"","synonyms":""},{"def":"the forward movement of a group of people, especially armed forces","examples":["We feared that an advance on the capital would soon follow.","enemy advances","The general ordered an advance to the front line.","The regiment made an advance on the enemy lines.","the Russian advance towards Berlin","Enemy advances had forced them to retreat into the mountains.","Their advance on the city seemed unstoppable."],"opposite":"","synonyms":""},{"def":"money paid for work before it has been done or money paid earlier than expected","examples":["They offered an advance of £5 000 after the signing of the contract.","The bank will give you an advance of 95% of the purchase price.","advance on something She asked for an advance on her salary.","The publishers have paid me an advance.","He was paid £5 000 as an advance on royalties."],"opposite":"","synonyms":""},{"def":"attempts to start a sexual relationship with somebody","examples":["He had made advances to one of his students.","She rejected his sexual advances."],"opposite":"","synonyms":""},{"def":"an increase in the price or value of something","examples":["Share prices showed significant advances."],"opposite":"","synonyms":""},{"def":"before the time that is expected; before something happens","examples":["a week/month/year in advance","The rent is due one month in advance.","Thanks in advance for your help.","We try to plan well in advance.","It would have helped to know in advance that you were coming.","(formal) The fee is payable in advance.","(formal) People were evacuated from the coastal regions in advance of the hurricane.","It's cheaper if you book the tickets in advance.","You'll get the agenda in advance of the committee meeting."],"opposite":"","synonyms":""},{"def":"more developed than somebody/something else","examples":["Galileo's ideas were well in advance of the age in which he lived."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in advance (of something)","def":"before the time that is expected; before something happens","examples":["a week/month/year in advance","The rent is due one month in advance.","Thanks in advance for your help.","We try to plan well in advance.","It would have helped to know in advance that you were coming.","(formal) The fee is payable in advance.","(formal) People were evacuated from the coastal regions in advance of the hurricane.","It's cheaper if you book the tickets in advance.","You'll get the agenda in advance of the committee meeting.","Galileo's ideas were well in advance of the age in which he lived."]}],"phrasal":[],"related":["advance man","advance guard","advance men","advance guards"]},{"pos":"verb","level":"B2","meanings":[{"def":"if knowledge, technology, etc. advances, it develops and improves","examples":["Technology is advancing at an incredibly rapid pace.","Our knowledge of the disease has advanced considerably over recent years.","advance something This research has done much to advance our understanding of language learning.","Will excavating this site advance our knowledge of history in a significant way?","As medical science advances, treatments are becoming more and more expensive.","Society needs to advance beyond prejudice and superstition."],"opposite":"","synonyms":""},{"def":"to move forward towards somebody/something, often in order to attack or threaten them or it","examples":["The troops were finally given the order to advance.","They had advanced 20 miles by nightfall.","the advancing Allied troops","advance on/towards somebody/something The mob advanced on us, shouting angrily.","She closed the door firmly and advanced towards the desk.","He advanced towards me in aggressive style.","The army advanced on the capital.","The troops advanced into central Europe.","advancing from the south","He advanced towards her.","The people fled from the advancing army.","Troops were given the order to advance."],"opposite":"","synonyms":""},{"def":"to help something to succeed","examples":["Studying for new qualifications is one way of advancing your career.","They worked together to advance the cause of democracy."],"opposite":"","synonyms":""},{"def":"to give somebody money before the time it would usually be paid","examples":["advance something to somebody We are willing to advance the money to you.","advance somebody something We will advance you the money."],"opposite":"","synonyms":""},{"def":"to suggest an idea, a theory or a plan for other people to discuss","examples":["The article advances a new theory to explain changes in the climate.","to advance an argument/agenda","This proposal has frequently been advanced as a possible solution."],"opposite":"","synonyms":""},{"def":"to change the time or date of an event so that it takes place earlier","examples":["The date of the trial has been advanced by one week."],"opposite":"postpone","synonyms":""},{"def":"to move forward to a later part of something; to move something forward to a later part","examples":["+ adv./prep. These players will now advance to the next round.","Users advance through the program by answering a series of questions.","advance something This button advances the hours and the red one advances the minutes in the display."],"opposite":"","synonyms":""},{"def":"to increase in price or amount","examples":["Oil shares advanced amid economic recovery hopes."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adjective","level":"B2","meanings":[{"def":"done or given before something is going to happen","examples":["Please give us advance warning of any changes.","We need advance notice of the numbers involved.","No advance booking is necessary on most departures."],"opposite":"","synonyms":""},{"def":"a group of people who go somewhere first, before the main group","examples":["The advance party for a winter ascent of Mount Everest has arrived in Nepal."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]