[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/adv/advis/advise__us_1.mp3","phonsUS":"/ədˈvaɪz/","level":"B1","meanings":[{"def":"to tell somebody what you think they should do in a particular situation","examples":["advise against doing something I would strongly advise against going out on your own.","advise somebody against doing something They advised me against visiting the troubled south of the country.","advise somebody against something The Foreign Office is advising Britons against all non-essential travel to the region.","advise against something They advised against the use of military force.","advise somebody Her mother was away and couldn't advise her.","advise something I'd advise extreme caution.","+ speech ‘Get there early,’ she advised (them).","advise somebody to do something Police are advising people to stay at home.","Doctors advised the patient to have surgery.","I'd advise you not to tell him.","Solicitors advised their clients to contact their local councillors.","advise that… They advise that a passport be carried with you at all times.","(British English also) They advise that a passport should be carried with you at all times.","it is advised that… It is strongly advised that you take out insurance.","advise doing something I'd advise buying your tickets well in advance if you want to travel in August.","We’d recommend you to book your flight early.","a recommended price of $50","I’d advise you not to tell him.","The group does not advocate the use of violence.","The situation is dangerous and the UN is urging caution.","We would always advise caution in the use of this drug.","I strongly advise you not to do this.","John would be ill advised to rely on their support.","You would be better advised to consult an accountant."],"opposite":"","synonyms":"recommend"},{"def":"to give somebody help and information on a subject that you know a lot about","examples":["advise on/about something We employ an expert to advise on new technology.","advise about doing something The nurse will advise about getting out of bed, bathing, and diet.","advise somebody on/about something She advises the government on environmental issues.","advise somebody about doing sh They can advise customers about safely using and storing pesticides.","advise what, which, whether, etc… The pharmacist will advise which medicines are safe to take.","advise somebody what, which, whether, etc… Your lawyer can advise you whether to take any action.","We will be happy to advise on any financial matters.","We were badly advised by our lawyer.","We can advise parents about education."],"opposite":"","synonyms":""},{"def":"to officially tell somebody something","examples":["advise somebody of something Please advise us of any change of address.","to advise somebody of their rights/the situation","You will be advised of the outcome of your application.","Please keep me advised of new developments in this case.","advise somebody when, where, how, etc… I will contact you later to advise you when to come.","advise somebody that… I regret to advise you that the course is now full."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]