[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/adv/advic/advice__us_1.mp3","phonsUS":"/ədˈvaɪs/","level":"A1","meanings":[{"def":"an opinion or a suggestion about what somebody should do in a particular situation","examples":["expert/practical/professional/medical advice","We were advised to seek legal advice.","advice on something The service offers information and advice on possible careers.","Ask your teacher's advice on how to prepare for the exam.","Ask your teacher for advice on how to prepare for the exam.","advice about something They give good advice to parents about managing difficult behaviour.","advice from somebody We were advised to seek advice from an expert.","Let me give you a piece of advice.","A word of advice. Don't wear that dress.","Take my advice. Don't do it.","Follow your doctor's advice.","on the advice of somebody I went there on the advice of a friend.","I chose it on his advice.","against the advice of somebody She went back to work against the advice of her doctor (= her doctor advised her not to).","The centre offers a free and confidential advice service.","If I were you, I'd wait.","I think you should/​ought to see a doctor.","Why don't you/​Why not/​Could you maybe ask Tom to help?","If you want my advice/​If you want to know what I think, I'd say it's better to tell him.","I'd advise you to sell it now.","Can you give me some advice on where to buy good maps?","I think my lawyer gave me the wrong advice.","I wished that I had followed her advice.","I hope I can pass on some useful advice.","Here is some advice for pregnant women.","I will refrain from giving unsolicited advice.","It is essential to seek expert advice from a mental health professional.","My advice to you would be to wait a few months.","On the advice of his experts he bought another company.","Permission was given against the advice of the planning officers.","That's very sound advice.","The Local Authority runs an advice centre in the town.","The website gives free, impartial advice on all aspects of saving energy."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["advice column","advice columnist","Citizens Advice","Citizens Advice Bureau"]}]