[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/aff/affai/affair__us_2.mp3","phonsUS":"/əˈfer/","level":"B2","meanings":[{"def":"events that are of public interest or political importance","examples":["world/international affairs","an expert on foreign affairs (= political events in other countries)","We are expecting a statement from the home affairs (= political events in your own country) spokesman.","internal/external affairs","affairs of state"],"opposite":"","synonyms":""},{"def":"an event that people are talking about or describing in a particular way","examples":["The newspapers exaggerated the whole affair wildly.","She wanted the celebration to be a simple family affair.","Many people have criticized the way the government handled the affair.","The Whitewater affair was the biggest scandal of the decade.","The debate was a pretty disappointing affair.","I ended up disillusioned and bitter about the whole affair.","I knew that the wedding would be a grand affair.","He has tried to play down his involvement in the affair.","She saw the whole affair as a great joke."],"opposite":"","synonyms":""},{"def":"a sexual relationship between two people, usually when one or both of them are already in a relationship with somebody else","examples":["She was having an affair with a co-worker.","an extramarital affair","It's the story of a secret affair between a married teacher and her teenage student.","They had a passionate affair for six months.","Their affair did not develop into a lasting relationship.","an affair with a married man","a torrid love affair","How long has the affair been going on?"],"opposite":"","synonyms":""},{"def":"matters connected with a person’s private business and financial situation","examples":["She manages the family's financial affairs.","I looked after my father's financial affairs.","She wanted to put her affairs in order before she died."],"opposite":"","synonyms":""},{"def":"a thing that somebody is responsible for (and that other people should not be interested in)","examples":["How I spend my money is my affair.","The details of your relationship should be a private affair.","That's no affair of yours.","It's a family affair."],"opposite":"","synonyms":""},{"def":"an object that is unusual or difficult to describe","examples":["Her hat was an amazing affair with feathers and a huge brim."],"opposite":"","synonyms":""},{"def":"a situation","examples":["This state of affairs can no longer be ignored."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a state of affairs","def":"a situation","examples":["This state of affairs can no longer be ignored."]}],"phrasal":[],"related":["love affair","Whitewater affair","Iran-Contra affair"]}]