[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/aff/affec/affect__us_1.mp3","phonsUS":"/əˈfekt/","level":"A2","meanings":[{"def":"to produce a change in somebody/something","examples":["How will these changes affect us?","The article deals with issues affecting the lives of children.","Thousands of people have been adversely affected (= affected in a negative way) by the decision.","The quality and health of the soil directly affects the quality and health of the plants.","Your opinion will not affect my decision.","The south of the country was worst affected by the drought.","Does television affect children’s behaviour?","Does television have an effect on children’s behaviour?","They hope to effect a reconciliation.","Hopefully this will not affect the outcome of the talks.","Sales did not seem unduly affected.","The class structure affects people's attitudes and behaviour.","decisions that affect all our lives","developments that are likely to affect the environment","Education has been severely affected by the war.","The type of audience will affect what you say and how you say it."],"opposite":"","synonyms":""},{"def":"to attack somebody or a part of the body; to make somebody become ill","examples":["The disease is more likely to affect women than men.","The condition affects one in five women.","Rub the cream into the affected areas."],"opposite":"","synonyms":""},{"def":"to make somebody feel very sad, sorry, etc. about somebody/something","examples":["They were deeply affected by the news of her death.","Her death affected him deeply.","Try not to let his problems affect you too much."],"opposite":"","synonyms":""},{"def":"to pretend to be feeling or thinking something","examples":["affect something She affected a calmness she did not feel.","affect to do something We are fascinated by the rich and powerful but often affect to despise them."],"opposite":"","synonyms":""},{"def":"to use or wear something that is intended to impress other people","examples":["I wish he wouldn't affect that ridiculous accent."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]