[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/afr/afrai/afraid__us_2.mp3","phonsUS":"/əˈfreɪd/","level":"A1","meanings":[{"def":"feeling fear; frightened because you think that you might be hurt or suffer","examples":["Don't be afraid.","afraid of somebody/something It's all over. There's nothing to be afraid of now.","He had always been afraid of death.","They know I'm afraid of heights.","Are you afraid of spiders?","afraid of doing something I started to feel afraid of going out alone at night.","afraid to do something She was afraid to open the door.","There’s nothing to be afraid of.","Aren’t you afraid (that) you’ll fall?","a frightened child","She was frightened that the glass would break.","The thieves got scared and ran away.","I was terrified (that) she wouldn’t come.","She looked at him with wide, terrified eyes.","She was alarmed at the prospect of travelling alone.","You’re just being paranoid.","What has made you so deeply afraid of your boss?","Are you afraid of the dark?","Don't be afraid. I won't hurt you.","I'm not afraid of you!"],"opposite":"","synonyms":"afraid"},{"def":"worried about what might happen","examples":["afraid of doing something She was afraid of upsetting her parents.","Tamsin was afraid of making a fool of herself.","afraid to do something Don't be afraid to ask if you don't understand.","The boy wasn’t afraid to say what he believed.","He certainly isn't afraid to speak his mind.","afraid (that…) We were afraid (that) we were going to capsize the boat.","He stopped abruptly, suddenly afraid to say the words out loud.","She was tense, almost afraid to open the letter.","You do know, don't you? You are just afraid to tell me.","He was half afraid to look at her.","Aren't you afraid (that) you'll fall?"],"opposite":"","synonyms":""},{"def":"worried or frightened that something unpleasant, dangerous, etc. will happen to a particular person or thing","examples":["I'm not afraid for me, but for the baby.","Roger was very afraid for her.","They had already fired three people and he was afraid for his job.","to be afraid for somebody's life/safety"],"opposite":"","synonyms":""},{"def":"used as a polite way of telling somebody something that is unpleasant or disappointing, or that you are sorry about","examples":["I can't help you, I'm afraid.","I'm afraid we can't come.","I'm afraid that it's not finished yet.","He's no better, I'm afraid to say.","‘Is there any left?’ ‘I'm afraid not.’","‘Will it hurt?’ ‘I'm afraid so.’"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"I’m afraid","def":"used as a polite way of telling somebody something that is unpleasant or disappointing, or that you are sorry about","examples":["I can't help you, I'm afraid.","I'm afraid we can't come.","I'm afraid that it's not finished yet.","He's no better, I'm afraid to say.","‘Is there any left?’ ‘I'm afraid not.’","‘Will it hurt?’ ‘I'm afraid so.’"]}],"phrasal":[],"related":["Who's Afraid of Virginia Woolf?"]}]