[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/agr/agree/agreement__us_1.mp3","phonsUS":"/əˈɡriːmənt/","level":"B1","meanings":[{"def":"an arrangement, a promise or a contract made with somebody","examples":["an international peace agreement","The agreement (= the document recording the agreement) was signed during a meeting at the UN.","agreement with somebody They have entered into a free trade agreement with Australia.","agreement between A and B An agreement was finally reached between management and employees.","agreement to do something They had an agreement never to talk about work at home.","They had made a verbal agreement to sell.","under an agreement The software is provided under a license agreement and may not be copied without permission.","The specific terms of the agreement have not been disclosed.","The documents are covered by a confidentiality agreement.","He sued the company for breach of agreement.","I am hopeful that we can come to an agreement.","Some employers reneged on agreements once the recession set in.","The agreement will be legally binding.","The draft agreement will be available before the meeting.","The terms of the agreement do not allow such exports.","They are working out a formal ceasefire agreement.","They signed two agreements on improving economic co-operation.","Under the agreement, the farmer is not allowed to use this field.","You have not kept to our agreement.","a clause in the agreement","We have an agreement to always tell each other the truth about everything."],"opposite":"","synonyms":""},{"def":"the state of sharing the same opinion or feeling","examples":["The two sides failed to reach agreement.","agreement on something There was broad agreement on what was needed.","agreement (among somebody) (that…) There is agreement among teachers that changes need to be made.","in agreement Is everybody in agreement now?","in agreement on/about something Are we in agreement about the price?","in agreement with somebody on/about something My wife is in complete agreement with me on this issue.","in agreement with somebody (that…) I am in agreement with you that she should be given more responsibilities."],"opposite":"disagreement","synonyms":""},{"def":"the fact of somebody approving of something and allowing it to happen","examples":["You'll have to get your parents' agreement if you want to go on the trip.","with the agreement of somebody Most pension schemes allow employees to keep working with the agreement of their employer.","without the agreement of somebody No images may be reproduced without the artist's agreement.","He nodded his agreement.","We will need to get the agreement of local organizations.","He still hopes to get his father's agreement.","The museum secured the agreement of the owners to the loan of the statue.","Such a measure would require the unanimous agreement of the member states.","My client wishes to withdraw the application, with the court's agreement.","The separation is by mutual agreement."],"opposite":"","synonyms":""},{"def":"the state of having the same number, gender or person","examples":["in agreement with something In the sentence ‘They live in the country’, the plural form of the verb ‘live’ is in agreement with the plural subject ‘they’."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["gentleman’s agreement","prenuptial agreement","Munich Agreement","Schengen agreement","Anglo-Irish Agreement","Good Friday Agreement","North American Free Trade Agreement","Canada-United States Free Trade Agreement","United States-Mexico-Canada Agreement","gentlemen’s agreement","the General Agreement on Tariffs and Trade"]}]