[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/agr/agree/agree__us_1.mp3","phonsUS":"/əˈɡriː/","level":"A1","meanings":[{"def":"to have the same opinion as somebody; to say that you have the same opinion","examples":["When he said that, I had to agree.","+ speech ‘That's true’, she agreed.","agree with somebody I totally agree with you!","agree about/on something You can't expect them to agree on everything.","agree with somebody about/on something He agreed with them about the need for change.","agree with something Many experts agree wholeheartedly with this statement.","I tend to agree with her political views.","agree (that)… All parties agree (that) urgent action is required.","We agreed (that) the proposal was a good one.","‘It's terrible.’ ‘I couldn't agree more!’ (= I completely agree)","Yes, that's true.","That's right. On the other hand, there are some drawbacks to the plan…","Exactly.","Absolutely.","Definitely.","Yes, I suppose/​guess so.","I agree. It's definitely the best idea.","I think you're right. We should listen to what they have to say.","Sue is absolutely right. It's too early to make a decision now.","I would go along with the idea that we should change the logo.","We are in agreement on the best way to proceed, but we need to discuss the timing.","I agree with her analysis of the situation.","I don't agree, for reasons I will explain later.","They said she didn't look well and I had to agree.","I very much agree with the prime minister.","I agree entirely with what you have said.","Do you agree with me that the plan won't work?","I agree with that analysis of the situation.","We don't always agree about everything.","Historians have not always agreed about the exact date.","They all agree (that) the research is hard work.","I'm inclined to agree there's nothing we can do.","I'm sure you'll agree that this issue is vitally important to the success of the company."],"opposite":"disagree","synonyms":""},{"def":"to approve of something because you think it is morally right","examples":["agree with doing something I don't agree with hitting children as a punishment.","agree with something I'm not sure I agree with the government's policy on this."],"opposite":"","synonyms":""},{"def":"to say ‘yes’; to say that you will do what somebody wants or that you will allow something to happen","examples":["I asked for a pay rise and she agreed.","agree to something The government has finally agreed in principle (= agreed in general but not in detail) to the terms of the deal.","Do you think he'll agree to their proposal?","agree (that)… She agreed (that) I could go early.","agree to do something He reluctantly agreed to pay for the damage.","She agreed to let me go early.","He agreed to let me go early.","They accepted the court’s decision.","The committee unanimously approved the plan.","She just goes along with everything he suggests.","She finally consented to answer our questions.","She suggested a walk in the open air and he readily agreed.","Edith Harlow has kindly agreed to help."],"opposite":"","synonyms":"agree"},{"def":"to decide with somebody else to do something or to have something","examples":["agree on/upon something Can we agree on a date?","The new plan was agreed upon between the two sides.","agree something They met at the agreed time.","Can we agree a price?","agree to do something We agreed to meet on Thursday.","agree what, where, etc… We couldn't agree what to do.","as agreed They left at ten, as agreed.","The two sides failed to agree on any of the proposals.","The two countries were unable to agree on a common strategy.","We are working toward mutually agreed goals."],"opposite":"","synonyms":""},{"def":"to officially accept a plan, request, etc.","examples":["The company agreed a deal worth $100 million.","Next year's budget has been agreed.","We arranged to meet a few days later and agree terms."],"opposite":"","synonyms":""},{"def":"to be the same as something","examples":["The figures do not agree.","agree with something Your account of the accident does not agree with hers."],"opposite":"","synonyms":""},{"def":"to match a word or phrase in number, gender or person","examples":["In ‘Tom likes jazz’, the singular verb ‘likes’ agrees with the subject ‘Tom’."],"opposite":"","synonyms":""},{"def":"if two people agree to differ/disagree, they accept that they have different opinions about something, but they decide not to discuss it any longer","examples":["We must just agree to differ on this.","In the end we agreed to disagree.","I think you're wrong. Let's just agree to differ."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"agree to differ/disagree","def":"if two people agree to differ/disagree, they accept that they have different opinions about something, but they decide not to discuss it any longer","examples":["We must just agree to differ on this.","In the end we agreed to disagree.","I think you're wrong. Let's just agree to differ."]}],"phrasal":["not agree with"],"related":["not agree with","not agree with somebody"]}]