[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/aid/aid__/aid__us_1.mp3","phonsUS":"/eɪd/","level":"B2","meanings":[{"def":"money, food, etc. that is sent to help countries in difficult situations","examples":["humanitarian/food/medical aid","An extra £10 million in foreign aid has been provided for victims of the earthquake.","international aid workers","The British government has now suspended humanitarian aid to the area.","The country's president has appealed for international aid in the wake of the disaster.","Emergency aid arrived too late for many.","a $14 million aid package"],"opposite":"","synonyms":""},{"def":"help that you need, especially to perform a particular task","examples":["with the aid of somebody/something She walks with the aid of a stick.","without the aid of somebody/something This job would be impossible without the aid of a computer.","(formal) One of the staff saw he was in difficulty and came to his aid (= helped him).","She is now able to get around with the aid of a walking stick.","We enlisted the aid of John and his family."],"opposite":"","synonyms":""},{"def":"an object, a machine, etc. that you use to help you do something","examples":["Photos make useful teaching aids."],"opposite":"","synonyms":""},{"def":"in order to help something/somebody","examples":["collecting money in aid of charity"],"opposite":"","synonyms":""},{"def":"used to ask why something is happening","examples":["What's all this crying in aid of?"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in aid of something/somebody","def":"in order to help something/somebody","examples":["collecting money in aid of charity"]},{"idiom":"what’s… in aid of?","def":"used to ask why something is happening","examples":["What's all this crying in aid of?"]}],"phrasal":[],"related":["Live Aid","Band-Aid™","first aid","grant aid","Kool-Aid™","legal aid","hearing aid","visual aid","aid climbing","Christian Aid","financial aid","grant-in-aid","grants-in-aid","aid and abet"]},{"pos":"verb","level":"B2","meanings":[{"def":"to help somebody/something to do something, especially by making it easier","examples":["aid in something The test is designed to aid in the diagnosis of various diseases.","aid in doing something The research has aided in developing new drugs.","aid somebody/something The charity was established to aid hurricane victims.","The investigation was greatly aided by the fact that the house was equipped with CCTV cameras.","They were accused of aiding his escape.","aid somebody to do something They were accused of aiding him to escape.","aid somebody/something in something They were accused of aiding him in his escape.","aid somebody/something in doing something The strategy can aid teachers in dealing with disruptive behaviour.","aid somebody with something Words will be displayed around the room to aid students with spelling.","The new test should aid in the early detection of the disease.","This feature is designed to aid inexperienced users.","Aided by heat and strong winds, the fire quickly spread.","Computers can be used to aid in management decision-making.","The dolphin's skin is designed to aid maximum swimming efficiency.","The government has promised to aid and support the new venture.","Each group is aided by a tutor or consultant.","Candidates are aided by volunteers who do doorstep canvassing."],"opposite":"","synonyms":""},{"def":"to help or encourage something to happen","examples":["New drugs are now available to aid recovery.","Some perfumes aid restful sleep.","Peppermint aids digestion."],"opposite":"","synonyms":""},{"def":"to help somebody to do something illegal or wrong","examples":["She stands accused of aiding and abetting the crime.","He was charged with aiding and abetting the robbers."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"aid and abet","def":"to help somebody to do something illegal or wrong","examples":["She stands accused of aiding and abetting the crime.","He was charged with aiding and abetting the robbers."]}],"phrasal":[],"related":[]}]