[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/aim/aim__/aim__us_1.mp3","phonsUS":"/eɪm/","level":"B1","meanings":[{"def":"to try or plan to achieve something","examples":["He has always aimed high (= tried to achieve a lot).","aim for something We should aim for a bigger share of the market.","The team is aiming for the top this season.","Don't try to aim for perfection.","aim at something The government is aiming at a 50% reduction in unemployment.","aim to do something They are aiming to reduce unemployment by 50%.","The project aims to provide employment for people with learning difficulties.","We aim to be there around six.","aim at doing something The training programme aims at raising employees' awareness about human rights.","He is aiming for a win in this race.","She's aiming at a scholarship this year.","They're aiming at training everybody by the end of the year."],"opposite":"","synonyms":""},{"def":"to have something as an aim","examples":["The initiative is specifically aimed at helping young people.","These measures are aimed at preventing violent crime."],"opposite":"","synonyms":""},{"def":"to say or do something that is intended to influence or affect a particular person or group","examples":["be aimed at somebody The courses are aimed primarily at older people.","My criticism wasn't aimed at you.","The book is aimed at very young children."],"opposite":"","synonyms":""},{"def":"to point or direct a weapon, camera, shot, kick, etc. at somebody/something","examples":["aim at somebody/something I was aiming at the tree but hit the car by mistake.","aim for somebody/something Aim for the middle of the target.","aim something at somebody/something The gun was aimed at her head.","She aimed the gun straight at the intruder.","aim something I aimed my camera and got one shot.","aim something + adv./prep. He aimed the rifle in the direction of the target and fired."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["take aim at somebody/something"]},{"pos":"noun","level":"B1","meanings":[{"def":"the purpose of doing something; what somebody is trying to achieve","examples":["the stated aims of the study","Our main aim is to provide affordable childcare.","His sole aim in life is to enjoy himself.","Teamwork is required in order to achieve these aims.","to pursue/further/fulfil your aims","She set out the company's aims and objectives in her speech.","with the aim of doing something The organization was formed with the aim of helping local people.","Our campaign’s main purpose is to raise money.","She went to London with the aim of finding a job.","Our main aim is to increase sales in Europe.","I have no intention of going to the wedding.","She’s full of good intentions but they rarely work out.","There are no plans to build new offices.","What’s the point of all this violence?","The point of the lesson is to compare the two countries.","The whole idea of going was so that we could meet her new boyfriend.","What’s the idea behind this?","She went to London with the aim of finding a job.","Our main aim is to increase sales in Europe.","Bob's one aim in life is to earn a lot of money.","His ultimate aim was to force the chairman to resign.","It is important to have a clear aim in view.","You will have to work hard to achieve your aim.","Simple truth must be the highest aim of any real enquiry.","The country is still pursuing its aim of joining the EU.","The express aim of the treaty is to keep the whole region free from nuclear weapons.","I want to see a strong and united country in which people work together with common aims.","They were intent on furthering their aims.","Begin by explaining the aims of the lesson."],"opposite":"","synonyms":"purpose"},{"def":"the action or skill of pointing a weapon at somebody/something","examples":["Her aim was good and she hit the lion with her first shot.","The gunman took aim (= pointed his weapon) and fired.","His aim was poor and he missed the target.","It was a perfect aim and there was no way he would miss."],"opposite":"","synonyms":""},{"def":"to direct your criticism at somebody/something","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"take aim at somebody/something","def":"to direct your criticism at somebody/something","examples":[]}],"phrasal":[],"related":[]}]