[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/ala/alarm/alarm__us_1.mp3","phonsUS":"/əˈlɑːrm/","level":"B1","meanings":[{"def":"a loud noise or a signal that warns people of danger or of a problem","examples":["She decided to sound the alarm (= warn people that the situation was dangerous).","I hammered on all the doors to raise the alarm.","By the time the alarm was raised the intruders had escaped.","Many birds give alarm calls to warn of danger.","Suddenly the alarm sounded and they all had to leave the building.","Soldier termites sound an alarm by beating their large heads on passage walls."],"opposite":"","synonyms":""},{"def":"a device that warns people of a particular danger, or that a particular person is in danger","examples":["a burglar/fire/smoke alarm","The cat set off the alarm (= made it start ringing).","A car alarm went off in the middle of the night (= started ringing).","Carry a personal alarm with you.","Install an alarm system and learn how to use it.","Unfortunately any little noise can set off the alarm.","Lizzie was carrying a rape alarm but it was out of reach in her handbag."],"opposite":"","synonyms":""},{"def":"a ringing sound or a tune played by a clock or your phone after you have set it to play at a particular time to wake you up","examples":["The alarm went off at 7 o'clock.","I set my alarm for 6.30."],"opposite":"","synonyms":""},{"def":"fear and worry that somebody feels when something dangerous or unpleasant might happen","examples":["in alarm What have you done?’ Ellie cried in alarm.","I felt a growing sense of alarm when he did not return that night.","The doctor said there was no cause for alarm.","(a) fear of flying","She showed no fear.","Her eyes were wild with terror.","I had a sudden moment of panic.","The doctor said there was no cause for alarm.","She cried out in fright.","To her parents' alarm, she announced that she intended to travel the world.","His face registered no alarm at all when I told him the news.","Many people have expressed alarm at the plans.","The head teacher's policies have provoked alarm among parents.","The incident created serious public alarm.","The news has been greeted with alarm.","There has been considerable alarm about the new proposals.","There is growing public alarm at this increase in crime.","He loves spreading alarm and despondency."],"opposite":"","synonyms":"fear"},{"def":"if you say that alarm bells are ringing, you mean that people are starting to feel worried and to suspect that something is wrong","examples":["The government’s proposal has set alarm bells ringing for people on low incomes."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"alarm bells ring/are ringing","def":"if you say that alarm bells are ringing, you mean that people are starting to feel worried and to suspect that something is wrong","examples":["The government’s proposal has set alarm bells ringing for people on low incomes."]}],"phrasal":[],"related":["alarm call","alarm clock","false alarm","fire alarm","smoke alarm","burglar alarm","alarm calls","alarm clocks"]},{"pos":"verb","level":"B2","meanings":[{"def":"to make somebody anxious or afraid","examples":["I can only guess that they don't want to alarm the public yet.","The blood test did not unduly alarm her medical team.","It alarms me that nobody takes this problem seriously.","The captain knew there was an engine fault but didn't want to alarm the passengers.","He brought out a gun and frightened them off.","They managed to scare the bears away.","It alarms me that nobody takes this problem seriously.","Flying terrified her."],"opposite":"","synonyms":"frighten"},{"def":"to fit something such as a door with a device that warns people when somebody is trying to enter illegally","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]