[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/ale/alert/alert__us_1.mp3","phonsUS":"/əˈlɜːrt/","level":"C1","meanings":[{"def":"to warn somebody about a dangerous situation or one that requires immediate action","examples":["alert somebody Neighbours quickly alerted the emergency services.","(be) alerted by something Alerted by a noise downstairs, he sat up and turned on the light.","be alerted that… The coastguard were alerted that a yacht had run into difficulties."],"opposite":"","synonyms":""},{"def":"to make somebody aware of something","examples":["be alerted to something They had been alerted to the possibility of further price rises."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["red alert","bomb alert","spoiler alert"]},{"pos":"noun","level":"C1","meanings":[{"def":"a situation in which people are watching for danger and ready to deal with it","examples":["on the alert (for something) Police are warning the public to be on the alert for suspicious packages.","on alert More than 5 000 troops have been placed on (full) alert.","The army was yesterday placed on a state of alert in case of more riots.","Thousands of police were put on full alert at all main roads leading to the city.","You should always be on the alert for anyone who looks suspicious."],"opposite":"","synonyms":""},{"def":"a warning of danger or of a problem","examples":["a bomb/fire alert","A nationwide alert went out for three escaped prisoners.","A security alert was issued after four men escaped from the prison.","Receive regular email alerts about breaking news.","The alert was called off when it was found that the bomb was not live.","They rang the church bells to sound the alert and the villagers then fled.","A bomb alert forced staff to evacuate the building for several hours.","A flood alert has been issued in the city after last night's heavy rain."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adjective","level":"C1","meanings":[{"def":"able to think quickly; quick to notice things","examples":["Suddenly he found himself awake and fully alert.","Two alert scientists spotted the mistake.","Try to stay alert while driving at night.","an alert mind","mentally alert","The machine should help to keep the pilot alert.","There was a noise outside and he was suddenly alert."],"opposite":"","synonyms":""},{"def":"aware of something, especially a problem or danger","examples":["We must be alert to the possibility of danger.","She was alert to the slightest sound."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]