[{"pos":"adverb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/als/also_/also__us_3.mp3","phonsUS":"/ˈɔːlsəʊ/","level":"A1","meanings":[{"def":"in addition; too","examples":["She's fluent in French and German. She also speaks a little Italian.","rubella, also known as German measles","I didn't like it that much. Also, it was much too expensive.","Jake's father had also been a doctor (= both Jake and his father were doctors).","She was not only intelligent but also very musical.","He also recently said that he would be leaving at the end of the year.","I probably also have a copy of the list.","Bilingual children do better in IQ tests than children who speak only one language. In addition/What is more, they seem to find it easier to learn third or even fourth languages.","Learning another language not only improves children’s job prospects in later life, but also boosts their self-esteem.","Teaching children a second language improves their job prospects in later life. Other benefits include increased self-esteem and greater tolerance of other cultures.","Another/One further/One additional reason for encouraging bilingual education is that it boosts children’s self-esteem.","Studies suggest that bilingual children find it easier to learn additional languages. There is, moreover, increasing evidence that bilingual children perform better across a range of school subjects, not just foreign languages.","His claim that children find bilingual education confusing is based on very little evidence. Moreover, the evidence he does provide is seriously flawed.","Research has shown that first-language development is not impeded by exposure to a second language. Furthermore, there is no evidence to support the claim that children find bilingual education confusing.","I went to New York last year, and I also spent some time in Washington.","‘I’m going home now.’ ‘I’ll come too.’","She hasn’t phoned and she hasn’t written either","You can have a burger, but you can’t have fries as well."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["also-ran","also-rans","also known as","not only… (but) (also)…"]}]