[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/alt/alter/alternative__us_1.mp3","phonsUS":"/ɔːlˈtɜːrnətɪv/","level":"A2","meanings":[{"def":"a thing that you can choose to do or have out of two or more possibilities","examples":["The car is too expensive so we're trying to find a cheaper alternative.","There is a vegetarian alternative on the menu every day.","We had no alternative but to fire Gibson.","to offer/provide an alternative","alternative to something Does this offer a viable alternative to the existing system?","as an alternative to something Fruit juice is provided as an alternative to alcoholic drinks.","alternative for somebody This treatment is the only alternative for some patients.","As I see it, we have two options…","Students have the option of studying abroad in their second year.","If I had the choice, I would stop working tomorrow.","There is a wide range of choices open to you.","You can be paid in cash weekly or by cheque monthly: those are the two alternatives.","We need to explore a wide range of possibilities.","The possibilities are endless.","His idea seemed to offer a possible alternative.","Is there an alternative to surgery for this complaint?","There is no alternative for those with no car of their own.","They are seeking alternatives to fossil fuels.","We'll have to find an alternative.","a healthier alternative to fizzy drinks","seeking alternatives to nuclear power","We can agree to their terms or else pull out of the deal completely: those are the two alternatives."],"opposite":"","synonyms":"option"}],"idioms":[],"phrasal":[],"related":["alternative fuel","alternative rock","alternative vote","alternative energy","alternative medicine","alternative fuels","alternative votes"]},{"pos":"adjective","level":"B1","meanings":[{"def":"that can be used instead of something else","examples":["The road was closed so we had to find an alternative route.","Can you offer an alternative explanation?","an alternative method of working","Do you have an alternative solution?"],"opposite":"","synonyms":""},{"def":"different from the usual or traditional way in which something is done","examples":["alternative therapy/treatments","an alternative lifestyle","Medicine made of mould must once have seemed very alternative."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]