[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/ang/anger/anger__us_2.mp3","phonsUS":"/ˈæŋɡər/","level":"B2","meanings":[{"def":"the strong feeling that you have when something has happened that you think is bad and unfair","examples":["She had to find a way to express her pent-up anger.","The plan provoked anger among local residents.","the growing anger and frustration of young unemployed people","in anger Jan slammed her fist on the desk in anger.","anger at something He was filled with anger at the way he had been treated.","anger over something There is much anger over plans to close the hospital.","anger about something Local people are seething with anger about the decision.","anger at somebody/something There is widespread anger at the government following yesterday's announcement.","anger towards somebody/something I feel no anger towards him, only pity.","anger against somebody/something The people are taking to the streets to vent their anger against the prime minister.","a course in anger management (= controlling your feelings of anger)","Hank stood up, his anger rising.","He slammed the door in a fit of anger.","She felt a brief flash of anger.","He raised his voice in anger.","Her subsided as quickly as it had flared up.","Children give vent to their anger in various ways.","He had walked out in a moment of anger.","He tried to channel his anger into political activism.","His eyes were filled with anger.","His joy soon turned to anger when he heard the full story.","His words only served to fuel her anger.","I felt a sudden anger at his suggestion.","It is not healthy to suppress your anger.","Much of the public's anger was directed at the government.","She was trembling with anger.","The anger drained from his face.","You could probably benefit from anger management classes.","her anger towards her parents"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Look Back in Anger"]},{"pos":"verb","level":"","meanings":[{"def":"to make somebody angry","examples":["anger somebody The question clearly angered him.","be angered by something She was angered by their selfishness and lack of concern.","be angered at something He was angered at the lack of attention being shown him.","be angered that… They were angered that their complaints were dismissed.","it angers somebody that… It angered her that no one would listen.","He is not easily angered.","They stayed silent but were angered by the decision."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]