[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/ang/angel/angel__us_1.mp3","phonsUS":"/ˈeɪndʒl/","level":"C1","meanings":[{"def":"a spirit who is believed to be a servant of God, and is sent by God to deliver a message or perform a task. Angels are often shown dressed in white, with wings.","examples":["a host of angels","She looks like an angel.","a singer who has the voice of an angel","She wore a white costume with big furry angel wings.","a book about anti-heroes and fallen angels","He liked to think of himself as an avenging angel fighting for justice.","We lay back in the snow and made snow angels (= a shape made by moving your arms and legs back and forward while lying in snow)."],"opposite":"","synonyms":""},{"def":"a person who is very good and kind; a child who behaves well","examples":["John is no angel, believe me (= he does not behave well).","Mary’s children are little angels.","I could hardly see Lisa in the role of ministering angel."],"opposite":"","synonyms":""},{"def":"used when you are talking to somebody and you are grateful to them","examples":["Thanks Dad, you're an angel.","Be an angel and make me a cup of coffee."],"opposite":"","synonyms":""},{"def":"a person who supports a business by investing money in it, especially somebody who supports a new small business with their own money","examples":["When will the angels get their money back?","They started the business with the help of $2 million supplied by angel investors."],"opposite":"","synonyms":""},{"def":"people with little experience try to do the difficult or dangerous things that more experienced people would not consider doing","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"fools rush in (where angels fear to tread)","def":"people with little experience try to do the difficult or dangerous things that more experienced people would not consider doing","examples":[]}],"phrasal":[],"related":["angel dust","angel hair","Hells Angel™","angel investor","business angel","guardian angel","angel food cake","Angel, Islington","Hell's Angel","angel's hair","angel investors","angel food cakes"]}]