[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/ang/angle/angle__us_1.mp3","phonsUS":"/ˈæŋɡl/","level":"B2","meanings":[{"def":"the space between two lines or surfaces that join, measured in degrees","examples":["a 45° angle","the rocket’s angle of descent","Draw a 130° angle in your notebooks.","Each joint can move through an angle of 90°.","The vertical line makes an angle with the horizontal line.","the angle between these two lines"],"opposite":"","synonyms":""},{"def":"a corner on the outside or inside of something","examples":["It's a modern building, all brick and glass and sharp angles."],"opposite":"","synonyms":""},{"def":"the direction that something is leaning or pointing in when it does not go straight up and down or straight across from side to side","examples":["at an angle The Tower of Pisa leans at an angle","The plane was coming in at a steep angle.","His hair was sticking up at all angles.","His shoulder was bent at an odd angle so it must be broken.","at an angle to something Venus and the Earth orbit the Sun at a slight angle to each other.","He wore his hat at a jaunty angle.","She adjusted the angle of the legs to make the table stand more firmly.","The calf's legs were splayed out at awkward angles."],"opposite":"","synonyms":""},{"def":"a position from which you look at something","examples":["The photo was taken from an unusual angle.","The painting changes slightly when seen from different angles.","The variety of camera angles gives her photographs interest.","How you see the building depends on your angle of vision.","Seeing herself from this angle, she realized how like her mother she looked."],"opposite":"","synonyms":""},{"def":"a particular way of presenting or thinking about a situation, problem, etc.","examples":["We need a new angle for our next advertising campaign.","You can look at the issue from many different angles.","You start seeing some solutions when you view something from all angles.","The article concentrates on the human angle (= the part that concerns people's emotions) of the story.","You need to consider the question from all angles.","The subject is considered from an unusual angle.","We've looked at the problem from every possible angle but still haven't found a solution.","He took a different angle on the story."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["angle for","acute angle","right angle","angle bracket","angle grinder","oblique angle","obtuse angle","reflex angle","adjacent angle","exterior angle","interior angle","straight angle","complementary angle","supplementary angle","wide-angle lens","angle brackets","angle grinders","angle for something"]},{"pos":"verb","level":"","meanings":[{"def":"to move or place something so that it is not straight or not directly facing somebody/something","examples":["He angled his chair so that he could sit and watch her."],"opposite":"","synonyms":""},{"def":"to present information, a report, etc. based on a particular way of thinking or for a particular audience","examples":["The programme is angled towards younger viewers."],"opposite":"","synonyms":""},{"def":"to catch fish with a line and a hook","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["angle for"],"related":[]}]