[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/ann/annou/announce__us_1.mp3","phonsUS":"/əˈnaʊns/","level":"B1","meanings":[{"def":"to tell people something officially, especially about a decision, plans, etc.","examples":["announce something He officially announced his intention to resign at today's press conference.","They haven't formally announced their engagement yet.","(figurative) A ring at the doorbell announced Jack's arrival.","announce that… We are pleased to announce that all five candidates were successful.","it is announced that… It was announced that new speed restrictions would be introduced.","announce something to somebody The company announced its decision to the public in March.","The government yesterday announced to the media plans to create a million new jobs.","announce somebody/something as something She was announced as the winner at last night's ceremony.","to declare war","The painting was declared to be a forgery.","He has already stated his intention to run for election.","During our meeting, he indicated his willingness to cooperate.","They haven’t formally announced their engagement yet.","Has our flight been announced yet?","The company proudly announced the launch of its new range of cars.","We expect to announce details of the plan later this week.","We regret to announce the death of our chairman, Alfred Sidebottom.","He announced to the crowd that the war was over."],"opposite":"","synonyms":"declare"},{"def":"to give information about something in a public place, especially through a loudspeaker","examples":["announce something Has our flight been announced yet?","The winners will be announced in reverse order.","+ speech ‘Now boarding flight 897, destination Seattle,’ the loudspeaker announced.","announce that… They announced that the flight would be delayed."],"opposite":"","synonyms":""},{"def":"to say something in a loud and/or serious way","examples":["+ speech ‘I've given up smoking,’ she announced.","announce that… She announced that she'd given up smoking.","to declare war","The painting was declared to be a forgery.","He has already stated his intention to run for election.","During our meeting, he indicated his willingness to cooperate.","They haven’t formally announced their engagement yet.","Has our flight been announced yet?"],"opposite":"","synonyms":"declare"},{"def":"to tell somebody your name or somebody else’s name when you or they arrive at a place","examples":["Would you announce the guests as they arrive? (= call out their names, for example at a formal party)"],"opposite":"","synonyms":""},{"def":"to introduce, or to give information about, a programme on the radio or television","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]