[{"pos":"determiner, pronoun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/ano/anoth/another__us_2.mp3","phonsUS":"/əˈnʌðər/","level":"A1","meanings":[{"def":"one more; an extra thing or person","examples":["Would you like another drink?","‘Finished?’ ‘No, I've got another three questions to do.’","We've still got another (= a further) forty miles to go.","‘It's a bill.’ ‘Oh no, not another!’","I got another of those calls yesterday.","Bilingual children do better in IQ tests than children who speak only one language. In addition/What is more, they seem to find it easier to learn third or even fourth languages.","Learning another language not only improves children’s job prospects in later life, but also boosts their self-esteem.","Teaching children a second language improves their job prospects in later life. Other benefits include increased self-esteem and greater tolerance of other cultures.","Another/One further/One additional reason for encouraging bilingual education is that it boosts children’s self-esteem.","Studies suggest that bilingual children find it easier to learn additional languages. There is, moreover, increasing evidence that bilingual children perform better across a range of school subjects, not just foreign languages.","His claim that children find bilingual education confusing is based on very little evidence. Moreover, the evidence he does provide is seriously flawed.","Research has shown that first-language development is not impeded by exposure to a second language. Furthermore, there is no evidence to support the claim that children find bilingual education confusing."],"opposite":"","synonyms":""},{"def":"different; a different person or thing","examples":["Let's do it another time.","We can try that—but whether it'll work is another matter.","The room's too small. Let's see if they've got another one.","I don't like this room. I'm going to ask for another."],"opposite":"","synonyms":""},{"def":"a person or thing of a very similar type","examples":["She's going to be another Madonna (= as famous as her).","There'll never be another like him."],"opposite":"","synonyms":""},{"def":"used when you are referring to various types of a thing, without saying exactly what you mean","examples":["We've all got problems of one kind or another."],"opposite":"","synonyms":""},{"def":"first one person or thing, and then another, and then another, up to any number or amount","examples":["The bills kept coming in, one after another."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"of one kind, sort, etc. or another","def":"used when you are referring to various types of a thing, without saying exactly what you mean","examples":["We've all got problems of one kind or another."]},{"idiom":"one after another/the other","def":"first one person or thing, and then another, and then another, up to any number or amount","examples":["The bills kept coming in, one after another."]}],"phrasal":[],"related":["one another","another place","tell me another!","to be on another planet","live to fight another day","one thing leads to another","one good turn deserves another","be another/a different matter","you’ve got another think coming","one (damned/damn) thing after another","A is one thing, B is another","(what) with one thing and another","one man’s meat is another man’s poison","have another string/more strings to your bow","it’s one thing to do A, it’s another thing to do B"]}]