[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/ans/answe/answer__us_1.mp3","phonsUS":"/ˈænsər/","level":"A1","meanings":[{"def":"something that you say, write or do to react to a question or situation","examples":["I rang the bell, but there was no answer.","Can't you give me a definitive answer?","The short answer is no.","The simple answer is that we don't know.","a question and answer session","answer to something I can't easily give an answer to your question.","Have you had an answer to your letter?","She had no answer to the accusations.","in answer to something As if in answer to our prayers, she offered to lend us £10 000.","answer from somebody You're not going to get an answer from me!","answer as to something The report does not provide answers as to why the tragedy occurred.","I’m writing to answer your questions","I’m writing to reply to your questions.","I’m writing to answer to your questions.","I haven’t answered her email yet.","I knocked on the door but nobody answered.","‘I won’t let you down,’ he replied.","The directors were unwilling to respond to questions.","I’m writing in answer to your letter.","He left without waiting to hear her answer.","He was clearly expecting a different answer.","I cannot give you a definite answer just yet.","I expect a straight answer to a straight question.","I struggled to formulate an answer.","I complained to the water company and received a very dusty answer.","I think you can guess the answer—they won't lend us the money.","I want some answers before I agree to anything.","Please give her your answer, so she can make the necessary arrangements.","She repeated her question, but he offered no answer.","The answer came in a postcard she sent from Devon.","The question deserves a proper answer.","The short answer to your query is that he has acted completely illegally.","We can provide answers to any questions you may have about the system.","In answer to your question—yes, I have seen him before."],"opposite":"","synonyms":""},{"def":"something that you write or say in reply to a question in a test, an exam, an exercise, etc.; the correct reply to a question in a test, etc.","examples":["the correct/right answer","Write your answers on the sheet provided.","Do you know the answer (= the right one) to question 12?","The answers are at the back of the book.","The sender of the first correct answer to be drawn will receive £100.","It's not worth guessing the answer, as you may lose marks.","Please print the answers to questions 1 and 2.","The students are allowed to use textbooks to find the right answer.","This part of the exam requires a written answer.","the short-answer section of the test"],"opposite":"","synonyms":""},{"def":"a solution to a problem","examples":["There is no easy answer.","The answer is simple.","answer to something This could be the answer to all our problems.","There are more questions than answers on the issue of our ageing population.","This may not be the answer for everyone.","She has spent her life looking for answers.","The obvious answer would be to cancel the party.","The answer lies in a combination of factors.","The answer came to him in a flash.","We are aware of this problem, but we do not have the answer.","If you really want to save time, this machine will provide the answer.","We have arrived at an answer which we hope will satisfy everyone."],"opposite":"","synonyms":""},{"def":"a person or thing from one place that may be thought to be as good as a famous person or thing from another place","examples":["The new theme park will be Britain's answer to Disneyland."],"opposite":"","synonyms":""},{"def":"to be confident that you know something, especially when you actually do not","examples":["He thinks he knows all the answers."],"opposite":"","synonyms":""},{"def":"to refuse to accept that somebody does not want something, will not do something, etc.","examples":["You're coming and I won't take no for an answer!"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"have/know all the answers","def":"to be confident that you know something, especially when you actually do not","examples":["He thinks he knows all the answers."]},{"idiom":"not take no for an answer","def":"to refuse to accept that somebody does not want something, will not do something, etc.","examples":["You're coming and I won't take no for an answer!"]}],"phrasal":[],"related":["answer to","answer back","answer for","answer for somebody","answer for something","answer back | answer somebody back","answer to somebody (for something)","answer to the name of something","answer/fit/match a description (of somebody/something)"]},{"pos":"verb","level":"A1","meanings":[{"def":"to say, write or do something as a reaction to a question or situation","examples":["I repeated the question, but she didn't answer.","Please answer honestly.","She answered in the affirmative (= said yes).","answer something You haven't answered my question.","All you have to do is correctly answer the following questions about geography.","to answer a letter/an email","to answer the phone","to answer the door (= to open the door when somebody knocks/rings)","We are grateful to all those people who answered our call for help with fundraising.","My prayers have been answered (= I have got what I wanted).","He refused to answer the charges against him.","answer somebody Come on, answer me! Where were you?","He answered me with a smile.","+ speech ‘I'd prefer to walk,’ she answered.","answer somebody + speech ‘I'd prefer to walk,’ she answered him.","answer that… She answered that she would prefer to walk.","answer somebody that… Bill answered me that he thought it was a good idea.","answer somebody something Answer me this: how did they know we were here?","I’m writing to answer your questions","I’m writing to reply to your questions.","I’m writing to answer to your questions.","I haven’t answered her email yet.","I knocked on the door but nobody answered.","‘I won’t let you down,’ he replied.","The directors were unwilling to respond to questions.","I’m writing in answer to your letter.","He answered as truthfully as he could.","What he told me does not fully answer the question of what his motives were.","She answered simply, ‘No.’"],"opposite":"","synonyms":""},{"def":"to defend yourself against a charge or criticism","examples":["He was summoned before the council to answer charges of treason.","With this new album she has answered her critics and shown her true quality."],"opposite":"","synonyms":""},{"def":"to be suitable for something; to match something","examples":["Does this answer your requirements?","Volunteer teachers definitely answer a need in the region."],"opposite":"","synonyms":""},{"def":"to be like a particular person or thing","examples":["A child answering the description of the missing boy was found safe and well in London yesterday.","We're all looking for quick, healthy meals, and pasta fits this description.","A man fitting your description was seen entering the building.","I realized to my horror that the description of the killer could fit me.","Police have arrested two men matching the descriptions of the robbers."],"opposite":"","synonyms":""},{"def":"to be called something","examples":["The dog was an ugly brute, answering to the name of Spike."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"answer/fit/match a description (of somebody/something)","def":"to be like a particular person or thing","examples":["A child answering the description of the missing boy was found safe and well in London yesterday.","We're all looking for quick, healthy meals, and pasta fits this description.","A man fitting your description was seen entering the building.","I realized to my horror that the description of the killer could fit me.","Police have arrested two men matching the descriptions of the robbers."]},{"idiom":"answer to the name of something","def":"to be called something","examples":["The dog was an ugly brute, answering to the name of Spike."]}],"phrasal":["answer back","answer for","answer to"],"related":[]}]