[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/app/appar/apparent__us_1.mp3","phonsUS":"/əˈpærənt/","level":"B2","meanings":[{"def":"easy to see or understand","examples":["Their devotion was apparent.","Then, for no apparent reason, the train suddenly stopped.","apparent from something that… It was apparent from her face that she was really upset.","apparent to somebody that… It soon became apparent to everyone that he couldn't sing.","apparent that… It's readily apparent that she has a gift for this kind of writing.","apparent from something No damage was apparent from a brain scan.","apparent to somebody The consequences of our actions are not immediately apparent to us.","It was quite clear to me that she was lying.","It’s obvious from what he said that something is wrong.","It was apparent from her face that she was really upset.","The orchestra played with evident enjoyment.","He made it very plain that he wanted us to leave.","I hope I make myself obvious.","Try not to make it so clear/​plain.","an evident case of something.","This bar chart illustrates how many journeys people made on public transport over a three-month period.","This table compares bus, train, and taxi use between April and June.","The results are shown in the chart below.","In this pie chart, the survey results are broken down by age.","This pie chart breaks down the survey results by age.","As can be seen from these results, younger people use buses more than older people.","According to these figures, bus travel accounts for 60 per cent of public transport use.","From the data in the above graph, it is apparent that buses are the most widely used form of public transport.","The extent of their injuries was not immediately apparent.","His unhappiness was all too apparent.","Local suspicion of the incomers was painfully apparent.","His lack of experience was quite apparent to everyone.","It soon became apparent that the company was losing money."],"opposite":"","synonyms":"clear"},{"def":"that seems to be real or true but may not be","examples":["My parents were concerned at my apparent lack of enthusiasm for school.","Their affluence is more apparent than real (= they are not as rich as they seem to be).","There is an apparent contradiction between these two approaches."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["heir apparent","apparent magnitude","heirs apparent","apparent magnitudes"]}]