[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/app/appea/appear__us_2.mp3","phonsUS":"/əˈpɪr/","level":"A2","meanings":[{"def":"to start to be seen","examples":["Three days later a rash appeared.","Symptoms usually start appearing within two to three days.","+ adv./prep. A cat suddenly appeared out of nowhere.","Smoke appeared on the horizon.","A bus appeared around the corner.","Posters for the gig appeared all over town.","New shoots are just appearing at the base of the plant.","The door burst open and John appeared.","Her dead mother appeared to her in a dream.","A police officer appeared as if from nowhere and ordered us to halt.","A man suddenly appeared in the doorway.","The file appeared on my desk yesterday."],"opposite":"","synonyms":""},{"def":"to begin to exist or be known or used for the first time","examples":["Scientists are unsure when the virus first appeared.","+ adv./prep. His work began to appear on the scene in the 1960s.","When did mammals appear on the earth?","This problem first appeared in the inner cities.","Modern contact lenses first appeared in the 1940s.","Some exciting new products have recently appeared on the market."],"opposite":"","synonyms":""},{"def":"to give the impression of being or doing something","examples":["+ adj. She didn't appear at all surprised at the news.","Everything appeared normal at first.","it appears + adj. It now appears likely that the school will be closed down.","It appears unlikely that interest rates will fall further.","+ noun He appears a perfectly normal person.","appear to do something The couple appeared to have nothing in common.","The video appears to show a car driving through the wall of a house.","She appeared to be in her late thirties.","They appeared not to know what was happening.","There appears to have been a mistake.","it appears (that)… It appears that there has been a mistake.","It would appear that this was a major problem.","appear as if… The sunset made it appear as if the sea was made of gold.","Most cybercrime involves traditional crimes, such as theft and fraud, being committed in new ways. Phishing is perhaps/possibly/probably the best-known example of this.","It seems/appears that the more personal data which organizations collect, the more opportunity there is for this data to be lost or stolen.","It seems clear that introducing national ID cards would do little to prevent identity theft.","It could be argued that the introduction of national ID cards might actually make identity theft easier.","It is possible that/It may be that the only way to protect ourselves against DNA identity theft is to avoid the creation of national DNA databases."],"opposite":"","synonyms":""},{"def":"to be published or broadcast","examples":["His new book will be appearing in the spring.","It was too late to prevent the story from appearing in the national newspapers.","These allegations appear in a forthcoming documentary."],"opposite":"","synonyms":""},{"def":"to take part in a film, play, television programme, etc.","examples":["He has appeared in over 60 movies.","She regularly appears on TV.","She is currently appearing as Juliet at the Liverpool Playhouse.","He appears briefly in the movie as a waiter.","The Senator has appeared frequently on this show.","She rarely appears in public.","Next month he will be appearing as Jefferson in a new play on Broadway."],"opposite":"","synonyms":""},{"def":"to arrive at a place","examples":["By ten o'clock Lee still hadn't appeared.","+ adv./prep. A man appeared at the door and asked to see her.","A bit later Jill appeared and came over to join them.","Michael appeared a few moments later.","He looked worried when he appeared in my office at half past two."],"opposite":"","synonyms":""},{"def":"to be written or mentioned somewhere","examples":["Your name will appear at the front of the book."],"opposite":"","synonyms":""},{"def":"to be present in court in order to give evidence or answer a charge","examples":["A man will appear in court today charged with the murder.","She is expected to appear at Dumfries Sheriff Court on Monday.","She appeared on six charges of theft.","They will appear before magistrates tomorrow.","He has been asked to appear as a witness for the defence.","They had all appeared before the court several times."],"opposite":"","synonyms":""},{"def":"to act as somebody’s lawyer in court","examples":["James Gilbert is the lawyer appearing for the defendant."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]