[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/app/appea/appearance__us_1.mp3","phonsUS":"/əˈpɪrəns/","level":"A2","meanings":[{"def":"the way that somebody/something looks on the outside; what somebody/something seems to be","examples":["the physical/outward/external appearance of something","She had never been greatly concerned about her appearance.","The dog was similar in general appearance to a spaniel.","He gave every appearance of (= seemed very much to be) enjoying himself.","Judging by appearances can be misleading.","To all appearances (= as far as people could tell) he was dead.","Shaving off his beard changed his appearance dramatically.","Inside, the house had the appearance of a temple.","man-made materials that mimic the appearance of wood","Towns merged to take on the appearance of a city.","The report gives an appearance of scientific credibility.","They tried to maintain the appearance of normality.","We must avoid any appearance of impropriety.","In outward appearance the two types of tomato are similar.","The American president, despite appearances, has only limited power.","To judge by appearances, Roger was rather embarrassed.","With his dishevelled appearance he often looks as though he's just fallen out of bed.","attempts to improve the general appearance of the town centre","attention to personal appearance and hygiene","rather bird-like in appearance"],"opposite":"","synonyms":""},{"def":"the fact of somebody/something arriving, especially when it is not expected","examples":["The sudden appearance of a security guard caused them to drop the money and run.","I don't want to go to the party, but I suppose I'd better put in an appearance (= go there for a short time).","It was at this point that their mother made an appearance.","They were startled by the young man's sudden appearance.","An awkward silence greeted her appearance in the doorway."],"opposite":"","synonyms":""},{"def":"the moment at which something begins to exist or starts to be seen or used","examples":["the early appearance of daffodils in spring","the appearance of organic vegetables in the supermarkets","Since its first appearance in the 19th century, cholera has killed millions.","This marked the appearance of a new genre in American music.","Gas lighting made its first appearance in 1802."],"opposite":"","synonyms":""},{"def":"an act of appearing in public, especially as a performer, politician, etc., or in court","examples":["The Dutch player will make his first appearance for Liverpool this Saturday.","The show featured a guest appearance from Amy Schumer.","The singer's first public appearance was at the age of eight.","She made a cameo appearance in the film.","the defendant’s appearance in court","a court appearance","his appearance before the committee/inquiry","She was forced to cancel her appearance as keynote speaker at the event.","her first appearance on the stage","one of the actor's rare television appearances"],"opposite":"","synonyms":""},{"def":"an act of being published or broadcast","examples":["the appearance of claims about the minister’s private life in the press"],"opposite":"","synonyms":""},{"def":"to hide the truth about a bad situation and pretend that everything is going well","examples":["When she lost all her money she was determined to keep up appearances."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"keep up appearances","def":"to hide the truth about a bad situation and pretend that everything is going well","examples":["When she lost all her money she was determined to keep up appearances."]}],"phrasal":[],"related":["non-appearance"]}]