[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/app/appea/appeal__us_2.mp3","phonsUS":"/əˈpiːl/","level":"B2","meanings":[{"def":"a deeply felt request for money, help or information that is needed immediately, especially one made by a charity or by the police","examples":["appeal for something to launch a TV appeal for donations to the charity","appeal to somebody He made an emotional appeal to voters.","appeal to somebody for something Police are making a fresh appeal to the public for any information that may help them.","appeal to somebody to do something The police made an appeal to the public to remain calm.","There was a look of silent appeal on his face.","She gazed at him in mute appeal.","an appeal for help","a fresh appeal for witnesses to come forward","They made a direct appeal to the government for funding.","The appeal raised over three million pounds.","The child's mother made an emotional appeal on TV for his return."],"opposite":"","synonyms":""},{"def":"a quality that makes somebody/something attractive or interesting","examples":["mass/wide/popular/broad/universal appeal","The Beatles have never really lost their appeal.","The prospect of living in a city holds little appeal for me.","Her charming children's stories have timeless appeal.","His considerable appeal lies in his quiet, gentle manner.","His views hold no appeal for me.","Unfortunately the movie lacks commercial appeal.","We are trying to broaden the appeal of classical music.","He was beginning to understand the appeal of living in the countryside.","the book's immediate appeal to young children"],"opposite":"","synonyms":""},{"def":"a formal request to a court or to somebody in authority for a judgement or a decision to be changed","examples":["(British English) to lodge an appeal","(North American English) to file an appeal","(British English) an appeal court/judge","(North American English) an appeals court/judge","appeal against something They have launched appeals against their convictions.","an appeal against the 3-match ban","an appeal against a decision/sentence/order/ruling","The court dismissed his appeal against the verdict.","on appeal The case was upheld on appeal.","The verdict was later overturned on appeal.","You have the right of appeal to the Constitutional Court.","He's bringing an appeal against the size of the fine.","a case currently under appeal","His appeal was upheld and he was released immediately.","His lawyer is considering an appeal to the Supreme Court.","She won the right to make another court appeal.","The court will hear the appeal on 10 June.","The judge has agreed to allow his appeal.","The players have been suspended pending appeal.","There is a possibility of a further appeal to a higher court.","They have agreed to drop the appeal."],"opposite":"","synonyms":""},{"def":"an indirect suggestion that any good, fair or reasonable person would act in a particular way","examples":["I relied on an appeal to his finer feelings.","an appeal to reason"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["sex appeal","appeal court","court of appeal","appeal courts","Appeal Court","Court of Appeal","courts of appeal"]},{"pos":"verb","level":"B2","meanings":[{"def":"to make a deeply felt request, especially for something that is needed immediately","examples":["I am appealing (= asking for money) on behalf of the famine victims.","appeal for something Community leaders appealed for calm (= urged people to remain calm).","appeal to somebody Appeal directly to the public, answer their questions.","appeal to somebody for something The government appealed to the British people for help.","appeal for somebody to do something Police have appealed for witnesses to come forward.","appeal to somebody to do something Organizers appealed to the crowd not to panic.","Police appealed to the public for information about the crime.","He went over the heads of union officials, appealing directly to the workforce."],"opposite":"","synonyms":""},{"def":"to attract or interest somebody","examples":["The prospect of a long wait in the rain did not appeal.","appeal to somebody The design has to appeal to all ages and social groups.","His movies appeal to a broad audience.","The ad is designed to appeal to female voters.","Computer games used to appeal primarily to boys.","The idea of retiring early really appeals to me.","The prospect of teaching such bright children appealed enormously.","These characters will appeal directly to children's imaginations.","The idea appealed enormously."],"opposite":"","synonyms":""},{"def":"to make a formal request to a court or to somebody in authority for a judgment or a decision to be changed","examples":["He said he would appeal after being found guilty on four counts of murder.","appeal against something The company is appealing against the ruling.","appeal to somebody/something against something He is seeking leave to appeal to the High Court against the decision.","appeal to somebody/something Permission to appeal to the House of Lords was refused.","He has decided to appeal to the European Court.","She appealed unsuccessfully against her conviction for murder."],"opposite":"","synonyms":""},{"def":"to try to persuade somebody to do something by suggesting that it is a fair, reasonable or honest thing to do","examples":["They needed to appeal to his sense of justice."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]