[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/app/apply/apply__us_1.mp3","phonsUS":"/əˈplaɪ/","level":"A2","meanings":[{"def":"to make a formal request, usually in writing, for something such as a job, a loan, permission for something, a place at a university, etc.","examples":["You should apply in person/by letter.","apply for something I have decided to apply for this new job.","They have successfully applied for political asylum.","to apply for a visa/passport/grant/licence","The developers applied for planning permission to build over 200 houses.","apply to somebody/something to apply to a company/university","apply to somebody/something for something They may apply to the court for the decision to be reversed.","apply to do something He has applied to join the army.","You can apply by letter or on-line.","I decided to apply to Manchester University.","We're worried that the new fees might discourage poorer students from applying."],"opposite":"","synonyms":""},{"def":"to affect or be relevant to somebody/something","examples":["Special conditions apply if you are under 18.","apply to somebody/something The rules applied to employees and their behaviour at work.","What I am saying applies only to some of you.","The policy will apply equally to everyone.","The law applied only to foreign nationals.","apply something to somebody/something The word ‘unexciting’ could never be applied to her novels.","These principles apply equally in all cases.","These restrictions do not apply to us.","British companies are subject to international laws and the same applies to companies in Europe."],"opposite":"","synonyms":""},{"def":"to use something or make something work in a particular situation","examples":["apply something to apply political pressure","The challenge allows students to apply economic principles they learn in class.","to apply economic sanctions","to apply a test/method/technique/approach/rule","Each citizen needs to apply the same standards to himself as to others.","apply something to something The new technology was applied to farming.","Now is the time to apply the insights you have gained from your studies."],"opposite":"","synonyms":""},{"def":"to put or spread something such as paint, cream, etc. onto a surface","examples":["apply something to something Apply the cream sparingly to your face and neck.","The glue should be applied to both surfaces.","apply something She combed her hair and carefully applied her make-up.","The paint was applied with a fine brush.","I carefully applied a creamy foundation.","Never apply the cleaning liquid directly to the surface."],"opposite":"","synonyms":""},{"def":"to work at something or study something very hard","examples":["apply yourself You would pass your exams if you applied yourself.","apply yourself/something to (doing) something We applied our minds to finding a solution to our problem."],"opposite":"","synonyms":""},{"def":"to press on something hard with your hand, foot, etc. to make something work or have an effect on something","examples":["apply something to apply the brakes (of a vehicle)","apply something to something Pressure applied to the wound will stop the bleeding."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]