[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/app/appoi/appointment__us_1.mp3","phonsUS":"/əˈpɔɪntmənt/","level":"B1","meanings":[{"def":"a formal arrangement to meet or visit somebody at a particular time, especially for a reason connected with their work","examples":["I've got a dental appointment at 3 o'clock.","to book/make/keep an appointment","Do you have an appointment?","She has a doctor's appointment in twenty minutes.","Viewing is by appointment only (= only at a time that has been arranged in advance).","an appointment book","appointment with somebody an appointment with my agent/doctor/specialist/consultant","appointment for something an appointment for a blood test","appointment for somebody to do something She made an appointment for her son to see the doctor.","He called without an appointment.","Tom has been given an appointment at the local hospital.","I assume he'll come at his usual 10 a.m. appointment time.","I didn't know if I would get an appointment at such short notice.","He failed to keep his appointment.","She has already broken three appointments.","Patients may be charged for missed appointments.","The hospital needs to allow more time for outpatient appointments."],"opposite":"","synonyms":""},{"def":"the act of choosing a person for a job or position of responsibility; the fact of being chosen for a job, etc.","examples":["They announced the appointments of key security officials.","the appointment of a new captain for the England team","appointment to something her recent appointment to the post","appointment as something his appointment as principal","appointments and dismissals","The board has confirmed the appointment of Howard Kendall as Sales Manager.","The President secured the appointment of a close friend.","the first appointments to the new government"],"opposite":"","synonyms":""},{"def":"a job or position of responsibility","examples":["a permanent/first appointment","The department wished him success in his new appointment as sales manager.","I would like to congratulate you on your appointment.","He’s trying to get a job in a bank.","a senior position in a large corporation","a key post in the new government","We have several vacancies for casual workers.","This is a permanent appointment, requiring commitment and hard work.","Employees may not hold any other appointments.","He takes up his appointment in January.","He was offered an appointment in the Education Department.","Miss Green resigned her appointment as our regional representative.","The college terminated the appointments of six professors.","He spent the first month of his new appointment going through the firm's financial records.","This is a permanent appointment, requiring commitment and hard work.","Those taking up senior government appointments are all vetted."],"opposite":"","synonyms":"job"},{"def":"a person chosen for a job or position of responsibility","examples":["Government ministers and other political appointments are frequently replaced."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["appointment book","appointment calendar","appointment books"]}]