[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/app/appro/approval__us_1.mp3","phonsUS":"/əˈpruːvl/","level":"B2","meanings":[{"def":"the feeling that somebody/something is good or acceptable; a positive opinion of somebody/something","examples":["She desperately wanted to win her father's approval.","Do the plans meet with your approval?","in approval Several people nodded in approval.","The president's approval ratings were slipping.","I could tell I had earned her approval.","Jane's father regards her fiancé with approval.","She gave him a nod of approval.","The people listening nodded approval.","There was a roar of approval from the crowd.","The crowd roared its approval for the song.","The latest poll has him at 47% approval and 49% disapproval."],"opposite":"disapproval","synonyms":""},{"def":"agreement to, or permission for something, especially a plan or request","examples":["The plan will be submitted to the committee for official approval.","parliamentary/congressional/government approval","Senior management have given their seal of approval (= formal approval) to the plans.","I can't agree to anything without my partner's approval.","planning approvals","approval of something The government is seeking approval of its plans.","The proposal is subject to approval by the shareholders (= they need to agree to it).","approval for something from somebody They required/received approval for the proposal from the shareholders.","approval for something He won approval for his project.","approval from somebody He left without obtaining the necessary approval from the authorities.","She expects to gain final approval from the council.","The committee is expected to recommend approval of the new drug.","The government has now given its approval for the new examinations.","The scheme did not meet unqualified approval.","We already have approval for six products.","We have submitted a design for approval.","You may not decorate the flat without the landlord's approval.","Alterations to the hotel must have planning approval.","The measure would require the approval of the European Parliament.","The treaty still required approval by the Senate.","The winning photo will be published in the magazine, subject to the Editor's approval."],"opposite":"","synonyms":""},{"def":"if you buy goods or if goods are sold on approval, you can use them for a time without paying, until you decide if you want to buy them or not","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]