[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/app/appro/approve__us_2.mp3","phonsUS":"/əˈpruːv/","level":"B2","meanings":[{"def":"to think that somebody/something is good, acceptable or suitable","examples":["I told my mother I wanted to leave school but she didn't approve.","approve of somebody/something Do you approve of my idea?","She didn't quite approve of the way he was running things.","approve of somebody doing something She doesn't approve of me leaving school this year.","(formal) approve of somebody’s doing something She doesn't approve of my leaving school this year.","I don't personally approve but I'm willing to live with it.","He didn't say anything, but I could tell from the look on his face that he didn't approve.","I very much approve of these new tests.","I wholeheartedly approve of his actions.","I don't think your mother would approve of this behaviour, do you?"],"opposite":"disapprove","synonyms":""},{"def":"to officially agree to a plan, request, etc.","examples":["The committee unanimously approved the plan.","We hope that the proposals will soon be approved by the committee.","to approve a bill/application","He agreed to let me go early.","They accepted the court’s decision.","The committee unanimously approved the plan.","She just goes along with everything he suggests.","She finally consented to answer our questions.","They approved the creation of a human resources development centre.","His appointment has not been formally approved yet.","The Legislature narrowly approved an amendment to the Massachusetts Constitution.","The committee has approved the compensation package."],"opposite":"","synonyms":"agree"},{"def":"to say that something is good enough to be used or is correct","examples":["be approved by somebody/something The course is approved by the Department for Education.","be approved for something This medicine is not approved for use in children.","be approved as something The chemical has never been federally approved as a pesticide.","approve something The auditors approved the company's accounts."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]