[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/app/appre/appreciate__us_1.mp3","phonsUS":"/əˈpriːʃieɪt/","level":"B1","meanings":[{"def":"to recognize the good qualities of somebody/something","examples":["Over the years he came to appreciate the beauty and tranquillity of the river.","His talents are not fully appreciated in that company.","Her family doesn't appreciate her.","You can't really appreciate foreign literature in translation.","The sound quality was poor so we couldn't fully appreciate the music."],"opposite":"","synonyms":""},{"def":"to be grateful for something that somebody has done; to welcome something","examples":["appreciate something I'd appreciate some help.","Your support is greatly appreciated.","Thanks for coming. I appreciate it.","I would appreciate any comments you might have.","Your kindness and generosity is much appreciated.","We really appreciate the extra effort you're making.","I would appreciate it if you paid in cash.","appreciate doing something I appreciate having the opportunity to discuss these important issues with you.","I don't appreciate being treated like a second-class citizen.","appreciate somebody doing something We would appreciate you letting us know of any problems.","Thank you very much. It's very kind of you./You really shouldn't have.","Thank you so much for coming. It was really nice to see you.","I'm very grateful.","I do appreciate your help.","That's all right.","Don't mention it.","No problem.","My pleasure.","I'm glad I could help.","Younger kids might especially appreciate a trip to the zoo.","Teachers will especially appreciate the lists at the back of the book."],"opposite":"","synonyms":""},{"def":"to understand that something is true","examples":["appreciate something What I failed to appreciate was the distance between the two cities.","The experience helped me understand and appreciate some of the difficulties people face.","appreciate how, what, etc… I don't think you appreciate how expensive it will be.","appreciate that… We didn't fully appreciate that he was seriously ill.","The government failed to appreciate the fact that voters were angry.","The problems should be easily appreciated.","You have to appreciate the difficulties we are facing.","As you'll appreciate, the task has not always been easy.","We didn't fully appreciate how sick he really was.","It is generally appreciated that the rail network needs a complete overhaul."],"opposite":"depreciate","synonyms":""},{"def":"to increase in value over a period of time","examples":["Their investments have appreciated over the years.","We wanted a property that would appreciate in value.","appreciate against something The euro continues to appreciate against the dollar."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]