[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/app/appre/appreciation__us_1.mp3","phonsUS":"/əˌpriːʃiˈeɪʃn/","level":"C1","meanings":[{"def":"pleasure that you have when you recognize and enjoy the good qualities of somebody/something","examples":["She shows little appreciation of good music.","in appreciation The crowd murmured in appreciation.","He doesn't share my appreciation for opera.","I have now developed an appreciation of poetry.","She gazed in appreciation at the scene.","They had a new-found appreciation for Japanese music.","They have little appreciation of the arts."],"opposite":"","synonyms":""},{"def":"a full understanding of something, such as a situation or a problem, and of what it involves","examples":["I had no appreciation of the problems they faced.","The article gave me a new appreciation for the work which went into the album.","The course helped me to gain a deeper appreciation of what scientific research involves.","There is a growing appreciation of the need for change.","a renewed appreciation of traditions once branded as primitive","Candidates should have a broad appreciation of contemporary issues.","We aim to enhance people's appreciation and enjoyment of history."],"opposite":"","synonyms":""},{"def":"the feeling of being grateful for something","examples":["I would like to express my appreciation and thanks to you all.","in appreciation of something Please accept this gift in appreciation of all you've done for us.","appreciation for something She never shows any appreciation for our efforts.","appreciation of something The clock was presented to Snell by his colleagues as an appreciation of his work and friendship.","I'll be sending them a donation in appreciation of their help.","The authors extend their sincere appreciation to everyone who contributed to the book."],"opposite":"","synonyms":""},{"def":"increase in value over a period of time","examples":["an appreciation in the value of the house","capital appreciation"],"opposite":"","synonyms":""},{"def":"a piece of writing or a speech in which the strengths and weaknesses of somebody/something, especially an artist or a work of art, are discussed and judged","examples":["They were asked to write an appreciation of a poem of their choice."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]