[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/app/appro/appropriate__us_1.mp3","phonsUS":"/əˈprəʊpriət/","level":"B2","meanings":[{"def":"suitable, acceptable or correct for the particular circumstances","examples":["an appropriate response/measure/method","Now that the problem has been identified, appropriate action can be taken.","Is now an appropriate time to make a speech?","Please debit my Mastercard/Visa/American Express card (delete as appropriate) (= cross out the options that do not apply).","This may be an appropriate treatment for many patients.","Skills can be enhanced by the appropriate use of technology in certain circumstances.","He said she had responded to the situation in an entirely appropriate way.","to deem/consider/think something appropriate","appropriate for something Jeans are not appropriate for a formal party.","appropriate to something The book was written in a style appropriate to the age of the children.","All personnel were trained at levels appropriate to the needs of each job.","It was thought appropriate to award her the prize.","Tutors can construct tests appropriate to individual students' needs.","Would it be appropriate to take him a small gift?"],"opposite":"inappropriate","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/app/appro/appropriate__us_2.mp3","phonsUS":"/əˈprəʊprieɪt/","level":"","meanings":[{"def":"to take something, somebody’s ideas, etc. for your own use, especially illegally or without permission","examples":["He was accused of appropriating club funds.","Some of the opposition party's policies have been appropriated by the government."],"opposite":"","synonyms":""},{"def":"to take or give something, especially money for a particular purpose","examples":["Five million dollars have been appropriated for research into the disease."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]