[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/are/area_/area__us_2.mp3","phonsUS":"/ˈeriə/","level":"A1","meanings":[{"def":"part of a place, town, etc., or a region of a country or the world","examples":["to improve access to services in rural areas","urban/metropolitan/residential areas","The farm and surrounding area were flooded.","She knows the local area very well.","area around… the area around San Francisco","Large areas of the city were destroyed in the earthquake.","over a… area Wreckage from the plane was scattered over a wide area.","Thousands of tourists visit the area every year.","in the area There are lots of things to do in the area.","Ted has lived in this area all his life.","People who live in remote areas of the country may not have access to electricity.","A lot of new people have moved into the area recently.","John is the London area manager.","There is heavy traffic in the downtown area tonight.","Few homes in the area had electricity.","He slowly turned around, surveying the area.","I explored the area on my day off.","Police patrol the area regularly.","The storm surges have brought significant flooding to low-lying coastal areas.","We were in a secluded area far away from the rest of the school.","environmentally sensitive areas","people living in socially deprived areas","Do not use the spray in enclosed areas."],"opposite":"","synonyms":""},{"def":"a part of a room, building or particular space that is used for a special purpose","examples":["the hotel reception area","a play/parking/dining area","This would be a good place for a picnic.","They’ve chosen a site for the new school.","the hotel reception area","Move the cursor to a blank area on the screen.","From his position at the top of the hill, he could see the harbour.","the point at which the river divides","The company is moving to a new location.","the scene of the accident","The lake is one of the local beauty spots.","You can only smoke in designated areas.","The hotel has an outdoor area that rivals any Las Vegas hotel.","Keep storage areas locked.","He was shown to a table in the VIP area."],"opposite":"","synonyms":"place"},{"def":"a particular place on an object","examples":["The treatment targets the affected areas of the brain.","The tumour had not spread to other areas of the body.","Move the cursor to a blank area of the computer screen."],"opposite":"","synonyms":""},{"def":"a particular subject or activity, or an aspect of it","examples":["Finance is Mark's area.","The course covers two main subject areas.","area of something The report focuses on three key areas of concern.","That's outside my specific area of expertise.","area for something We have identified several areas for improvement.","in this area More research is needed in this area.","in the area of something to improve skills in the areas of critical thinking and problem-solving","the areas of training and development","The report covers several areas of social policy.","We are generally pleased with the results but there are a few areas of concern.","There have been some exciting new developments in this area.","The research explores three areas.","Taxation is a very complex area.","People with this disability can cope well in most areas of life."],"opposite":"","synonyms":""},{"def":"the amount of space covered by a flat surface or piece of land, described as a measurement","examples":["the area of a triangle","Measure the surface area.","The estate covers an area of 106 acres.","in area The room is 12 square metres in area.","Britain occupies a total area of 88 798 square miles.","A large building with a floor area of 100m2.","The country has a total area of around a million square miles.","The province covers an area roughly the size of Wales."],"opposite":"","synonyms":""},{"def":"the area in front of the goal. If the defending team breaks the rules within this area, the other team is given a penalty.","examples":["He shot from just outside the area."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["area code","goal area","grey area","rest area","assisted area","Broca’s area","council area","disaster area","no-go area","penalty area","service area","staging area","catchment area","conservation area","development area","in-goal area","Wernicke’s area","local area network","wide area network"]}]