[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/arg/argue/argue__us_2.mp3","phonsUS":"/ˈɑːrɡjuː/","level":"A2","meanings":[{"def":"to speak angrily to somebody because you disagree with them","examples":["My brothers are always arguing.","He's offering to pay so who am I to argue?","argue with somebody about/over something We're always arguing with each other about money.","argue about something I know it was a stupid thing to argue about.","argue over something All families seem to argue over money.","argue with somebody I don't want to argue with you—just do it!","She's always arguing with her mother.","They were arguing over who should have the car that day.","Magda walked out of the room before her husband could argue back."],"opposite":"","synonyms":""},{"def":"to give reasons why you think that something is right/wrong, true/not true, etc., especially to persuade people that you are right","examples":["argue for/against something/doing something They argued for the right to strike.","He argues persuasively against nationalism.","argue something She argued the case for bringing back the death penalty.","He was too tired to argue the point (= discuss the matter).","a well-argued article","argue that… Critics argue that Britain is not investing enough in broadband.","It could be argued that laws are made by and for men.","He argued that they needed more time to finish the project.","His lawyer successfully argued that the punishment was excessive.","Some critics argue that Picasso remained a great master all his life.","Others maintain that there is a significant deterioration in quality in his post-war work.","Picasso himself claimed that good art is created, but great art is stolen.","As Smith has noted, Picasso borrowed imagery from African art.","As the author points out, Picasso borrowed imagery from African art.","The writer challenges the notion that Picasso’s sculpture was secondary to his painting.","It has been suggested that Picasso’s painting was influenced by jazz music.","While the film is undoubtedly too long, it is nevertheless an intriguing piece of cinema.","It can be argued that the movie is too long. It is nonetheless an intriguing piece of cinema.","The film is undoubtedly too long. Still, it is an intriguing piece of cinema.","Of course, huge chunks of the book have been sacrificed in order to make a two-hour movie, but it is nevertheless a successful piece of storytelling.","Critics are wrong to argue that the film’s plot is too complicated. Certainly there are a couple of major twists, but audiences will have no difficulty following them.","It is true that you cannot make a good movie without a good script, but it is equally true that a talented director can make a good script into an excellent film.","It remains to be seen whether these two movies herald a new era of westerns, but there is no doubt that they represent welcome additions to the genre.","Most cybercrime involves traditional crimes, such as theft and fraud, being committed in new ways. Phishing is perhaps/possibly/probably the best-known example of this.","It seems/appears that the more personal data which organizations collect, the more opportunity there is for this data to be lost or stolen.","It seems clear that introducing national ID cards would do little to prevent identity theft.","It could be argued that the introduction of national ID cards might actually make identity theft easier.","It is possible that/It may be that the only way to protect ourselves against DNA identity theft is to avoid the creation of national DNA databases.","The general argued for extending the ceasefire.","They argued in favour of stricter punishments.","She argued against a rise in interest rates.","I would wish to argue that appreciation of the arts should be encouraged for its own sake.","In her paper she goes on to argue that scientists do not yet know enough about the nature of the disease.","It is possible to argue that the rules are too strict.","The report argues convincingly that economic help should be given to these countries.","You could easily argue that this policy will have no effect."],"opposite":"","synonyms":""},{"def":"to show clearly that something exists or is true","examples":["These latest developments argue a change in government policy."],"opposite":"","synonyms":""},{"def":"to continue to disagree about a decision, especially when it is too late to change it or it is not very important","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"argue the toss","def":"to continue to disagree about a decision, especially when it is too late to change it or it is not very important","examples":[]}],"phrasal":["argue into doing","argue out of doing","argue with"],"related":["argue with","argue into doing","argue out of doing","argue with something","argue somebody into doing something","argue somebody out of doing something"]}]