[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/ari/arise/arise__us_2.mp3","phonsUS":"/əˈraɪz/","level":"B2","meanings":[{"def":"to happen; to start to exist","examples":["An opportunity arose to work in the United States.","Questions naturally arose as to who was responsible.","A serious problem can arise if the heart stops pumping effectively.","Children should be disciplined when the need arises (= when it is necessary).","This issue arose as an unintended consequence of the Act.","A new crisis has arisen.","We keep them informed of any changes as they arise.","A storm arose during the night.","A disagreement arose over who should pay for the trip.","Call this number if any unforeseen emergency should arise.","Doubts have arisen over the viability of the schedule.","I'll speak to him if the occasion arises.","Somehow a misunderstanding arose.","These animals don't like water but will swim if the necessity arises.","We will deal with that if the situation arises.","No one could remember exactly how the dispute had arisen.","Difficulties arise when people fail to consult their colleagues.","Ambiguity arises when students' spoken English is very limited."],"opposite":"","synonyms":""},{"def":"to happen as a result of a particular situation","examples":["injuries arising out of a road accident","Emotional or mental problems can arise from a physical cause.","Are there any matters arising from the minutes of the last meeting?","Some learning difficulties arise from the way children are taught at school.","The current debate arose out of the concerns of parents.","Violence typically arises out of anger."],"opposite":"","synonyms":""},{"def":"to begin to exist or develop","examples":["Several new industries arose in the town."],"opposite":"","synonyms":""},{"def":"to get out of bed; to stand up","examples":["He arose at dawn."],"opposite":"","synonyms":""},{"def":"to come together to protest about something or to fight for something","examples":["The peasants arose against their masters."],"opposite":"","synonyms":""},{"def":"to gradually start to be seen as you move towards it","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]