[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/arr/arran/arrange__us_2.mp3","phonsUS":"/əˈreɪndʒ/","level":"A2","meanings":[{"def":"to plan or organize something in advance","examples":["arrange something The party was arranged quickly.","Can I arrange an appointment for Monday?","The meeting was provisionally arranged for 9 October.","She arranged a loan with the bank.","We met at six, as arranged.","arrange how, where, etc… We've still got to arrange how to get to the airport.","arrange to do something Have you arranged to meet him?","arrange that… I've arranged that we can borrow their car.","arrange for something to do something We arranged for a car to collect us from the airport.","arrange for something The president arranged for a meeting in his office.","arrange with somebody (about something) I've arranged with the neighbours about feeding the cat while we are away.","These matters are easy to arrange.","These things can be arranged with difficulty.","Todd will be able to arrange matters.","A news conference was hastily arranged.","Accommodation can be arranged in advance.","You can arrange a convenient time with your tutor.","She arranged that we could stay at her brother's house.","I'd be very grateful if you could arrange for this work to be carried out."],"opposite":"","synonyms":""},{"def":"to put something in a particular order; to make something neat or attractive","examples":["The books are arranged alphabetically by author.","The photos are arranged in chronological order.","She arranged the flowers in a vase.","The streets are arranged in a grid pattern.","I must arrange my financial affairs and make a will.","She arranged the chairs in neat rows.","She took the list of visitors' names and arranged them into groups of four.","The clothes were arranged according to size.","Her red hair was carefully arranged and her face made up."],"opposite":"","synonyms":""},{"def":"to change a piece of music so that it is suitable for a particular instrument or voice","examples":["He arranged traditional folk songs for the piano."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]