[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/arr/arriv/arrival__us_3.mp3","phonsUS":"/əˈraɪvl/","level":"B1","meanings":[{"def":"an act of coming or being brought to a place","examples":["We apologize for the late arrival of the train.","the arrival of the mail in the morning","Our estimated time of arrival is 7.15.","I need to check our arrival time.","on/upon arrival Guests receive dinner on arrival at the hotel","She was declared dead on arrival at the hospital.","There are 120 arrivals and departures every day.","daily arrivals of new patients","They are eagerly awaiting the arrival of their new computer.","Security escorts will ensure their safe arrival.","The staff greeted the arrival of the new boss with excitement.","The timely arrival of the cheque took away the need to borrow money.","They were saved by the arrival on the scene of another boat.","With the arrival of John's friends, the party became really enjoyable.","A frost in the air marked the arrival of winter.","A rainstorm greeted our arrival.","He met her soon after his arrival in Scotland.","Her arrival was a complete surprise.","News spread of the imminent arrival of the detective.","The princess's unexpected arrival threw catering staff into a panic.","The sound of the doorbell announced her arrival."],"opposite":"departure","synonyms":""},{"def":"the part of an airport that you go through when you arrive on a plane","examples":["I made my way through arrivals."],"opposite":"","synonyms":""},{"def":"a person or thing that comes to a place","examples":["The first arrivals at the concert got the best seats.","early/late/new arrivals","We're expecting a new arrival (= a baby) in the family soon.","We are delighted to welcome two new arrivals to the firm this month.","I was a new arrival in the country then.","There were plenty of jobs for arrivals from other areas.","The first arrivals are going through immigration control now.","The family are recent arrivals from South Africa.","Somebody needs to be here to greet the late arrivals."],"opposite":"","synonyms":""},{"def":"the time when a new technology or idea is introduced","examples":["the arrival of pay TV"],"opposite":"","synonyms":""},{"def":"(of an accident victim or other patient) already dead when arriving at a hospital","examples":["She was pronounced dead on arrival.","He didn’t even make it to hospital: DOA.","Many of the casualties were dead on arrival."],"opposite":"","synonyms":""},{"def":"very unlikely to be successful; not working when it is delivered","examples":["The bill was dead on arrival in the Senate.","The software was DOA."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"dead on arrival","def":"(of an accident victim or other patient) already dead when arriving at a hospital","examples":["She was pronounced dead on arrival.","He didn’t even make it to hospital: DOA.","Many of the casualties were dead on arrival.","The bill was dead on arrival in the Senate.","The software was DOA."]}],"phrasal":[],"related":["dead on arrival","estimated time of arrival"]}]