[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/art/artic/article__us_1.mp3","phonsUS":"/ˈɑːrtɪkl/","level":"A1","meanings":[{"def":"a piece of writing about a particular subject in a newspaper or magazine, on a website, etc.","examples":["to read/write/publish an article","Her tweet follows an article posted online by the ‘Huffington Post’.","article (by somebody) on something I read an interesting article by a well-known scientist on the subject of genetics.","article (by somebody) about something Have you seen that article about young fashion designers?","according to an article According to a recent newspaper article, the company is worth over $20 billion.","A leading article in ‘The Times’ accused the minister of lying.","He wrote about his political career in a series of articles published in a national newspaper.","I'm doing an article about ways of preventing pollution.","It was her job to commission occasional articles.","The article appears in this week's edition of ‘The Spectator’.","The article looks at two questions.","The magazine includes a how-to article on building a greenhouse.","The magazine refused to print his article.","an article on the dangers of sunbathing"],"opposite":"","synonyms":""},{"def":"a separate item in an agreement or a contract","examples":["Article 10 of the European Convention guarantees free speech.","The key articles of the constitution can only be changed by referendum.","Article 7 provides that all businesses must be registered correctly.","Several articles of the 1955 treaty were rewritten.","The actions of the organization are in breach of Article 12 of the treaty.","The judge ordered the child's return home under Article 6 of the Convention."],"opposite":"","synonyms":""},{"def":"a particular item or separate thing, especially one of a set","examples":["articles of clothing","toilet articles such as soap and shampoo","The articles found in the car helped the police to identify the body.","The finished article takes two months to manufacture.","Fake designer watches are sold at a fraction of the price of the genuine article."],"opposite":"","synonyms":""},{"def":"the words a and an (the indefinite article) or the (the definite article)","examples":["Names of countries in English do not usually take an article."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["definite article","leading article","article of faith","indefinite article"]}]