[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/ass/assau/assault__us_1.mp3","phonsUS":"/əˈsɔːlt/","level":"C1","meanings":[{"def":"the crime of attacking somebody physically","examples":["Both men were charged with assault.","sexual assaults","assault on/upon somebody A significant number of indecent assaults on women go unreported.","Better street lighting has helped reduce the number of assaults against women.","He reported the assault to the police.","allegations of police assault on the boy","assaults committed by teenagers"],"opposite":"","synonyms":""},{"def":"the act of attacking a building, an area, etc. in order to take control of it","examples":["An assault on the capital was launched in the early hours of the morning.","air assaults by fighter planes","a series of assaults on enemy targets","The garrison was built to withstand assaults.","The factory came under assault from soldiers in the mountains.","After an all-out assault the village was captured by the enemy."],"opposite":"","synonyms":""},{"def":"the act of trying to achieve something that is difficult or dangerous","examples":["The government has mounted a new assault on unemployment.","a two-year legal assault on alleged tax fraud","Three people died during an assault on the mountain (= while trying to climb it)."],"opposite":"","synonyms":""},{"def":"an act of criticizing somebody/something severely","examples":["The suggested closures came under assault from all parties.","assault on/upon/against somebody/something The paper's assault on the president was totally unjustified.","She used the article to make a sustained assault on her former political allies.","He launched into a verbal assault on tabloid journalism."],"opposite":"","synonyms":""},{"def":"an act that threatens to harm somebody physically, whether or not actual harm is done","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["assault course","indecent assault","assault and battery","assault courses"]},{"pos":"verb","level":"C1","meanings":[{"def":"to attack somebody violently, especially when this is a crime","examples":["He has been charged with assaulting a police officer.","Four women have been sexually assaulted in the area recently.","He admitted indecently assaulting the child.","Many healthcare workers say they have been physically assaulted by patients."],"opposite":"","synonyms":""},{"def":"to affect your senses in a way that is very unpleasant or uncomfortable","examples":["Loud rock music assaulted our ears."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]