[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/ass/assem/assembly__us_1.mp3","phonsUS":"/əˈsembli/","level":"C1","meanings":[{"def":"a group of people who have been elected to meet together regularly and make decisions or laws for a particular region or country","examples":["state/legislative/federal/local assemblies","Power has been handed over to provincial and regional assemblies.","The national assembly has voted to adopt the budget.","the California Assembly","the UN General Assembly","assembly elections","an elected assembly","Some assembly is required.","South Korea voted for its National Assembly this week.","The announcement was made during morning assembly.","The assembly voted to delay the legislation to allow further consultation to take place.","The company has twenty assembly plants in Europe.","These issues have been discussed in the local assemblies.","They demanded the right to hold peaceful assemblies.","This factory deals with final assembly and testing.","We hold an assembly every morning.","When the fire alarm sounds, leave the building and proceed to your assembly point.","furniture designed for home assembly","workers on the assembly line","I'm playing the flute in assembly tomorrow morning.","Laws governing freedom of assembly were gradually being relaxed.","Some assembly of the equipment is required.","The party has only 3 seats in the 51-seat National Assembly.","There is a whole school assembly every Friday morning.","Workers rushed to their designated assembly points."],"opposite":"","synonyms":""},{"def":"the meeting together of a group of people for a particular purpose; a group of people who meet together for a particular purpose","examples":["They were fighting for freedom of speech and freedom of assembly.","He was to address a public assembly on the issue.","an assembly point (= a place where people have been asked to meet)"],"opposite":"","synonyms":""},{"def":"a meeting of the teachers and students in a school, usually at the start of the day, to give information, discuss school events or say prayers together","examples":["The deputy head was taking (= leading) school assembly that day."],"opposite":"","synonyms":""},{"def":"the process of putting together the parts of something such as a vehicle or piece of furniture","examples":["Putting the bookcase together should be a simple assembly job.","a car assembly plant","the correct assembly of the parts"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["assembly line","assembly room","self-assembly","assembly language","Assembly Member","constituent assembly","freedom of assembly","General Assembly","London Assembly","Welsh Assembly","Northern Ireland Assembly","National Assembly for Wales","General Assembly of the Church of Scotland","assembly lines","assembly rooms","Assembly Members"]}]