[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/ass/assis/assist__us_1.mp3","phonsUS":"/əˈsɪst/","level":"B1","meanings":[{"def":"to help somebody to do something","examples":["Anyone willing to assist can contact this number.","assist in/with something He assisted in the development of the business strategy.","We are looking for people who would be willing to assist in the group's work.","assist somebody We'll do all we can to assist you.","They will be ably assisted by our remarkable staff.","The play was directed by Mike Johnson, assisted by Sharon Gale.","His task is to advise and assist his colleagues.","assist somebody in doing something We will assist you in finding somewhere to live.","assist somebody in/with something Two men are assisting the police with their enquiries (= are being questioned by the police).","The driver has been assisting police with their investigation.","assist somebody to do something a course to assist adults to return to the labour market","She offered to assist with the marketing of the product.","She was ably assisted by a team of volunteers.","We have been greatly assisted by individuals and organizations.","measures designed to assist people with disabilities"],"opposite":"","synonyms":""},{"def":"to help something to happen more easily","examples":["activities that will assist the decision-making process","Volcanic eruptions like this probably assisted the development of life on this planet.","Day hospitals have sprung up to assist the process of rehabilitation."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"","meanings":[{"def":"an action in ice hockey, football (soccer), etc. in which a player passes the ball in a way that helps another player on the same team to score a goal","examples":["He had/made ten assists."],"opposite":"","synonyms":""},{"def":"an action in baseball in which a player throws the ball to another member of the team who gets an opponent out either by stepping onto the base before the runner reaches it, or by touching the runner with the ball before he or she reaches the base","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]