[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/ass/assoc/association__us_2_rr.mp3","phonsUS":"/əˌsəʊsiˈeɪʃn/","level":"B2","meanings":[{"def":"an official group of people who have joined together for a particular purpose","examples":["Do you belong to any professional or trade associations?","a residents’ association","It was to be a free association of equal partners.","The association meets four times a year.","a loose association of sovereign states","a professional association for music teachers","They held a number of events to raise money for the local community association.","This report has been issued by the Association of Medical Research Charities.","You should talk to your trade union or staff association."],"opposite":"","synonyms":""},{"def":"a connection or relationship between people or organizations","examples":["association with somebody/something They have maintained a close association with a college in the US.","his alleged association with terrorist groups","She became famous through her association with the group of poets.","in association with The book was published in association with (= together with) English Heritage.","The competition was organized in association with the Government's anti-drugs initiative.","The letter was a clumsy attempt to establish guilt by association.","His association with such criminals can only destroy him.","One of the most important political freedoms is freedom of association.","The city has had a long association with the mining industry.","Tourists visit the city for its historical associations.","He was questioned about his alleged association with terrorist groups.","We are working in association with several NGOs.","a close association between the two nations","the traditional association of the Democrats with minority interests","He was considered tainted by association with the corrupt regime."],"opposite":"","synonyms":""},{"def":"an idea or a memory that is suggested by somebody/something; a mental connection between ideas","examples":["The seaside had all sorts of pleasant associations with childhood holidays for me.","The cat soon made the association between human beings and food.","Incense always had associations with religion for him.","Dogs learn mainly by association.","The smell of fresh bread triggers all kinds of associations for me.","You want the child to form an association between good behaviour and rewards.","the technique of free association in which the patient is encouraged to say the first thing that comes to mind","The colour white was used due to its association with innocence and purity.","There are notes on the literary and cultural associations of certain words."],"opposite":"","synonyms":""},{"def":"a connection between things where one is caused by the other","examples":["association between A and B Studies have shown strong associations between housing conditions and health.","a proven association between passive smoking and cancer","The study found a significant association between exposure to electromagnetic fields and the disease.","in association with something cases of cancer found in association with colitis","The research showed an association between diet and various diseases.","a clear association between good health and regular exercise"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["free association","housing association","Association football","residents’ association","freedom of association","Press Association","Soil Association","Football Association","parent-teacher association","savings and loan association","American Bar Association","British Medical Association","British Science Association","National Rifle Association","Ulster Defence Association","Youth Hostels Association","Amateur Athletic Association","American Medical Association","British United Provident Association","National Education Association"]}]