[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/ass/assum/assume__us_2.mp3","phonsUS":"/əˈsuːm/","level":"B2","meanings":[{"def":"to think or accept that something is true but without having proof of it","examples":["assume (that)… It is reasonable to assume (that) the economy will continue to improve.","It's probably safe to assume (that) we'll be hearing more about this story.","Let us assume for a moment that the plan succeeds.","She would, he assumed, be home at the usual time.","it is assumed (that)… It is generally assumed that stress is caused by too much work.","assume something Don't always assume the worst (= that something bad has happened).","In this example we have assumed a unit price of $10.","assume somebody/something to be/have something I had assumed him to be a Belgian.","It's all too easy to assume that people know what they are doing.","I think we can safely assume that this situation will continue.","He automatically assumed that I had children.","I hope to go to college next year, always assuming that I pass my exams.","It is generally assumed that they were lovers.","We have assumed an average profit of £5 000 a month."],"opposite":"","synonyms":""},{"def":"to take or begin to have power or responsibility","examples":["Rebel forces have assumed control of the capital.","The court assumed responsibility for the girl's welfare.","Goodman will assume the role of president.","Lynch assumed office in April.","A military junta assumed power in 1988.","Harris then assumed command of the battalion.","His oldest brother assumed the role of father."],"opposite":"","synonyms":""},{"def":"to begin to have a particular quality or appearance","examples":["This matter has assumed considerable importance.","In the story the god assumes the form of an eagle."],"opposite":"","synonyms":""},{"def":"to pretend to have a particular feeling or quality","examples":["He assumed an air of concern.","He had assumed a stage Southern accent."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]