[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/atm/atmos/atmosphere__us_2.mp3","phonsUS":"/ˈætməsfɪr/","level":"B1","meanings":[{"def":"the mixture of gases that surrounds the earth","examples":["Wind power doesn't release carbon dioxide into the atmosphere.","greenhouse gases in the earth's atmosphere","Volcanoes and hot springs can emit methane into the atmosphere.","the upper atmosphere","pollution of the atmosphere","The spaceship should re-enter the earth's atmosphere later today.","Dangerous gases have escaped into the atmosphere.","Last night's storm had cleared the atmosphere.","Pesticides can kill wildlife and pollute the atmosphere.","levels of radiation in the atmosphere","The northern lights are caused by charged particles in the upper atmosphere."],"opposite":"","synonyms":""},{"def":"a mixture of gases that surrounds another planet or a star","examples":["Saturn’s atmosphere","The probe will plunge into the planet's stormy atmosphere.","The outermost part of the sun's atmosphere is called the corona."],"opposite":"","synonyms":""},{"def":"the air in a room or in a small space; the air around a place","examples":["a smoky/stuffy atmosphere","These plants love warm, humid atmospheres."],"opposite":"","synonyms":""},{"def":"the feeling or mood that you have in a particular place or situation; a feeling between two people or in a group of people","examples":["Before the parade, the atmosphere was electric.","This type of lighting creates a relaxing atmosphere.","City officials have created an atmosphere of fear.","Use music and lighting to create a romantic atmosphere.","There was an atmosphere of mutual trust between them.","The old house is full of atmosphere (= it's very interesting).","The children grew up in an atmosphere of violence and insecurity.","a party atmosphere","The hotel offers a friendly atmosphere and personal service.","His blunt comments really soured the atmosphere.","His funny remarks lightened the atmosphere.","She could sense the hostile atmosphere in the room.","She tries to create an atmosphere of calm and security for her children.","Since their argument there had been a strained atmosphere between them.","The atmosphere was charged with excitement.","The restaurant has a comfortable atmosphere.","The whole atmosphere in the stadium changed dramatically.","the rarefied atmosphere of academic life"],"opposite":"","synonyms":""},{"def":"a situation when people do not say anything, but feel embarrassed or uncomfortable","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a heavy silence/atmosphere","def":"a situation when people do not say anything, but feel embarrassed or uncomfortable","examples":[]}],"phrasal":[],"related":[]}]