[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/att/attac/attack__us_2.mp3","phonsUS":"/əˈtæk/","level":"A2","meanings":[{"def":"an act of using violence to try to hurt or kill somebody","examples":["Five people were killed in the attacks that took place last night.","attack on/upon somebody/something the recent series of deadly terrorist attacks on European cities","a violent attack upon a police officer","attack against somebody vicious attacks against pensioners","attack by somebody/something A child is recovering in hospital after a serious attack by a stray dog.","He was subjected to a violent attack.","Two teenagers carried out a frenzied attack on a local shopkeeper.","Where did the attack happen?","an attack by an armed gang","an increase in knife attacks on police officers"],"opposite":"","synonyms":""},{"def":"an act of trying to kill or injure the enemy in war, using weapons such as guns and bombs","examples":["a bomb/rocket/missile attack","attack on somebody/something Rebel forces launched an attack on civilian targets.","attack against somebody/something Commanders attempted to prevent an attack against the city.","under attack (from somebody/something) The patrol came under attack from all sides.","Bombers pressed home their attack, causing severe damage to harbour installations.","Most of the population would stand little chance of surviving a nuclear attack.","The administration may launch a pre-emptive attack against terrorist bases.","The attack took place under cover of darkness.","The border towns have suffered a series of attacks.","The soldiers mounted an all-out attack on the town.","They came under sustained attack from the air.","an attack on enemy positions"],"opposite":"","synonyms":""},{"def":"a sudden, short period of illness, usually severe","examples":["to suffer an asthma attack","attack of something an attack of fever"],"opposite":"","synonyms":""},{"def":"a sudden period of feeling an emotion such as fear","examples":["a panic attack","attack of something an attack of nerves","He suffers from attacks of anxiety.","(figurative) an attack of conscience (= a guilty feeling about something you have done or are planning to do)","(figurative) an attack of the giggles"],"opposite":"","synonyms":""},{"def":"strong criticism of somebody/something in speech or in writing","examples":["He found himself the victim of an unprovoked attack by the media.","She has laid herself wide open to attack.","attack on somebody/something It was seen as a personal attack on the president.","under attack (from somebody/something) (for something/for doing something) The school has come under attack for failing to encourage bright students.","Doctors have gone on the attack, accusing the government of incompetence.","The government's decision has provoked an attack from leaders of the health service.","The first line of attack is often name-calling."],"opposite":"","synonyms":""},{"def":"the players in a team whose job is to try to score goals or points","examples":["Germany's attack has been weakened by the loss of some key players through injury."],"opposite":"","synonyms":""},{"def":"the actions that players take to try to score a goal or win the game","examples":["a sustained attack on the Arsenal goal"],"opposite":"","synonyms":""},{"def":"an action that you take to try to stop or change something that you feel is bad","examples":["to launch an all-out attack on poverty/unemployment"],"opposite":"","synonyms":""},{"def":"the action of something such as an insect, or a disease, that causes damage to something/somebody","examples":["The roof timbers were affected by rot and insect attack."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["attack ad","attack dog","heart attack","counter-attack","Massive Attack","attack dogs"]},{"pos":"verb","level":"A2","meanings":[{"def":"to use violence to try to hurt or kill somebody","examples":["Most dogs will not attack unless provoked.","attack somebody/something Terrorists attacked several targets across the city.","A woman was brutally attacked by a gang of youths.","attack somebody with something One of the men viciously attacked officers with a home-made weapon.","The man attacked him with a knife.","It's alleged that the man savagely attacked the pensioner in his home.","They run a helpline for women who have been sexually attacked."],"opposite":"","synonyms":""},{"def":"to use weapons, such as guns and bombs against an enemy in a war, etc.","examples":["Enemy forces attacked at night.","attack somebody/something There are fears that the government is planning to attack neighbouring countries.","At dawn the army attacked the town."],"opposite":"","synonyms":""},{"def":"to criticize somebody/something severely","examples":["attack somebody/something His latest work has been bitterly attacked by the critics.","attack somebody/something for something He was publicly attacked for his political views.","attack somebody/something for doing something The police have been attacked for failing to take immediate action.","She has been attacked for ignoring her own party members.","attack somebody/something over something The council has been attacked over its lack of investment in public services.","a newspaper article attacking the England football manager","He attacked the idea that the company's practices were bad for the environment.","The studio audience repeatedly attacked the minister for her stance."],"opposite":"","synonyms":""},{"def":"to have a harmful effect on something","examples":["a disease that attacks the brain","The vines were attacked by mildew.","Bacteria act on sugars to form acids which attack the tooth surface.","The virus attacks different cells in the body."],"opposite":"","synonyms":""},{"def":"to go forward in a game in order to try to score goals or points","examples":["Spain attacked more in the second half and deserved a goal.","A period of good attacking play gave Italy the lead."],"opposite":"","synonyms":""},{"def":"to deal with something with a lot of energy","examples":["Let's attack one problem at a time."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]