[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/att/attem/attempt__us_1.mp3","phonsUS":"/əˈtempt/","level":"B2","meanings":[{"def":"an act of trying to do something, especially something difficult, often with no success","examples":["I passed my driving test at the first attempt.","attempt to do something They made no attempt to escape.","The launch will go ahead despite the failure of previous attempts to create an online business.","Why have repeated attempts to find a permanent solution to the problem failed ?","They were frustrated in their attempts to get an explanation.","He has failed in three previous attempts to win the world title.","in an attempt to do something Two factories were closed in an attempt to cut costs.","attempt at something The couple made an unsuccessful attempt at a compromise.","attempt at doing something They were praised for making an attempt at solving the problem.","That's not bad for a first attempt.","Rescue attempts were stopped because of bad weather.","In an attempt to ward off criticism, the government has made education a priority.","She has made no attempt to contact her mother.","The board said it would resist any attempt to take control of the company.","Their attempt to break out of prison was foiled.","her vain attempt to save her son's life","Last night there was a desperate attempt to reach survivors of the accident.","They were arrested after a failed coup attempt.","She smiled at my feeble attempt at humour/​humor.","I made a half-hearted attempt at cleaning my apartment."],"opposite":"","synonyms":""},{"def":"an act of trying to kill somebody","examples":["attempt on somebody/sb’s life Someone has made an attempt on the president's life.","an assassination attempt","a murder/suicide attempt"],"opposite":"","synonyms":""},{"def":"an effort to do better than something, such as a very good performance in sport","examples":["his attempt on the world land speed record","a world-record attempt"],"opposite":"","synonyms":""},{"def":"a thing that you produce as a result of trying to make or achieve something","examples":["She picked her first attempt at a letter out of the bin."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"B2","meanings":[{"def":"to make an effort or try to do something, especially something difficult","examples":["attempt to do something I will attempt to answer all your questions.","She never attempted to explain her behaviour to her family.","She has been unsuccessfully attempting to find out the name of the police officer.","I haven't even attempted to do any of this yet.","Do not attempt to repair this yourself.","attempt something The prisoners attempted an escape, but failed.","Don't attempt to argue with him.","The patient may attempt to dismiss or deny the problem.","The coastguard had advised them not to attempt a rescue.","A group of junior army officers attempted a coup in March 1988.","More than once, depression drove him to attempt suicide."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]