[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/att/atten/attention__us_1.mp3","phonsUS":"/əˈtenʃn/","level":"A2","meanings":[{"def":"the act of listening to, looking at or thinking about something/somebody carefully; interest that people show in somebody/something","examples":["the report’s attention to detail","He turned his attention back to the road again.","His attention turned to other matters.","Public attention is focused on the issue of plastic pollution.","Please pay close attention (= listen carefully) to what I am saying.","Don't pay any attention to what they say (= don't think that it is important).","She doesn't pay her children much attention.","She tried to attract the waiter's attention.","The event has attracted a lot of media attention.","The exhibition has received special attention from the media.","The problem has been getting little attention in the press.","I tried not to draw attention to (= make people notice) the weak points in my argument.","An article in the newspaper caught my attention.","I couldn't give the programme my undivided attention.","As the youngest child, she was always the centre of attention.","Small children have a very short attention span.","(formal) These issues should be brought to the attention of the public.","(formal) It has come to my attention (= I have been informed) that…","(formal) He called (their) attention to the fact that many files were missing.","(formal) Can I have your attention please?","This case emphasizes/highlights the importance of honest communication between managers and employees.","Effective communication skills are essential/crucial/vital.","It should be noted that this study considers only verbal communication. Non-verbal communication is not dealt with here.","It is important to remember that/An important point to remember is that non-verbal communication plays a key role in getting your message across.","Communication is not only about the words you use but also your body language and, especially/above all, the effectiveness with which you listen.","I would like to draw attention to the role of listening in effective communication.","Choose your words carefully: in particular, avoid confusing and ambiguous language.","Finally, and perhaps most importantly, you must learn to listen as well as to speak.","Films with big stars always attract great attention.","He devoted all his attention to his mother.","He was convicted of driving without due care and attention.","I felt my attention wandering during the lecture.","In this chapter we confine our attention to non-renewable energy sources.","My boss was grateful that I had brought the matter to her attention.","Please pay extra attention to what I'm about to tell you.","Policy-makers paid scant attention to the wider issues.","She was surrounded by men all vying for her attention.","The company decided to refocus its attention back onto its traditional strengths and expertise.","There was something in the way he spoke that riveted her attention.","an interesting essay that repays close attention","dozens of concerns jostling for your attention","Attention has now shifted to the presidential elections.","Media attention focused today on the prince's business affairs.","The issue of climate change has received considerable attention in recent times.","Wherever he goes, he commands attention.","They listened with rapt attention.","The government is trying to divert attention away from the economy.","The focus of attention must now be how to improve the economy.","His music deserves more scholarly attention."],"opposite":"","synonyms":""},{"def":"special care, action or treatment","examples":["He received urgent medical attention.","The roof needs attention (= needs to be repaired).","for the attention of… (= written on the envelope of an official letter to say who should deal with it)","She was in need of medical attention.","His injuries required immediate attention.","It's clear that a great deal of care and attention was put into the movie sets.","She lavishes attention on those silly little dogs.","a matter requiring urgent attention"],"opposite":"","synonyms":""},{"def":"things that somebody does to try to please you or to show their interest in you","examples":["She tried to escape the unwanted attentions of her former boyfriend.","Her primary aim was to avoid the attentions of the newspapers."],"opposite":"","synonyms":""},{"def":"the position soldiers take when they stand very straight with their feet together and their arms at their sides","examples":["to stand at/to attention"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["attention deficit disorder","for the attention of","attention deficit disorders","attention deficit hyperactivity disorder"]},{"pos":"exclamation","level":"A2","meanings":[{"def":"used for asking people to listen to something that is being announced","examples":["Attention, please! Passengers for flight KL412 are requested to go to gate 21 immediately."],"opposite":"","synonyms":""},{"def":"used for ordering soldiers to stand to attention","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]