[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/att/attit/attitude__us_1.mp3","phonsUS":"/ˈætɪtuːd/","level":"B1","meanings":[{"def":"the way that you think and feel about somebody/something; the way that you behave towards somebody/something that shows how you think and feel","examples":["attitude towards somebody/something These societies have to change their attitudes towards women.","the government’s attitude towards single parents","to have a positive/negative attitude towards somebody/something","attitude to somebody/something changes in public attitudes to marriage","attitude about something social attitudes about education","attitude on something changing attitudes on issues such as gay marriage","Youth is simply an attitude of mind.","If you want to pass your exams you'd better change your attitude!","If they can adopt that kind of attitude then the future looks very promising.","You're taking a pretty selfish attitude over this, aren't you?","He displayed a condescending attitude towards/​toward his co-workers.","The policy reflects a caring attitude towards/​toward employees.","I try to have a healthy, positive attitude to life.","The experience changed his attitude to religion.","The teachers seem to have a very relaxed attitude to discipline.","Her attitude to her parents has always been somewhat negative.","There has been a marked change in attitude towards the European single currency.","They are accused of taking a cavalier attitude towards their employees' safety.","Newspapers reflect social attitudes.","She seems to have the right attitude for the job.","We all need to show commitment and a can-do attitude.","Sometimes it's essential for doctors to cultivate a detached attitude.","The general attitude of the public is sympathetic.","His general attitude of hostility did not impress the jury.","I tend to take the attitude that it's best to leave well alone.","The political attitudes of young people are rarely taken seriously.","There are some major differences between British and American attitudes when it comes to the role of government."],"opposite":"","synonyms":""},{"def":"confident, sometimes aggressive behaviour that shows you do not care about other people’s opinions and that you want to do things in an individual way","examples":["You'd better get rid of that attitude and shape up, young man.","Don't give me any attitude!","with attitude a band with attitude"],"opposite":"","synonyms":""},{"def":"a position of the body","examples":["in an attitude of something Her hands were folded in an attitude of prayer."],"opposite":"","synonyms":""},{"def":"to hold your body in a particular way to create a particular impression","examples":["to strike a dramatic pose","(figurative) He strikes an attitude of bravery and lonely defiance."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"strike a pose/an attitude","def":"to hold your body in a particular way to create a particular impression","examples":["to strike a dramatic pose","(figurative) He strikes an attitude of bravery and lonely defiance."]}],"phrasal":[],"related":["attitude problem"]}]