[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/aud/audie/audience__us_1.mp3","phonsUS":"/ˈɔːdiəns/","level":"A2","meanings":[{"def":"the group of people who have gathered to watch or listen to something (a play, concert, somebody speaking, etc.)","examples":["The audience was/were clapping for 10 minutes.","The museum is trying to attract a wider audience.","The debate was televised in front of a live audience.","an audience of 10 000","Audience members voted on their favorite presentations.","We encourage audience participation during our show.","He prefers playing to live audiences.","He sought a private audience with the Queen.","He was trying to convince his audience of his seriousness.","His core audience is over the age of 35.","Most movies are designed to appeal to a mainstream audience.","She regales her audience with funny stories.","She sought a private audience with the Japanese emperor.","Some scenes in the movie risk alienating a female audience.","Such a well-known politician should draw a big audience.","The Pope granted him an audience.","The audience cheered loudly.","The audience roared with laughter.","The audience was visibly moved.","The film has thrilled audiences throughout the country.","These artists remain relatively unknown to Western audiences.","We want to reach a target audience that's younger in age.","We want to reach a younger target audience.","Cinema audiences would be more accepting of this sort of advertising.","The Pope granted her a private audience.","We played in front of a capacity audience of 15 000."],"opposite":"","synonyms":""},{"def":"a number of people or a particular group of people who watch, read, or listen to the same thing","examples":["TV/television/cinema/movie audiences","His book reached an even wider audience when it was made into a movie.","This book will appeal to a broad audience.","She has generated a massive online audience since uploading her first clip three years ago.","The target audience for this advertisement was mainly teenagers.","An audience of millions watched the wedding on TV.","Most companies now have their own websites which address mass audiences.","They aim to make art accessible to the widest possible audience."],"opposite":"","synonyms":""},{"def":"a formal meeting with an important person","examples":["an audience with the Pope","a job interview","He confessed after four days under interrogation.","The Pope granted her a private audience."],"opposite":"","synonyms":"interview"}],"idioms":[],"phrasal":[],"related":["television audience measurement"]}]