[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/aut/autho/authority__us_1_rr.mp3","phonsUS":"/əˈθɔːrəti/","level":"B1","meanings":[{"def":"the power to give orders to people","examples":["in a position of authority","to undermine/challenge somebody's authority","authority over somebody/something She now has authority over the people who used to be her bosses.","The law states that parents exercise authority over their children.","in authority Nothing will be done because no one in authority (= who has a position of power) takes the matter seriously.","adult authority figures such as parents and teachers","Central government has extensive authority over teachers.","He assumed full authority as tsar in 1689.","He refuses to relinquish authority over the design process.","She had challenged my authority once too often.","She holds a position of authority in the local church.","The commander-in-chief exercises supreme authority within his zone.","The new manager obviously felt the need to demonstrate her authority.","These men denied the divine authority of the Church."],"opposite":"","synonyms":""},{"def":"the power or right to do something","examples":["Some experts think the agency may have exceeded its authority.","authority to do something The government has the authority to regulate the economy.","The Constitution gives Congress the authority to decide whether to fund military action.","We have the authority to search this building.","Only the Board has the authority to approve the budget.","Parents have the authority to discipline their children.","The clause limits the directors' authority to allot shares."],"opposite":"","synonyms":""},{"def":"official permission to do something","examples":["without authority He took the car without authority.","without somebody's authority It was done without the principal's authority.","under the authority of somebody/something We acted under the authority of the UN.","The government was accused of selling the land without formal authority.","You will need the written authority of the registered owner.","The minister must answer to Parliament for anything his officials have done under his authority."],"opposite":"","synonyms":""},{"def":"the people or an organization who have the power to make decisions or who have a particular area of responsibility in a country or region","examples":["I have to report this to the authorities.","The health authorities are investigating the problem.","planning/police/immigration authorities","Aviation authorities say traffic will grow 20 per cent a year.","German authorities arrested the author of the computer virus.","He had permission from the proper authorities.","The government is urging education authorities to spend less money.","The local authority has not granted planning permission.","The system notifies the authorities when a security breach occurs.","the right of law enforcement authorities to take and retain photographs"],"opposite":"","synonyms":""},{"def":"the power to influence people because they respect your knowledge or official position","examples":["with authority He spoke with authority on the topic.","authority to do something the moral authority to run the country","She bore an air of authority."],"opposite":"","synonyms":""},{"def":"a person with special knowledge","examples":["She's an authority on criminal law.","Copernicus justified his innovation by citing respected authorities.","He has come to be something of a leading authority on the subject."],"opposite":"","synonyms":""},{"def":"to be able to believe something because you trust the person who gave you the information","examples":["I have it on good authority that he is going to be promoted."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"have something on good authority","def":"to be able to believe something because you trust the person who gave you the information","examples":["I have it on good authority that he is going to be promoted."]}],"phrasal":[],"related":["local authority","unitary authority","Local Education Authority","Tennessee Valley Authority","Civil Aviation Authority","Financial Conduct Authority","Greater London Authority","Port of London Authority","Advertising Standards Authority","Financial Services Authority","Competition and Markets Authority","United Kingdom Atomic Energy Authority"]}]