[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/a/awa/award/award__us_1.mp3","phonsUS":"/əˈwɔːrd/","level":"A2","meanings":[{"def":"a prize such as money, etc. for something that somebody has done","examples":["He was nominated for the best actor award.","the UK's most prestigious literary award","the Housing Design Award","The mayor will present the awards.","award for something to win/accept an award for something","He received numerous awards for excellence in teaching.","She was recently honoured with a lifetime achievement award.","The winners of the awards are picked by the network's viewers.","an awards ceremony","She was the recipient of numerous awards and honours.","He received the Young Player of the Year Award.","His goalkeeping won him the man of the match award.","Stephen's quick thinking has earned him a bravery award.","She has won awards for her solo shows.","The award was made for his work in cancer research.","The movie deserved all the awards it received.","The winning designers will receive cash awards.","the numerous awards bestowed on him in his lifetime","The association is presenting its annual awards this week."],"opposite":"","synonyms":""},{"def":"an increase in the amount of money somebody earns","examples":["an annual pay award","The union is unhappy with this year's pay award."],"opposite":"","synonyms":""},{"def":"an amount of money given as an official payment or grant to somebody","examples":["an award of £600 000 in libel damages","The judge has the power to make damages awards.","Students on diploma courses could apply for a discretionary award from their local authority."],"opposite":"","synonyms":""},{"def":"the official decision to give something to somebody","examples":["Satisfactory completion of the course will lead to the award of the Diploma of Social Work.","The court must specify the different elements in its award of compensation."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["award-winning","Academy Award™","Golden Globe Award","National Book Award","Queen's Award for Enterprise","Duke of Edinburgh's Award","New York Drama Critics Circle Award","Queen's Award"]},{"pos":"verb","level":"B1","meanings":[{"def":"to make an official decision to give something to somebody as a payment, prize, contract, etc.","examples":["award something Knowing why and how corporations award contracts is vitally important.","award something to somebody The judges awarded equal points to both finalists.","award somebody something The judges awarded both finalists equal points.","He was awarded damages of £50 000.","He was posthumously awarded the Victoria Cross.","The referee awarded a penalty against them.","The prize is awarded annually for the best new building.","He was jointly awarded the Nobel Prize with Alex Mueller.","Promotions were automatically awarded to senior officials.","She mentally awarded herself top marks for staying cool under pressure."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]