[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bac/backg/background__us_1.mp3","phonsUS":"/ˈbækɡraʊnd/","level":"A2","meanings":[{"def":"the details of a person’s family, education, experience, etc.","examples":["somebody's ethnic/genetic/cultural background","somebody's family/educational background","The job would suit someone with a business background.","We come from very different backgrounds but we get on well.","background in something She has a background in journalism.","In the future, we will require background checks on airport employees.","In spite of their very different backgrounds, they immediately became friends.","Can you tell me something about your family background?","Children from a military background often move around a lot.","Even people with a technical background will struggle to understand some of the jargon.","He came from a very privileged background.","Her academic background includes a degree in education.","Her background was in biology and medicine.","I think we get on well because we're from similar backgrounds.","It is important to have a broad educational background.","She wanted to know about his criminal background.","The students are drawn from very mixed social backgrounds.","We work with clients from diverse backgrounds.","She is an economist with a background in business.","I work with children from deprived backgrounds.","Discrimination on the basis of race, sex or social background will not be tolerated.","The classes are designed for students with a background in history or theology."],"opposite":"","synonyms":""},{"def":"the circumstances or past events that help explain why something is how it is; information about these","examples":["I'm including a little background information on the situation.","background to something The book explains the complex historical background to the war.","against a background of something The elections are taking place against a background of violence.","background on something Our reporter can now provide more background on this story.","Can you give me more background on the company?","Against that general background, let me give you a more detailed view of current practice.","The book provides the background to the revolution.","Those discussions formed the background to the decision.","Encyclopedias are a good source of background information."],"opposite":"","synonyms":""},{"def":"the part of a picture, photograph or view behind the main objects, people, etc.","examples":["in the background a photograph with trees in the background","A shadowy figure is visible in the background of the scene.","against the… background The areas of water stood out against the dark background.","An unhappy home environment can affect children’s behaviour.","a pleasant working environment","The island provided an idyllic setting for the concert.","The huts blend in perfectly with their surroundings.","The mountains in the background were capped with snow.","The picture shows a family gathered around a kitchen table.","This is a picture/​photo of a busy city street.","In the foreground/​background, we can see a group of protesters.","In the bottom right-hand corner/​top left-hand corner, there's a child sitting alone.","On the left/​On the right/​In the middle, someone is standing with a bottle in his hand.","In the cartoon, we can see two people looking at a newspaper headline.","The cartoonist has drawn the man to represent a typical businessman.","The mountains in the background were capped with snow.","The wolves' coats turn white to match their snowy background."],"opposite":"","synonyms":"environment"},{"def":"a position in which people are not paying attention to somebody/something or not as much attention as they are paying to somebody/something else","examples":["The camerawork, the background music and the locations all contribute to the mood of the film.","There was a lot of background noise (= that you could hear, but were not listening to).","background radiation","in the background He prefers to remain in the background and let his assistant talk to the press.","A piano was playing gently in the background.","Danger was always lurking in the background.","The issue has recently faded into the background.","After the first scene, his character is relegated to the background.","There was a radio on in the background.","I could see my secretary hovering in the background.","He had learned how to melt invisibly into the background.","The dispute over the new contract allowed her other problems to fade into the background.","The signal was very clear, with no background hiss or distortion.","Who did the background vocals on that track?","We were provided with soft lights and a tranquil background."],"opposite":"","synonyms":""},{"def":"a colour or design on which something is painted, drawn, etc.","examples":["on a… background The name of the company is written in red on a white background.","against a… background Most paintings look good against a neutral background colour."],"opposite":"","synonyms":""},{"def":"used to refer to tasks or processes that the user is not actively working on at the present time","examples":["in the background Programs can be left running in the background.","Find and kill unwanted background processes like viruses and trojans."],"opposite":"","synonyms":""},{"def":"to behave quietly when you are with a group of people so that they do not notice you","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"merge into the background","def":"to behave quietly when you are with a group of people so that they do not notice you","examples":[]}],"phrasal":[],"related":[]}]