[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bal/balan/balance__us_2.mp3","phonsUS":"/ˈbæləns/","level":"B1","meanings":[{"def":"a situation in which different things exist in equal, correct or good amounts","examples":["This newspaper maintains a good balance in its presentation of different opinions.","Tourists often disturb the delicate balance of nature on the island.","His wife's death disturbed the balance of his mind.","balance between A and B Try to keep a balance between work and relaxation.","in balance It is important to keep the different aspects of your life in balance.","How do you find an acceptable balance between closeness and distance in a relationship?","Pulling up all the plants will disturb the natural balance of the pond.","There is an even gender balance among staff and students.","With children, it is important to achieve the right balance between love and discipline.","You have to maintain a balance in your life or else you'll go crazy.","The diet should contain a healthy balance of foods.","Does the course offer the right balance between academic and practical work?"],"opposite":"","synonyms":""},{"def":"the ability to keep steady with an equal amount of weight on each side of the body","examples":["Athletes need a good sense of balance.","I struggled to keep my balance on my new skates.","She cycled round the corner, lost her balance and fell off.","Cats have a very good sense of balance.","Gymnasts have excellent balance.","He set his feet wider and adjusted his balance.","Tightness in one set of muscles will affect your whole balance.","Yoga improves balance as well as flexibility."],"opposite":"","synonyms":""},{"def":"the amount that is left after taking numbers or money away from a total","examples":["to check your bank balance (= to find out how much money there is in your account)","Consider a balance transfer to a credit card with a lower rate of interest (= = moving the amount owed from one card to another).","Everyone likes to have a healthy bank balance.","He asked the cashier for the balance of his current account.","Interest is calculated on the daily cleared balance and paid direct to your account.","The balance of the proceeds will be used for new equipment.","That figure is the balance brought forward from the previous year."],"opposite":"","synonyms":""},{"def":"an amount of money still owed after some payment has been made","examples":["The balance of $500 must be paid within 90 days.","I'll pay the balance later.","The final balance is due six weeks before departure."],"opposite":"","synonyms":""},{"def":"the largest part of a group or an amount; the position of advantage or attention","examples":["The balance of opinion was that work was more important than leisure.","The balance has now shifted from the unions to employers.","The balance of economists are expecting a rise in interest rates.","He argues that the balance has swung too far in favour of capitalism."],"opposite":"","synonyms":""},{"def":"an instrument for weighing things, with a bar that is supported in the middle and has dishes hanging from each end","examples":[],"opposite":"","synonyms":""},{"def":"(considering) the evidence on both sides of an argument, to find the most likely reason for or result of something","examples":["The balance of evidence suggests the Liberal party's decline began before the First World War.","The coroner thought that on the balance of probabilities, the pilot had suffered a stroke just before the crash."],"opposite":"","synonyms":""},{"def":"if the future of something/somebody, or the result of something is/hangs in the balance, it is not certain","examples":["The long-term future of the space programme hangs in the balance.","Tom’s life hung in the balance for two weeks as he lay in a coma."],"opposite":"","synonyms":""},{"def":"to make somebody unsteady and in danger of falling","examples":["I was thrown off balance by the sudden gust of wind.","The sudden movement threw him off balance."],"opposite":"","synonyms":""},{"def":"to make somebody surprised and no longer calm","examples":["The senator was clearly caught off balance by the unexpected question."],"opposite":"","synonyms":""},{"def":"after considering all the information","examples":["On balance, the company has had a successful year."],"opposite":"","synonyms":""},{"def":"to make a situation equal or fair again","examples":["For years poorer children have had to put up with a lower quality education, and now is the time to redress the balance."],"opposite":"","synonyms":""},{"def":"to manage to find a way of being fair to two things that are opposed to each other; to find an acceptable position that is between two things","examples":["We need to strike a balance between these conflicting interests."],"opposite":"","synonyms":""},{"def":"to affect the result of something in one way rather than another","examples":["In an interview, smart presentation can tip the balance in your favour.","New evidence tipped the balance against the prosecution."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"(on) the balance of evidence/probability","def":"(considering) the evidence on both sides of an argument, to find the most likely reason for or result of something","examples":["The balance of evidence suggests the Liberal party's decline began before the First World War.","The coroner thought that on the balance of probabilities, the pilot had suffered a stroke just before the crash."]},{"idiom":"(be/hang) in the balance","def":"if the future of something/somebody, or the result of something is/hangs in the balance, it is not certain","examples":["The long-term future of the space programme hangs in the balance.","Tom’s life hung in the balance for two weeks as he lay in a coma."]},{"idiom":"(catch/throw somebody) off balance","def":"to make somebody unsteady and in danger of falling","examples":["I was thrown off balance by the sudden gust of wind.","The sudden movement threw him off balance.","The senator was clearly caught off balance by the unexpected question."]},{"idiom":"on balance","def":"after considering all the information","examples":["On balance, the company has had a successful year."]},{"idiom":"redress the balance","def":"to make a situation equal or fair again","examples":["For years poorer children have had to put up with a lower quality education, and now is the time to redress the balance."]},{"idiom":"strike a balance (between A and B)","def":"to manage to find a way of being fair to two things that are opposed to each other; to find an acceptable position that is between two things","examples":["We need to strike a balance between these conflicting interests."]},{"idiom":"tip the balance/scales","def":"to affect the result of something in one way rather than another","examples":["In an interview, smart presentation can tip the balance in your favour.","New evidence tipped the balance against the prosecution."]}],"phrasal":[],"related":["balance beam","balance sheet","bank balance","trade balance","spring balance","balance of power","balance of trade","work-life balance","balance of payments","balance sheets","tip the balance/scales","(on) the balance of probability/evidence"]},{"pos":"verb","level":"B1","meanings":[{"def":"to put your body or something else into a position where it is steady and does not fall","examples":["balance on something How long can you balance on one leg?","balance something on something The television was precariously balanced on top of a pile of books.","She balanced the cup on her knee.","He balanced the glasses carefully on the tray."],"opposite":"","synonyms":""},{"def":"to give equal importance to two things or parts of something which are very different","examples":["She tries to balance the needs of her children with those of her employer.","The song perfectly balances melody and rhythm.","She tries to balance home life and career.","The plan seeks to balance two important objectives."],"opposite":"","synonyms":""},{"def":"to be equal in value, amount, etc. to something else that has the opposite effect","examples":["balance out The good and bad effects of any decision will usually balance out.","balance something out This year's profits will balance out our previous losses.","be balanced by something His lack of experience was balanced by a willingness to learn."],"opposite":"","synonyms":""},{"def":"to compare the relative importance of two things which are different","examples":["The cost of obtaining legal advice needs to be balanced against its benefits.","We have to balance the risks of the new strategy against the possible benefits."],"opposite":"","synonyms":""},{"def":"to manage finances so that the money spent is equal to the money received; to show this in the accounts","examples":["In order to balance the budget severe spending cuts had to be made.","The law requires the council to balance its books each year."],"opposite":"","synonyms":""},{"def":"(of an account) to have an equal amount of money spent and money received","examples":["I tried to work out why the books wouldn't balance."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]