[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/ban/ban__/ban__us_1.mp3","phonsUS":"/bæn/","level":"B1","meanings":[{"def":"to decide or say officially that something is not allowed","examples":["ban something The law effectively bans smoking in all public places.","a list of banned substances","The use of these chemicals in homes was banned outright by the government in 2000.","ban something from something a campaign to ban sugary drinks from schools","Chemical weapons are banned internationally.","Congress has voted to ban online gambling.","MPs voted to ban hunting with dogs.","There's been a move to ban tobacco advertising.","He claimed that the government had tried to ban the book.","Trade in tiger products is banned under the convention."],"opposite":"","synonyms":""},{"def":"to order somebody not to do something, go somewhere, etc., especially officially","examples":["be banned from something He was banned from the meeting.","She was banned from the road for ten months for drinking and driving.","be banned from doing something She's been banned from leaving the country while the allegations are investigated.","(British English) He was banned from driving for six months.","be banned The sprinter has been banned for life after failing a drugs test."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["test ban"]},{"pos":"noun","level":"B1","meanings":[{"def":"an official rule that says that something is not allowed","examples":["a smoking ban","A majority of people are against the ban.","ban on something They are calling for a blanket ban (= complete ban) on the use of phones while driving.","They have imposed a total ban on the import of seal skins.","There are no plans to lift the ban on the sale of fireworks to children.","a nuclear test ban treaty","The ban on exports has now been eased.","The ban only covers tropical hardwood.","The ban will affect all public and work premises.","The students took to the streets, defying a ban on political gatherings.","There is a ban on traffic in the town centre.","Hopes are growing for a lifting of the import ban."],"opposite":"","synonyms":""},{"def":"an official decision that means a person is not allowed to do something or go somewhere for a period of time","examples":["a five-year driving ban for various offences","The sprinter received a lengthy ban for failing a drugs test.","ban from something His behaviour led to a life ban from international football."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]