[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/ban/band_/band__us_1.mp3","phonsUS":"/bænd/","level":"A1","meanings":[{"def":"a small group of musicians who play popular music together, often with a singer or singers","examples":["a rock/punk/jazz band","He plays drums in a band that he formed with some friends.","The band is/are playing a gig in Liverpool tonight.","She's a singer with a band.","There's nothing like the excitement of seeing a live band.","his fellow band members Paul McCartney, George Harrison and Ringo Starr","He formed a garage band with his friends.","He was accompanied onstage by his backing band.","They hired a Beatles tribute band to play at the reception."],"opposite":"","synonyms":""},{"def":"a group of musicians who play brass and percussion instruments","examples":["a military band","We heard a band strike up in the park."],"opposite":"","synonyms":""},{"def":"a group of people who do something together or who have the same ideas, interests or achievements","examples":["a band of outlaws/rebels","He persuaded a small band of volunteers to help.","They are members of a growing band of enthusiasts.","The two men are part of a dwindling band of veterans.","He is one of a select band of top class players.","The young Irishman joined the elite band of Formula One drivers this week."],"opposite":"","synonyms":""},{"def":"a thin flat piece or circle of any material that is put around things, for example to hold them together or to make them stronger","examples":["She always ties her hair back in a band.","All babies in the hospital have name bands on their wrists.","She wore a simple band of gold (= a ring) on her finger."],"opposite":"","synonyms":""},{"def":"a line of colour or material on something that is different from what is around it","examples":["a white plate with a blue band around the edge","The light had expanded in a broad band across the sky."],"opposite":"","synonyms":""},{"def":"a range of radio waves","examples":["Short-wave radio uses the 20–50–metre band."],"opposite":"","synonyms":""},{"def":"a range of numbers, ages, prices, etc. within which people or things are counted or measured","examples":["the 25–35 age band","Which tax band do you fall into?"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["big band","boy band","tri-band","Band-Aid™","girl band","pipe band","Alice band","brass band","dance band","garage band","rubber band","silver band","steel band","band council","band together","concert band","elastic band","gastric band"]},{"pos":"verb","level":"","meanings":[{"def":"to put a band of a different colour or material around something","examples":["be banded (+ adj.) Many insects are banded black and yellow."],"opposite":"","synonyms":""},{"def":"to organize something into bands of price, income, etc.","examples":["be banded Tax is banded according to income."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["band together"],"related":[]}]