[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bar/bar__/bar__us_1.mp3","phonsUS":"/bɑːr/","level":"A2","meanings":[{"def":"a place where you can buy and drink alcoholic and other drinks","examples":["We arranged to meet in a bar called the Flamingo.","The area is full of restaurants and bars.","The bar staff are very friendly.","It's the island’s only licensed bar (= one that is allowed to sell alcoholic drinks).","(British English) I found David in the bar of the Red Lion (= a room in a pub where drinks are served).","The hotel has a restaurant, bar and swimming pool.","There were not many people in the bar.","He's been working in a bar called the Anvil.","We could meet at the theatre and have a drink in the bar.","It's a singles bar.","It was supposed to be a restaurant but seemed more like a dive bar."],"opposite":"","synonyms":""},{"def":"a place in which a particular kind of food or drink is the main thing that is served","examples":["a sushi bar","The hotel has a cocktail bar on the top floor."],"opposite":"","synonyms":""},{"def":"a long wide wooden surface where drinks, etc. are served","examples":["at the bar She was sitting at the bar.","behind the bar He spent the summer working behind the bar at the local pub.","It was so crowded I couldn't get to the bar.","They were chatting at the bar.","The barmaid stood behind the bar.","I didn't recognize the man who was serving behind the bar.","(humorous) You can usually find him propping up (= leaning on) the bar of the Queen's Head."],"opposite":"","synonyms":""},{"def":"a piece of something with straight sides","examples":["a bar of chocolate/soap","a chocolate bar","(North American English) a candy bar"],"opposite":"","synonyms":""},{"def":"a long straight piece of metal or wood. Bars are often used to stop somebody from getting through a space.","examples":["He smashed the window with an iron bar.","The room was small, with bars on the windows.","The windows at street level were fitted with bars.","a five-bar gate (= one made with five horizontal bars of wood)"],"opposite":"","synonyms":""},{"def":"a long narrow area, usually at the top or side of a computer screen, that contains links or pull-down menus or displays information about the website or program that you are using","examples":[],"opposite":"","synonyms":""},{"def":"the crossbar of a goal","examples":["His shot hit the bar."],"opposite":"","synonyms":""},{"def":"a band of colour or light","examples":["Bars of sunlight slanted down from the tall narrow windows."],"opposite":"","synonyms":""},{"def":"a thing that stops somebody from doing something","examples":["At that time being a woman was a bar to promotion in most professions."],"opposite":"","synonyms":""},{"def":"one of the short sections of equal length that a piece of music is divided into, and the notes that are in it","examples":["four beats to the bar","the opening bars of a piece of music","She played a few bars on the piano."],"opposite":"","synonyms":""},{"def":"the profession of barrister (= a lawyer in a higher court)","examples":["to be called to the Bar (= allowed to work as a qualified barrister)"],"opposite":"","synonyms":""},{"def":"the profession of any kind of lawyer","examples":[],"opposite":"","synonyms":""},{"def":"a unit for measuring the pressure of the atmosphere, equal to a hundred thousand newtons per square metre","examples":[],"opposite":"","synonyms":""},{"def":"a piece of metal with wire wrapped around it that becomes red and hot when electricity is passed through it","examples":["Switch another bar on if you’re cold."],"opposite":"","synonyms":""},{"def":"in prison","examples":["The murderer is now safely behind bars."],"opposite":"","synonyms":""},{"def":"to set a new, lower standard of quality or performance","examples":["In the current economic climate we may need to lower the bar on quotas."],"opposite":"","synonyms":""},{"def":"to have nothing to do with something","examples":["If he tries to sell you his car, don't have a bar of it."],"opposite":"","synonyms":""},{"def":"to set a new, higher standard of quality or performance","examples":["The factory has raised the bar on productivity, food safety and quality.","This latest computer game raises the bar for interface design.","The awards go to people who have truly raised the bar.","Perhaps the new admission requirements raised the bar too high."],"opposite":"lower","synonyms":""},{"def":"to set a standard of quality or performance","examples":["The show really sets the bar for artistic invention.","Sofia sets the bar very high for what she expects of herself."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"behind bars","def":"in prison","examples":["The murderer is now safely behind bars."]},{"idiom":"lower the bar","def":"to set a new, lower standard of quality or performance","examples":["In the current economic climate we may need to lower the bar on quotas."]},{"idiom":"not have a bar of something","def":"to have nothing to do with something","examples":["If he tries to sell you his car, don't have a bar of it."]},{"idiom":"raise the bar","def":"to set a new, higher standard of quality or performance","examples":["The factory has raised the bar on productivity, food safety and quality.","This latest computer game raises the bar for interface design.","The awards go to people who have truly raised the bar.","Perhaps the new admission requirements raised the bar too high."]},{"idiom":"set the bar","def":"to set a standard of quality or performance","examples":["The show really sets the bar for artistic invention.","Sofia sets the bar very high for what she expects of herself."]}],"phrasal":[],"related":["T-bar","bar-hop","bar line","cash bar","heel bar","menu bar","nail bar","open bar","raw bar","roll bar","tow bar","wet bar","wine bar","bar chart","bar graph","bar snack","bar stool"]},{"pos":"verb","level":"B2","meanings":[{"def":"to ban or prevent somebody from doing something","examples":["bar somebody from doing something Prisoners are barred by law from voting in general elections.","The players are barred from drinking alcohol the night before a match.","bar somebody from something The curfew has effectively barred migrant workers from their jobs.","bar something The new law bars smoking in all public places.","be barred to somebody Certain activities are still barred to women."],"opposite":"","synonyms":""},{"def":"to close something with a bar or bars","examples":["be barred All the doors and windows were barred."],"opposite":"","synonyms":""},{"def":"to block a road, path, etc. so that nobody can pass","examples":["Two police officers were barring her exit.","We found our way barred by rocks."],"opposite":"","synonyms":""},{"def":"with no rules or limits on what somebody is allowed to do","examples":["There will be no holds barred in his interview with the president this evening."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"no holds barred","def":"with no rules or limits on what somebody is allowed to do","examples":["There will be no holds barred in his interview with the president this evening."]}],"phrasal":[],"related":[]},{"pos":"preposition","level":"","meanings":[{"def":"except for somebody/something","examples":["The students all attended, bar two who were ill.","All bar one of the employees lost their jobs.","It's the best result we've ever had, bar none (= none was better).","Bar a few changes to the kitchen, the house is the same as when Mozart lived here."],"opposite":"","synonyms":""},{"def":"to be almost finished or decided, so that there is no doubt about the final result","examples":["The game is all over bar the shouting."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be all over bar the shouting","def":"to be almost finished or decided, so that there is no doubt about the final result","examples":["The game is all over bar the shouting."]}],"phrasal":[],"related":[]}]