[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bar/barri/barrier__us_2.mp3","phonsUS":"/ˈbæriər/","level":"B2","meanings":[{"def":"an object like a fence that prevents people from moving forward from one place to another","examples":["The crowd had to stand behind barriers.","Concrete barriers were erected around the site.","The crowd managed to break through the barriers and get onto the pitch.","The car crashed into the safety barrier and burst into flames.","The police waited behind the barriers.","Sightseers watched from the other side of the security barriers."],"opposite":"","synonyms":""},{"def":"a gate at a car park or railway station that controls when you may go through by being raised or lowered","examples":["Scan your ticket at the barrier and it will automatically lift.","There was a slow trickle of people through the barriers.","She got her luggage stuck in the automatic barrier."],"opposite":"","synonyms":""},{"def":"a problem, rule or situation that prevents somebody from doing something, or that makes something impossible","examples":["the removal of trade barriers","to overcome/break down barriers","the language barrier (= when people cannot communicate because they do not speak the same language)","barrier to something Lack of confidence is a psychological barrier to success.","The old laws created barriers to free trade.","barrier against something The country has removed barriers against imports.","The world of Disney is a magical experience that knows no age barriers.","Cost should not be a barrier to the use of legal services.","Lack of a common language was a formidable barrier to communication.","There has been a gradual reduction in subsidies and trade barriers."],"opposite":"","synonyms":""},{"def":"something that exists between one thing or person and another and keeps them separate","examples":["The Yangtze River is a natural barrier to the north-east.","barrier between A and B There was no real barrier between reality and fantasy in his mind.","barrier against something The cream acts as a protective barrier against sun damage.","Ozone is the earth's barrier against ultraviolet radiation.","The mountains form a natural barrier between the two countries.","They believe that music can cross any barriers.","There was a class barrier between the two families."],"opposite":"","synonyms":""},{"def":"a particular amount, level or number that it is difficult to get past","examples":["the first player whose earnings passed the $10 million barrier"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["barrier reef","crash barrier","crush barrier","pain barrier","barrier method","sound barrier","species barrier","Thames Barrier","barrier reefs","barrier methods"]}]