[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bas/base_/base__us_1.mp3","phonsUS":"/beɪs/","level":"B1","meanings":[{"def":"the lowest part of something, especially the part or surface on which it rests or stands","examples":["The lamp has a heavy base.","the base of a column/glass","at the base of something He felt a sharp pain at the base of his spine.","Cut the stalks at their base.","The government is to base its decision on the results of these trials.","The trolls typify all that is base and ugly in human nature.","This song is all treble and no bass.","His powerful bass voice contributed much to the film.","Footnotes are given at the bottom of each page.","I waited for them at the bottom of the hill.","The lamp has a heavy base.","to lay the foundations of the new school","At the foot of the stairs she turned to face him.","The statue has a solid concrete base.","Four bronze lions stand at the base of the column."],"opposite":"","synonyms":"bottom"},{"def":"the main place where you live or stay or where a business operates from","examples":["I spend a lot of time in Britain but Paris is still my base.","base for doing something The town is an ideal base for touring the area.","base for something The organization is looking for a permanent base for its operations.","as a base You can use our apartment as a base in New York.","The company has its base in New York, and branch offices all over the world.","The company has set up its new base in the north."],"opposite":"","synonyms":""},{"def":"a place where an army, a navy, etc. operates from","examples":["a military/naval base","an air base","After the attack, they returned to base.","The UN forces headed back to base.","Demonstrators demanded the removal of foreign bases.","The Americans established a naval base on the island in the 1960s."],"opposite":"","synonyms":""},{"def":"the people, activity, etc. from which somebody/something gets most of their support, income, power, etc.","examples":["These policies have a broad base of support.","We once had an economy with a solid manufacturing base.","By broadening the tax base (= increasing the number of people who pay taxes) he could raise more revenue.","We have developed a strong client base.","This course is an opportunity to expand my knowledge base","The country has a sound commercial base."],"opposite":"","synonyms":""},{"def":"the pay that you get before anything extra is added","examples":["All we got was base pay—we didn't reach profitability levels to award a bonus."],"opposite":"","synonyms":""},{"def":"an idea, a fact, a situation, etc. from which something is developed","examples":["She used her family's history as a base for her novel.","His arguments have a sound economic base.","These policies give us a solid base for winning the next election.","This article will form the basis for our discussion.","Respect and friendship provide a solid foundation for marriage.","The rumour is totally without foundation (= is not based on any facts).","His arguments have a sound economic base."],"opposite":"","synonyms":"basis"},{"def":"the first or main part of a substance to which other things are added","examples":["a drink with a rum base","Put some moisturizer on as a base before applying your make-up."],"opposite":"","synonyms":""},{"def":"a chemical substance, for example an alkali, that can combine with an acid to form a salt","examples":[],"opposite":"","synonyms":""},{"def":"a number on which a system of counting and expressing numbers is built up, for example 10 in the decimal system and 2 in the binary system","examples":[],"opposite":"","synonyms":""},{"def":"one of the four positions that a player must reach in order to score points","examples":[],"opposite":"","synonyms":""},{"def":"to consider and deal with all the things that could happen or could be needed when you are arranging something","examples":["I am confident this contract covers all the bases."],"opposite":"","synonyms":""},{"def":"to fail to make a successful start in a project, relationship, etc.; to fail to get through the first stage","examples":[],"opposite":"","synonyms":""},{"def":"completely wrong about something","examples":["If that's what you think, you're way off base."],"opposite":"","synonyms":""},{"def":"to make contact with somebody again","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"cover all the bases","def":"to consider and deal with all the things that could happen or could be needed when you are arranging something","examples":["I am confident this contract covers all the bases."]},{"idiom":"not get to first base (with something/somebody)","def":"to fail to make a successful start in a project, relationship, etc.; to fail to get through the first stage","examples":[]},{"idiom":"off base","def":"completely wrong about something","examples":["If that's what you think, you're way off base."]},{"idiom":"touch base (with somebody)","def":"to make contact with somebody again","examples":[]}],"phrasal":[],"related":["base on","fan base","base camp","base form","base rate","base upon","home base","base jumper","base metal","first base","power base","second base","third base","base jumping","customer base","base camps"]},{"pos":"verb","level":"B1","meanings":[{"def":"to use a particular city, town, etc. as the main place for a business, holiday, etc.","examples":["be based in… The organization is now based in Geneva.","base something/somebody in… They decided to base the new company in York.","base yourself in… We're going to base ourselves in Tokyo and make trips from there.","base somebody/something/yourself + adv./prep. I would like to base myself somewhere warmer.","Cut the stalks at their base.","The government is to base its decision on the results of these trials.","The trolls typify all that is base and ugly in human nature.","This song is all treble and no bass.","His powerful bass voice contributed much to the film."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["base on","base upon"],"related":[]},{"pos":"adjective","level":"","meanings":[{"def":"having no moral principles or rules","examples":["He acted from base motives.","Cut the stalks at their base.","The government is to base its decision on the results of these trials.","The trolls typify all that is base and ugly in human nature.","This song is all treble and no bass.","His powerful bass voice contributed much to the film."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]