[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bas/basis/basis__us_2.mp3","phonsUS":"/ˈbeɪsɪs/","level":"B1","meanings":[{"def":"the way things are organized or arranged; how often something happens","examples":["We are in contact on a regular basis.","to be employed on a permanent/temporary/part-time basis","Fatal accidents occur on our roads on a daily basis.","on a day-to-day/weekly/monthly basis","Applications will be considered on a case-by-case basis.","All members of the committee work on a voluntary basis."],"opposite":"","synonyms":""},{"def":"the reason why people take a particular action","examples":["on the basis of something She was chosen for the job on the basis of her qualifications.","We made our decision on the basis of the information we had.","on the basis that… Some movies have been banned on the basis that they are too violent.","On what basis will this decision be made?","He said no but he didn’t give a reason.","The most likely explanation is that his plane was delayed.","She left the room abruptly without explanation.","You have no grounds for complaint.","On what basis will this decision be made?","Late again! What’s your excuse this time?","It gave me an excuse to take the car.","There seemed to be no motive for the murder.","I can see no possible justification for any further tax increases.","He left the party early on the pretext of having to work."],"opposite":"","synonyms":"reason"},{"def":"the important facts, ideas or events that support something and that it can develop from","examples":["The basis of a good marriage is trust.","basis for something This article will form the basis for our discussion.","The initial talks were intended to provide a basis for negotiations.","as a/the basis for something These results will serve as a basis for more detailed research.","Their advice is used as a basis for decision-making.","basis in something The theory seems to have no basis in fact.","This article will form the basis for our discussion.","Respect and friendship provide a solid foundation for marriage.","The rumour is totally without foundation (= is not based on any facts).","His arguments have a sound economic base.","The proposal provides a sound basis for a book.","The whole basis for your argument is false.","These allegations have no basis in fact."],"opposite":"","synonyms":"basis"}],"idioms":[],"phrasal":[],"related":["on a need-to-know basis"]}]