[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bas/baske/basket__us_1.mp3","phonsUS":"/ˈbæskɪt/","level":"B2","meanings":[{"def":"a container for holding or carrying things. Baskets are made of long thin pieces of material that bends and twists easily, for example plastic, wire or wicker.","examples":["a shopping basket","a picnic basket","a clothes/laundry basket (= in which dirty clothes are put before being washed)","a wicker/wire basket","a cat/dog basket (= in which a cat or dog sleeps or is carried around)","She heaved the huge basket onto the table.","She was cycling along with her bicycle basket full of groceries.","The cat lay curled in its basket.","On the table was a basket filled with delicious fruit.","There were hanging baskets full of summer flowers.","She found a basket of fruit waiting for her in the hotel room.","The logs were in a wicker basket next to the fireplace.","We packed a picnic basket and set off for the beach."],"opposite":"","synonyms":""},{"def":"the amount contained in a basket","examples":["a basket of fruit"],"opposite":"","synonyms":""},{"def":"a facility on a website that records the items that you select to buy","examples":["Click to drop items into your shopping basket.","82 per cent of shoppers have abandoned an online shopping basket in the last year."],"opposite":"","synonyms":""},{"def":"the net and the metal ring it hangs from, high up at each end of a basketball court; a point that is scored by throwing the ball through this net","examples":["to make/shoot a basket"],"opposite":"","synonyms":""},{"def":"a number of different goods or currencies","examples":["the value of the rupee against a basket of currencies"],"opposite":"","synonyms":""},{"def":"to rely on one particular course of action for success rather than giving yourself several different possibilities","examples":["I’ve applied for several jobs. I don’t want to put all my eggs in one basket."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"put all your eggs in one basket","def":"to rely on one particular course of action for success rather than giving yourself several different possibilities","examples":["I’ve applied for several jobs. I don’t want to put all my eggs in one basket."]}],"phrasal":[],"related":["basket case","work basket","Moses basket","hanging basket","wastepaper basket","basket cases","waste-paper basket"]}]