[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bat/battl/battle__us_2.mp3","phonsUS":"/ˈbætl/","level":"B1","meanings":[{"def":"a fight between armies, ships or planes, especially during a war; a violent fight between groups of people","examples":["Napoleon was defeated at the Battle of Waterloo.","in battle His father had been killed in battle.","to go into battle","battle with somebody Hundreds of protesters fought running battles with the police.","battle against somebody In 1817 Bolivar won a series of battles against Spanish forces.","battle between A and B It ended in a gun battle between police and drug smugglers.","He died in battle.","Many young men were sent into battle without proper training.","The film has all the usual car chases and gun battles.","The battle between police and demonstrators continued for several hours.","Charles V refused to give battle.","Iwo Jima was for many the climactic battle of World War II.","The leaders anxiously watched the battle unfold.","The squadron was getting ready for the coming battle.","The battle claimed the lives of three soldiers and 40 guerrillas.","Police fought a pitched battle against demonstrators.","Scores of people have been hurt in running battles with police."],"opposite":"","synonyms":""},{"def":"a competition, an argument or a struggle between people or groups of people trying to win power or control","examples":["battle for something She finally won her six-year battle for compensation.","battle with somebody (for something) They are engaged in a legal battle with their competitors.","battle against somebody He faces an uphill battle against a hostile press.","a battle of wits (= when each side uses their ability to think quickly to try to win)","a battle of wills (= when each side is very determined to win)","the battle of the sexes","battle between A and B The essay discusses the endless battle between man and nature.","battle over something The government now faces a new battle over tax increases.","the campaign for parliamentary reform","an advertising campaign","She finally won the legal battle for compensation.","the endless battle between man and nature","the struggle for independence","the struggle between good and evil","the drive for greater efficiency","a drive to reduce energy consumption","the war against crime","Workers won their fight to stop compulsory redundancies.","A policy battle is raging in Washington.","A ten-month legal battle ensued.","She saw a way to end the prolonged legal battle.","The college president fought a running battle with the editors of the student newspaper.","The upcoming political battle could be for the allegiance of the young.","There's now a real battle at the top of the First Division.","A turf battle among competing drug cartels has claimed several lives.","There followed a fierce battle between developers and the local community.","There is set to be a heated battle between the oil industry and environmentalists.","He had been conducting a personal battle of wits with the sales manager since his first day at work.","Looking after a two-year-old needn't be a constant battle of wills.","As a parent, you have to pick your battles."],"opposite":"","synonyms":"campaign"},{"def":"a determined effort that somebody makes to solve a difficult problem or succeed in a difficult situation","examples":["battle against something She finally lost her long battle against cancer.","He has fought an uphill battle against prejudice.","battle for something Her life had become a battle for survival.","the battle for human rights","battle with something his battle with alcoholism","battle to do something They have been at the forefront of the battle to save the hospital."],"opposite":"","synonyms":""},{"def":"used to say that people or groups have shown which side they intend to support in an argument or contest that is going to begin","examples":[],"opposite":"","synonyms":""},{"def":"to fight or argue with somebody","examples":["He was quite prepared to do battle with his boss over his promotion.","Are you prepared to do battle with your insurance company over the claim?"],"opposite":"","synonyms":""},{"def":"to be able to win an argument or get what you want without anyone’s help","examples":["I wouldn't get involved—he's old enough to fight his own battles.","My parents believed in leaving me to fight my own battles."],"opposite":"","synonyms":""},{"def":"the most important or difficult part of achieving something","examples":["When you’ve got a difficult day ahead, getting a good night’s sleep is often half the battle."],"opposite":"","synonyms":""},{"def":"to begin fighting somebody","examples":["The two armies joined battle.","(figurative) Local residents have joined battle with the council over the lack of parking facilities."],"opposite":"","synonyms":""},{"def":"(to try to do) something that you will probably never succeed in doing","examples":["I’m fighting a losing battle against the mess in this house!","She wanted him to take some responsibility for his actions, but she knew it was a losing battle."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the battle lines are drawn","def":"used to say that people or groups have shown which side they intend to support in an argument or contest that is going to begin","examples":[]},{"idiom":"do battle (with somebody) (over something)","def":"to fight or argue with somebody","examples":["He was quite prepared to do battle with his boss over his promotion.","Are you prepared to do battle with your insurance company over the claim?"]},{"idiom":"fight your own battles","def":"to be able to win an argument or get what you want without anyone’s help","examples":["I wouldn't get involved—he's old enough to fight his own battles.","My parents believed in leaving me to fight my own battles."]},{"idiom":"half the battle","def":"the most important or difficult part of achieving something","examples":["When you’ve got a difficult day ahead, getting a good night’s sleep is often half the battle."]},{"idiom":"join battle (with somebody)","def":"to begin fighting somebody","examples":["The two armies joined battle.","(figurative) Local residents have joined battle with the council over the lack of parking facilities."]},{"idiom":"(fight) a losing battle","def":"(to try to do) something that you will probably never succeed in doing","examples":["I’m fighting a losing battle against the mess in this house!","She wanted him to take some responsibility for his actions, but she knew it was a losing battle."]}],"phrasal":[],"related":["battle cry","Battle Creek","battle fatigue","battle fatigues","battle-hardened","battle-scarred","pitched battle","Mons","Battle of Britain","Crécy","Culloden","Edgehill","Hastings","Naseby","Plassey","Sedgemoor","Shiloh","Trafalgar","Waterloo"]},{"pos":"verb","level":"B2","meanings":[{"def":"to try very hard to achieve something difficult or to deal with something unpleasant or dangerous","examples":["Both teams battled hard.","battle for something The two leaders are battling for control of the government.","battle with somebody/something She's still battling with a knee injury.","battle against somebody/something We had to battle against the elements to reach safety.","battle over something Residents are battling over plans for a new airport runway.","battle it out The two sides will battle it out in the final next week.","battle + adv. It’s vital that we keep battling away at the problem.","battle to do something Doctors battled to keep her alive.","I had to battle hard just to stay afloat.","battle something He battled cancer for four years.","The players have battled hard.","Doctors battled in vain to save his life.","He battled with cancer for many months.","Riot police battled with 4 000 students.","Rescuers battled against torrential rain and high winds.","The child battled bravely for her life.","The victims are battling for compensation.","There are players from eight countries battling for the title.","Unions are battling with the company over the job losses.","Competitors battled it out against the clock.","We battled through the snowstorm.","We'll keep battling away and hope that the goals start to come.","He battled his way to the bar."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]