[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bea/beach/beach__us_1.mp3","phonsUS":"/biːtʃ/","level":"A1","meanings":[{"def":"an area of sand or small stones (called shingle), next to the sea or a lake","examples":["on the beach tourists sunbathing on the beach","to the beach He decided to go to the beach for a swim.","at the beach She often spent summer days at the beach.","a sandy beach","a pebble/shingle beach","a beach bar","We rented an airy apartment at a beach resort.","a town on the south coast of Georgia","The coast road is closed due to bad weather.","She took the kids to the beach for the day.","sandy beaches","a trip to the seaside","Let's go to the shore.","The reef runs along the island's north shore.","California’s rugged coastline","We went for a walk along the sand.","a resort with miles of golden sands","He liked to look for shells on the seashore.","He walked along the beach.","She took the kids to the beach for the day.","She lay on the beach and read her book.","We could see tourists sunbathing on the beach.","They met at the beach.","They sat on a grassy hill overlooking the beach.","There are miles of beautiful sandy beaches.","The resort has a beautiful golden beach stretching for miles.","The island group has over 230 miles of pristine tropical beaches.","To the south is West Bay, a small port with a shingle beach.","She met him in a beach bar."],"opposite":"","synonyms":"coast"}],"idioms":[],"phrasal":[],"related":["beach ball","beach buggy","Long Beach","Palm Beach","beach volleyball","Virginia Beach","Beach Boys","South Beach Diet","beach balls","beach buggies"]},{"pos":"verb","level":"","meanings":[{"def":"to bring a boat out of the water and onto a beach","examples":["He beached the boat and lifted the boy onto the shore."],"opposite":"","synonyms":""},{"def":"to become stuck on land and unable to get back into the water","examples":["a beached whale","We don't know what causes whales to beach."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]