[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/beg/begin/begin__us_1.mp3","phonsUS":"/bɪˈɡɪn/","level":"A1","meanings":[{"def":"to start doing something; to do the first part of something","examples":["Shall I begin?","begin at something Let's begin at page 9.","begin with something I'd like to begin with a simple question.","begin by doing something She began by thanking us all for coming.","begin something We began work on the project in May.","I began (= started reading) this novel last month and I still haven't finished it.","begin something with something He always begins his lessons with a warm-up exercise.","begin something at something I began piano lessons at the age of six.","begin something by doing something She began her speech by praising her opponent.","begin something as something He began his political career as a student (= when he was a student).","begin to do something I began to feel dizzy.","Leaves are just beginning to appear.","We have already begun to address the problem.","I was beginning to think you'd never come.","begin doing something Everyone began talking at once.","We began working on the project in May.","This study has the following aims: first, to investigate how international students in the UK use humour; second, to examine how jokes can help to establish social relationships; and third, to explore the role that humour plays in helping overseas students adjust to life in the UK.","Let us begin by identifying some of the popular joke genres in the UK.","Next, let us turn to/Next, let us consider the question of gender differences in the use of humour.","Finally/Lastly, let us briefly examine the role of humour in defining a nation’s culture.","When does the class start?","When does the concert begin?","The discussion started off mildly enough.","Tom will kick off with a few comments.","The festival kicks off on Monday, September 13.","The meeting is scheduled to commence at noon.","The story opens with a murder.","We had to begin all over again.","He took a deep breath and slowly began.","We will begin with a brief discussion of the problems.","Let's begin by writing down a few ideas.","Begin your story at the beginning, and carry on to the end.","At last the guests began to arrive.","It was beginning to snow.","She began to cry.","When will you begin recruiting?"],"opposite":"","synonyms":"start"},{"def":"to start to happen or exist, especially from a particular time","examples":["When does the concert begin?","begin in… Work on the new bridge is due to begin in September.","begin at… The lecture begins at 8pm.","The evening began well.","What time does the concert start/​begin?","She started/​began working here three months ago.","The story begins on the island of Corfu.","We’ll need to start at 7.00.","Who do you think started the fire?","The car won’t start.","I didn’t start worrying/​to worry until she was 2 hours late.","It’s starting/​beginning to rain.","It’s starting/​beginning raining.","The entertainment was due to begin at 8.30.","Once it has finished, the DVD automatically begins again.","Their troubles are only beginning.","Research into the problem began immediately."],"opposite":"","synonyms":""},{"def":"to have something as the first part or the point where something starts","examples":["Where does Europe end and Asia begin?","begin with something Use ‘an’ before words beginning with a vowel.","‘I'm thinking of a country in Asia.’ ‘What does it begin with (= what is the first letter)?’","Each chapter begins with a quotation.","begin at… The path begins at Livingston village.","The story begins on the island of Corfu."],"opposite":"","synonyms":""},{"def":"to start or make something start for the first time","examples":["The school began in 1920, with only ten pupils.","begin something He began a new magazine on post-war architecture."],"opposite":"","synonyms":""},{"def":"to be something first, before becoming something else","examples":["He began as an actor, before starting to direct films.","What began as a minor scuffle turned into a full-scale riot."],"opposite":"","synonyms":""},{"def":"to start speaking","examples":["‘Ladies and gentlemen,’ he began, ‘welcome to the Town Hall.’"],"opposite":"","synonyms":""},{"def":"to make no attempt to do something or have no chance of doing something","examples":["I can't begin to thank you enough.","He didn't even begin to understand my problem."],"opposite":"","synonyms":""},{"def":"you should help and care for your own family, etc. before you start helping other people","examples":[],"opposite":"","synonyms":""},{"def":"at first","examples":["I found it tiring to begin with but I soon got used to it.","We'll go slowly to begin with."],"opposite":"","synonyms":""},{"def":"used to introduce the first point you want to make","examples":["‘What was it you didn't like?’ ‘Well, to begin with, our room was far too small.’"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"charity begins at home","def":"you should help and care for your own family, etc. before you start helping other people","examples":[]},{"idiom":"to begin with","def":"at first","examples":["I found it tiring to begin with but I soon got used to it.","We'll go slowly to begin with.","‘What was it you didn't like?’ ‘Well, to begin with, our room was far too small.’"]}],"phrasal":[],"related":[]}]