[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/beg/begin/beginning__us_1.mp3","phonsUS":"/bɪˈɡɪnɪŋ/","level":"A1","meanings":[{"def":"the time when something starts; the first part of an event, a story, etc.","examples":["A story has to have a beginning, middle, and end.","beginning of something We missed the beginning of the movie.","She's been working there since the beginning of last summer.","The birth of their first child marked the beginning of a new era in their married life.","at the beginning of something We're going to Japan at the beginning of July.","The animals were weighed at the beginning and end of the experiment.","At the beginning of 1836, the work was finished.","from the beginning Let's start again from the beginning.","I've read the whole book from beginning to end and still can't understand it.","Our position was quite clear from the very beginning.","I'm paid at the beginning of each month.","In the beginning I found the course very difficult.","I disliked her from the very beginning.","Tell me the whole story, right from the beginning.","It was an auspicious beginning to his long career.","She spoke of a new beginning for the nation.","These changes are just the beginning: much more is to come."],"opposite":"","synonyms":""},{"def":"the first or early ideas, signs or stages of something","examples":["Did democracy have its beginnings in ancient Greece?","The company has grown from humble beginnings.","The society had its early beginnings in discussion groups.","a custom that traces its beginnings to the 15th century","He built up his multimillion-pound music business from small beginnings."],"opposite":"","synonyms":""},{"def":"the first sign of something ending","examples":["The scandal was the beginning of the end of his career as a politician.","It wasn't the end of their marriage, but it was the beginning of the end.","That day was the beginning of the end of our friendship."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the beginning of the end","def":"the first sign of something ending","examples":["The scandal was the beginning of the end of his career as a politician.","It wasn't the end of their marriage, but it was the beginning of the end.","That day was the beginning of the end of our friendship."]}],"phrasal":[],"related":[]}]