[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bel/belie/believe__us_1.mp3","phonsUS":"/bɪˈliːv/","level":"A1","meanings":[{"def":"to feel certain that something is true or that somebody is telling you the truth","examples":["believe somebody I don't believe you!","The man claimed to be a social worker and she believed him.","Do you really believe her?","Believe me, she's not right for you.","believe something I believed his lies for years.","I find that hard to believe.","Don't believe a word of it (= don't believe any part of what somebody is saying).","believe (that)… People used to believe (that) the earth was flat.","He refused to believe (that) his son was involved in drugs.","I do believe you’re right (= I think something is true, even though it is surprising).","I'm inclined to believe you.","It's hard to believe that this campaign has been going on for ten years.","It was generally believed that evil spirits lived in the forest.","The ad led us to believe (= made us think) that all prices had been cut."],"opposite":"","synonyms":""},{"def":"to think that something is true or possible, although you are not completely certain","examples":["‘Where does she come from?’ ‘Spain, I believe.’","‘Does he still work there?’ ‘I believe so/not.’","believe (that)… Police believe (that) the man may be armed.","Experts believe that the diamond is the only one of its kind.","l firmly believe that she is still alive.","There is no reason to believe he is dangerous.","it is believed (that)… It is believed that the couple have left the country.","It is widely believed that he was forced to resign.","believe something Few people believe the claim that the cost of living has not risen since last year.","be believed to be, have, etc. something The vases are believed to be worth over $20 000 each.","be believed + adj. Three sailors are missing, believed drowned.","Do you think (that) they’ll come?","Well, I like it. What do you think?","Police believe (that) the man may be armed.","We all felt (that) we were unlucky to lose.","I reckon (that) I’m going to get that job.","I was under the impression that the work had already been completed.","We have reason to believe that the escaped prisoner may be hiding in this house.","No one seriously believes that this war will happen.","Paul says he's happy, but his mother believes otherwise."],"opposite":"","synonyms":"think"},{"def":"to have the opinion that something is right or true","examples":["The party believes (that) education is the most important issue facing the government.","She believes that killing animals for food or fur is completely immoral.","I strongly believe that competition is a good thing.","She truly believes that love can change the world.","Photography is, according to Vidal, the art form of untalented people.","For Vidal, photography is the art form of untalented people.","His view is that photography is not art but merely the mechanical reproduction of images.","Smith takes the view that photography is both an art and a science.","In Brown’s view, photography should be treated as a legitimate art in its own right.","James is of the opinion that a good painter can always be a good photographer if they so decide.","Emerson believed that a photograph should only reflect what the human eye can see.","In my opinion, everyone should have some understanding of science.","Everyone should, in my opinion, have some understanding of science.","It seems to me that many people in this country have a poor understanding of science.","This is, in my view, the result of a failure of the scientific community to get its message across.","Another reason why so many people have such a poor understanding of science is, I believe, the lack of adequate funding for science in schools.","Smith argues that science is separate from culture. My own view is that science belongs with literature, art, philosophy and religion as an integral part of our culture.","In this writer’s opinion, the more the public know about science, the less they will fear and distrust it.","I personally believe that it's important.","I've long believed that a good reputation is the most valuable asset you can have in business.","I believe that we have a responsibility towards the less fortunate in society."],"opposite":"","synonyms":""},{"def":"used to say that you are surprised or annoyed at something","examples":["believe (that)… She couldn’t believe (that) it was all happening again.","I don't believe I'm doing this!","believe how, what, etc… I can't believe how much better I feel.","I couldn't believe what I was hearing."],"opposite":"","synonyms":""},{"def":"to have a religious faith","examples":["The god appears only to those who believe."],"opposite":"","synonyms":""},{"def":"used to introduce information that is true but that may surprise people","examples":["Believe it or not, he asked me to marry him!"],"opposite":"","synonyms":""},{"def":"used to emphasize that you strongly believe what you are saying","examples":["You haven't heard the last of this, believe you me!"],"opposite":"","synonyms":""},{"def":"used to tell somebody that something is definitely not true","examples":["‘She wouldn’t do a thing like that.’ ‘Don’t you believe it!’"],"opposite":"","synonyms":""},{"def":"to make somebody believe/understand something","examples":["I was given to understand that she had resigned."],"opposite":"","synonyms":""},{"def":"used to say that you are surprised or annoyed about something","examples":["I don't believe it! What are you doing here?"],"opposite":"","synonyms":""},{"def":"used to say that you think somebody is stupid if they believe that something is true","examples":["‘He promised not to do it again.’ ‘Sure, and if you believe that, you’ll believe anything.’"],"opposite":"","synonyms":""},{"def":"to pretend that something is true","examples":[],"opposite":"","synonyms":""},{"def":"to be very surprised at something you hear/see","examples":["I couldn't believe my eyes when she walked in."],"opposite":"","synonyms":""},{"def":"used to say that somebody will have to believe that something is true when they see it, although they do not think it is true now","examples":[],"opposite":"","synonyms":""},{"def":"used to show that you are surprised and annoyed about something","examples":["And, would you believe, he didn't even apologize!"],"opposite":"","synonyms":""},{"def":"used to tell somebody that something is definitely true","examples":["‘He’s not a bad player, is he?’ ‘You’d better believe it!’"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"believe it or not","def":"used to introduce information that is true but that may surprise people","examples":["Believe it or not, he asked me to marry him!"]},{"idiom":"believe (you) me","def":"used to emphasize that you strongly believe what you are saying","examples":["You haven't heard the last of this, believe you me!"]},{"idiom":"don’t you believe it!","def":"used to tell somebody that something is definitely not true","examples":["‘She wouldn’t do a thing like that.’ ‘Don’t you believe it!’"]},{"idiom":"give somebody to believe/understand (that)…","def":"to make somebody believe/understand something","examples":["I was given to understand that she had resigned."]},{"idiom":"I don’t believe it!","def":"used to say that you are surprised or annoyed about something","examples":["I don't believe it! What are you doing here?"]},{"idiom":"if you believe that, you’ll believe anything","def":"used to say that you think somebody is stupid if they believe that something is true","examples":["‘He promised not to do it again.’ ‘Sure, and if you believe that, you’ll believe anything.’"]},{"idiom":"make believe (that…)","def":"to pretend that something is true","examples":[]},{"idiom":"not believe your ears/eyes","def":"to be very surprised at something you hear/see","examples":["I couldn't believe my eyes when she walked in."]},{"idiom":"seeing is believing","def":"used to say that somebody will have to believe that something is true when they see it, although they do not think it is true now","examples":[]},{"idiom":"would you believe (it)?","def":"used to show that you are surprised and annoyed about something","examples":["And, would you believe, he didn't even apologize!"]},{"idiom":"you/you’d better believe it!","def":"used to tell somebody that something is definitely true","examples":["‘He’s not a bad player, is he?’ ‘You’d better believe it!’"]}],"phrasal":["believe in","believe of"],"related":["believe in","believe of","make-believe","Ripley's Believe It or Not","believe in somebody","believe in something","believe in somebody/something","believe something of somebody","not believe your ears","not believe your eyes"]}]