[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bel/belie/belief__us_1.mp3","phonsUS":"/bɪˈliːf/","level":"B1","meanings":[{"def":"a strong feeling that something/somebody exists or is true; confidence that something/somebody is good or right","examples":["belief in something/somebody I admire his passionate belief in what he is doing.","belief in God/democracy","The incident has shaken my belief (= made me have less confidence) in the police.","belief that… They share a belief that there is life after death.","I think the rights and wrongs of eating meat are a matter of personal belief.","She has lost her belief in God.","The child's death shook her belief in God.","They had a shared belief in the power of education.","We remain united in our belief in democracy."],"opposite":"","synonyms":""},{"def":"an opinion about something; something that you think is true","examples":["belief that… There is a general belief that things will soon get better.","There is a widespread belief that multinationals have too much power.","a widely/commonly held belief","in the belief that… She acted in the belief that she was doing good.","I took the job in the mistaken belief that I would be able to stay in London.","Contrary to popular belief (= in spite of what people may think), he was not responsible for the tragedy.","It's my belief that she's telling the truth.","He shared his father's belief that people should work hard for their living.","She did it in the belief that it would help her career.","She was strict with her children in the genuine belief that it was the right thing to do.","She clung to the belief that he would come back to her.","The exam results encouraged the belief that he was a good teacher.","There is a belief among young people that education is a waste of time.","This latest evidence strengthens our belief that the government is doing the right thing."],"opposite":"","synonyms":""},{"def":"something that you believe, especially as part of your religion","examples":["religious/political beliefs","A society should be judged on its beliefs and values.","belief about something Some people hold beliefs about the world that are not supported by science.","Each religion has its set of beliefs.","He tried to impose his beliefs on other people.","I have very firm beliefs about moral issues.","The Labour Party must stick to its beliefs.","The people still follow their traditional beliefs.","They were persecuted for their religious beliefs.","You must respect other people's beliefs.","an attempt to reconcile apparently opposite beliefs","beliefs about the origin of the universe","the basic beliefs of Christianity","People who did not subscribe to the dominant beliefs of society were widely persecuted.","The beliefs of a minority have come to dominate the political agenda.","Those holding Socialist beliefs were expelled from the organization.","You need to examine your own attitudes and beliefs."],"opposite":"","synonyms":""},{"def":"to be too extreme, horrible, etc. to believe/describe","examples":["It beggars belief how things could have got this bad."],"opposite":"","synonyms":""},{"def":"(in a way that is) too great, difficult, etc. to be believed","examples":["Dissatisfaction with the government has grown beyond belief.","icy air that was cold beyond belief","It is beyond belief that anyone could commit such a crime."],"opposite":"","synonyms":""},{"def":"as far as you know","examples":["He never made a will, to the best of my knowledge."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"beggar belief/description","def":"to be too extreme, horrible, etc. to believe/describe","examples":["It beggars belief how things could have got this bad."]},{"idiom":"beyond belief","def":"(in a way that is) too great, difficult, etc. to be believed","examples":["Dissatisfaction with the government has grown beyond belief.","icy air that was cold beyond belief","It is beyond belief that anyone could commit such a crime."]},{"idiom":"to the best of your knowledge/belief","def":"as far as you know","examples":["He never made a will, to the best of my knowledge."]}],"phrasal":[],"related":["beggar belief/description"]}]