[{"pos":"preposition","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bes/besid/besides__us_1.mp3","phonsUS":"/bɪˈsaɪdz/","level":"B2","meanings":[{"def":"in addition to somebody/something; apart from somebody/something","examples":["We have lots of things in common besides music.","Besides working as a doctor, he also writes novels in his spare time.","I've got no family besides my parents.","I’ve got plenty of other things to do besides talking to you.","What other sports do you like besides football?","I like all sports except football.","What other sports do you like apart from football?","I like all sports apart from football.","She wrote all of the songs on the album except for the final track.","Apart from/aside from the final track, all of the songs on the album were written by her.","The songwriting—with a few minor exceptions—is of a very high quality.","With only one or two exceptions, the songwriting is of a very high quality.","The majority of the compositions are less than three minutes long, with the notable exception of the title track.","With the exception of the title track, this album is a huge disappointment.","Here is a list of all the band’s CDs, excluding unofficial ‘bootleg’ recordings.","Sit here beside me.","What other sports do you play besides hockey?","I don’t think I’ll come on Saturday. I have a lot of work to do. Besides, I don’t really like parties.","She likes football. Besides, she likes tennis and basketball."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adverb","level":"B2","meanings":[{"def":"used for making an extra comment that adds to what you have just said","examples":["I don't really want to go. Besides, it's too late now.","Bilingual children do better in IQ tests than children who speak only one language. In addition/What is more, they seem to find it easier to learn third or even fourth languages.","Learning another language not only improves children’s job prospects in later life, but also boosts their self-esteem.","Teaching children a second language improves their job prospects in later life. Other benefits include increased self-esteem and greater tolerance of other cultures.","Another/One further/One additional reason for encouraging bilingual education is that it boosts children’s self-esteem.","Studies suggest that bilingual children find it easier to learn additional languages. There is, moreover, increasing evidence that bilingual children perform better across a range of school subjects, not just foreign languages.","His claim that children find bilingual education confusing is based on very little evidence. Moreover, the evidence he does provide is seriously flawed.","Research has shown that first-language development is not impeded by exposure to a second language. Furthermore, there is no evidence to support the claim that children find bilingual education confusing.","Sit here beside me.","What other sports do you play besides hockey?","I don’t think I’ll come on Saturday. I have a lot of work to do. Besides, I don’t really like parties.","She likes football. Besides, she likes tennis and basketball."],"opposite":"","synonyms":""},{"def":"in addition; also","examples":["discounts on televisions, stereos and much more besides"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]