[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bid/bid__/bid__us_1.mp3","phonsUS":"/bɪd/","level":"B2","meanings":[{"def":"an offer by a person or a company to pay a particular amount of money for something","examples":["bid for something A German firm launched a takeover bid for the company.","At the auction (= a public sale where things are sold to the person who offers the most), the highest bid for the picture was £200.","bid on something (North American English also) the highest bid on the picture","Any more bids?","I placed a bid on a repossessed Ferrari.","He made a cash bid for the company.","They have invited bids for the property.","They blocked a $24 million bid by a rival company."],"opposite":"","synonyms":""},{"def":"an offer to do work or provide a service for a particular price, in competition with other companies, etc.","examples":["The company submitted a bid for the contract to clean the hospital."],"opposite":"","synonyms":""},{"def":"an effort to do something or to obtain something","examples":["bid for something a bid for power","bid to do something a desperate bid to escape from his attackers","He attacked his guards in a desperate bid for freedom.","This play was her last bid for recognition.","It was a bid by the president to boost his popularity.","They failed in their bid to buy the company."],"opposite":"","synonyms":""},{"def":"a statement of the number of points a player thinks they will win","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"B2","meanings":[{"def":"to offer to pay a particular price for something, especially at an auction","examples":["bid (something) (for something) I bid £2 000 for the painting.","bid (against somebody) (for something) We wanted to buy the chairs but another couple were bidding against us.","Two dealers bid against each other for the antique table."],"opposite":"","synonyms":""},{"def":"to offer to do work or provide a service for a particular price, in competition with other companies, etc.","examples":["bid for something A French firm will be bidding for the contract.","bid on something (North American English also) A French firm will be bidding on the contract.","bid to do something Which other cities are bidding to host the 2028 Olympics?"],"opposite":"","synonyms":""},{"def":"to try to do, get or achieve something","examples":["The team is bidding to retain its place in the league."],"opposite":"","synonyms":""},{"def":"(in some card games) to say how many points you expect to win","examples":["She bid four hearts."],"opposite":"","synonyms":""},{"def":"used by an auctioneer who is selling something","examples":["What am I bid for this vase?"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"what am I bid?","def":"used by an auctioneer who is selling something","examples":["What am I bid for this vase?"]}],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to say ‘good morning’, etc. to somebody","examples":["I bade farewell to all the friends I had made in Paris.","I bade all my friends farewell.","He bade farewell to the city where he had been so happy.","He bade her good day and left."],"opposite":"","synonyms":""},{"def":"to tell somebody to do something","examples":["He bade me come closer."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]