[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bin/bind_/bind__us_1.mp3","phonsUS":"/baɪnd/","level":"C1","meanings":[{"def":"to tie somebody/something with rope, string, etc. so that they/it cannot move or are held together strongly","examples":["bind somebody/something to something She was bound to a chair.","bind somebody/something together They bound his hands together.","bind somebody/something He was left bound and gagged (= tied up and with a piece of cloth tied over his mouth).","The sails are bound to the mast with cord.","She found herself bound hand and foot."],"opposite":"","synonyms":""},{"def":"to tie a long thin piece of cloth around something","examples":["She bound up his wounds."],"opposite":"","synonyms":""},{"def":"to make people, organizations, etc. feel united so that they live or work together more happily or effectively","examples":["bind A (and B) (together) Organizations such as schools and clubs bind a community together.","bind A to B She thought that having his child would bind him to her forever."],"opposite":"","synonyms":""},{"def":"to force somebody to do something by making them promise to do it or by making it their duty to do it","examples":["bind somebody (to something) He had been bound to secrecy (= made to promise not to tell people about something).","bind somebody to do something The agreement binds her to repay the debt within six months."],"opposite":"","synonyms":""},{"def":"to stick together or to make things stick together in a solid mass","examples":["bind (together) Add an egg yolk to make the mixture bind.","bind something (together) Add an egg yolk to bind the mixture together."],"opposite":"","synonyms":""},{"def":"to fasten the pages of a book together and put them inside a cover","examples":["two volumes bound in leather"],"opposite":"","synonyms":""},{"def":"to sew a piece of material to the edge of something to decorate it or to make it stronger","examples":["The blankets were bound with satin."],"opposite":"","synonyms":""},{"def":"to tie somebody’s hands and feet together so that they cannot move or escape","examples":[],"opposite":"","synonyms":""},{"def":"to prevent somebody from doing what they want by creating rules, limits, etc.","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"bind/tie somebody hand and foot","def":"to tie somebody’s hands and feet together so that they cannot move or escape","examples":[]}],"phrasal":["bind over"],"related":["bind over","double bind","bind somebody over","in a bind"]},{"pos":"noun","level":"","meanings":[{"def":"an annoying situation that is often difficult to avoid","examples":[],"opposite":"","synonyms":""},{"def":"in a difficult situation that you do not know how to get out of","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in a bind","def":"in a difficult situation that you do not know how to get out of","examples":[]}],"phrasal":[],"related":[]}]