[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bir/birth/birth__us_1.mp3","phonsUS":"/bɜːrθ/","level":"A2","meanings":[{"def":"the time when a baby is born; the process of being born","examples":["at birth The baby weighed three kilos at birth.","Global life expectancy at birth is about 72 years.","John was present at the birth of both his children.","It was a difficult birth.","a hospital/home birth","from birth Mark has been blind from birth.","Please state your date and place of birth.","These chemicals can cause birth defects.","They are at increased risk of low birth weight.","The risk of premature birth increases markedly after 35.","Please provide your complete birth name and birth date.","He was anxiously awaiting the birth of his child.","They recently celebrated the birth of their second daughter.","You should prepare a birth plan with your obstetrician.","Better living conditions mean more live births and fewer stillbirths.","a registry of births, marriages and deaths"],"opposite":"","synonyms":""},{"def":"the beginning of a new situation, idea, place, etc.","examples":["This declaration marked the birth of a new society in South Africa.","He was a medical student years before the birth of psychoanalysis."],"opposite":"","synonyms":""},{"def":"a person’s origin or the social position of their family","examples":["Anne was French by birth but lived most of her life in Italy.","a woman of noble birth"],"opposite":"","synonyms":""},{"def":"to produce a baby or young animal","examples":["She died shortly after giving birth.","Mary gave birth to a healthy baby girl.","(figurative) It was the study of history that gave birth to the social sciences."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"give birth (to somebody/something)","def":"to produce a baby or young animal","examples":["She died shortly after giving birth.","Mary gave birth to a healthy baby girl.","(figurative) It was the study of history that gave birth to the social sciences."]}],"phrasal":[],"related":["birth rate","birth control","birth mother","birth partner","breech birth","birth certificate","Birth of a Nation","birth rates","birth mothers","birth weight","birth partners","birth certificates"]}]