[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bla/blame/blame__us_1.mp3","phonsUS":"/bleɪm/","level":"B2","meanings":[{"def":"to think or say that somebody/something is responsible for something bad","examples":["blame somebody/something for something She doesn't blame anyone for her father's death.","A dropped cigarette is being blamed for the fire.","Why is he blaming others for his problems?","blame somebody/something for doing something You can't really blame them for not telling you.","blame somebody/something It's easy to blame the media at times like this.","blame something on somebody/something Police are blaming the accident on dangerous driving.","The violence was blamed in part on militants.","Blaming the victim is characteristic of any prejudice.","He is widely blamed for masterminding the attacks.","I don't blame Jack for the mistake.","The government has been widely blamed for the crisis.","You can hardly blame Peter for being angry with her.","She blamed the government for failing to respond to the crisis.","Whenever something goes wrong, everyone blames it on me."],"opposite":"","synonyms":""},{"def":"to be responsible for something bad","examples":["If anyone's to blame, it's me.","Which driver was to blame for the accident?","A spokesman said that bad weather was partly to blame for the delay."],"opposite":"","synonyms":""},{"def":"used to advise somebody not to do something, when you think they will do it despite your advice","examples":["Call her if you like, but don't blame me if she's angry."],"opposite":"","synonyms":""},{"def":"used to say that you think that what somebody did was reasonable and the right thing to do","examples":["‘I just slammed the phone down when he said that.’ ‘I don't blame you!’"],"opposite":"","synonyms":""},{"def":"used to say that you think something is somebody’s own fault","examples":["If you lose your job, you'll only have yourself to blame."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be to blame (for something)","def":"to be responsible for something bad","examples":["If anyone's to blame, it's me.","Which driver was to blame for the accident?","A spokesman said that bad weather was partly to blame for the delay."]},{"idiom":"don’t blame me","def":"used to advise somebody not to do something, when you think they will do it despite your advice","examples":["Call her if you like, but don't blame me if she's angry."]},{"idiom":"I don’t blame you/her, etc. (for doing something)","def":"used to say that you think that what somebody did was reasonable and the right thing to do","examples":["‘I just slammed the phone down when he said that.’ ‘I don't blame you!’"]},{"idiom":"only have yourself to blame | have nobody/no one to blame but yourself","def":"used to say that you think something is somebody’s own fault","examples":["If you lose your job, you'll only have yourself to blame."]}],"phrasal":[],"related":["the finger of blame/suspicion"]},{"pos":"noun","level":"B2","meanings":[{"def":"responsibility for doing something badly or wrongly; saying that somebody is responsible for something","examples":["Why do I always get the blame for everything that goes wrong?","to lay/put the blame for something on somebody","The government will have to take the blame for the riots.","The real estate industry deserves a fair share of the blame for this failure.","Don't even think about playing the blame game (= blaming somebody else for a problem instead of trying to find a solution).","He was absolved of all blame.","She put the blame on me.","They pinned the blame for the crisis on the President.","They placed the blame squarely on the doctor.","The government tried to lay the blame at the door of the unions.","My brother broke the window, but I got the blame.","The blame lies with the police, who failed to act quickly enough.","The company refused to accept any blame for the damage.","The government must share the blame for this confusion.","They tried to shift the blame onto someone else.","I’m not interested in apportioning blame for the accident (= deciding how much each person involved was responsible for it)."],"opposite":"","synonyms":""},{"def":"if the finger of blame/suspicion points or is pointed at somebody, they are suspected of having committed a crime, being responsible for something, etc.","examples":["The inquiry pointed the finger of blame at the driver of the crashed coach.","The finger of suspicion was pointed at the chicken served for lunch."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the finger of blame/suspicion","def":"if the finger of blame/suspicion points or is pointed at somebody, they are suspected of having committed a crime, being responsible for something, etc.","examples":["The inquiry pointed the finger of blame at the driver of the crashed coach.","The finger of suspicion was pointed at the chicken served for lunch."]}],"phrasal":[],"related":[]}]