[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/ble/blend/blend__us_1.mp3","phonsUS":"/blend/","level":"C1","meanings":[{"def":"to mix two or more substances together","examples":["blend A with B Blend the flour with the milk to make a smooth paste.","blend A and B (together) Blend together the eggs, sugar and flour.","Mix all the ingredients together in a bowl.","Oil and water do not mix.","She stirred her tea.","Blend the flour with the milk to make a smooth paste.","Add the fruit and cream and blend well.","I have very little idea of how to blend colours.","Blend all the ingredients together."],"opposite":"","synonyms":"mix"},{"def":"to form a mixture with something","examples":["blend with something Oil does not blend with water.","blend (together) Oil and water do not blend."],"opposite":"","synonyms":""},{"def":"to combine with something in an attractive or effective way; to combine something in this way","examples":["blend (something) (together) The old and new buildings blend together perfectly.","blend something (and/with something) Their music blends traditional and modern styles.","This process allows the flavours to blend together.","The ornamental pool blends perfectly with its surroundings."],"opposite":"","synonyms":""},{"def":"to produce something by mixing different types together","examples":["blended whisky/tea"],"opposite":"","synonyms":""},{"def":"to behave in a way that does not attract any attention; to disappear or hide","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"blend/fade into the woodwork","def":"to behave in a way that does not attract any attention; to disappear or hide","examples":[]}],"phrasal":["blend in","blend into"],"related":["blend in","blend into","Gold Blend™","blend something","blend into something","blend in (with something/somebody)"]},{"pos":"noun","level":"C1","meanings":[{"def":"a mixture of different types of the same thing","examples":["a blend of tea","The barman prepared a cool blend of tropical fruit juices.","We offer several different blends of freshly ground coffee.","a scarf with a subtle blend of colours"],"opposite":"","synonyms":""},{"def":"a pleasant or useful combination of different things","examples":["a blend of youth and experience","just the right blend of work and relaxation","This charming hotel is a delightful blend of the old and the new."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]