[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/blo/block/block__us_1.mp3","phonsUS":"/blɑːk/","level":"B1","meanings":[{"def":"a large piece of a solid material that is square or rectangular in shape and usually has flat sides","examples":["The houses are made of concrete blocks with tin roofs.","block of something a block of ice/wood","The wall was made from massive blocks of stone."],"opposite":"","synonyms":""},{"def":"a tall building that contains flats or offices; buildings that form part of a school, hospital, etc. which are used for a particular purpose","examples":["a block of flats","a tower block","an office block","She lives in a modern apartment block.","the university’s science block","We have a buyer who would like to view the property.","The price of property has risen enormously.","The company is looking for larger premises.","a leisure complex","The pier is a wooden structure.","a block of flats","the school’s science block","They live in the next block.","The prisoners had been transferred to a different cell block."],"opposite":"","synonyms":"building"},{"def":"the length of one side of a piece of land or group of buildings, from the place where one street crosses it to the next","examples":["His apartment is three blocks away from the police station.","They walked a few blocks down the street."],"opposite":"","synonyms":""},{"def":"a group of buildings with streets on all sides","examples":["around the block She took the dog for a walk around the block.","(North American English) The downtown area covers four city blocks.","The hotel occupies an entire block.","People were queueing round the block to get in."],"opposite":"","synonyms":""},{"def":"a large area of land","examples":[],"opposite":"","synonyms":""},{"def":"an area of land for building a house on","examples":[],"opposite":"","synonyms":""},{"def":"a quantity of something or an amount of time that is considered as a single unit","examples":["a block of shares","a block of text in a document","(British English) The theatre gives discounts for block bookings (= a large number of tickets bought at the same time).","The three-hour class is divided into four blocks of 45 minutes each."],"opposite":"","synonyms":""},{"def":"something that makes movement or progress difficult or impossible","examples":["Lack of training acts as a block to progress in a career.","I suddenly had a mental block and couldn't remember his name."],"opposite":"","synonyms":""},{"def":"a movement that stops another player from going forward","examples":[],"opposite":"","synonyms":""},{"def":"the two blocks on the ground that runners push their feet against at the beginning of a race","examples":[],"opposite":"","synonyms":""},{"def":"(in the past) the piece of wood on which a person’s head was cut off as a punishment","examples":[],"opposite":"","synonyms":""},{"def":"a person who is very similar to their mother or father in the way that they look or behave","examples":[],"opposite":"","synonyms":""},{"def":"to be sold, especially at an auction (= a sale in which items are sold to the person who offers the most money)","examples":[],"opposite":"","synonyms":""},{"def":"to have a lot of experience","examples":[],"opposite":"","synonyms":""},{"def":"used to threaten somebody that you will hit them","examples":[],"opposite":"","synonyms":""},{"def":"a person who is new to a place, an organization, etc.","examples":["Despite his six years in politics, he was still regarded by many as the new kid on the block."],"opposite":"","synonyms":""},{"def":"to risk losing your job, damaging your reputation, etc. by doing or saying something","examples":["It's not a matter that I'm prepared to put my head on the block for."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a chip off the old block","def":"a person who is very similar to their mother or father in the way that they look or behave","examples":[]},{"idiom":"go on the block","def":"to be sold, especially at an auction (= a sale in which items are sold to the person who offers the most money)","examples":[]},{"idiom":"have been around the block (a few times)","def":"to have a lot of experience","examples":[]},{"idiom":"I’ll knock your block/head off!","def":"used to threaten somebody that you will hit them","examples":[]},{"idiom":"a/the new kid on the block","def":"a person who is new to a place, an organization, etc.","examples":["Despite his six years in politics, he was still regarded by many as the new kid on the block."]},{"idiom":"put/lay your head/neck on the block","def":"to risk losing your job, damaging your reputation, etc. by doing or saying something","examples":["It's not a matter that I'm prepared to put my head on the block for."]}],"phrasal":[],"related":["block in","block up","H-block","block off","block out","block party","block vote","tower block","block diagram","breeze block","butcher block","cinder block","office block","apartment block","block capitals","building block","butcher’s block","chock-a-block","chopping block"]},{"pos":"verb","level":"B1","meanings":[{"def":"to stop something from moving or flowing through a pipe, a passage, a road, etc. by putting something in it or across it","examples":["After today's heavy snow, many roads are still blocked.","a blocked sink","A truck had overturned and was completely blocking traffic.","A large delivery van was almost blocking the narrow street.","Fat that is poured down the sink will block the drain.","The exit was blocked with beer crates.","He found that the pipe was partially blocked with leaves."],"opposite":"","synonyms":""},{"def":"to stop somebody from going somewhere or seeing something by standing in front of them or in their way","examples":["One of the guards moved to block her path.","An ugly new building blocked the view from the window.","His way was blocked by two large bouncers.","She had her back to the door, blocking his exit."],"opposite":"","synonyms":""},{"def":"to prevent something from happening, developing or making progress","examples":["The proposed merger has been blocked by the government.","Firewalls can block unauthorized access to a computer.","The local mayor is seeking to block the dumping of waste in the area.","He accused the French of trying to block the agreement.","A court ruling blocked the plans to develop the area.","The new rules would effectively block protesters' attempts to assert their rights.","The group has moved to block the government's proposals."],"opposite":"","synonyms":""},{"def":"to stop a ball, hit, etc. from reaching somewhere by moving in front of it","examples":["His shot was blocked by the goalie.","We learned some basic punching and blocking techniques."],"opposite":"","synonyms":""},{"def":"to stop a mobile/cell phone from being used, for example after it has been stolen","examples":["Police have accused mobile networks of failing to block stolen phones."],"opposite":"","synonyms":""},{"def":"to prevent someone from contacting you on social media","examples":["There are many reasons to block someone online.","A person who has been blocked won't necessarily know that you've blocked them."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["block in","block off","block out","block up"],"related":[]}]