[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bod/body_/body__us_2.mp3","phonsUS":"/ˈbɑːdi/","level":"A1","meanings":[{"def":"the whole physical structure of a human or an animal","examples":["The human body is a complex structure.","a male/female/naked body","The virus can affect all parts of the body.","The heart pumps blood around the body.","His whole body was trembling.","body fat/weight/temperature/size","Yoga is designed to release the body and mind from tension.","She bit her lip nervously.","He scratched his head and looked thoughtful.","I wrinkled my nose in disgust.","She raised questioning eyebrows.","Extreme heat may cause changes in the body.","Pain racked her body.","to maintain your ideal body weight"],"opposite":"","synonyms":""},{"def":"the main part of a body not including the head, or not including the head, arms and legs","examples":["She had injuries to her head and body.","He has a large body, but thin legs.","These exercises help develop your upper body.","She still had the marks from the ropes on her body.","He pulled the sheet up over his naked body."],"opposite":"","synonyms":""},{"def":"the body of a dead person or animal","examples":["a dead body","The family of the missing girl has been called in by the police to identify the body.","A man's body was found floating in the river.","His body is being brought back to his home town for burial."],"opposite":"","synonyms":""},{"def":"the main part of something, especially a building, a vehicle or a book, an article, etc.","examples":["the body of a plane (= the central part where the seats are)","the main body of the text","The bar is in the main body of the hotel.","Although parts were scattered over the surrounding fields, the main body of the plane had landed in one piece.","Most of the body panels on a Land Rover are aluminium.","The new car body weighed 9.55 tonnes.","There are some references in the main body of the text."],"opposite":"","synonyms":""},{"def":"a group of people who work or act together, often for an official purpose, or who are connected in some other way","examples":["a regulatory/an advisory body","The governing body of the school is/are concerned about discipline.","recognized professional bodies such as the Law Association","An independent body has been set up to investigate the affair.","body of somebody A large body of people will be affected by the tax cuts.","in a body The protesters marched in a body (= all together) to the White House.","An independent body has been set up to regulate the telecommunications sector.","The government is consulting trade unions and other professional bodies.","They asked for funds from Gymnastics USA, the sport's governing body.","The students marched in a body to the government offices."],"opposite":"","synonyms":""},{"def":"a large amount or collection of something","examples":["a vast body of evidence/information/research","large bodies of water (= lakes or seas)","There is a powerful body of opinion against the ruling.","The two islands are separated by a large body of water.","a large body of evidence"],"opposite":"","synonyms":""},{"def":"an object","examples":["heavenly bodies (= stars, planets, etc.)","an operation to remove a foreign body (= something that would not usually be there) from a wound","They removed a foreign body from her eye.","Stars are celestial bodies.","He underwent an operation to remove a foreign body from the wound.","Astrology extends back to the time when people worshipped the heavenly bodies as gods."],"opposite":"","synonyms":""},{"def":"the full strong taste of alcoholic drinks or the thick healthy quality of somebody’s hair","examples":["a wine with plenty of body","Regular use of conditioner is supposed to give your hair more body."],"opposite":"","synonyms":""},{"def":"having the type of body mentioned","examples":["full-bodied red wines","soft-bodied insects"],"opposite":"","synonyms":""},{"def":"a piece of clothing which fits tightly over a woman’s upper body and bottom, usually fastening between the legs","examples":[],"opposite":"","synonyms":""},{"def":"with all your energy","examples":["She committed herself body and soul to fighting for the cause."],"opposite":"","synonyms":""},{"def":"to stay alive with just enough of the food, clothing, etc. that you need","examples":["They barely have enough money to keep body and soul together."],"opposite":"","synonyms":""},{"def":"to have none of the quality mentioned","examples":["She was honest and hard-working, and didn't have an unkind bone in her body."],"opposite":"","synonyms":""},{"def":"used to show you are strongly opposed to something","examples":["She moves into our home over my dead body."],"opposite":"","synonyms":""},{"def":"to have sex with somebody in exchange for money","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"body and soul","def":"with all your energy","examples":["She committed herself body and soul to fighting for the cause."]},{"idiom":"keep body and soul together","def":"to stay alive with just enough of the food, clothing, etc. that you need","examples":["They barely have enough money to keep body and soul together."]},{"idiom":"not have a… bone in your body","def":"to have none of the quality mentioned","examples":["She was honest and hard-working, and didn't have an unkind bone in her body."]},{"idiom":"over my dead body","def":"used to show you are strongly opposed to something","examples":["She moves into our home over my dead body."]},{"idiom":"sell your body","def":"to have sex with somebody in exchange for money","examples":[]}],"phrasal":[],"related":["body bag","body blow","body shop","body slam","body armour","body check","body clock","body count","body double","body image","body odour","body press","body search","body swerve","body warmer","body fascism","body language","body piercing","body-popping"]}]