[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bon/bond_/bond__us_1.mp3","phonsUS":"/bɑːnd/","level":"B2","meanings":[{"def":"something that forms a connection between people or groups, such as a feeling of friendship or shared ideas and experiences","examples":["the bond that links us","bond between A and B A bond of friendship had been forged between them.","The agreement strengthened the bonds between the two countries.","the special bond between mother and child","Informal language creates a bond between the members of the community.","bond with somebody The students formed strong bonds with each other.","She felt a bond of affection for the other girls.","We try to forge bonds between the different communities."],"opposite":"","synonyms":""},{"def":"an agreement by a government or a company to pay you interest on the money you have lent; a document containing this agreement","examples":["government bonds","The bonds were redeemed in 2002.","I decided to invest in some government bonds."],"opposite":"","synonyms":""},{"def":"a sum of money that is paid as bail","examples":["He was released on $5 000 bond."],"opposite":"","synonyms":""},{"def":"a legal agreement by which a bank lends you money to buy a house, etc. which you pay back over many years; the sum of money that is lent","examples":["to pay off a bond","We had to take out a second bond on the property.","bond rates (= of interest)"],"opposite":"","synonyms":""},{"def":"the ropes or chains keeping somebody prisoner; anything that stops you from being free to do what you want","examples":["to release somebody from their bonds","the bonds of oppression/injustice"],"opposite":"","synonyms":""},{"def":"a legal written agreement or promise","examples":["We entered into a solemn bond."],"opposite":"","synonyms":""},{"def":"the way in which two things are joined together","examples":["a firm bond between the two surfaces"],"opposite":"","synonyms":""},{"def":"the way in which atoms are held together in a chemical compound","examples":[],"opposite":"","synonyms":""},{"def":"somebody’s promise can be relied on completely","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"somebody’s word is their bond","def":"somebody’s promise can be relied on completely","examples":[]}],"phrasal":[],"related":["junk bond","Bond","bond paper","Bond Street","mortgage bond","Premium Bond","savings bond","debenture bond","Premium Savings Bond"]},{"pos":"verb","level":"","meanings":[{"def":"to join two things strongly together; to join strongly to something else","examples":["bond something This new glue bonds a variety of surfaces in seconds.","bond (A) to B It cannot be used to bond wood to metal.","bond (A and B) together The atoms bond together to form a molecule."],"opposite":"","synonyms":""},{"def":"to develop or create a relationship of trust with somebody","examples":["Mothers who are depressed sometimes fail to bond with their children."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]