[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bor/borde/border__us_1.mp3","phonsUS":"/ˈbɔːrdər/","level":"B1","meanings":[{"def":"the line that divides two countries or areas; the land near this line","examples":["I live in a small town in the US, near the Canadian border.","Thousands of people cross the border every day.","They took steps to secure the border.","to seal/close the border","border between A and B They spent a week in a national park on the border between Kenya and Tanzania.","(figurative) It is difficult to define the border between love and friendship.","border with something The treaty fixed Denmark's new border with Germany.","across the border They fled across the border.","over the border They live just over the border.","on the border The incident happened on Nevada's northern border.","at the border They were stopped at the border.","along the border There are tensions all along the border.","border crossings","border patrols/security/guards","border controls","a border dispute","a border town/village/county","a border region/area","a national park on the border between Kenya and Tanzania","The fence marked the boundary between my property and hers.","The river formed the frontier between the land of the Saxons and that of the Danes.","The rebels control the frontier and the surrounding area.","After the war the national boundaries were redrawn.","Thousands of people cross the boundary every day.","the boundary fence/​wall between the properties","Brazil has a common border with most South American countries.","Ethiopia shares its longest border with Somalia.","He drove us right up to the Russian border.","Poland has a common border with Germany.","There has been fighting along the border.","There has been fighting on both sides of the border.","They slipped across the border at nightfall.","We were stopped on the border.","a farm on the border of Cumbria and Yorkshire","to smuggle goods across the border"],"opposite":"","synonyms":"border"},{"def":"a long narrow piece around the edge of something such as a picture or a piece of cloth","examples":["a pillowcase with a lace border","She drew a decorative border around the picture.","The tablecloth has a narrow lace border.","a white handkerchief with a blue border"],"opposite":"","synonyms":""},{"def":"a long narrow area of soil which is planted with flowers, along the edge of the grass","examples":["The back garden is mostly lawn with herbaceous borders."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["border on","Border collie","cross-border","herbaceous border","UK Border Agency","Border collies","Canadian Border Services Agency","border on something"]},{"pos":"verb","level":"B2","meanings":[{"def":"to share a border with another country or area","examples":["the countries bordering the Baltic","a mountainous region bordering Pakistan","Albania is bordered to the north by Serbia and Montenegro."],"opposite":"","synonyms":""},{"def":"to form a line along or around the edge of something","examples":["Meadows bordered the path to the woods.","The large garden is bordered by a stream.","A hedge borders the path."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["border on"],"related":[]}]