[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bor/borro/borrow__us_2_rr.mp3","phonsUS":"/ˈbɔːrəʊ/","level":"A2","meanings":[{"def":"to take and use something that belongs to somebody else, and return it to them at a later time","examples":["borrow something Can I borrow your umbrella?","borrow something from somebody/something Members can borrow up to ten books from the library at any one time.","borrow something off somebody (British English, informal) I borrowed the tools I needed off my brother.","Can I borrow your pen?","Can I borrow a pen from you?","Here, I’ll lend you my pen.","I'll borrow some coffee off the neighbours.","I'm borrowing the office laptop for the weekend.","You can borrow the book from the local library."],"opposite":"","synonyms":""},{"def":"to take money from a person or bank and agree to pay it back to them at a later time","examples":["borrow something How much did you have to borrow to pay for this?","The goal is to borrow funds at a low interest rate.","borrow something from somebody/something She borrowed £2 000 from her parents.","borrow from somebody/something I don't like to borrow from friends.","The company had borrowed heavily from state-owned banks.","borrow something off somebody (informal) I had to borrow the money off a friend.","She borrowed £50 from her mother.","I borrowed £50 off my mum."],"opposite":"","synonyms":""},{"def":"to take words, ideas, etc. from another language, person, etc. and use them as your own","examples":["borrow (from somebody/something) The author borrows heavily from Henry James.","His designs borrow freely from the architecture of ancient Egypt.","borrow something (from somebody/something) Some musical terms are borrowed from Italian.","The villain was—to borrow a phrase from Alex—‘all bark and no bite’."],"opposite":"","synonyms":""},{"def":"to still be alive after the time when you were expected to die","examples":["He’s been living on borrowed time ever since his last heart attack."],"opposite":"","synonyms":""},{"def":"to be doing something that other people are likely to soon stop you from doing","examples":["According to the latest opinion polls, the government is living on borrowed time."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be (living) on borrowed time","def":"to still be alive after the time when you were expected to die","examples":["He’s been living on borrowed time ever since his last heart attack.","According to the latest opinion polls, the government is living on borrowed time."]}],"phrasal":[],"related":[]}]