[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bot/bothe/bother__us_1.mp3","phonsUS":"/ˈbɑːðər/","level":"B1","meanings":[{"def":"to spend time and/or energy doing something","examples":["‘Shall I wait?’ ‘No, don't bother’.","I don't know why I bother! Nobody ever listens!","If that’s all the thanks I get, I won’t bother in future!","bother with/about something It's not worth bothering with (= using) an umbrella—the car's just outside.","I don't know why you bother with that crowd (= why you spend time with them).","He doesn’t bother much about his appearance.","bother to do something He didn't even bother to let me know he was coming.","He hadn't even bothered to read the crucial documents.","Doctors never bothered to check his blood pressure.","bother doing something Why bother asking if you're not really interested?","I didn't bother trying to explain my feelings."],"opposite":"","synonyms":""},{"def":"to annoy, worry or upset somebody; to cause somebody trouble or pain","examples":["bother somebody The thing that bothers me is…","That sprained ankle is still bothering her (= hurting).","She has been bothered by a leg injury.","‘I'm sorry he was so rude to you.’ ‘It doesn't bother me.’","bother somebody with something I don't want to bother her with my problems at the moment.","bother somebody that… Does it bother you that she earns more than you?","it bothers somebody to do something It bothers me to think of her alone in that big house."],"opposite":"","synonyms":""},{"def":"to interrupt somebody; to talk to somebody when they do not want to talk to you","examples":["bother somebody Stop bothering me when I'm working.","Let me know if he bothers you again.","Sorry to bother you, but there's a call for you on line two.","Please stop bothering me with all these questions!"],"opposite":"","synonyms":""},{"def":"to think that somebody/something is important","examples":["I'm not bothered about what he thinks.","‘Where shall we eat?’ ‘I'm not bothered.’ (= I don't mind where we go.)"],"opposite":"","synonyms":""},{"def":"used to say that you do not want to spend time and/or energy doing something","examples":["I should really do some work this weekend but I can't be bothered.","All this has happened because you couldn't be bothered to give me the message."],"opposite":"","synonyms":""},{"def":"in a state of worry or stress because you are under too much pressure, have a problem, are trying to hurry, etc.","examples":[],"opposite":"","synonyms":""},{"def":"to not spend time/effort on something, because it is not important or you are not interested in it","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be bothered (about somebody/something)","def":"to think that somebody/something is important","examples":["I'm not bothered about what he thinks.","‘Where shall we eat?’ ‘I'm not bothered.’ (= I don't mind where we go.)"]},{"idiom":"can’t be bothered (to do something)","def":"used to say that you do not want to spend time and/or energy doing something","examples":["I should really do some work this weekend but I can't be bothered.","All this has happened because you couldn't be bothered to give me the message."]},{"idiom":"(all) hot and bothered","def":"in a state of worry or stress because you are under too much pressure, have a problem, are trying to hurry, etc.","examples":[]},{"idiom":"not bother yourself/your head with/about something","def":"to not spend time/effort on something, because it is not important or you are not interested in it","examples":[]}],"phrasal":[],"related":["a bother"]},{"pos":"noun","level":"","meanings":[{"def":"trouble or difficulty","examples":["You seem to have got yourself into a spot of bother.","I don't want to put you to any bother (= cause you any trouble).","Don't go to the bother of tidying up on my account (= don't make the effort to do it).","‘Thanks for your help!’ ‘It was no bother.’","Call them and save yourself the bother of going round.","I don’t mind looking after the children; they aren’t any bother.","She’s been having a bit of bother with her car.","He's got a spot of bother with his eyes.","He's having a little bother with his computer.","He's in a bit of bother with the police.","I don't mind looking after your dog—it's no bother to me.","I had a little bother finding your house.","I wouldn't go to the bother of making the cakes myself.","I'd love to come and stay with you, but I don't want to put you to any bother.","It was no bother having the children to stay.","The children were no bother.","We found the hotel without any bother.","Your little boy didn't give me any bother."],"opposite":"","synonyms":""},{"def":"an annoying situation, thing or person","examples":["I hope I haven't been a bother."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"exclamation","level":"","meanings":[{"def":"used to express the fact that you are annoyed about something/somebody","examples":["Bother! I've left my wallet at home.","Oh, bother him! He's never around when you need him."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]