[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/box/box__/box__us_1.mp3","phonsUS":"/bɑːks/","level":"A1","meanings":[{"def":"a container made of wood, thick card, metal, etc. with a flat stiff base and sides and often a lid (= cover), used especially for holding solid things","examples":["in a box Everything we owned was neatly packed in cardboard boxes.","She kept all the letters in a box.","inside a box Do you know what is inside the box?","She opened her money box to see if she had saved enough for a tennis racket.","a toolbox","a matchbox","She filled the box with old clothes.","The dog sleeps in a box lined with an old blanket.","The exhibition is free, but there is a collection box for donations.","They were sitting around the fire on upturned boxes.","This box holds ten candles and costs $21.40.","We packed all the books into boxes.","a box marked ‘fragile’"],"opposite":"","synonyms":""},{"def":"a box and its contents; the things a box contains","examples":["a box of chocolates/cereal/tissues","He produced a box of matches from his pocket.","People buy low-fat cookies and then eat the whole box."],"opposite":"","synonyms":""},{"def":"a square or rectangle on a page or computer screen for people to put information in or containing extra or different information","examples":["Put a cross in the appropriate box.","(British English) to tick a box","(North American English) to check a box","Type your query in the search box.","There are over 300 special note boxes in the dictionary.","Put a cross in the box if you agree with the comments.","Tick the appropriate box below.","The basic search screen includes two text boxes for words to be searched.","A box pops up on the monitor providing a customer profile.","Please offer your own ideas in the comment box at the end of this blog."],"opposite":"","synonyms":""},{"def":"a small area in a theatre, court or sports stadium, separated off from where other people sit","examples":["The painting depicts two elegantly dressed women in a box at the opera.","The judge addressed the 12 people seated in the jury box.","They drank champagne as they watched the game from the executive box."],"opposite":"","synonyms":""},{"def":"a small shelter used for a particular purpose","examples":["a sentry/signal box","(British English, old-fashioned) a telephone box","I called him from the phone box on the corner.","There was a babble of languages in the commentary box when the race began."],"opposite":"","synonyms":""},{"def":"the television","examples":["on the box What's on the box tonight?"],"opposite":"","synonyms":""},{"def":"a place where two roads cross or join, marked with a pattern of yellow lines to show that vehicles must not stop in that area","examples":["Only traffic turning right may enter the box."],"opposite":"","synonyms":""},{"def":"an area on a sports field that is marked by lines and used for a particular purpose","examples":["(British English) He was fouled in the box (= the penalty box)."],"opposite":"","synonyms":""},{"def":"a number used as an address, especially one given in newspaper advertisements to which replies can be sent","examples":[],"opposite":"","synonyms":""},{"def":"a piece of plastic that a man wears over his sex organs to protect them while he is playing a sport, especially cricket","examples":[],"opposite":"","synonyms":""},{"def":"a small evergreen tree or bush with thick dark leaves, used especially for garden hedges","examples":[],"opposite":"","synonyms":""},{"def":"the hard wood of the box tree","examples":[],"opposite":"","synonyms":""},{"def":"a set of methods or equipment that somebody can use","examples":["Hotel managers are using a whole new bag of tricks to attract their guests."],"opposite":"","synonyms":""},{"def":"to hit somebody with your hand on the side of their head as a punishment","examples":[],"opposite":"","synonyms":""},{"def":"to think about something, or how to do something, in a way that is new, different or shows imagination","examples":[],"opposite":"","synonyms":""},{"def":"to do exactly the right things to please somebody","examples":["This is a movie that ticks all the boxes.","The house we would like to buy ticks all our boxes."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a bag/box of tricks","def":"a set of methods or equipment that somebody can use","examples":["Hotel managers are using a whole new bag of tricks to attract their guests."]},{"idiom":"give somebody a box on the ears","def":"to hit somebody with your hand on the side of their head as a punishment","examples":[]},{"idiom":"think out of the box","def":"to think about something, or how to do something, in a way that is new, different or shows imagination","examples":[]},{"idiom":"tick all the/somebody’s boxes","def":"to do exactly the right things to please somebody","examples":["This is a movie that ticks all the boxes.","The house we would like to buy ticks all our boxes."]}],"phrasal":[],"related":["box in","PO box","big box","blue box","boom box","box kite","box room","box seat","box set","call box","cash box","cool box","fuse box","list box","nest box","out box","red box","wine box"]},{"pos":"verb","level":"","meanings":[{"def":"to fight somebody in the sport of boxing","examples":["He boxed for Ireland in the Olympics.","The newcomer boxed the champion for the full twelve rounds."],"opposite":"","synonyms":""},{"def":"to put something in a box","examples":["She boxed the decorations up and put them in the attic."],"opposite":"","synonyms":""},{"def":"to act in a clever way to get what you want, sometimes tricking somebody","examples":["Suzie realized that she had to box clever. She had to let Adam think she trusted him."],"opposite":"","synonyms":""},{"def":"to hit somebody with your hand on the side of their head as a punishment","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"box clever","def":"to act in a clever way to get what you want, sometimes tricking somebody","examples":["Suzie realized that she had to box clever. She had to let Adam think she trusted him."]},{"idiom":"box somebody’s ears","def":"to hit somebody with your hand on the side of their head as a punishment","examples":[]}],"phrasal":["box in"],"related":[]}]