[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bra/branc/branch__us_1.mp3","phonsUS":"/bræntʃ/","level":"B1","meanings":[{"def":"a part of a tree that grows out from the main stem and on which leaves, flowers and fruit grow","examples":["She climbed the tree and hid in the branches.","the bare branches of a tree in winter"],"opposite":"","synonyms":""},{"def":"a local office or shop belonging to a large company or organization","examples":["The bank has branches all over the country.","Our New York branch is dealing with the matter.","The store is opening more local branches.","He has been named assistant branch manager at a new branch of the bank.","the Post Office announced plans to close another branch."],"opposite":"","synonyms":""},{"def":"a part of a government or other large organization that deals with one particular aspect of its work","examples":["Scotland Yard's anti-terrorist branch swung into action.","The idea was so popular, other branches of government copied it.","She was national branch secretary of the union."],"opposite":"","synonyms":""},{"def":"a division of an area of knowledge or a group of languages","examples":["the branch of computer science known as ‘artificial intelligence’","Quantum analysis is a branch of statistics.","The aim is to bring together researchers from different branches of geography."],"opposite":"","synonyms":""},{"def":"a smaller or less important part of a river, road, railway, etc. that leads away from the main part","examples":["a branch of the Rhine","a branch line (= a small line off a main railway line, often in country areas)"],"opposite":"","synonyms":""},{"def":"a group of members of a family who all have the same ancestors","examples":["My uncle's branch of the family emigrated to Canada."],"opposite":"","synonyms":""},{"def":"completely and in a way that affects every part of something","examples":["The government set out to destroy the organization root and branch.","root-and-branch reforms"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"root and branch","def":"completely and in a way that affects every part of something","examples":["The government set out to destroy the organization root and branch.","root-and-branch reforms"]}],"phrasal":[],"related":["branch off","branch out","olive branch","Branch Davidians","Special Branch","executive branch","judicial branch","legislative branch","the Special Branch","branch out (into something)"]},{"pos":"verb","level":"","meanings":[{"def":"to divide into two or more parts, especially smaller or less important parts","examples":["The accident happened where the road branches."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["branch off","branch out"],"related":[]}]