[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bra/brand/brand__us_1.mp3","phonsUS":"/brænd/","level":"B1","meanings":[{"def":"a type of product, service, etc. made or offered by a particular company under a particular name","examples":["a well-known brand of toothpaste","(British English) You pay less for the supermarket's own brand.","(North American English) You pay less for the store brand.","luxury/premium brands","We compared our product with the leading brands.","How can we build our brand?","brand loyalty (= when customers continue buying the same brand)","brand awareness/recognition","brand image/values","the world's leading brand of vodka","Our main aim is to encourage brand loyalty.","The company's core brand value is consistency in quality and service.","Champagne houses owe their success to brand image.","They realize the importance of creating a consistent brand identity."],"opposite":"","synonyms":""},{"def":"a particular type or kind of something","examples":["an unorthodox brand of humour","I don’t think Bertha would appreciate your particular brand of sympathy.","This brand of rhythm and blues was different in several ways.","They developed their own brand of communism.","She has her own unique brand of humour.","His brand of sarcasm was well-known.","his particular brand of comedy"],"opposite":"","synonyms":""},{"def":"a mark made with a piece of hot metal, especially on farm animals to show who owns them","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["brand new","own-brand","Brand","brand name","store-brand","brand ambassador","Brand's Hatch","brand names","brand ambassadors"]},{"pos":"verb","level":"B1","meanings":[{"def":"to apply a brand name, image or identity to something","examples":["brand something The website was not doing a very good job of branding the company.","brand something with something Stadiums are branded with corporate logos.","brand something (as) something Their products are branded as organic.","brand itself (as) something The city is trying to brand itself a world-class capital."],"opposite":"","synonyms":""},{"def":"to describe somebody/something as being something bad or unpleasant, especially unfairly","examples":["They were branded as liars and cheats.","The newspapers branded her a hypocrite.","Her parents had long since branded her a failure."],"opposite":"","synonyms":""},{"def":"to mark an animal with a brand to show who owns it","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]