[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bre/breac/breach__us_1.mp3","phonsUS":"/briːtʃ/","level":"C1","meanings":[{"def":"a failure to do something that must be done by law","examples":["a breach of contract/copyright/warranty","They are in breach of Article 119.","(British English) (a) breach of the peace (= the crime of behaving in a noisy or violent way in public)","Selling goods constituted a breach of regulation 10B.","He was sued for breach of contract.","The court's decision is in breach of the European Convention on human rights.","This action is in breach of Article 119 of the Constitution."],"opposite":"","synonyms":""},{"def":"an action that breaks an agreement to behave in a particular way","examples":["a breach of confidence/trust","a breach of security (= when something that is normally protected is no longer secure)","Such actions constitute a breach of confidentiality.","a minor breach of discipline","He refused to shake hands, in deliberate breach of etiquette."],"opposite":"","synonyms":""},{"def":"a break in a relationship between people or countries","examples":["The disagreement caused a serious breach in Franco-German relations.","She left home following the breach with her family.","What caused the breach between the two brothers?","What had caused this sudden breach between father and son?"],"opposite":"","synonyms":""},{"def":"an opening that is created during a military attack or by strong winds or seas","examples":["They escaped through a breach in the wire fence.","A breach in the mountain wall permits warm sea air to penetrate inland.","The mortars blew a large breach in the castle walls."],"opposite":"","synonyms":""},{"def":"to do somebody’s job or work when they are suddenly or unexpectedly unable to do it","examples":["She stepped into the breach caused by Stella's illness."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"step into the breach","def":"to do somebody’s job or work when they are suddenly or unexpectedly unable to do it","examples":["She stepped into the breach caused by Stella's illness."]}],"phrasal":[],"related":[]},{"pos":"verb","level":"C1","meanings":[{"def":"to not keep to an agreement or not keep a promise","examples":["The government is accused of breaching the terms of the treaty.","A doctor was sacked for allegedly breaching patient confidentiality.","The proposed changes breached trade union rules."],"opposite":"","synonyms":""},{"def":"to make a hole in a wall, fence, etc. so that somebody/something can go through it","examples":["The dam had been breached.","Demonstrators breached police lines around the embassy."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]