[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bre/break/break__us_1.mp3","phonsUS":"/breɪk/","level":"A1","meanings":[{"def":"to be damaged and separated into two or more parts, as a result of force; to damage something in this way","examples":["All the windows broke with the force of the blast.","The bag broke under the weight of the bottles inside it.","break in/into something She dropped the plate and it broke into pieces.","The boat hit a rock and broke in half.","break something to break a cup/window","She fell off a ladder and broke her arm.","to break a leg/bone","break something in/into something He broke the chocolate in two.","The parking brake comes on by itself.","There wasn't even time for the driver to brake.","Break the biscuits into small pieces.","They left the office for a tea break.","The balloon hit a tree and burst.","The ice started to crack.","Crumble the cheese into a bowl.","Now cut the wire in two.","He fell and fractured his hip.","The vase hit the floor and shattered.","Vandals had smashed two windows.","I snapped the pencil in half.","The bag had split open on the way home.","She tore the letter into pieces.","The glass broke into hundreds of pieces.","How did this dish get broken?","I didn't mean to break the window.","She broke the bar in two and gave a piece to me."],"opposite":"","synonyms":""},{"def":"to stop working as a result of being damaged; to damage something and stop it from working","examples":["My watch has broken.","break something I think I've broken the washing machine."],"opposite":"","synonyms":""},{"def":"to cut the surface of the skin and make it bleed","examples":["The dog bit me but didn't break the skin."],"opposite":"","synonyms":""},{"def":"to do something that is against the law; to not keep a promise, etc.","examples":["I had broken the law and deserved to be punished.","People should not be allowed to break the rules.","to break a promise","to break an agreement/a contract/your word","to break an appointment (= not to come to it)","He was breaking the speed limit (= travelling faster than the law allows).","They insist that they have not broken any rules.","Would you be willing to break the law to achieve your goal?","She had broken the conditions of her bail.","She has already broken three appointments.","Some companies have broken sanctions by supplying arms to the warring states.","I've never broken my word; why should I do it now?","Perhaps it is more courageous to break a promise if it means saving the economy."],"opposite":"","synonyms":""},{"def":"to stop doing something for a while, especially when it is time to eat or have a drink","examples":["break for something Let's break for lunch.","Parliament breaks for recess next week.","We broke early and went for a drink.","break something Their sleep was broken by noise from the street.","(especially British English) We broke our journey in Oxford (= stopped in Oxford on the way to the place we were going to)."],"opposite":"","synonyms":""},{"def":"to interrupt something so that it ends suddenly","examples":["She broke the silence by coughing.","A tree broke his fall (= stopped him as he was falling).","The phone rang and broke my train of thought.","Someone laughed suddenly and the spell was broken."],"opposite":"","synonyms":""},{"def":"to make something end by using force or strong action","examples":["an attempt to break the year-long siege","Management has not succeeded in breaking the strike."],"opposite":"","synonyms":""},{"def":"to end a connection with something or a relationship with somebody","examples":["He broke all ties with his parents."],"opposite":"","synonyms":""},{"def":"to manage to get away from or out of a position in which they have been caught","examples":["He finally managed to break free from his attacker."],"opposite":"","synonyms":""},{"def":"to destroy something or make somebody/something weaker; to become weak or be destroyed","examples":["to break somebody’s morale/resistance/resolve/spirit","The government was determined to break the power of the trade unions.","The scandal broke him (= ruined his reputation and destroyed his confidence).","She broke under questioning (= was no longer able to bear it) and confessed to everything."],"opposite":"","synonyms":""},{"def":"to win a game in which it is your opponent's turn to serve (= hit the ball across the net first)","examples":["Williams broke her opponent's serve five times."],"opposite":"","synonyms":""},{"def":"to make somebody feel so sad, lonely, etc. that they cannot live a normal life","examples":["The death of his wife broke him completely."],"opposite":"","synonyms":""},{"def":"to change suddenly, usually after a period when it has been fine","examples":["On the third day the weather broke and they had a violent storm."],"opposite":"","synonyms":""},{"def":"to show an opening","examples":["The clouds broke and the sun came out."],"opposite":"","synonyms":""},{"def":"to come up through the surface of water in the sea, a pool, etc.","examples":["When his head broke the surface he took in deep gulps of air."],"opposite":"","synonyms":""},{"def":"when the day or dawn or a storm breaks, it begins","examples":["Dawn was breaking when they finally left."],"opposite":"","synonyms":""},{"def":"if a piece of news breaks, it becomes known","examples":["There was a public outcry when the scandal broke.","breaking news (= news that is arriving about events that have just happened)"],"opposite":"","synonyms":""},{"def":"to be the first to tell somebody some bad news","examples":["Who's going to break it to her?","I'm sorry to be the one to break the news to you.","Just break the news to her gently."],"opposite":"","synonyms":""},{"def":"if somebody’s voice breaks, it changes its tone because of emotion","examples":["Her voice broke as she told us the dreadful news."],"opposite":"","synonyms":""},{"def":"when a boy’s voice breaks, it becomes permanently deeper at about the age of 13 or 14","examples":[],"opposite":"","synonyms":""},{"def":"to do something better, faster, etc. than anyone has ever done it before","examples":["She had broken the world 100 metres record.","The movie broke all box-office records."],"opposite":"","synonyms":""},{"def":"when waves break, they fall and are dissolved into foam, usually near land","examples":["the sound of waves breaking on the beach","The sea was breaking over the wrecked ship."],"opposite":"","synonyms":""},{"def":"to find the meaning of something secret","examples":["to break a code"],"opposite":"","synonyms":""},{"def":"to change a banknote for coins","examples":["Can you break a twenty-dollar bill?"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["break away","break down","break for","break in","break into","break off","break out","break out in","break through","break up","break with"],"related":["break in","break-in","break up","break-up","break for","break off","break out","tax break","tea break","break away","break down","break-even","break into","break point","break time","break with","fast break","word break"]},{"pos":"noun","level":"A1","meanings":[{"def":"a short period of time when you stop what you are doing and rest, eat, etc.","examples":["She was on her lunch break.","a coffee/tea break","Let's take a break.","break for something a break for lunch","a bathroom break (= a short period when somebody stops what they are doing to use the toilet)","She worked all day without a break.","The parking brake comes on by itself.","There wasn't even time for the driver to brake.","Break the biscuits into small pieces.","They left the office for a tea break.","We stopped for a well-earned rest.","Let’s take a break.","The drug brought a brief respite from the pain.","Take time out to relax by the pool.","This delay gives the party a breathing space in which to sort out its policies.","I had a word with John during the break.","We have a 15-minute break in the morning.","We'll take a break now and resume in an hour."],"opposite":"","synonyms":"rest"},{"def":"a period of time between lessons at school","examples":["Come and see me at break."],"opposite":"","synonyms":""},{"def":"a period of time when something stops before starting again","examples":["Employees can take a career break of up to one year.","break in something a break in my daily routine","break from something He is having a break from his successful television show.","break from doing something I need a break from caring for the children.","the summer/winter break","(especially British English) the Christmas/Easter break (= the period at Christmas/Easter when most people do not work)","I need a break from mental activity.","Everyone needs a break, a change from day-to-day routine.","The team have been taking a break in Spain.","Have you got any plans for the Easter break?"],"opposite":"","synonyms":""},{"def":"a short period of time when a television or radio show stops for advertisements","examples":["More news after the break.","Most viewers tend to skip through the ad breaks."],"opposite":"","synonyms":""},{"def":"a short holiday","examples":["We had a weekend break in New York.","a well-earned break","a two/three-night break","Choose from our range of city breaks.","It's a great city for a weekend break.","I'd like to take her on a mini-break.","The prize is a three-night break in Paris.","Spend the weekend at a spa for a really relaxing break."],"opposite":"","synonyms":""},{"def":"the moment when a situation or a relationship that has existed for a time changes, ends or is interrupted","examples":["I wanted to leave but was nervous about making the break.","break with somebody/something He needed to make a complete break with the past.","a break with tradition (= a change from what is accepted, in something such as art, behaviour, etc.)","break in something a break in the weather (= a change from one type of weather to a different one)","a break in diplomatic relations","break from something This event represents a real break from tradition."],"opposite":"","synonyms":""},{"def":"a space or an opening between two or more things","examples":["We could see the moon through a break in the clouds.","Wait for a break in the traffic before crossing the road.","The track bends left through a break in the hedge."],"opposite":"","synonyms":""},{"def":"an opportunity to do something, usually to get something that you want or to achieve success","examples":["I got my lucky break when I won a ‘Young Journalist of the Year’ competition.","We've had a few bad breaks (= pieces of bad luck) along the way.","If you just give me a break, you won’t regret it.","He's the director who gave her her first big break.","It's often difficult for talented newcomers to get the break they deserve."],"opposite":"","synonyms":""},{"def":"a place where something, especially a bone in your body, has broken","examples":["The X-ray showed there was no break in his leg."],"opposite":"","synonyms":""},{"def":"a win in a game in which your opponent is serving","examples":["It was her second break in the set."],"opposite":"","synonyms":""},{"def":"a series of successful shots by one player; the number of points scored in a series of successful shots","examples":["He's put together a magnificent break.","a 147 break (= the highest possible break in snooker)","The champion began with breaks of 74 and 58."],"opposite":"","synonyms":""},{"def":"the moment in the early hours of the morning when it begins to get light","examples":[],"opposite":"","synonyms":""},{"def":"a complete end to any connection with a person, an organization, a way of life, etc.","examples":["She wanted to make a clean break with the past."],"opposite":"","synonyms":""},{"def":"a break in a bone in one place","examples":[],"opposite":"","synonyms":""},{"def":"to give somebody a chance; to not judge somebody too severely","examples":["Give the lad a break—it's only his second day on the job."],"opposite":"","synonyms":""},{"def":"used when somebody wants somebody else to stop doing or saying something that is annoying, or to stop saying something that is not true","examples":[],"opposite":"","synonyms":""},{"def":"to run towards something in order to try and escape","examples":["He suddenly leapt up and made a break for the door.","They decided to make a break for it (= to try and escape) that night."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"break of day/dawn","def":"the moment in the early hours of the morning when it begins to get light","examples":[]},{"idiom":"a clean break","def":"a complete end to any connection with a person, an organization, a way of life, etc.","examples":["She wanted to make a clean break with the past."]},{"idiom":"give somebody a break","def":"to give somebody a chance; to not judge somebody too severely","examples":["Give the lad a break—it's only his second day on the job."]},{"idiom":"give me a break!","def":"used when somebody wants somebody else to stop doing or saying something that is annoying, or to stop saying something that is not true","examples":[]},{"idiom":"make a break for something/for it","def":"to run towards something in order to try and escape","examples":["He suddenly leapt up and made a break for the door.","They decided to make a break for it (= to try and escape) that night."]}],"phrasal":[],"related":[]}]