[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bri/brief/brief__us_1.mp3","phonsUS":"/briːf/","level":"B2","meanings":[{"def":"lasting only a short time; short","examples":["a brief visit/meeting/conversation","Mozart's life was brief.","He said nothing during the brief court appearance.","a brief pause/silence","Susan and Mary were enjoying a brief moment of solitude.","He died after a relatively brief period of suffering.","Could you make it brief? I've got a meeting in ten minutes.","The wait was mercifully brief, little more than an hour.","Sean gave a brief glance at the screen.","The prime minister is due to make a brief visit to South Korea.","There was a brief silence after I made my announcement."],"opposite":"","synonyms":""},{"def":"using few words","examples":["a brief description/summary/overview","Please be brief (= say what you want to say quickly).","I will keep my comments brief.","Section 1 of the book gives a brief history of Mexico.","I made a brief introductory statement and our meeting began.","I promised to be brief.","The diary entries were tantalizingly brief.","This necessarily brief account concentrates on two main areas.","David gave me a brief summary of what was said at the meeting.","He began with a brief introduction.","Saunders's lawyer made a brief statement to the press outside the court.","The author makes only a brief mention of the role of Japan in this period.","The leaflet provides a brief description of the changes to the benefits system."],"opposite":"","synonyms":""},{"def":"short and not covering much of the body","examples":["a brief skirt"],"opposite":"","synonyms":""},{"def":"in a few words, without details","examples":["In brief, the meeting was a disaster.","Now the rest of the news in brief."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in brief","def":"in a few words, without details","examples":["In brief, the meeting was a disaster.","Now the rest of the news in brief."]}],"phrasal":[],"related":["Brief Lives","Brief Encounter","watching brief","hold no brief for somebody/something"]},{"pos":"noun","level":"","meanings":[{"def":"the instructions that a person is given explaining what their job is and what their duties are","examples":["It wasn't part of his brief to speak to the press.","I was given the brief of reorganizing the department.","to stick to your brief (= to only do what you are asked to do)","to prepare/produce a brief for somebody","He told me to stick to my brief.","How the new policy is to be implemented is outside his brief.","It's not part of my brief to advise on financial matters.","She makes all these points in her brief.","a technical brief on food hygiene"],"opposite":"","synonyms":""},{"def":"a legal case that is given to a lawyer to argue in court; a piece of work for a barrister","examples":["Will you accept this brief?"],"opposite":"","synonyms":""},{"def":"a written summary of the facts that support one side of a legal case that will be presented to a court","examples":[],"opposite":"","synonyms":""},{"def":"a solicitor or a defence lawyer","examples":["I want to see my brief."],"opposite":"","synonyms":""},{"def":"the detailed instructions or information that are given at such a meeting","examples":["Officials are pushing for this target to be included in the next presidential brief.","We were given daily briefs by the commander."],"opposite":"","synonyms":""},{"def":"to not support or be in favour of somebody/something","examples":["I hold no brief for either side in this war."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"hold no brief for somebody/something","def":"to not support or be in favour of somebody/something","examples":["I hold no brief for either side in this war."]}],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to give somebody information about something so that they are prepared to deal with it","examples":["brief somebody I expect to be kept fully briefed at all times.","brief somebody on/about something The officer briefed her on what to expect.","Each member of my crew took it in turn to brief me on his particular duties.","The men have been fully briefed about the intended mission."],"opposite":"","synonyms":""},{"def":"to give a lawyer, especially a barrister, the main facts of a legal case so that it can be argued in court","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]