[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bud/budge/budget__us_1.mp3","phonsUS":"/ˈbʌdʒɪt/","level":"B2","meanings":[{"def":"the money that is available to a person or an organization and a plan of how it will be spent over a period of time","examples":["an annual budget of £10 million","a balanced budget (= one where the amount spent matches the amount available)","Many families struggle to balance the household budget.","to cut/slash a budget","the education/defence budget (= the amount of money that can be spent on this)","an advertising budget of $2 million","It's one of those big-budget Hollywood movies.","on a budget We decorated the house on a tight budget (= without much money to spend).","on/within budget The work was finished on time and within budget (= did not cost more money than was planned).","over budget They went over budget (= spent too much money).","under/below budget The project came in under budget.","in the budget Is there any money left in the budget?","The hospital now faces severe budget cuts.","a budget surplus/shortfall (= when there is more/less money than is needed)","All her projects are on time and on budget.","Costs have been held below budget.","The project is now well over budget.","The company must not go over budget.","The IT department manages its own budget.","The organization has a large annual budget.","The budget for next year has not yet been set.","The city has drawn up its budget for next year.","Work out a weekly budget and stick to it.","They spent their entire budget on a new kitchen.","The school has a struggle to balance its budget.","The museum's operating budget for this year is just over $2 million.","This hotel caters for people on a tight budget.","The film was was made on a shoestring budget.","The government is planning to double the education budget.","The museum has an annual budget of £3 million with which to acquire new works of art."],"opposite":"","synonyms":""},{"def":"an official statement by the government of a country’s income from taxes, etc. and how it will be spent","examples":["Tax cuts are expected to be a major part of this year's Budget.","a budget deficit (= when the government spends more money than it earns)","The finance ministry is trying to reduce the budget deficit.","Military spending accounts for around 17% of the federal budget."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["big-budget","low-budget","budget account","Office of Management and Budget","budget accounts","Congressional Budget Office"]},{"pos":"verb","level":"","meanings":[{"def":"to be careful about the amount of money you spend; to plan to spend an amount of money for a particular purpose","examples":["If we budget carefully we'll be able to afford the trip.","budget for something I've budgeted for two new members of staff.","budget something (for something) Ten million euros has been budgeted for the project.","We have budgeted $10 000 for advertising.","budget something (at something) The project has been budgeted at ten million euros.","I’m saving for a new car.","If we budget carefully we’ll be able to afford the trip.","With the price increases, we are all having to tighten our belts."],"opposite":"","synonyms":"save"}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adjective","level":"","meanings":[{"def":"low in price","examples":["a budget flight/hotel","Save pounds on budget flights to the sun."],"opposite":"","synonyms":"cheap"}],"idioms":[],"phrasal":[],"related":[]}]