[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/b/bus/bus__/bus__us_1.mp3","phonsUS":"/bʌs/","level":"A1","meanings":[{"def":"a large road vehicle that carries passengers, especially one that travels along a fixed route and stops regularly to let people get on and off","examples":["by bus Shall we walk or go by bus?","I didn't want to get on the wrong bus.","Many students board the school bus before 7 a.m.","He was seriously injured when the band's tour bus crashed.","I was going to catch the airport shuttle bus.","(US English) I ride the city bus every day.","a bus company/driver","A regular bus service connects the train station with the town centre.","He can't afford the bus fare into the city.","I left work a bit late and had to run for my bus.","I missed the last bus and had to walk.","I waited 40 minutes for a bus.","Is this the bus for Oxford?","It's about 15 minutes away by bus.","Local buses run regularly to and from the campus.","Look up the bus schedule on the internet.","Look up the bus times in the local timetable.","The bus left the city, heading north.","The bus pulled up and we got on.","The buses stop outside the post office.","The double-decker bus stopped to pick up some more passengers.","There are regular buses to the beach.","We took the bus from Reading to Bristol.","a bus carrying 56 passengers","a four-hour bus journey over the mountains","a short bus journey to work","people travelling on buses","people who travel on buses","the bus from Charlottesville to Union Station","the bus into town","Have you got a bus timetable?","It's a short bus ride from here.","The map shows all the local bus routes.","There is a bus, the number 18, which stops outside the house.","When we go on a double-decker bus the children always want to sit upstairs."],"opposite":"","synonyms":""},{"def":"a set of wires that carries information from one part of a computer system to another","examples":[],"opposite":"","synonyms":""},{"def":"to make somebody else suffer in order to save yourself or gain an advantage for yourself","examples":["Plenty of my co-workers are satisfied to throw everyone else under the bus as long as they keep their wages."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"throw somebody under the bus","def":"to make somebody else suffer in order to save yourself or gain an advantage for yourself","examples":["Plenty of my co-workers are satisfied to throw everyone else under the bus as long as they keep their wages."]}],"phrasal":[],"related":["bus lane","bus pass","bus stop","bendy bus","bus stand","local bus","bus shelter","bus station","walking bus","Greyhound bus","bus lanes","bus stops","bus shelters","bus stations","universal serial bus"]},{"pos":"verb","level":"","meanings":[{"def":"to transport somebody by bus","examples":["We were bussed from the airport to our hotel."],"opposite":"","synonyms":""},{"def":"(in the US) to transport young people by bus to another area as a way of integrating schools (= having them educate black and white children together)","examples":[],"opposite":"","synonyms":""},{"def":"to take the dirty plates, etc. off the tables in a restaurant, as a job","examples":["He buses tables to help finance his tuition."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]