[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cal/calcu/calculate__us_1.mp3","phonsUS":"/ˈkælkjuleɪt/","level":"B2","meanings":[{"def":"to use numbers to find out a total number, amount, distance, etc.","examples":["calculate something An independent valuer will calculate the value of your property.","That figure was calculated using the standard equation.","Use the formula to calculate the volume of the container.","We haven’t really calculated the cost of the vacation yet.","Benefit is calculated on the basis of average weekly earnings.","calculate something from something Expected cancer rates were calculated from data from the eight surrounding counties.","calculate something by something The daily doses were calculated by a somewhat simpler method.","calculate something by doing something The ratio is calculated by dividing a company's share price by its earnings per share.","calculate how much, what, etc. You'll need to calculate how much time the assignment will take.","it is calculated that… It has been calculated that at least 47 000 jobs were lost last year.","be calculated at… The sum involved was calculated at $82 million.","It's difficult to calculate precisely what we've spent.","The amount is calculated according to the number of years you have paid into the plan."],"opposite":"","synonyms":""},{"def":"to guess something or form an opinion by using all the information available","examples":["calculate that… Conservationists calculate that hundreds of species could be lost in this area.","calculate how much, what, etc. It is impossible to calculate what influence he had on her life.","calculate something It's impossible to calculate the extent of his influence on her.","Calculating that he would not be home yet, I slipped in through the back door.","Environmentalists calculate that hundreds of plant species may be affected.","I tried to calculate how much time it would take me to get there."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]