[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cam/campa/campaign__us_2.mp3","phonsUS":"/kæmˈpeɪn/","level":"B1","meanings":[{"def":"a series of planned activities that are intended to achieve a particular social, commercial or political aim","examples":["an anti-smoking campaign","an advertising/a marketing campaign","an election campaign","the recent presidential campaign","campaign for something the campaign for parliamentary reform","campaign against something a campaign against ageism in the workplace","campaign to do something Today police launched a campaign to reduce road accidents.","They began a grass-roots campaign to encourage people to shop locally.","to mount/start a campaign","to run/lead/spearhead a campaign","Both sides have been accused of waging a dirty campaign.","the governor's campaign manager","The candidates are on the campaign trail (= travelling around to attract support).","the campaign for parliamentary reform","an advertising campaign","She finally won the legal battle for compensation.","the endless battle between man and nature","the struggle for independence","the struggle between good and evil","the drive for greater efficiency","a drive to reduce energy consumption","the war against crime","Workers won their fight to stop compulsory redundancies.","She led the campaign for parliamentary reform.","the campaign for racial equality","A campaign of intimidation was waged against people trying to vote.","Local people started a petition and letter-writing campaign to keep the hospital open.","She has fought a one-woman campaign for ten years about the lack of childcare provision in the town.","She led a successful campaign against the closure of the library.","The campaign failed to achieve its objectives.","The anti-fur organization financed an ad campaign featuring celebrities.","The campaign aims to inform the public of the dangers of this disease.","a carefully orchestrated campaign against striking workers","The campaign featured athletes talking about healthy lifestyles.","a concerted campaign aimed at educating young people about the dangers of drugs","After sliding in the opinion polls, the party had to rethink its plan of campaign.","The company launched a huge advertising campaign.","The advertising campaign was responsible for the massive rise in sales.","We designed an internet marketing campaign.","The general election campaign gets underway today.","A news conference was held at the party's campaign headquarters.","Education has become an important campaign issue.","People have criticized the way in which she conducted her election campaign.","The President kept his campaign promises.","a health awareness campaign to promote a healthy lifestyle","election candidates on the campaign trail","The terrorists responded with a bombing campaign directed at business and commerce."],"opposite":"","synonyms":"campaign"},{"def":"a series of attacks and battles that are intended to achieve a particular military aim during a war","examples":["the North African campaign","a bombing campaign","Air battles had dominated the campaign.","The government has intensified the military campaign against the rebels.","The Russian campaign ended with the German defeat at Stalingrad."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["defiance campaign","whispering campaign","Plain English Campaign","whistle-stop campaign","Campaign for Real Ale","Campaign for Nuclear Disarmament","Campaign to Protect Rural England"]},{"pos":"verb","level":"B1","meanings":[{"def":"to take part in or lead a campaign, for example to achieve social or political change, or in order to win an election","examples":["The party campaigned vigorously in the north of the country.","campaign for somebody/something She has campaigned tirelessly for their release.","campaign against somebody/something We have actively campaigned against whaling for the last 15 years.","She campaigned on a pro-business platform (= with policies to help business).","We campaign on behalf of consumers.","campaign to do something They are campaigning to save the area from building development.","We will campaign hard for an end to the ivory trade.","Local communities have successfully campaigned against the dumping of toxic waste.","The group campaigns on a range of environmental issues."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]