[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cap/capac/capacity__us_3.mp3","phonsUS":"/kəˈpæsəti/","level":"B2","meanings":[{"def":"the number of things or people that a container or space can hold","examples":["a fuel tank with a maximum capacity of 50 litres","The theatre has a seating capacity of 2 000.","a hard disk storage capacity of 1 000 gigabytes","large capacity disk drives","to capacity The hall was filled to capacity (= was completely full).","They played to a capacity crowd (= one that filled all the space or seats)."],"opposite":"","synonyms":""},{"def":"the ability to understand or to do something","examples":["mental/intellectual capacity","capacity for something She has an enormous capacity for hard work.","capacity for doing something Limited resources are restricting our capacity for developing new products.","capacity to do something A habit becomes an addiction when it reduces your capacity to enjoy life.","beyond/within somebody's capacity The mountain walk is well within the capacity of most fit people.","His capacity for learning languages astonished me.","She seems to have lost the capacity to enjoy herself.","These questions are beyond the capacity of most students.","The qualification should increase my earning capacity."],"opposite":"","synonyms":""},{"def":"the official position or function that somebody has","examples":["in a… capacity We are simply involved in an advisory capacity on the project.","to do something in a business/judicial/professional/voluntary capacity","in your capacity as something She was acting in her capacity as manager.","In my capacity as president, I would like to thank Jack for his hard work."],"opposite":"","synonyms":""},{"def":"the quantity that a factory, machine, etc. can produce","examples":["The downturn in the business cycle left the plant with excess capacity.","Spare oil production capacity will probably remain low.","at capacity The factory is working at (full) capacity."],"opposite":"","synonyms":""},{"def":"the size or power of a piece of equipment, especially the engine of a vehicle","examples":["an engine with a capacity of 1 600 cc"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["heat capacity","diminished capacity"]}]