[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cap/captu/capture__us_2.mp3","phonsUS":"/ˈkæptʃər/","level":"B2","meanings":[{"def":"to catch a person or an animal and keep them as a prisoner or shut them in a space that they cannot escape from","examples":["Allied troops captured over 300 enemy soldiers.","The animals are captured in nets and sold to local zoos."],"opposite":"","synonyms":""},{"def":"to take control of a place, building, etc. using force","examples":["The city was captured in 1941."],"opposite":"","synonyms":""},{"def":"to succeed in getting control or possession of something that other people are also trying to get","examples":["The company has captured 90 per cent of the market.","He captured the world championship title in 2018."],"opposite":"","synonyms":""},{"def":"to make somebody interested in something","examples":["The project has captured the imagination of the local public.","His story captured the attention of Hollywood."],"opposite":"","synonyms":""},{"def":"to succeed in accurately expressing a feeling, an atmosphere, etc. in a picture, piece of writing, film, etc.","examples":["Her photos capture the essence of her subjects.","The song captures the spirit of those times.","They have captured a moment in people's lives.","That description captures perfectly the feeling of being invisible.","The article captured the mood of the nation.","The exhibition on India fails to capture the great diversity of this fascinating country."],"opposite":"","synonyms":""},{"def":"to photograph, film, record, paint, etc. somebody/something","examples":["capture something The photographer's camera captures images of extreme beauty.","capture somebody/something on something The attack was captured on film by security cameras."],"opposite":"","synonyms":""},{"def":"to make somebody love you","examples":[],"opposite":"","synonyms":""},{"def":"to put something into a computer in a form it can use","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["data capture","state capture","carbon capture and storage","carbon capture and storages","carbon capture and sequestration"]},{"pos":"noun","level":"B2","meanings":[{"def":"the act of capturing somebody/something or of being captured","examples":["He evaded capture for three days.","to elude/avoid capture","They narrowly escaped capture several times.","This information led to the capture of the murderer."],"opposite":"","synonyms":""},{"def":"the act of taking control of a place, building, etc. using force","examples":["the capture of enemy territory"],"opposite":"","synonyms":""},{"def":"the act or process of recording something, especially using computers","examples":["image/video capture","I have provided a series of screen captures (= images of what was on a screen) below.","It was the first movie to use motion capture for its entire length."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]