[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/car/car__/car__us_2.mp3","phonsUS":"/kɑːr/","level":"A1","meanings":[{"def":"a road vehicle with an engine and four wheels that can carry a small number of passengers","examples":["Paula got into the car and drove off.","by car How did you come?’ ‘By car.’","in a/the car Are you going in the car?","Her husband was driving the car at the time of the accident.","Where can I park the car?","There were parked cars on both sides of the road.","a car driver/manufacturer/dealer","a car accident/crash","I can't find my car keys.","He pulled his car over at a small hotel.","She swerved her car sharply to the right.","Her car skidded on a patch of ice.","His car hit a van coming in the opposite direction.","I lost control of the car and it spun off the road.","The red car suddenly pulled out in front of me.","I'll wait for you in the car.","It's too far to walk. I'll take the car.","The kids all piled into the car.","It's very expensive to run a car these days.","I have to take the car in for a service.","The car does 55 miles per gallon.","The car was doing over 100 miles an hour.","The government wants more people to use public transport instead of private cars.","The number of cars on the road is increasing all the time.","Police in an unmarked car had been following the stolen vehicle for several minutes.","The robbers abandoned their getaway car and ran off.","The driver crashed the stolen car while being chased by the police.","There was a line of parked cars in front of the building.","He opened the car door for her.","I can put the wheelchair in the back of the car.","I decided to buy a second-hand car.","They parked the car and walked the rest of the way."],"opposite":"","synonyms":""},{"def":"a separate section of a train","examples":["Several cars went off the rails."],"opposite":"","synonyms":""},{"def":"a car on a train of a particular type","examples":["a sleeping/dining car"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["in-car","car bomb","car bra","car coat","car park","car pool","car seat","car tax","car wash","club car","race car","cable car","car crash","car phone","motor car","panda car","squad car","stock car","baggage car"]}]