[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/car/caref/careful__us_2.mp3","phonsUS":"/ˈkerfl/","level":"A2","meanings":[{"def":"giving attention or thought to what you are doing so that you avoid hurting yourself, damaging something or doing something wrong","examples":["Be careful!","careful to do something He was careful to keep out of sight.","He's been careful to avoid significant debt.","careful not to do something Be careful not to wake the baby.","careful when/what/how, etc. You must be careful when handling chemicals.","Be careful what you say.","careful of/with something Please be careful with my glasses (= Don't break them).","Be careful of the traffic.","careful about something As a young actor, you have to be extremely careful about the roles you accept.","careful about doing something I’m very careful about washing my hands before eating (= I make sure I do it).","careful (that)… Be careful you don't bump your head.","Look out! There's a car coming.","Be careful. It can be quite dangerous on that path.","Watch out. That's not a very safe place at night.","Make sure you keep hold of your bag.","I wouldn't do that if I were you.","Be particularly careful when swimming in the lake.","Bitter past experience had made her careful of what she confided to Nadia.","He's very careful of his reputation.","She was quite careful about how she spoke to him.","I'm very careful about washing my hands before eating."],"opposite":"","synonyms":""},{"def":"giving a lot of attention to details","examples":["After careful consideration we have decided to offer you the job.","A successful party requires careful planning.","He praised the careful attention to detail shown by the report's authors.","She made a careful analysis of the evidence.","Careful study of finds from archaeological sites has confirmed this theory.","This is a very careful piece of work.","A careful examination of the facts suggests a different conclusion."],"opposite":"careless","synonyms":""},{"def":"not spending money on things that are unimportant","examples":["His mother had always been careful with money."],"opposite":"","synonyms":""},{"def":"used to warn somebody that they should take care to avoid danger or problems","examples":["Don't stay out in the sun for too long—you can't be too careful."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"careful with money","def":"not spending money on things that are unimportant","examples":["His mother had always been careful with money."]},{"idiom":"you can’t be too careful","def":"used to warn somebody that they should take care to avoid danger or problems","examples":["Don't stay out in the sun for too long—you can't be too careful."]}],"phrasal":[],"related":[]}]