[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/car/caree/career__us_2.mp3","phonsUS":"/kəˈrɪr/","level":"A1","meanings":[{"def":"the series of jobs that a person has in a particular area of work, usually involving more responsibility as time passes","examples":["a teaching career","career in something She plans to pursue a career in medicine.","He had a successful career in television journalism.","career as something He enjoyed a long and distinguished career as a historian.","She has been concentrating on her career.","a change of career","That will be a good career move (= something that will help your career).","We wish our graduates every success in whatever career path they have chosen.","a career soldier/diplomat (= a professional one)","(British English) a careers adviser/officer (= a person whose job is to give people advice and information about jobs)","It’s very difficult to find work at the moment.","Only half the people here are in paid employment.","He had a very distinguished career in the Foreign Office.","He hopes to enter the medical profession.","Please state your name, age, and occupation.","Carpentry is a highly skilled trade.","He did a film for Hollywood to boost his flagging career.","She had a distinguished career as a diplomat.","He has had a somewhat chequered career.","He made a good career for himself in football.","She achieved a lot in her chosen career.","She pursued a successful career in medicine.","The movie revived his flagging career.","The profession has no clear career structure.","It's time for a career change.","What made you decide on a career as a vet?","Kelly's career took off when she was spotted at a talent contest.","She was on the first step of the career ladder.","Students can get free careers advice between 6.30 and 8.30 each evening.","The course focuses on your career development."],"opposite":"","synonyms":"work"},{"def":"the period of time that you spend in your life working or doing a particular thing","examples":["She started her career as an English teacher.","He began his professional boxing career in 1998.","He is playing the best tennis of his career.","My school career was not very impressive.","in somebody's career This was a turning point in her career.","throughout/during somebody's career He has had injury problems throughout his career.","She has spent her entire career in education.","That was the album that launched his recording career.","Her stage career spans sixty years.","She started her working career as a waitress.","She was at the peak of her career when she injured herself.","His performance as Al in the movie was a career high.","He was the first golfer to surpass $2 million in career earnings."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["career break","career woman","career breaks"]},{"pos":"verb","level":"","meanings":[{"def":"to move forward very quickly, especially in a way that shows a loss of control","examples":["The vehicle careered across the road and hit a cyclist.","A sudden gust caught her hat and sent it careering wildly down the road.","A bunch of children were careering around the playground.","The bike was careering down the hill.","The car careered out of control and plunged into a river."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]