[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/car/carve/carve__us_1.mp3","phonsUS":"/kɑːrv/","level":"C1","meanings":[{"def":"to make objects, patterns, etc. by cutting away material from a piece of wood or stone, or another hard material","examples":["carve something a carved doorway","carve something from/out of something The statue was carved out of a single piece of stone.","The beads were carved from solid ivory.","carve something into/in something The wood had been carved into the shape of a flower.","(figurative) Over the centuries, melting snow had carved valleys in the landscape.","carve in something She carves in both stone and wood."],"opposite":"","synonyms":""},{"def":"to write something on a surface by cutting into it","examples":["They carved their initials on the desk.","A Latin inscription had been carved on the lid of the box."],"opposite":"","synonyms":""},{"def":"to cut a large piece of cooked meat into smaller pieces for eating","examples":["carve (something) | carve (somebody) something Who's going to carve the turkey?","Lunch is ready. Who's going to carve?","She taught me how to carve a leg of lamb.","We watched as the waiter expertly carved the duck."],"opposite":"","synonyms":""},{"def":"to work hard in order to have a successful career, reputation, etc.","examples":["carve something (out) He succeeded in carving out a career in the media.","carve something (out) for yourself She has carved a place for herself in the fashion world."],"opposite":"","synonyms":""},{"def":"unable to be changed","examples":["People should remember that our proposals aren't set in stone.","These rules are not set in stone."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"carved/set in stone","def":"unable to be changed","examples":["People should remember that our proposals aren't set in stone.","These rules are not set in stone."]}],"phrasal":["carve up"],"related":["carve up","carve-up","carve-ups","carve something"]}]