[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cas/case_/case__us_1.mp3","phonsUS":"/keɪs/","level":"A2","meanings":[{"def":"a particular situation or a situation of a particular type","examples":["in… cases In some cases people have had to wait several weeks for an appointment.","In most cases the increases have been marginal.","In many cases it is the pressure of the job that causes managers to behave like this.","What should be done in such cases?","The substances causes nausea, sickness and, in extreme cases, death.","in cases of something The company only dismisses its employees in cases of gross misconduct.","in the case of something In the case of banks, the law can limit activities.","Sometimes compost isn't enough, in which case artificial products may have to be used.","a case of something It's a classic case (= a very typical case) of bad planning.","This appears to be a case of mistaken identity.","Can you give me an example of what you mean?","In some cases people have had to wait several weeks for an appointment.","The report highlights a number of instances of injustice.","The aquarium has some interesting specimens of unusual tropical fish.","The statistics are a clear illustration of the point I am trying to make.","the present economic situation","The ship sank in mysterious circumstances.","She felt she was in a position of power.","We were forced to work outside in freezing conditions.","Hi, Jane! How are things?","Think things over before you decide.","If that is the case (= if the situation described is true), we need more staff.","How did this unhappy state of affairs come about?","Except in a few rare cases, bee stings are not dangerous.","It was a simple case of mistaken identity.","The committee has full powers to deal with any cases of malpractice that arise.","There have been documented cases of officials accepting bribes.","a case of animal cruelty","cases alleging violations of international law"],"opposite":"","synonyms":"example"},{"def":"the true situation","examples":["be the case If that is the case (= if the situation described is true), we need more staff.","it's the case that… It is simply not the case that prison conditions are improving.","It remains the case that not enough graduates are going into teaching."],"opposite":"","synonyms":""},{"def":"a situation that relates to a particular person or thing","examples":["in somebody's case I cannot make an exception in your case (= for you and not for others).","In your case, we are prepared to be lenient.","in this case Don't underestimate the power of the pen, or in this case, the power of the keyboard.","In the present case, the facts are not disputed.","Every application will be decided on a case-by-case basis (= each one will be considered separately).","Can you give me an example of what you mean?","In some cases people have had to wait several weeks for an appointment.","The report highlights a number of instances of injustice.","The aquarium has some interesting specimens of unusual tropical fish.","The statistics are a clear illustration of the point I am trying to make.","In her case, she failed the exam because she wasn't well.","He highlighted the case of Harry Farr, who was executed in 1916.","Complaints are dealt with on a case by case basis.","The teacher must judge each case according to its merits.","Let's consider the case of a dealer trying to make a sale."],"opposite":"","synonyms":"example"},{"def":"a matter that is being officially investigated, especially by the police","examples":["They never solved the Jones murder case.","Police believe it is a simple case of theft.","Four officers are investigating the case.","The case hinged on the evidence of the only witness to the killing.","This was the hardest case she had handled since becoming a lawyer.","the notorious case of the Botley strangler","The book is about the notorious case of the Lindbergh kidnapping.","He was looking through some homicide case files.","The judge ruled that the defendant had no case to answer, as the evidence had been discredited.","As a lawyer he was involved in high-profile divorce cases.","Carter was the senior case officer on the investigation.","The case raises a number of issues.","No lawyer would take his case.","a compensation case involving thousands of workers","The disciplinary committee considered the merits of his case before fining him.","The union has taken up the case of the suspended worker.","The local MP has taken up the case of the family of six who have been left homeless."],"opposite":"","synonyms":""},{"def":"a question to be decided in court","examples":["a court case","a criminal/civil case","The case will be heard next week.","The Supreme Court heard the case yesterday.","to win/lose a case","When does her case come before the court?","the evidence in the case","She lost the case and was ordered to pay legal fees.","The case against her collapsed when a key witness was proved to have lied.","The case came before Judge Hales in the Crown Court.","The case will be heard in a higher court.","The case was thrown out for lack of evidence.","The case was settled out of court.","The jury are required to be unanimous in death-penalty cases.","He brought a case challenging the legality of the war.","He brought the case to the Supreme Court.","The prosecution decided to drop the case.","He was so clearly innocent, the case should never have gone to court.","He pledged to bring a case of constructive dismissal against the government."],"opposite":"","synonyms":""},{"def":"a set of facts or arguments that support one side in a trial, a discussion, etc.","examples":["Our lawyer didn't think we had a case (= had enough good arguments to win in a court of law).","case for something the case for the defence/prosecution","case against somebody/something The case against her was very weak.","Let us consider the case for and against private education.","case for doing something The report makes out a strong case (= gives good arguments) for spending more money on hospitals.","He successfully argued the case for accepting the agreement.","case that… They try to make the case that this war is necessary.","You will each be given the change to state your case.","The defendant requested more time to prepare his case.","There is a good prima facie case for believing what she says.","What evidence do you have to support your case?","The new evidence weakened the case for the defence.","I thought she argued her case very well.","I agree with him, but don't you think he slightly overstates the case?","You can make out a case for changing our teaching methods.","With his current superb form, he presents an unanswerable case for selection in the team.","a case against wearing business attire","The report makes out a strong case for spending more money on hospitals.","Is there a case against wearing school uniforms?","A strong case exists for adopting a similar system in this country."],"opposite":"","synonyms":""},{"def":"a container or cover used to protect or store things; a container with its contents or the amount that it contains","examples":["a jewellery case","The museum was full of stuffed animals in glass cases.","case of something a case (= 12 bottles) of champagne","He put the binoculars back in their carrying case.","She kept all her trophies in a display case.","The winner will receive a case of champagne.","a gold watch in a presentation case"],"opposite":"","synonyms":""},{"def":"a container with flat sides and a handle, used for carrying clothes, etc. when you are travelling","examples":["Let me carry your case for you.","a packing case","They put their cases in the boot and drove off.","She wanted to pack her case and leave immediately.","I left my cases at the hotel and set off to meet him."],"opposite":"","synonyms":""},{"def":"the fact of somebody having a disease or an injury; a person who has a disease or an injury","examples":["a severe case of food poisoning","Over 130 000 cases of cholera were reported in 2016.","The most serious cases were treated at the scene of the accident.","He had contracted a severe case of pneumonia.","He claims there has never been a case of food poisoning at his restaurant.","Two million new cases of hypertension are diagnosed each year.","There have been no confirmed cases of BSE in the US.","The Department of Health reported five human cases of bird flu.","He had a bad case of appendicitis.","About 25% of AIDS cases are linked with the sharing of needles."],"opposite":"","synonyms":""},{"def":"a person who needs, or is thought to need, special treatment or attention","examples":["He's a hopeless case.","After the exams, the teacher gave all borderline cases a spoken test."],"opposite":"","synonyms":""},{"def":"the form of a noun, an adjective or a pronoun in some languages, that shows its relationship to another word","examples":["the nominative/accusative/genitive case","Latin nouns have case, number and gender.","In Polish the verb ‘to be’ takes the instrumental case."],"opposite":"","synonyms":""},{"def":"used to say that one of two or more possibilities is true, but which one is true depends on the circumstances","examples":["There may be an announcement about this tomorrow—or not, as the case may be."],"opposite":"","synonyms":""},{"def":"to criticize somebody all the time","examples":["She's always on my case about cleaning my room."],"opposite":"","synonyms":""},{"def":"to be dealing with a particular matter, especially a criminal investigation","examples":["We have two agents on the case."],"opposite":"","synonyms":""},{"def":"a clear example of the problem, situation, etc. that is being discussed","examples":["Many professions feel they deserve higher pay, and nurses are a case in point.","The website has a variety of interactive exercises (e.g. matching games, crosswords and quizzes).","The website has a variety of interactive exercises, including matching games, crosswords and quizzes.","Internet technologies, such as wikis, blogs and social networking sites, have changed the way that people find information and interact with it.","Many websites allow users to contribute information. A good example of this is the ‘wiki’, a type of website that anyone can edit.","Wikis vary in how open they are. For example, some wikis allow anybody to edit content, while others only allow registered users to do this.","Wikis vary in how open they are. Some wikis, for example/for instance, allow anybody to edit content, while others only allow registered users to do this.","More and more people read their news on the internet. To take one example, over 14 million people now read the online version of ‘The Oxford Herald’.","Online newspapers are now more popular than paper ones. ‘The Oxford Herald’ is a case in point. Its print circulation has fallen in recent years, while its website attracts millions of users every month."],"opposite":"","synonyms":""},{"def":"a situation in business, politics, etc. where there is a lot of competition and people are willing to harm each other in order to succeed","examples":["I'm afraid in this line of work it's a case of dog eat dog.","We're operating in a dog-eat-dog world."],"opposite":"","synonyms":""},{"def":"used to tell somebody to stop criticizing you","examples":[],"opposite":"","synonyms":""},{"def":"whatever happens or may have happened","examples":["There's no point complaining now—we're leaving tomorrow in any case."],"opposite":"","synonyms":""},{"def":"because of the possibility of something happening","examples":["You'd better take the keys in case I'm out.","You probably won't need to call—but take my number, just in case.","In case (= if it is true that) you’re wondering why Jo’s here—let me explain…"],"opposite":"","synonyms":""},{"def":"if something happens","examples":["In case of fire, ring the alarm bell."],"opposite":"","synonyms":""},{"def":"if that happens or has happened; if that is the situation","examples":["‘I’ve made up my mind.’ ‘In that case, there’s no point discussing it.’"],"opposite":"","synonyms":""},{"def":"used to say that you do not need to say any more about something because you think that you have proved your point","examples":[],"opposite":"","synonyms":""},{"def":"used by lawyers in court to say that they have finished presenting their case","examples":["The prosecution rests its case."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"as the case may be","def":"used to say that one of two or more possibilities is true, but which one is true depends on the circumstances","examples":["There may be an announcement about this tomorrow—or not, as the case may be."]},{"idiom":"be on somebody’s case","def":"to criticize somebody all the time","examples":["She's always on my case about cleaning my room."]},{"idiom":"be on the case","def":"to be dealing with a particular matter, especially a criminal investigation","examples":["We have two agents on the case."]},{"idiom":"a case in point","def":"a clear example of the problem, situation, etc. that is being discussed","examples":["Many professions feel they deserve higher pay, and nurses are a case in point.","The website has a variety of interactive exercises (e.g. matching games, crosswords and quizzes).","The website has a variety of interactive exercises, including matching games, crosswords and quizzes.","Internet technologies, such as wikis, blogs and social networking sites, have changed the way that people find information and interact with it.","Many websites allow users to contribute information. A good example of this is the ‘wiki’, a type of website that anyone can edit.","Wikis vary in how open they are. For example, some wikis allow anybody to edit content, while others only allow registered users to do this.","Wikis vary in how open they are. Some wikis, for example/for instance, allow anybody to edit content, while others only allow registered users to do this.","More and more people read their news on the internet. To take one example, over 14 million people now read the online version of ‘The Oxford Herald’.","Online newspapers are now more popular than paper ones. ‘The Oxford Herald’ is a case in point. Its print circulation has fallen in recent years, while its website attracts millions of users every month."]},{"idiom":"(a case of) dog eat dog","def":"a situation in business, politics, etc. where there is a lot of competition and people are willing to harm each other in order to succeed","examples":["I'm afraid in this line of work it's a case of dog eat dog.","We're operating in a dog-eat-dog world."]},{"idiom":"get off my case","def":"used to tell somebody to stop criticizing you","examples":[]},{"idiom":"in any case","def":"whatever happens or may have happened","examples":["There's no point complaining now—we're leaving tomorrow in any case."]},{"idiom":"(just) in case (…)","def":"because of the possibility of something happening","examples":["You'd better take the keys in case I'm out.","You probably won't need to call—but take my number, just in case.","In case (= if it is true that) you’re wondering why Jo’s here—let me explain…"]},{"idiom":"in case of something","def":"if something happens","examples":["In case of fire, ring the alarm bell."]},{"idiom":"in that case","def":"if that happens or has happened; if that is the situation","examples":["‘I’ve made up my mind.’ ‘In that case, there’s no point discussing it.’"]},{"idiom":"rest your case","def":"used to say that you do not need to say any more about something because you think that you have proved your point","examples":["The prosecution rests its case."]}],"phrasal":[],"related":["case law","cold case","edge case","test case","basket case","case study","jewel case","lower case","pencil case","upper case","vanity case","worst-case","attaché case","case history","display case","document case","packing case","case-sensitive"]},{"pos":"verb","level":"","meanings":[{"def":"to look carefully around a building so that you can plan how to steal things from it at a later time","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"case the joint","def":"to look carefully around a building so that you can plan how to steal things from it at a later time","examples":[]}],"phrasal":[],"related":[]}]