[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cau/cause/cause__us_1.mp3","phonsUS":"/kɔːz/","level":"A2","meanings":[{"def":"the person or thing that makes something happen","examples":["Unemployment is a major cause of poverty.","The report ignores the root cause of the problem.","Smoking is the leading cause of lung cancer.","Drinking and driving is one of the most common causes of traffic accidents.","It was impossible to determine the cause of death.","There was discussion about the fire and its likely cause.","He died of natural causes.","It is not easy to separate cause and effect in this situation.","A greater cause for resentment is the discrepancy in pay.","Smoking is a common cause of premature death.","The precise cause of the accident is not known.","The real cause of the problem lies in the poor construction of the bridge.","What are the causes of the crisis?","attempts to identify the immediate cause of the breakdown","the causes of blindness","the root cause of the problem","the social causes of ill health","She regarded me as the cause of all her problems.","They are still trying to identify the immediate cause of the breakdown."],"opposite":"","synonyms":""},{"def":"a reason for having particular feelings or behaving in a particular way","examples":["cause for something There is no cause for concern.","The food was excellent—I had no cause for complaint.","with/without cause If your child is absent without good cause (= a good reason), you may receive a warning from the school board.","Her health is giving us great cause for concern.","The experts may find cause to disagree with the school's decision.","The onus is on government departments to show cause why information cannot be disclosed.","There is no cause for alarm.","There is no reasonable cause to suspect an unnatural death.","We have good cause to believe that he was involved in the crime."],"opposite":"","synonyms":""},{"def":"an organization or idea that people support or fight for","examples":["Animal welfare campaigners raised £70 000 for their cause last year.","a good/worthy cause (= an organization that does good work, such as a charity)","He dedicated his life to fighting for the Republican cause.","The donation is the biggest private gift to a humanitarian cause.","She has long championed the cause of civil liberties.","He pleaded the cause of the local fishermen.","She has taken up the cause of animal rights.","She was keen to do anything that would further the cause.","The different groups support a common cause.","The money she left went to various worthy causes.","young men willing to fight for the cause","They were not prepared to sacrifice themselves for the cause of the country.","prominent figures in the socialist cause"],"opposite":"","synonyms":""},{"def":"a case that goes to court","examples":[],"opposite":"","synonyms":""},{"def":"worth doing, because it is helping other people","examples":["Oh well, it's all for a good cause.","The function took a lot of organizing, but was all for/in a good cause."],"opposite":"","synonyms":""},{"def":"in order to support or defend something","examples":["He gave his life in the cause of freedom.","battles fought in the cause of decentralization","to disregard the strict letter of the law in the cause of true justice"],"opposite":"","synonyms":""},{"def":"to be united with somebody about something that you both agree on, believe in or wish to achieve","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be for/in a good cause","def":"worth doing, because it is helping other people","examples":["Oh well, it's all for a good cause.","The function took a lot of organizing, but was all for/in a good cause."]},{"idiom":"in the cause of something","def":"in order to support or defend something","examples":["He gave his life in the cause of freedom.","battles fought in the cause of decentralization","to disregard the strict letter of the law in the cause of true justice"]},{"idiom":"make common cause with somebody","def":"to be united with somebody about something that you both agree on, believe in or wish to achieve","examples":[]}],"phrasal":[],"related":["’cause","lost cause","cause célèbre","probable cause","Rebel Without a Cause","make, cause, etc. a splash"]},{"pos":"verb","level":"A2","meanings":[{"def":"to make something happen, especially something bad or unpleasant; to make somebody do something","examples":["cause something Do they know what caused the fire?","Are you causing trouble again?","Doctors say her condition is causing some concern.","Recently there have been several deaths caused by dangerous driving.","cause something for somebody/something The drought is causing problems for many farmers.","cause something to something/somebody The earthquake caused widespread damage to property.","The revelations caused some discomfort to the president.","cause somebody something The project is still causing him a lot of problems.","cause something/somebody to do something The poor harvest caused prices to rise sharply.","The bad weather is likely to cause people to stay away.","Childhood obesity can cause/lead to long-term health problems.","Changes in lifestyle and diet over the last twenty years have caused/led to/resulted in a sharp increase in childhood obesity.","Several factors, including changes in diet and lifestyle, have contributed to the increase in childhood obesity.","Research suggests that fast food and soft drinks directly contribute to childhood obesity.","Genetics, lifestyle and diet are all important factors in cases of childhood obesity.","Even small changes in lifestyle and diet can bring about significant weight loss.","A serious road accident caused traffic chaos yesterday.","Bacteria sticks to food debris in the teeth, causing decay.","Heavy rainfall in the mountains caused the floods.","The bombing caused an international outcry.","The loss of a pet can cause some people real anguish.","The president's remarks caused surprise and embarrassment.","Will it cause any difficulties if I go early?"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"conjunction","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cos/cos__/cos__us_3.mp3","phonsUS":"/kəz/","level":"","meanings":[{"def":"because","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]