[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cau/cauti/caution__us_1.mp3","phonsUS":"/ˈkɔːʃn/","level":"C1","meanings":[{"def":"care that you take in order to avoid danger or mistakes; the fact of not taking any risks","examples":["extreme/great caution","with caution Statistics should be treated with caution.","He could find himself making enemies as well as friends unless he proceeds with the utmost caution.","She chose her words with care.","The utmost caution must be exercised when handling explosives.","As a matter of prudence, keep a record of all your financial transactions.","I must stress the need for caution.","The information on the website should be treated with some caution.","The utmost caution must be exercised when handling explosives.","We proceeded with due caution.","We urge caution in the use of this medication."],"opposite":"","synonyms":"care"},{"def":"a warning that is given by the police to somebody who has committed a crime that is not too serious","examples":["As a first offender, she got off with a caution.","They let her off with a caution."],"opposite":"","synonyms":""},{"def":"a warning or a piece of advice about a possible danger or risk","examples":["a word/note of caution","Some cautions must be mentioned—for example good tools are essential to do the job well.","Some cautions must be kept in mind when interpreting these results.","Some companies have sounded a note of caution about the outlook for the second half of this year.","The board sounded a note of caution about the economy.","I would just like to add a word of caution."],"opposite":"","synonyms":""},{"def":"to stop caring about how dangerous something might be; to start taking risks","examples":["He threw caution to the wind and dived into the water after the child."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"throw/cast caution to the wind(s)","def":"to stop caring about how dangerous something might be; to start taking risks","examples":["He threw caution to the wind and dived into the water after the child."]}],"phrasal":[],"related":["throw/cast caution to the wind(s)"]},{"pos":"verb","level":"","meanings":[{"def":"to warn somebody about the possible dangers or problems of something","examples":["caution against (doing) something I would caution against getting too involved.","caution somebody against/about (doing) something Sam cautioned him against making a hasty decision.","caution (somebody) that… The government cautioned that pay increases could lead to job losses.","caution somebody to do something Employees were cautioned to be careful about what they said to people outside the company.","caution (somebody) + speech ‘I’d take care if I were you,’ she cautioned (him)."],"opposite":"","synonyms":""},{"def":"to warn somebody officially that anything they say may be used as evidence against them in court","examples":["Suspects must be cautioned before any questions are asked."],"opposite":"","synonyms":""},{"def":"to warn somebody officially that they will be punished if they do something wrong or illegal again","examples":["be cautioned (for something) She wasn't sent to the juvenile court; instead she was cautioned."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]