[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cen/centr/centre__us_1.mp3","phonsUS":"/ˈsentər/","level":"A1","meanings":[{"def":"the middle point or part of something","examples":["the center of something He walked to the center of the circle.","in the center of something There was a long table in the center of the room.","The statue is in the very center of the temple.","chocolates with soft centers","at the center of something Aristotle believed that the Earth was at the center of the universe."],"opposite":"","synonyms":""},{"def":"the main part of a town or city where there are a lot of shops and offices","examples":["in the… center We both work in the city center."],"opposite":"","synonyms":""},{"def":"a place or an area where a lot of people live; a place where a lot of business or cultural activity takes place","examples":["major urban/industrial centers","center of something At that time Winchester was still a major centrer of population.","center for something The university is a leading center for scientific research.","Small towns in South India serve as economic and cultural centers for the surrounding villages."],"opposite":"","synonyms":""},{"def":"a building or place used for a particular purpose or activity","examples":["a shopping/sports/leisure/community center","The company has recently opened a new training center."],"opposite":"","synonyms":""},{"def":"a place where a particular kind of work is done extremely well","examples":["The university is recognized as an international center of excellence for training dentists."],"opposite":"","synonyms":""},{"def":"the point towards which people direct their attention","examples":["Children like to be the center of attention."],"opposite":"","synonyms":""},{"def":"a moderate (= middle) political position or party, between the extremes of left-wing and right-wing parties","examples":["a party of the center","a center party"],"opposite":"","synonyms":""},{"def":"a player or position in the middle of the pitch, court, etc.","examples":[],"opposite":"","synonyms":""},{"def":"in or into the most important position","examples":["The issue has moved front and center in his presidential campaign."],"opposite":"","synonyms":""},{"def":"in all directions; everywhere","examples":["He's giving away money left, right and center."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"front and center","def":"in or into the most important position","examples":["The issue has moved front and center in his presidential campaign."]},{"idiom":"left, right and center","def":"in all directions; everywhere","examples":["He's giving away money left, right and center."]}],"phrasal":[],"related":["center field","Center Parcs","center of mass","day care center","Rockefeller Center","John Hancock Center","Kennedy Center","Lyndon B Johnson Space Center","Walter Reed National Military Medical Center","Lincoln Center for the Performing Arts","call center","center back","center half","center-left","cost center","data center","day center","off-center"]},{"pos":"verb","level":"B1","meanings":[{"def":"to be the person or thing around which most activity takes place; to make somebody/something the central person or thing","examples":["center around/round somebody/something Conversation centered around their wedding plans.","center on/upon somebody/something The debate centered on an important practical question.","The investigations centered on him as the only real suspect in the case.","be centered around/round somebody/something Leisure activities were largely centered around the family.","Roosevelt's foreign policy was centered around these themes.","be centered on/upon somebody/something Discussions were centered on developments in Eastern Europe.","The main story is centered on two young men, one a photographer, the other a gang leader."],"opposite":"","synonyms":""},{"def":"to take place mainly in or around the place mentioned","examples":["Most of the fighting was centered in the north of the capital."],"opposite":"","synonyms":""},{"def":"to move something so that it is in the center of something else","examples":["This button will center the image on the page."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]