[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cer/certa/certain__us_2.mp3","phonsUS":"/ˈsɜːrtn/","level":"A2","meanings":[{"def":"strongly believing something; having no doubts","examples":["I think it was him, but I can't be certain.","certain (that)… She wasn’t certain (that) he had seen her.","I'm certain we'll think of something.","certain about something Are you absolutely certain about this?","certain of something I am not certain of the precise date.","certain who/where, etc… I'm not certain who was there.","To my certain knowledge he was somewhere else at the time (= I am sure about it).","I grew more and more certain that she was lying to me.","He wasn't certain who he'd given the papers to.","You have to be quite certain of the facts before making a decision."],"opposite":"","synonyms":""},{"def":"that you can rely on to happen or to be true","examples":["The climbers face certain death if the rescue today is unsuccessful.","it is certain (that)… It is certain that they will agree.","It was not certain that the bones were even human.","certain to do something She looks certain to win an Oscar.","He seemed certain to be defeated in the election.","The death toll was almost certain to rise.","They are certain to agree.","One thing is certain—it will be exciting.","certain of something/of doing something If you want to be certain of getting a ticket, book now.","It’s certain that they will agree.","They are certain to agree.","She’s sure to be picked for the team.","It’s sure to rain.","Is it definite that he’s leaving?","That kind of behaviour is guaranteed to make him angry.","‘Is that John over there?’ ‘I’m not sure.’","Are you sure about that?","England must win this game to be sure of qualifying.","I’m quite confident that you’ll get the job.","The team feels confident of winning.","I’m convinced that she’s innocent.","Are you absolutely certain about this?","She was positive that he’d been there.","‘Are you sure?’ ‘Positive.’","My memory isn’t really clear on that point.","Digby looked certain to be the next president.","It's by no means certain that she'll get the job.","If you want to be certain of getting into the concert, buy your ticket now."],"opposite":"","synonyms":"certain"},{"def":"used to mention a particular thing, person or group without giving any more details about it or them","examples":["For certain personal reasons I shall not be able to attend.","Certain people might disagree with this.","This car appeals to a certain type of driver.","You can choose to only watch certain kinds of movies.","They refused to release their hostages unless certain conditions were met.","The president can under certain circumstances dissolve parliament."],"opposite":"","synonyms":""},{"def":"slight; easy to notice, but difficult to describe","examples":["That's true, to a certain extent.","I experienced a certain amount of relief.","I felt there was a certain coldness in her manner."],"opposite":"","synonyms":""},{"def":"used with a person’s name to show that the speaker does not know the person","examples":["It was a certain Dr Davis who performed the operation."],"opposite":"","synonyms":""},{"def":"without doubt","examples":["I can't say for certain when we'll arrive.","I don't know for certain how many people are coming.","I think she's a teacher, but I couldn't say for certain.","I couldn't say for certain whether she'll be there."],"opposite":"","synonyms":""},{"def":"to find out whether something is definitely true","examples":["I think there's a bus at 8 but you'd better call to make certain.","Make certain that you lock the door if you go out."],"opposite":"","synonyms":""},{"def":"to do something in order to be sure that something else will happen","examples":["You'll have to leave soon to make certain of getting there on time."],"opposite":"","synonyms":""},{"def":"if you talk about a person being of a certain age, you mean that they are no longer young but not yet old","examples":["The show appeals to an audience of a certain age."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"for certain","def":"without doubt","examples":["I can't say for certain when we'll arrive.","I don't know for certain how many people are coming.","I think she's a teacher, but I couldn't say for certain.","I couldn't say for certain whether she'll be there.","I'm sure/100% certain/​absolutely positive I left my keys on the table.","There's no doubt in my mind that this is the best option.","Without a doubt,/No question, this is where it was.","I'm not (at all) sure what time they arrive, to be honest.","I rather doubt they'll call back."]},{"idiom":"make certain (that…)","def":"to find out whether something is definitely true","examples":["I think there's a bus at 8 but you'd better call to make certain.","Make certain that you lock the door if you go out."]},{"idiom":"make certain of something/of doing something","def":"to do something in order to be sure that something else will happen","examples":["You'll have to leave soon to make certain of getting there on time."]},{"idiom":"of a certain age","def":"if you talk about a person being of a certain age, you mean that they are no longer young but not yet old","examples":["The show appeals to an audience of a certain age."]}],"phrasal":[],"related":["certain of…","of a certain age","up to a (certain) point"]},{"pos":"pronoun","level":"","meanings":[{"def":"used for talking about some members of a group of people or things without giving their names","examples":["Certain of those present were unwilling to discuss the matter further."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]