[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cha/chair/chair__us_1.mp3","phonsUS":"/tʃer/","level":"A1","meanings":[{"def":"a piece of furniture for one person to sit on, with a back, a seat and four legs","examples":["a table and chairs","on a chair Sit on your chair!","in a chair an old man asleep in a chair (= an armchair)","She was sitting in her favourite chair.","He sighed and leaned back in his chair.","‘Sit down,’ she said, pointing to the empty chair next to her.","a comfortable chair","a wooden/leather/plastic chair","a folding/reclining/swivel chair","an office/a desk chair","‘Please, be my guest.’ He gestured towards an empty chair.","A cat was asleep on the chair.","His tall figure was slumped into his chair.","Rising slowly from his chair he went to a bookcase.","A chair stood facing the window.","Come in and take a chair (= sit down).","He gave her his chair.","He got up from his chair to address the meeting.","He lay back in the reclining chair and went to sleep.","He gestured to an empty chair.","He pulled out a chair for her.","He pushed back his chair and got to his feet.","He put his feet up on the desk and lay back in his chair.","He sank into his chair and opened the letter.","He sat nervously on the edge of his chair.","He was shifting about uneasily in his chair.","Lisa heard a chair scraping the floor.","a set of antique dining chairs","a dining table and four matching chairs","They straightened in their chairs when the manager burst in.","The chair creaked every time I moved.","She tipped her chair back and fixed her gaze full upon him.","She swivelled round in her chair and picked up the phone.","She leaned back in her chair and lit a cigarette.","She gripped the arm of her chair as she spoke.","She dropped her bags and flopped down into the nearest chair.","She returned to the swivel chair (= one on which the seat turns around without moving the base) behind her desk.","She always swivels around in her chair.","dining/​kitchen chairs"],"opposite":"","synonyms":""},{"def":"the position of being in charge of a meeting or committee; the person who holds this position","examples":["in the chair Who is in the chair today?","All remarks should be addressed to the chair.","She takes the chair in all our meetings.","chair of something the chair of the committee","He was elected chair of the city council.","The chairs of all the subcommittees will meet on Friday.","Anne took the chair in Carol's absence.","Paul Ryan was in the chair at today's meeting.","Please address your questions to the chair."],"opposite":"","synonyms":""},{"def":"the position of being in charge of a department in a university; a special position as a university professor","examples":["He holds the chair of philosophy at Oxford.","the department chair","She was awarded a personal chair in black history at Bath Spa University (= she was made a professor without being head of a department).","He held the Chair of Psychology at Yale.","He held the Chair of Botany at Cambridge University for thirty years.","A private benefactor endowed the new Chair of Japanese Literature."],"opposite":"","synonyms":""},{"def":"(especially in the US) a chair in which criminals are killed by having a powerful electric current passed through their bodies; the method of execution that uses this chair","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["bath chair","easy chair","high chair","lawn chair","sedan chair","wing chair","lounge chair","rocking chair","director’s chair","electric chair","Coronation Chair","recliner chair","the electric chair","in the director's chair"]},{"pos":"verb","level":"B2","meanings":[{"def":"to act as the chairman or chairwoman of a meeting, discussion, etc.","examples":["to chair a committee","Who's chairing the meeting?","a judging panel chaired by a radio presenter.","I had the unenviable task of chairing the closing session.","Lord Stansfield will chair the committee."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]