[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cha/chain/chain__us_1.mp3","phonsUS":"/tʃeɪn/","level":"B1","meanings":[{"def":"a series of connected metal rings, used for pulling or fastening things; a length of chain used for a particular purpose","examples":["She wore a heavy gold chain around her neck.","The mayor wore his chain of office.","a bicycle chain","in chains The prisoners were kept in chains (= with chains around their arms and legs, to prevent them from escaping).","on a chain They kept the dog on a chain all day long.","a short length of chain","Let the dog off its chain.","The prisoner was led away in chains.","Put the chain on the door (= so the door can only be opened a little bit) before you go to bed."],"opposite":"","synonyms":""},{"def":"a series of connected things or people","examples":["mountain/island chains","Volunteers formed a human chain (= line of people) to rescue precious items from the burning house.","chain of somebody/something to set in motion a chain of events","a chain of command (= a system in an organization by which instructions are passed from one person to another)","Our suppliers are the weakest link in the chain.","Volunteers formed a human chain to pass buckets of water to each other.","She was personally involved in this chain of events.","It's important to make sure the chain of communication is not broken.","If any part of the chain of infection is broken, the spread of the disease will be stopped.","I was next in the chain of command.","the complex chain of events that led to the war","Middlemen are important links in the chain.","There has been an unbroken chain of great violinists in the family.","The people formed a human chain to pass the supplies up the beach.","a chain of volcanic islands"],"opposite":"","synonyms":""},{"def":"a group of shops or hotels owned by the same company","examples":["a supermarket/hotel/retail chain","chain of something a chain of stores/shops/restaurants","a chain of department stores","a chain of clothes shops","This hotel is part of a large chain."],"opposite":"","synonyms":""},{"def":"a thing that limits somebody’s freedom or ability to do something","examples":["the chains of fear/misery"],"opposite":"","synonyms":""},{"def":"a situation in which a number of people selling and buying houses must each complete the sale of their house before buying from the next person","examples":[],"opposite":"","synonyms":""},{"def":"a problem that prevents you from doing what you would like to do","examples":["The responsibility was a ball and chain around my ankle."],"opposite":"","synonyms":""},{"def":"one of the stages in a process or a line of argument","examples":["Food production, processing and marketing are different links in the chain from farmer to consumer.","Death is the last link in the chain."],"opposite":"","synonyms":""},{"def":"the point at which a system or an organization is most likely to fail","examples":["She went straight for the one weak link in the chain of his argument."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a ball and chain","def":"a problem that prevents you from doing what you would like to do","examples":["The responsibility was a ball and chain around my ankle."]},{"idiom":"a link in the chain","def":"one of the stages in a process or a line of argument","examples":["Food production, processing and marketing are different links in the chain from farmer to consumer.","Death is the last link in the chain."]},{"idiom":"the weak link (in the chain)","def":"the point at which a system or an organization is most likely to fail","examples":["She went straight for the one weak link in the chain of his argument."]}],"phrasal":[],"related":["chain gang","chain mail","chain-smoke","chain store","choke chain","daisy chain","food chain","chain letter","chain-smoker","supply chain","chain reaction","chain-link fence","key chain","chain gangs","chain letters","chain-smokes"]},{"pos":"verb","level":"B2","meanings":[{"def":"to fasten something with a chain; to fasten somebody/something to another person or thing with a chain, so that they do not escape or get stolen","examples":["chain somebody/something The doors were always locked and chained.","He maintained that the convicts working on the roads were never chained.","He was beaten in his cell while in handcuffs and with his legs chained.","chain somebody/something up The dog was chained up for the night.","She took the old man out into the yard and chained him up.","chain somebody/something to somebody/something She chained her bicycle to the gate.","Four activists chained themselves to construction equipment.","(figurative) I've been chained to my desk all week (= because there was so much work).","chain somebody/something together The detainees were chained together in groups of two or three.","With their wrists chained together they were led out to the waiting vehicles."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]