[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cha/chall/challenge__us_1.mp3","phonsUS":"/ˈtʃælɪndʒ/","level":"B1","meanings":[{"def":"a new or difficult task that tests somebody’s ability and skill","examples":["a tough/major/significant challenge","The role will be the biggest challenge of his acting career.","She still faces many challenges (= has to deal with them).","Destruction of the environment is one of the most serious challenges we face.","The greatest challenge facing the region is unemployment.","Rapid industrialization presents both challenges and opportunities.","challenge of something Countries need to work together to address the challenge of climate change.","Schools must meet the challenge of new technology (= deal with it successfully).","I’m looking forward to the challenge of my new job.","challenge of doing something The gallery has risen to the challenge of exhibiting the works of young artists.","challenge for somebody/something The challenge for the government is to find a way of providing affordable housing.","challenge to somebody/something Digital piracy continues to pose huge challenges to the industry.","He has taken on some exciting new challenges with this job.","Liszt's piano music presents an enormous technical challenge.","She could always be counted on when a challenge arose.","The army faced the daunting challenge of fighting a war on two fronts.","The challenge lies in creating a demand for the product.","The competitive market represents significant challenges for farmers.","the challenges facing nurses in casualty"],"opposite":"","synonyms":""},{"def":"an invitation or a suggestion to somebody that they should enter a competition, fight, etc.","examples":["She accepted his challenge to a debate on the issue.","I'm looking forward to taking on the challenge.","challenge for something He plans to mount a challenge for the party leadership.","She took up his challenge.","plans to mount a leadership challenge within the party","his title challenge to the heavyweight champion","a challenge from the other political party","I accepted his challenge to a game of chess."],"opposite":"","synonyms":""},{"def":"a statement or an action that shows that somebody refuses to accept something and questions whether it is right, legal, etc.","examples":["Their legal challenge was unsuccessful.","challenge to something It was a direct challenge to the president's authority.","challenge from somebody The commission reconsidered the rules after a challenge from the television networks.","The demonstration represents a direct challenge to the new law.","a legal challenge to the President's power","He was answering challenges to the government's policy.","Our team will have to fight off the challenge from better trained teams."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["University Challenge","Diamond Challenge Sculls","Football Association Challenge Cup"]},{"pos":"verb","level":"B2","meanings":[{"def":"to question whether a statement or an action is right, legal, etc.; to refuse to accept something","examples":["challenge something His legal team immediately sought to challenge the decision.","The story was completely untrue and was successfully challenged in court.","She does not like anyone challenging her authority.","This discovery challenges traditional beliefs.","The new study challenges fundamental assumptions about the virus.","challenge somebody on something She challenged him on his old-fashioned views.","challenge somebody He repeated the claim but the interviewer did not challenge him.","Some critics argue that Picasso remained a great master all his life.","Others maintain that there is a significant deterioration in quality in his post-war work.","Picasso himself claimed that good art is created, but great art is stolen.","As Smith has noted, Picasso borrowed imagery from African art.","As the author points out, Picasso borrowed imagery from African art.","The writer challenges the notion that Picasso’s sculpture was secondary to his painting.","It has been suggested that Picasso’s painting was influenced by jazz music.","Harley sought to challenge the jurisdiction of the court.","She was effectively challenging the whole basis on which society was run.","The newspaper was directly challenging the government's legitimacy."],"opposite":"","synonyms":""},{"def":"to invite somebody to enter a competition, fight, etc.; to suggest strongly that somebody should do something (especially when you think that they might be unwilling to do it)","examples":["challenge somebody to something Mike challenged me to a game of chess.","The count challenged him to a duel.","challenge somebody to do something The opposition leader challenged the prime minister to call an election."],"opposite":"","synonyms":""},{"def":"to enter into to a competition against somebody to achieve something or take something from them","examples":["challenge for something She was poised to challenge for the party leadership.","challenge somebody for something He challenged her for the role of leader.","challenge somebody She is the person most likely to challenge him before the next election."],"opposite":"","synonyms":""},{"def":"to test somebody’s/your ability and skills, especially in an interesting way","examples":["challenge somebody The job doesn't really challenge her.","No one has seriously challenged the champion.","challenge yourself She continues to challenge herself as a dancer."],"opposite":"","synonyms":""},{"def":"to order somebody to stop and say who they are or what they are doing","examples":["We were challenged by police at the border."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]