[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cha/chanc/chance__us_1.mp3","phonsUS":"/tʃæns/","level":"A2","meanings":[{"def":"a possibility of something happening, especially something that you want","examples":["chance of doing something She only has a slim chance of passing the exam.","Is there any chance of getting tickets for tonight?","chance that… There's a good chance that he'll be back in time.","There is no chance that he will change his mind.","chance of somebody/something doing something What chance is there of anybody being found alive?","There is little chance of that happening.","chance of something The operation has a fifty-fifty chance of success.","Nowadays a premature baby has a very good chance of survival.","Not wearing a helmet could increase your chance of injury.","The Met Office said there was an 80 per cent chance of severe weather.","chance at something Now that he's met the love of his life, he finally has a chance at real happiness.","chance for something We believe the plan has a good chance for success.","with a chance They are the one team with a chance of beating us.","an outside chance (= a very small one)","The chances are a million to one against being struck by lightning.","As long as there is an outside chance, we will go for it.","He didn't want to risk the chance of being discovered.","He had zero chance of survival.","How do you rate our chances of finding her?","I don't fancy our chances of getting there on time.","It was a mistake which eliminated any chance of an Australian victory.","She has every chance of passing the exam if she works hard.","She played left-handed to give her opponent a fair chance.","The doctors gave him little chance of surviving the night.","The missing climber's chances of survival are slim.","There is a very real chance that the film will win an award.","There was only a million-to-one chance of it happening.","There's a fair chance that nobody will come to the talk.","They have a 90 per cent chance of success.","What are his survival chances?","the variety with the best chance for success"],"opposite":"","synonyms":""},{"def":"a suitable time or situation when you have the opportunity to do something","examples":["It was the chance she had been waiting for.","Jeff deceived me once already—I won't give him a second chance.","This is your big chance (= opportunity for success).","chance of something We won't get another chance of a holiday this year.","chance to do something Please give me a chance to explain.","You'll have the chance to ask questions at the end.","The team missed their chance to win the cup.","Tonight is your last chance to catch the play at your local theatre.","He jumped at the chance to go back to Australia.","He realized that this might be his only chance to save himself.","chance for somebody to do something There will be a chance for parents to look around the school.","He deserves the chance to give his side of the story.","Given the chance, I'd retire tomorrow.","He blew four of his seven save chances.","He had wasted a golden chance to make history.","I finally had the chance to meet my hero.","I would welcome the chance to give my opinion.","I wouldn't pass up the chance of working for them.","If she let this chance slip, she would regret it for the rest of her life.","Katie was his last real chance at happiness.","No child should be denied the chance of growing up in a family.","She spotted her chance of making a quick profit.","Take every chance that comes your way.","The dog always runs off when it gets half a chance.","The new college is intended to improve the life chances of children in the inner city.","The teacher gave her one last chance to prove she could behave.","The team created several clear chances but failed to score.","There are no second chances in this business.","They blew their chance to go second in the league.","This is the ideal chance for him to show his ability.","This is your big chance—grab it with both hands.","Travis had left the door open—she seized her chance and was through it like a shot.","When the chance came to go to Paris, she jumped at it.","We won't get another chance at a vacation this year."],"opposite":"","synonyms":""},{"def":"an unpleasant or dangerous possibility","examples":["When installing electrical equipment don't take any chances. A mistake could kill.","The car might break down but that's a chance we'll have to take.","chance on somebody/something The producers didn't want to take a chance on an unknown actor.","chance with somebody/something The police were taking no chances with the protesters."],"opposite":"","synonyms":""},{"def":"the way that some things happen without any cause that you can see or understand","examples":["I met her by chance (= without planning to) at the airport.","Chess is not a game of chance.","It was pure chance that we were both there.","We'll plan everything very carefully and leave nothing to chance.","This ring has always brought me good luck.","The results could simply be due to chance.","They met through a series of strange coincidences.","Their early arrival was just an accident.","Fate decreed that she would never reach America.","I believe there’s some force guiding us—call it God, destiny or fate.","We met by chance at the airport.","There is always an element of chance in buying a used car.","The results could simply be due to chance.","The police came upon the hideout purely by chance.","Leaving nothing to chance, he delivered the letter himself.","I got most answers right through sheer chance.","By a happy chance he bumped into an old friend on the plane."],"opposite":"","synonyms":"luck"},{"def":"happening in a way that was lucky, although it was not planned","examples":["As chance would have it, John was going to London too, so I went with him."],"opposite":"","synonyms":""},{"def":"to have the possibility of succeeding or achieving something","examples":["‘Do you think we'll win?’ ‘I think we're in with a chance.’","He's in with a good chance of passing the exam.","After a poor start, they are now in with a chance of winning the league."],"opposite":"","synonyms":""},{"def":"used especially in questions, to ask whether something is true, possible, etc.","examples":["Are you in love with him, by any chance?","Are you by any chance Mr Ludd?"],"opposite":"","synonyms":""},{"def":"it is likely that…","examples":["The chances are you won't have to pay."],"opposite":"","synonyms":""},{"def":"people say chance would be a fine thing to show that they would like to do or have the thing that somebody has mentioned, but that they do not think that it is very likely","examples":[],"opposite":"","synonyms":""},{"def":"used for saying that you do not believe something is likely to happen","examples":["‘They might let us in without tickets.’ ‘Fat chance of that!’","Fat chance of him helping you!"],"opposite":"","synonyms":""},{"def":"a small chance of being successful if a great effort is made","examples":["We still have a fighting chance of beating them and winning the Cup.","If you win this round then you still have a fighting chance."],"opposite":"","synonyms":""},{"def":"to give somebody/something some opportunity to do something","examples":["That dog will give you a nasty bite, given half a chance."],"opposite":"","synonyms":""},{"def":"to be equally likely to do or not do something","examples":["She has more than an even chance of winning tomorrow.","There’s an even chance that the jury will find him guilty."],"opposite":"","synonyms":""},{"def":"there is no possibility","examples":["‘Do you think he'll do it?’ ‘No chance.’"],"opposite":"","synonyms":""},{"def":"to have no chance at all","examples":[],"opposite":"","synonyms":""},{"def":"to have no chance at all","examples":["He hasn't a dog's chance of passing the exam."],"opposite":"","synonyms":""},{"def":"to have no chance at all","examples":["There isn't a snowball's chance in hell that I'll wear that thing!"],"opposite":"","synonyms":""},{"def":"because of the possibility of something happening, although it is unlikely","examples":["I didn't think you'd be at home but I just called by on the off chance.","She scanned the crowd on the off chance of seeing someone she knew.","I called in at the office on the off chance that you would still be there.","I rang the company just on the off chance that they might have a vacancy."],"opposite":"","synonyms":""},{"def":"a reasonable chance of success","examples":[],"opposite":"","synonyms":""},{"def":"to have the possibility of succeeding or achieving something","examples":["The driver didn't stand a chance of stopping in time.","He doesn't stand a chance of winning against such an experienced player."],"opposite":"","synonyms":""},{"def":"to decide to do something, knowing that it might be the wrong choice","examples":["We took a chance on the weather and planned to have the party outside.","The manager took a chance on the young goalkeeper.","The guide book didn't mention the hotel, but we decided to take a chance."],"opposite":"","synonyms":""},{"def":"to take a risk or to use the opportunities that you have and hope that things will happen in the way that you want","examples":["He took his chances and jumped into the water."],"opposite":"","synonyms":""},{"def":"with the hope of using a particular situation in order to gain some advantage for yourself","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"as chance would have it","def":"happening in a way that was lucky, although it was not planned","examples":["As chance would have it, John was going to London too, so I went with him."]},{"idiom":"be in with a chance (of doing something)","def":"to have the possibility of succeeding or achieving something","examples":["‘Do you think we'll win?’ ‘I think we're in with a chance.’","He's in with a good chance of passing the exam.","After a poor start, they are now in with a chance of winning the league."]},{"idiom":"by any chance","def":"used especially in questions, to ask whether something is true, possible, etc.","examples":["Are you in love with him, by any chance?","Are you by any chance Mr Ludd?"]},{"idiom":"the chances are (that)…","def":"it is likely that…","examples":["The chances are you won't have to pay."]},{"idiom":"chance would be a fine thing","def":"people say chance would be a fine thing to show that they would like to do or have the thing that somebody has mentioned, but that they do not think that it is very likely","examples":[]},{"idiom":"(a) fat chance (of something/doing something)","def":"used for saying that you do not believe something is likely to happen","examples":["‘They might let us in without tickets.’ ‘Fat chance of that!’","Fat chance of him helping you!"]},{"idiom":"a fighting chance","def":"a small chance of being successful if a great effort is made","examples":["We still have a fighting chance of beating them and winning the Cup.","If you win this round then you still have a fighting chance."]},{"idiom":"give somebody/something half a chance","def":"to give somebody/something some opportunity to do something","examples":["That dog will give you a nasty bite, given half a chance."]},{"idiom":"have an even chance (of doing something)","def":"to be equally likely to do or not do something","examples":["She has more than an even chance of winning tomorrow.","There’s an even chance that the jury will find him guilty."]},{"idiom":"no chance","def":"there is no possibility","examples":["‘Do you think he'll do it?’ ‘No chance.’"]},{"idiom":"not have/stand a cat in hell’s chance (of doing something)","def":"to have no chance at all","examples":[]},{"idiom":"not have a dog’s chance","def":"to have no chance at all","examples":["He hasn't a dog's chance of passing the exam."]},{"idiom":"not have a snowball’s chance in hell","def":"to have no chance at all","examples":["There isn't a snowball's chance in hell that I'll wear that thing!"]},{"idiom":"on the off chance (of doing something/that…)","def":"because of the possibility of something happening, although it is unlikely","examples":["I didn't think you'd be at home but I just called by on the off chance.","She scanned the crowd on the off chance of seeing someone she knew.","I called in at the office on the off chance that you would still be there.","I rang the company just on the off chance that they might have a vacancy."]},{"idiom":"a sporting chance","def":"a reasonable chance of success","examples":[]},{"idiom":"stand a chance (of doing something)","def":"to have the possibility of succeeding or achieving something","examples":["The driver didn't stand a chance of stopping in time.","He doesn't stand a chance of winning against such an experienced player."]},{"idiom":"take a chance (on something)","def":"to decide to do something, knowing that it might be the wrong choice","examples":["We took a chance on the weather and planned to have the party outside.","The manager took a chance on the young goalkeeper.","The guide book didn't mention the hotel, but we decided to take a chance."]},{"idiom":"take your chances","def":"to take a risk or to use the opportunities that you have and hope that things will happen in the way that you want","examples":["He took his chances and jumped into the water."]},{"idiom":"with an eye for/on/to the main chance","def":"with the hope of using a particular situation in order to gain some advantage for yourself","examples":[]}],"phrasal":[],"related":["chance on","chance upon","chance on somebody/something","chance upon somebody/something","chance your arm","not have Buckley’s (chance)","the chance, etc. of a lifetime","not have/stand a cat in hell’s chance (of doing something)"]},{"pos":"verb","level":"","meanings":[{"def":"to risk something, although you know the result may not be successful","examples":["chance something She was chancing her luck driving without a licence.","‘Take an umbrella.’ ‘No, I'll chance it’ (= take the risk that it may rain).","chance doing something I stayed hidden; I couldn't chance coming out."],"opposite":"","synonyms":""},{"def":"to happen or to do something by chance","examples":["chance to do something If I do chance to find out where she is, I'll inform you immediately.","They chanced to be staying at the same hotel.","it chanced (that)… It chanced (that) they were staying at the same hotel."],"opposite":"","synonyms":""},{"def":"to take a risk although you will probably fail","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"chance your arm","def":"to take a risk although you will probably fail","examples":[]}],"phrasal":["chance on","chance upon"],"related":[]},{"pos":"adjective","level":"","meanings":[{"def":"not planned","examples":["a chance meeting/encounter"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]