[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cha/chann/channel__us_1.mp3","phonsUS":"/ˈtʃænl/","level":"B1","meanings":[{"def":"a television station","examples":["a television/TV channel","cable/digital/satellite channels","a news channel","a music/sports/movie channel","to change/switch channels","on a channel What's on Channel 4 tonight?","I changed channels when the news came on.","Last year, the company launched its own TV channel.","Lily surfed the channels on the television.","There's an interesting documentary on Channel 4 tonight.","This channel broadcasts 24 hours a day."],"opposite":"","synonyms":""},{"def":"a band of radio waves used for making television or radio broadcasts","examples":["radio channels","terrestrial/satellite channels"],"opposite":"","synonyms":""},{"def":"a method or system that people use to get information, to communicate, or to send something somewhere","examples":["Complaints must be made through the proper channels.","The newsletter is a useful channel of communication between teacher and students.","The company has worldwide distribution channels.","Steps are being taken to implement a ceasefire through diplomatic channels.","If you want a visa, you will have to go through the proper channels.","Journalists always have indirect channels for getting information.","She first tried to get a doctor's certificate through official channels.","The government hopes to settle the dispute through diplomatic channels.","an effective channel for communication","attempts to open up new channels of communication"],"opposite":"","synonyms":""},{"def":"a means by which data is communicated and exchanged between elements of a computer system or other system","examples":["an audio channel"],"opposite":"","synonyms":""},{"def":"a way of expressing ideas and feelings","examples":["The campaign provided a channel for protest against the war.","Music is a great channel for releasing your emotions."],"opposite":"","synonyms":""},{"def":"a passage that water can flow along, especially in the ground, on the bottom of a river, etc.","examples":["drainage channels in the rice fields","A channel is being dug to divert the river.","The drainage channels had survived since the Roman occupation.","Irrigation channels supply the crops with water.","The estate has fountains and water channels."],"opposite":"","synonyms":""},{"def":"a deep passage of water in a river or near the coast that can be used as route for ships","examples":[],"opposite":"","synonyms":""},{"def":"a passage of water that connects two areas of water, especially two seas","examples":["the Bristol Channel"],"opposite":"","synonyms":""},{"def":"the area of sea between England and France, also known as the English Channel","examples":["the Channel Tunnel","cross-Channel ferries","across the Channel news from across the Channel (= from France)","We crossed the Channel in stormy weather.","The government is watching economic developments across the Channel with great interest."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Channel 4","Channel 5","channel-hop","pay channel","Clear Channel","Discovery Channel","Fox News Channel","blue channel","Bristol Channel","Channel Islands","Channel Tunnel","English Channel","public access channel","channel-hops","channel-surf","Channel","channel-hopped","channel-hopping"]},{"pos":"verb","level":"","meanings":[{"def":"to direct money, feelings, ideas, etc. towards a particular thing or purpose","examples":["He channels his aggression into sport."],"opposite":"","synonyms":""},{"def":"to send money, help, etc. using a particular route","examples":["Money for the project will be channelled through local government."],"opposite":"","synonyms":""},{"def":"to carry or send water, light, etc. through a passage","examples":["A sensor channels the light signal along an optical fibre."],"opposite":"","synonyms":""},{"def":"to act as a medium (= a person who claims to be able to communicate with the spirits of dead people) for somebody","examples":["He believed that he could channel an ancestor from two hundred years ago."],"opposite":"","synonyms":""},{"def":"to behave in the manner of somebody else, as though that person has given you the idea or desire to act in that way","examples":["When he sang, he would channel Nat King Cole."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]