[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cha/charg/charge__us_1.mp3","phonsUS":"/tʃɑːrdʒ/","level":"B1","meanings":[{"def":"the amount of money that somebody asks for goods and services","examples":["admission charges","charge for something We have to make a small charge for refreshments.","Delivery is free of charge.","a low hourly rate of pay","interest rates","an admission charge","legal fees","an annual membership fee","a parking fine","All changes will incur a charge.","The company will deliver free of charge.","The hotel operates a bus service to the beach for a small charge.","There is no charge for cashing traveller's cheques.","They agreed to waive the cancellation charges.","This service is available at a nominal charge.","We make a small charge for wrapping your gift.","a charge on company profits","The museum has introduced a £3 admission charge.","(British English) There is a quarterly standing charge (= an amount of money that you pay in order to use a service, such as gas or water).","They guarantee that there are no hidden fees and charges.","parking charges","Trained coaches will provide support at no extra charge.","What's that $30 charge on your credit card bill?","For orders over £30, you don't have to pay the delivery charge."],"opposite":"","synonyms":"rate"},{"def":"a charge account","examples":["Would you like to put that on your charge?","‘Are you paying cash?’ ‘No, it'll be a charge.’"],"opposite":"","synonyms":""},{"def":"a position of having control over somebody/something; responsibility for somebody/something","examples":["She has charge of the day-to-day running of the business.","He took charge of the farm after his father's death.","in charge of somebody/something They left the au pair in charge of the children for a week.","in somebody's charge I'm leaving the school in your charge.","We need somebody to take charge of the financial side.","The conductor has overall charge of the train.","The child is under my charge until her mother returns.","Stephen will resume sole charge for the time being.","She took personal charge of the files.","John has been put in charge of marketing.","I need to feel more in charge of my life.","She heroically gave her life to save the baby in her charge.","the police officers in charge of the investigation"],"opposite":"","synonyms":""},{"def":"a person that you have responsibility for and care for","examples":[],"opposite":"","synonyms":""},{"def":"an official claim made by the police that somebody has committed a crime","examples":["criminal charges","a murder/an assault charge","charge of something a charge of theft/rape/attempted murder","He will be sent back to England to face a charge of (= to be on trial for) armed robbery.","Both men deny the charges.","charge against somebody/something They decided to drop the charges against the newspaper and settle out of court.","without charge After being questioned by the police, she was released without charge.","fraud/​corruption/​felony charges","He has admitted the murder charge.","He was found guilty on a reduced charge of assault.","She appeared in court on charges of kidnapping and assault.","She is almost certain to face criminal charges.","The charges against you have been dropped.","The company agreed to pay $20 million to settle insider-trading charges.","The company has managed to avoid criminal charges in this case.","The court dismissed the charge against him.","a charge of armed robbery","charges relating to the embezzlement of public funds","new charges alleging the misuse of funds","to be detained/​held/​released without charge","The investigation resulted in criminal charges against three police officers.","He was arrested on a charge of murder.","They had pleaded guilty to the charge at Swansea Crown Court.","He was convicted of five charges under the Official Secrets Act.","He admitted seven charges of attempted murder.","The Court dismissed all charges.","charges of assault/​murder"],"opposite":"","synonyms":""},{"def":"a statement accusing somebody of doing something wrong or bad","examples":["She rejected the charge that the story was untrue.","Be careful you don't leave yourself open to charges of political bias.","He accused the government of fabricating the charges for political reasons.","The charges will be difficult to prove.","The prime minister dismissed the charge that he had misled Parliament.","She defended herself against charges of racism."],"opposite":"","synonyms":""},{"def":"the amount of electricity that is put into a battery or carried by a substance","examples":["a positive/negative charge"],"opposite":"","synonyms":""},{"def":"the act of putting electricity into a battery; the electricity in a battery","examples":["on charge He put his phone on charge.","My laptop had run out of charge."],"opposite":"","synonyms":""},{"def":"a sudden rush or violent attack, for example by soldiers, wild animals or players in some sports","examples":["He led the charge down the field.","Allen led the charge, but could they get a goal back?","The bugle sounded the charge.","They were driven back by a police baton charge.","(figurative) Young people are leading the charge to clean up the city."],"opposite":"","synonyms":""},{"def":"the amount of explosive needed to fire a gun or make an explosion","examples":[],"opposite":"","synonyms":""},{"def":"the power to cause strong feelings","examples":["the emotional charge of the piano piece","a film in which every scene carries an emotional charge"],"opposite":"","synonyms":""},{"def":"a task or duty","examples":["His charge was to obtain specific information."],"opposite":"","synonyms":""},{"def":"to accuse somebody formally of a crime so that there can be a trial in court","examples":["Police have brought a charge of dangerous driving against the man.","Many victims of crime are reluctant to press charges against their attackers.","She laid charges against the firm for not complying with the regulations."],"opposite":"","synonyms":""},{"def":"to get a strong feeling of excitement or pleasure from something","examples":["I get a real charge out of working hard and seeing good results."],"opposite":"","synonyms":""},{"def":"to be the first to make the effort to do something new","examples":["Denmark, Norway and Sweden are united in leading the charge to a cash-free economy."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"bring/press/lay/prefer charges against somebody","def":"to accuse somebody formally of a crime so that there can be a trial in court","examples":["Police have brought a charge of dangerous driving against the man.","Many victims of crime are reluctant to press charges against their attackers.","She laid charges against the firm for not complying with the regulations."]},{"idiom":"get a charge out of something","def":"to get a strong feeling of excitement or pleasure from something","examples":["I get a real charge out of working hard and seeing good results."]},{"idiom":"lead the charge","def":"to be the first to make the effort to do something new","examples":["Denmark, Norway and Sweden are united in leading the charge to a cash-free economy."]}],"phrasal":[],"related":["charge card","charge nurse","charge sheet","cover charge","depth charge","charge account","charge capping","chargé d’affaires","congestion charge","reverse-charge","service charge","prescription charge","community charge","Charge of the Light Brigade","charge cards","charge nurses","charge sheets"]},{"pos":"verb","level":"B1","meanings":[{"def":"to ask an amount of money for goods or a service","examples":["The fees charged by some companies are excessive.","charge something for something What did they charge for the repairs?","The restaurant charges £40 for the set menu.","They are charging a reasonable price for the album.","charge somebody for something We won't charge you for delivery.","charge somebody something He only charged me half price.","charge somebody something for something She charged me £300 for the car.","charge something at something Calls are charged at 36p per minute.","charge for something Do you think museums should charge for admission?","charge to do something The bank doesn't charge to stop a payment.","charge somebody to do something They charge you to change money into euros.","They’re charging £3 for the catalogue.","Calls will be charged at 90 cents a minute.","Companies are free to charge whatever they like for their services.","Stamp Duty will be charged at one per cent.","We don't charge for delivery.","Your broker will charge you a 6% commission on the transaction.","The people responsible will be charged for the damage.","Interest was not charged on student loans.","Two other taxes are also charged on fuel according to its price.","We will charge an hourly rate for the work.","The cinema charges a flat rate of a dollar a show.","They charge smaller customers a premium.","The bank charges a commission on all foreign currency transactions."],"opposite":"","synonyms":""},{"def":"to record the cost of something as an amount that somebody has to pay","examples":["charge something to something They charge the calls to their credit-card account.","(North American English) charge something Don't worry. I'll charge it (= pay by credit card).","charge something against something Research and development expenditure is charged against profits in the year it is incurred.","€50 will be charged to your account.","The cost is charged directly to the profit and loss account."],"opposite":"","synonyms":""},{"def":"to pass electricity through something so that it is stored there; to take in electricity so that it is stored and ready for use","examples":["charge (something) I need to charge my phone.","Before use, the battery must be charged.","Don't unplug my phone—it's charging.","Let the batteries charge fully before using.","charge something up The shaver can be charged up and used when travelling."],"opposite":"","synonyms":""},{"def":"to accuse somebody formally of a crime so that there can be a trial in court","examples":["charge somebody Several people were arrested but nobody was charged.","be charged with something He was charged with murder.","be charged with doing something They were charged with organizing an illegal demonstration.","A man has been charged in connection with the attack.","She has not yet been formally charged with the crime.","The teenagers were jointly charged with attempted murder.","She was charged under section three of the Computer Misuse Act.","Four of his assistants also charged in the case were fined and given jail terms of up to five years.","Companies are often charged with multiple offenses.","She was never charged with the crime.","Peters was charged with two counts of armed robbery.","to be charged with assault/​manslaughter/​rape","An unnamed San Francisco man has been arrested and charged with possession of stolen property.","They were charged with conspiracy to commit fraud."],"opposite":"","synonyms":""},{"def":"to accuse somebody publicly of doing something wrong or bad","examples":["Opposition MPs charged the minister with neglecting her duty."],"opposite":"","synonyms":""},{"def":"to make a claim or statement that something will happen or be the case","examples":["Opponents charged that cutting costs would reduce safety."],"opposite":"","synonyms":""},{"def":"to rush forward and attack somebody/something","examples":["The bull put its head down and charged.","charge (at) somebody/something We charged at the enemy.","I was worried that the animal might charge at us.","The rhino charged headlong towards us.","He ordered his troops to charge the enemy lines."],"opposite":"","synonyms":""},{"def":"to rush in a particular direction","examples":["The children charged down the stairs.","He came charging into my room and demanded to know what was going on.","I heard the sound of feet charging down the stairs.","She charged into the room.","The children were all charging around outside.","He came charging into my office and demanded an explanation.","The children all charged down the stairs and out of the front door.","Three of the men charged towards Gallagher."],"opposite":"","synonyms":""},{"def":"to give somebody a responsibility or task","examples":["be charged with something The committee has been charged with the development of sport in the region.","be charged with doing something The governing body is charged with managing the school within its budget."],"opposite":"","synonyms":""},{"def":"to fill somebody with an emotion","examples":["be charged (with something) The room was charged with hatred."],"opposite":"","synonyms":""},{"def":"to fill a glass","examples":["Please charge your glasses and drink a toast to the bride and groom!"],"opposite":"","synonyms":""},{"def":"to load a gun","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]