[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cha/chara/character__us_3.mp3","phonsUS":"/ˈkærəktər/","level":"A2","meanings":[{"def":"a person or an animal in a book, play or film","examples":["the main character in the film","a major/minor character in the book","Who plays the main character?","He loves to draw and create his own cartoon characters.","Clint Eastwood's character is the most sympathetic in the movie.","The minor characters in the novel provide a lot of the humour.","One of the main characters in the film is Leo Bloom, an accountant.","the artist who developed the Superman character","The writers killed off her character when she wanted to leave the soap.","The two lead actors inhabit their characters fully.","The main character is played by Nicole Kidman.","The film also features the new character Mary Anna Morrison.","The actors remained in character to answer questions from the audience.","colourful/​interesting characters","The film jumps between characters and plots and yet fails to properly develop any of them.","The book mixes fictional characters with real people.","the central/​lead character in the story","He played the title character in the film Dr. No.","The play has strong female characters.","Who was your favorite character in the play?","The film portrays all the characters as complex human beings.","She creates characters the audience can sympathize with.","The show has a familiar cast of characters.","Among the exhibition's highlights are character studies of the artist's friends and colleagues.","The story line and character development are both strong."],"opposite":"","synonyms":""},{"def":"a particular type of person in a play, film or TV show","examples":["He has developed a skill set from his character work in film,TV and stage."],"opposite":"","synonyms":""},{"def":"all the qualities and features that make a person different from others","examples":["to have a strong/weak character","character traits","character defects","The book gives a fascinating insight into Mrs Obama's character.","Generosity is part of the American character.","His scruffy appearance does not reflect his character.","She revealed her true character when anyone disagreed with her.","She's undergone a complete character change since her promotion.","It's not in his character to be so secretive.","She, too, was a determined character and was not going to give up that easily.","a tough/​determined/​shrewd character"],"opposite":"","synonyms":""},{"def":"strong personal qualities such as the ability to deal with difficult or dangerous situations","examples":["Everyone admires her strength of character and determination.","He showed great character returning to the sport after his accident.","Adventure camps are considered to be character-building (= meant to improve somebody's strong qualities).","The team showed great character in coming back to win.","He is a man of good character and integrity.","a woman of impeccable moral character"],"opposite":"","synonyms":""},{"def":"the way that something is; a particular quality or feature that a thing, an event or a place has","examples":["The character of the neighbourhood hasn't changed at all.","I love the delicate character of the light in the evening.","The police pointed out the illegal character of the protest action.","in character buildings that are very simple in character","As you move north, the landscape takes on a different character.","Each house in the street has its own distinctive character.","Food in Italy has a distinct regional character.","It's the basil that gives the sauce its essential character.","The development detracts from the rural character of the area.","The houses are Mediterranean in character.","The renovated buildings retain their traditional character.","The town centre has lost much of its original character.","factors that form the character of a nation","the features that make up the national character","the public character of material published on the internet","Most of the buildings are very simple in character.","Your handwriting has a character of its own.","offences of a serious character","Prague's unique character is reflected in its abundant architectural heritage."],"opposite":"","synonyms":""},{"def":"the interesting or unusual quality that a place or a person has","examples":["The modern hotels here have no real character.","a face with a lot of character","the individual touches that give character to a house","His face has character—I'll say that for it.","buildings of considerable character","The restaurant is cheap and full of character.","I was looking for an old house with character."],"opposite":"","synonyms":""},{"def":"a person, particularly an unpleasant or strange one","examples":["There were some really strange characters hanging around the bar.","Who's that suspicious character hanging around outside?","He reported several undesirable characters lurking around the estate.","a/​an unsavoury/​undesirable/​shady character"],"opposite":"","synonyms":""},{"def":"an interesting or unusual person","examples":["She's a character!","The bar was full of interesting local characters.","You must have come across some real characters, working in the circus."],"opposite":"","synonyms":""},{"def":"the opinion that people have of you, particularly of whether you can be trusted or relied on","examples":["She was a victim of character assassination (= an unfair attack on the good opinion people had of her).","a slur/attack on his character","My teacher agreed to be a character witness for me in court.","a character reference (= a letter that a person who knows you well writes to an employer to tell them about your good qualities)","Applicants had to obtain character references before being considered for the work.","He had been discharged without a stain on his character.","He was prepared to sue for defamation of character.","The defence lawyer attempted a character assassination of the witness."],"opposite":"","synonyms":""},{"def":"a letter, sign, mark or symbol used in writing, in printing or on computers","examples":["These are the Chinese characters meaning ‘wind’ and ‘water’.","This size of type produces a line 30 characters long.","optical character recognition","The URL contained non-standard characters like question marks."],"opposite":"","synonyms":""},{"def":"typical/not typical of a person’s character","examples":["Her behaviour last night was completely out of character.","The lawyer argued that his client's violent behaviour was out of character."],"opposite":"","synonyms":""},{"def":"in the same style as something","examples":["The new wing of the museum was not really in character with the rest of the building."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in character | out of character","def":"typical/not typical of a person’s character","examples":["Her behaviour last night was completely out of character.","The lawyer argued that his client's violent behaviour was out of character."]},{"idiom":"in character (with something)","def":"in the same style as something","examples":["The new wing of the museum was not really in character with the rest of the building."]}],"phrasal":[],"related":["character actor","character code","character recognition","non-player character","optical character recognition","character codes","acquired character","character actors"]}]