[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cha/chart/charter__us_1.mp3","phonsUS":"/ˈtʃɑːrtər/","level":"C1","meanings":[{"def":"a written statement describing the rights that a particular group of people should have","examples":["the European Social Charter of workers’ rights","a rail passenger’s charter","a charter of rights for people with disabilities","a national charter for the protection of animals","He fought for a social charter of workers' rights.","Minority rights are protected by the UN charter.","A commission was appointed to draw up a charter to regulate political life."],"opposite":"","synonyms":""},{"def":"a written statement of the principles and aims of an organization","examples":["the United Nations Charter"],"opposite":"","synonyms":""},{"def":"an official document stating that a government or political leader allows a new organization, town or university to be established and gives it particular rights","examples":["The Royal College received its charter as a university in 1967.","Certain towns were allowed to hold weekly markets, by royal charter.","The BBC's charter was due to be renewed.","The university received its Royal Charter in 1946.","They were given this right by royal charter."],"opposite":"","synonyms":""},{"def":"a law or policy that seems likely to help people do something bad","examples":["The new law will be a charter for unscrupulous financial advisers.","a blackmailer’s charter"],"opposite":"","synonyms":""},{"def":"the hiring of a plane, boat, etc.","examples":["a yacht available for charter"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["royal charter","charter flight","charter member","charter school","Atlantic Charter","Citizen's Charter","Patient's Charter","Canadian Charter of Rights and Freedoms","the Charter","charter flights","charter members"]},{"pos":"verb","level":"","meanings":[{"def":"to hire a plane, boat, etc. for your own use","examples":["They flew to Athens and then chartered a boat to the island.","Special trains were chartered to take them to the festival.","The club chartered a special flight from Manchester to Turin.","The oil companies use both owned and chartered ships."],"opposite":"","synonyms":""},{"def":"to state officially that a new organization, town or university has been established and has special rights","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]