[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cha/chat_/chat__us_1.mp3","phonsUS":"/tʃæt/","level":"A2","meanings":[{"def":"to talk in a friendly, informal way to somebody","examples":["I'm sorry I can't stop to chat.","The two of us got chatting (= started chatting) at the bus stop.","chat to/with somebody My kids spend hours chatting on the phone to their friends.","chat away Within minutes of being introduced they were chatting away like old friends.","chat away to/with somebody Everyone here chats away to you as though they've known you for decades.","chat about something/somebody What were you chatting about?","George was in the kitchen chatting to some friends.","I spent a happy half-hour chatting with a friend.","They chatted away to each other.","We chatted briefly about the weather.","You will have a chance to circulate and chat informally."],"opposite":"","synonyms":""},{"def":"to exchange messages with somebody on the internet, when you can see and reply to messages immediately and have a written conversation","examples":["chat (to/with somebody) I've been chatting online with my best friend.","chat about something/somebody I use social media to chat about stuff as well."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["chat up"],"related":["chat up","chat-up","web chat","chat room","chat show","chit-chat","fireside chat","chat-ups","chat rooms","chat shows","Internet Relay Chat","chat somebody"]},{"pos":"noun","level":"A2","meanings":[{"def":"a friendly informal conversation","examples":["I just called in for a chat.","chat with somebody I had a long chat with her.","chat about somebody/something He always enjoyed a chat about the old days.","Discussions are still taking place between the two leaders.","a telephone conversation","The novel has long descriptions and not much dialogue.","The President told waiting reporters there had been a constructive dialogue.","I had a long talk with my boss about my career prospects.","a debate on prison reform","There have been extensive consultations between the two countries.","We had a good gossip about the boss.","We had a nice chat over a cup of tea.","a chat about his new job","a chat between Mrs May and a journalist","a friendly chat with a colleague","I just called in for a chat about the kids."],"opposite":"","synonyms":"discussion"},{"def":"talking, especially informal conversation","examples":["After a few more minutes of chat, she left.","That's enough chat from me—on with the music!","They say he's already married, but it's just idle chat.","chat with somebody He would never engage in chat with the servants.","chat about somebody/something There was some general chat about the weather before the interview started.","Discussions are still taking place between the two leaders.","a telephone conversation","The novel has long descriptions and not much dialogue.","The President told waiting reporters there had been a constructive dialogue.","I had a long talk with my boss about my career prospects.","a debate on prison reform","There have been extensive consultations between the two countries.","We had a good gossip about the boss."],"opposite":"","synonyms":"discussion"},{"def":"communication between people on the internet in which they see and reply to messages immediately and have a written conversation","examples":["Fans are invited to an online chat.","a guide to internet chat safety for children","chat with somebody You can take part in a live chat with the movie's director this afternoon.","chat about somebody/something There was much chat about it on internet message boards.","chat software","internet chat services"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]