[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/che/cheat/cheat__us_1.mp3","phonsUS":"/tʃiːt/","level":"B1","meanings":[{"def":"to trick somebody or make them believe something that is not true","examples":["cheat somebody/something She is accused of attempting to cheat the taxman.","We will crack down on people who try to cheat the system.","Many people feel cheated by the election process.","cheat somebody out of something He cheated investors out of billions of dollars.","She is accused of attempting to cheat the taxman.","He cheated his way into the job.","Just don’t be fooled into investing any money with them.","She deceived him into handing over all his savings.","She felt betrayed when she found out the truth about him.","I was taken in by her story.","They had been conned out of £100 000.","Customers were cheated by unscrupulous retailers.","Many people felt cheated by the government's refusal to hold another referendum."],"opposite":"","synonyms":"cheat"},{"def":"to act in a dishonest way in order to gain an advantage, especially in a game, a competition, an exam, etc.","examples":["He cheats at cards.","(British English) Have you ever cheated in an exam?","(North American English) Have you ever cheated on an exam?","You're not allowed to look at the answers—that's cheating.","Anyone caught cheating will be automatically disqualified from the examination.","Why would anyone want to lie or cheat?"],"opposite":"","synonyms":""},{"def":"to have a secret sexual relationship with somebody else","examples":["He’s cheating on his wife."],"opposite":"","synonyms":""},{"def":"to survive in a situation where you could have died","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"cheat death","def":"to survive in a situation where you could have died","examples":[]}],"phrasal":["cheat of","cheat out of"],"related":["cheat of","cheat sheet","cheat out of","cheat sheets","cheat somebody of something | cheat somebody out of something"]},{"pos":"noun","level":"B1","meanings":[{"def":"a person who cheats, especially in a game","examples":["You little cheat!","Are you accusing me of being a cheat?","a plan to crack down on tax cheats","benefit/welfare cheats","attempts to eliminate drug cheats from the sport","I've been a liar and a cheat."],"opposite":"","synonyms":""},{"def":"something that seems unfair or dishonest, for example a way of doing something with less effort than it usually needs","examples":["It's really a cheat, but you can use ready-made pastry if you want."],"opposite":"","synonyms":""},{"def":"a program you can use to move immediately to the next stage of a computer game without needing to play the game","examples":["There's a cheat you can use to get to the next level."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]