[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/che/check/check__us_1.mp3","phonsUS":"/tʃek/","level":"A1","meanings":[{"def":"to examine something to see if it is correct, safe or acceptable","examples":["check something She gave me the minutes of the meeting to read and check.","Check the oil and water before setting off.","Check your work before handing it in.","Customs officers have the right to check all luggage going through customs.","The cars were checked to see whether the faults had been spotted.","check something for something Check the container for cracks or leaks.","Be sure to check labels for specific information.","check something against something I'll need to check these figures against last year's.","Check your work before handing it in.","The goods were examined for damage on arrival.","Make sure you inspect the goods before signing for them.","The Tourist Board inspects all recommended hotels at least once a year.","Go over your work for spelling mistakes before you hand it in.","Check the engine oil level regularly.","Check the roof for loose slates."],"opposite":"","synonyms":"check"},{"def":"to look at something or ask somebody to find out if something/somebody is present, correct or true or if something is how you think it is","examples":["We'll check back in a couple of hours.","We were interrupted by a waiter checking to see if everything was OK.","‘Is Mary in the office?’ ‘Just a moment. I'll go and check.’","check something Hang on—I just need to check my email.","She's constantly checking her phone—it drives me mad.","check something for something Check our website for details.","check (that)… Go and check (that) I’ve locked the windows.","check with somebody Check with your doctor before beginning any exercise programme.","check what/whether, etc…. She glance around to check whether anyone was watching.","check with somebody what/whether, etc… You'd better check with Jane what time she's expecting us tonight.","check something against something The data is then checked against a database of criminals.","Always check that the electricity is switched off before you start.","He was just checking to see if I was in my room.","I checked with her to see if she needed any help.","It's worth checking that there is no rust on the car.","We had better check that all the doors are locked."],"opposite":"","synonyms":""},{"def":"to put a mark (✓) next to an item on a list, an answer, etc.","examples":["Check the box next to the right answer.","To take advantage of this extra bonus offer, simply check the box on your order form."],"opposite":"","synonyms":""},{"def":"to control something; to stop something from increasing or getting worse","examples":["The government is determined to check the growth of public spending.","She tied some strips of cloth around the wound to check the bleeding.","The active ingredient checks the growth of bacteria."],"opposite":"","synonyms":""},{"def":"to stop yourself from saying or doing something or from showing a particular emotion","examples":["check something to check your anger/laughter/tears","She made no effort to check her tears and just let them run down her face.","check yourself She wanted to tell him the whole truth but she checked herself—it wasn't the right moment."],"opposite":"","synonyms":""},{"def":"to leave coats, bags, etc. in an official place (called a checkroom) while you are visiting a club, restaurant, etc.","examples":["Do you want to check your coats?"],"opposite":"","synonyms":""},{"def":"to leave bags or cases with an official so that they can be put on a plane or train","examples":["How many bags are you checking?"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["check in","check into","check off","check on","check out","check over","check through","check up on"],"related":["check in","check-in","check on","check-up","check off","check out","body check","check card","check into","check over","coat check","cross-check","rain check","spot check","check through","check up on"]},{"pos":"noun","level":"A2","meanings":[{"def":"an act of making sure that something is safe, correct or in good condition by examining it","examples":["Could you give the tyres a check?","I went for a health check before going on the trip.","The drugs were found in their car during a routine check by police.","I'll just have a quick check to see if the letter's arrived yet.","check of something She had a thorough check of the room, but nothing had been taken.","check for something a check for spelling mistakes","check on something It is vital to keep a check on your speed (= look at it regularly in order to control it).","I did a final check on the seating arrangements.","check with somebody A check with the doctor confirmed his fears.","A spokesperson said the company made regular checks with the police and the council.","A thorough check is made before the luggage is put on the plane.","I did a quick visual check of the engine.","I have to go for a dental check.","Police are keeping a close check on the house.","a routine check on the factory","I had a last-minute check to see if the email had arrived.","Regular safety checks are conducted on the equipment used in the factory."],"opposite":"","synonyms":""},{"def":"an investigation to find out more information about somebody/something","examples":["The agency insisted all the necessary background checks had been carried out.","Security checks were causing long delays at border crossings.","check on somebody/something The police ran a check on the registration number of the car.","Was any check made on Mr Morris when he applied for the post?","We're running a police check on all applicants for the job."],"opposite":"","synonyms":""},{"def":"a mark (✓) put next to a sum or an item on a list, usually to show that it has been checked or done or is correct","examples":["The teacher put a check next to his name.","If there are no checks in the boxes, you have successfully unsubscribed.","Place a check beside each characteristic that you feel that you possess."],"opposite":"","synonyms":""},{"def":"a piece of paper that shows how much you have to pay for the food and drinks that you have had in a restaurant","examples":["Can I have the check, please?","Tess asked for the check and handed the waiter a credit card.","I paid the check for the dinner.","the gas bill","Put it on my account please.","The builders sent an invoice for £250.","Can I have the check, please?","The waiter handed me the check for my meal.","Uncle Louie picked up the dinner check."],"opposite":"","synonyms":"bill"},{"def":"a printed form that you can write on and sign as a way of paying for something instead of using money","examples":[],"opposite":"","synonyms":""},{"def":"something that delays the progress of something else or stops it from getting worse","examples":["A cold spring will provide a natural check on the number of insects.","the most fundamental check to the power of the British monarchy","The House of Commons became the most fundamental check to the power of the British monarchy.","Leaving some fields fallow provided a natural check on insect populations.","The law acts as a check on people's actions."],"opposite":"","synonyms":""},{"def":"rules that are designed to control the amount of power, especially political power, that one person or group has","examples":[],"opposite":"","synonyms":""},{"def":"a pattern of squares, usually of two colours","examples":["Do you prefer checks or stripes?","a check shirt/suit","a yellow and red check skirt"],"opposite":"","synonyms":""},{"def":"a place in a club, restaurant, etc. where you can leave your coat or bag","examples":[],"opposite":"","synonyms":""},{"def":"a ticket that you get when you leave your coat, bag, etc. in, for example, a restaurant or theatre","examples":[],"opposite":"","synonyms":""},{"def":"a position in which a player’s king (= the most important piece) can be directly attacked by the other player’s pieces","examples":["There, you're in check."],"opposite":"","synonyms":""},{"def":"to keep something under control so that it does not spread or get worse","examples":["Maggie managed to keep her temper in check.","The epidemic was held in check by widespread vaccination.","You need to keep your temper in check!"],"opposite":"","synonyms":""},{"def":"to refuse an offer or invitation but say that you might accept it later","examples":["‘Are you coming for a drink?’ ‘Can I take a rain check?—I must get this finished tonight.’"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"hold/keep something in check","def":"to keep something under control so that it does not spread or get worse","examples":["Maggie managed to keep her temper in check.","The epidemic was held in check by widespread vaccination.","You need to keep your temper in check!"]},{"idiom":"take a rain check (on something)","def":"to refuse an offer or invitation but say that you might accept it later","examples":["‘Are you coming for a drink?’ ‘Can I take a rain check?—I must get this finished tonight.’"]}],"phrasal":[],"related":[]},{"pos":"exclamation","level":"","meanings":[{"def":"used to show that you agree with somebody or that something on a list has been dealt with","examples":["‘Do you have your tickets?’ ‘Check.’ ‘Passport?’ ‘Check.’"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]