[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/che/cheer/cheer__us_1.mp3","phonsUS":"/tʃɪr/","level":"B2","meanings":[{"def":"to shout loudly, in order to show support or praise for somebody, or to encourage them","examples":["We all cheered as the team came on to the field.","Cheering crowds greeted their arrival.","cheer for somebody/something The fans cheered for their team.","cheer somebody The crowd cheered the president as he drove slowly by.","Stop shouting and listen!","‘Run!’ he shouted.","She yelled at the boy to get down from the wall.","She ran over to the window and cried for help.","He screamed at me to stop.","We all cheered as the team came onto the field.","‘Quiet!’ the teacher bellowed.","She never once raised her voice to us.","The crowd cheered loudly as he came on stage.","The crowd cheered loudly as the goalkeeper made a brilliant save."],"opposite":"boo","synonyms":"shout"},{"def":"to encourage somebody or to give them hope or comfort","examples":["be cheered (by something) She was cheered by the news from home.","He was cheered by the thought of a drink and something to eat.","I was greatly cheered by this news."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["cheer on","cheer up"],"related":["cheer on","cheer up","Bronx cheer","cheer somebody","cheer up | cheer somebody/something"]},{"pos":"noun","level":"B2","meanings":[{"def":"a shout of joy, support or praise","examples":["A great cheer went up from the crowd.","cheers of encouragement","Three cheers for the winners! (= used when you are asking a group of people to cheer three times, in order to congratulate somebody, etc.)","He accepted the prize amid cheers.","She got a loud cheer when she finished speaking.","She went off the stage to loud cheers.","The players were greeted by rousing cheers.","There were loud cheers from the crowd.","They gave a big cheer when I finally arrived.","Three cheers for Mr Jones!","a cheer for democracy","cheers of welcome"],"opposite":"boo","synonyms":""},{"def":"a special song or poem used by cheerleaders","examples":[],"opposite":"","synonyms":""},{"def":"an atmosphere of happiness","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]