[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/chi/child/child__us_1.mp3","phonsUS":"/tʃaɪld/","level":"A1","meanings":[{"def":"a young human who is not yet an adult","examples":["a child of 3/a 3-year-old child","men, women and children","an organization that campaigns for the rights of the unborn child","The film is not suitable for young children.","I lived in London as a child.","She was a child star but never made it as an adult.","Children grow up so quickly!","He had old-fashioned ideas on how to bring up children.","He's always been a problem child.","My father died while I was still a small child.","She works in a centre for delinquent children.","The children were quite unruly and ran around the house as if they owned it.","There are a lot of street children in the poorer parts of the city.","What a precocious child—reading Jane Austen at the age of ten!","You can't spoil a child by giving it all the affection it wants.","a child custody dispute between divorced parents","a school for gifted children","good food for growing children","tax concessions for families with dependent children","the emotional connections which ensure healthy child development","All the children learn to swim from an early age.","The book is aimed at the parents of pre-school children.","He took the children to Disneyland.","Will you put the children to bed?","It has been her dream since she was a child.","A family ticket (two adults and two children) costs £30.","The product was developed with parents and children in mind.","All of her children and grandchildren were at the party.","timeless images of mother and child","Entrance is free for children.","The organization helps seriously ill children and their families.","a campaign to increase dairy consumption among children","You're behaving like a child.","He taught the children about the importance of nutrition and exercise.","The law is in place to protect children.","Arts Umbrella educates children in the visual and performing arts.","In a small child, learning happens with repetition.","All children under the age of 11 were given free admission.","Children learn in different ways.","She works as an illustrator of children's books.","She grew up in children's homes and foster care","Fair Trade Certified means that men and women receive equal wages and that no child labor is used.","All staff are aware of child protection issues.","The government is aiming to halve child poverty in the next five years.","Local authorities have the responsibility for child welfare.","Child soldiers were used by all sides during the 14-year civil war.","They try to establish positive relationships with the children in their care.","parents of children with special needs","With the right support most children with special educational needs can be included successfully at a mainstream school."],"opposite":"","synonyms":""},{"def":"a son or daughter of any age","examples":["They have three grown-up children.","a support group for adult children of alcoholics","They can't have children.","She didn't have her first child until she was nearly forty.","She couldn't imagine the pain of losing a child at birth.","Their first child was born with a rare heart condition.","They are expecting a child in June.","We had trouble conceiving our first child.","We have three teenage children.","We've got three teenage children.","Once the children left home, they moved overseas.","They have two children aged 21 and 17.","Most parents tend to raise their children in much the same way they were raised.","When they moved abroad, they sent their children to boarding school.","My parents are coming to help take care of the children.","They share custody of their two young children.","They moved to the country after the birth of their child.","They tried to control their children's lives."],"opposite":"","synonyms":""},{"def":"a person who is strongly influenced by the ideas and attitudes of a particular time or person","examples":["a child of the 90s"],"opposite":"","synonyms":""},{"def":"an adult who behaves like a child and is not mature or responsible","examples":[],"opposite":"","synonyms":""},{"def":"to be very easy to do, so not even a child would find it difficult","examples":[],"opposite":"","synonyms":""},{"def":"to be pregnant","examples":["big with child"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be child’s play","def":"to be very easy to do, so not even a child would find it difficult","examples":[]},{"idiom":"be with child","def":"to be pregnant","examples":["big with child"]}],"phrasal":[],"related":["child abuse","child seat","love child","only child","child benefit","child labour","child support","poster child","street child","child maintenance","child restraint","fur child","child labor","boomerang child","child benefits","latchkey child","the Child Support Agency","be expecting (a baby/child)"]}]