[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cho/choic/choice__us_1.mp3","phonsUS":"/tʃɔɪs/","level":"A2","meanings":[{"def":"an act of choosing between two or more possibilities; something that you can choose","examples":["We are faced with a difficult choice.","choice between A and B women forced to make a choice between family and career","We aim to help students make more informed career choices.","I am sure you have made the right choice.","Resources are finite, and choices have to be made between competing priorities and needs.","There is a wide range of choices open to you.","As I see it, we have two options…","Students have the option of studying abroad in their second year.","If I had the choice, I would stop working tomorrow.","There is a wide range of choices open to you.","You can be paid in cash weekly or by cheque monthly: those are the two alternatives.","We need to explore a wide range of possibilities.","The possibilities are endless.","There are two main reasons why I think it’s the best option: first, there's the cost and second, the quality.","I think/​believe it's the right thing to do because it gives everyone a fair chance.","I would choose the newer one on the grounds that it will last longer.","Of the three houses, the largest one seems to me to be the best, because they need the room.","My choice would be number 3, simply because it's the clearest design.","Doctors have to make moral choices every day of their lives.","These are personal choices that people must make for themselves.","I now had a clear choice: either I accept their terms or I leave.","In the end, the choice was quite easy.","She faced the stark choice of backing the new plan or losing her job.","When did you make a conscious choice to become an artist?","Your needs should dictate your choice.","a careful choice of words","a limited range of choices available to buyers","a range of available choices","to make choices about their future","Leaders must make good decisions and tough choices.","He wondered whether he had made the right choice.","Nutrition factors are driving consumer choices."],"opposite":"","synonyms":"option"},{"def":"the right to choose; the possibility of choosing","examples":["If I had the choice, I would stop working tomorrow.","He had no choice but to leave (= this was the only thing he could do).","She's going to do it. She doesn't have much choice, really, does she?","This government is committed to extending parental choice in education.","After a delicious meal with free wine, the choice is yours: a quiet drink in the bar, the late night disco or a stroll along the beach beneath a starry sky.","Sandy had to tell his tale in halting Italian. Since Franco spoke no English, he had no choice in the matter.","He had no choice about that.","I had no choice but to cancel my holiday.","The way he behaved meant that we had no choice in the matter.","We gave her the choice, and she decided she'd like a bike for her birthday.","Everyone in a democracy has the right to exercise choice.","Your decision leaves me with no choice but to resign.","You can have first choice of all the rooms.","to extend parental choice as to which schools children should attend","People still have a choice about where to live.","I believe in freedom of choice.","They were left with no choice but to trust her."],"opposite":"","synonyms":""},{"def":"a person or thing that is chosen","examples":["This colour wasn't my first choice.","choice for something She's the obvious choice for the job.","Hawaii remains a popular choice for winter vacation travel.","choice as something She wouldn't be my choice as manager.","choice of something I don’t like his choice of friends (= the people he chooses as his friends).","She’s the obvious choice for the job.","Which one’s your favourite?","Tastes and preferences vary from individual to individual.","A selection of reader’s comments are published below.","She was his pick for best actress.","I think she's a very good choice for captain.","It was a happy choice of venue","Maria defended her choice of name for the child.","Mary is a popular choice as chair of the committee.","Much ill health is the result of poor diet and lifestyle choices.","Our first choice for a holiday is the north of Scotland.","Our first choice for a site was already taken.","People were asked about their top choices for meeting locations.","She questioned the choice of Murphy for this role.","She was starting to regret her choice.","The hotel is the preferred choice for business people.","Bill is the obvious choice for captain of the team.","I don't think much of her choice of outfit.","The restaurant is a good choice for a night out.","He seems an odd choice for this sort of work."],"opposite":"","synonyms":"choice"},{"def":"the number or range of different things from which to choose","examples":["The menu has a good choice of desserts.","There wasn't much choice of colour.","I can't decide. There's too much choice.","The shop has a very limited choice of ties.","Students have a free choice from a range of subjects.","Smoking may limit your choice of contraception.","She has a choice between three different universities.","We offer a choice of ten different destinations.","The curtains come in a choice of twelve different colours.","Do supermarkets offer consumers too much choice?"],"opposite":"","synonyms":""},{"def":"to have such a lot of things to choose from that it is very difficult to make a decision","examples":[],"opposite":"","synonyms":""},{"def":"because you have chosen","examples":["I wouldn't go there by choice.","I wouldn't have come to this bar by choice!"],"opposite":"","synonyms":""},{"def":"that is chosen by a particular group of people or for a particular purpose","examples":["It's the software of choice for business use."],"opposite":"","synonyms":""},{"def":"that you choose yourself","examples":["First prize will be a meal for two at the restaurant of your choice."],"opposite":"","synonyms":""},{"def":"used for saying that there is very little difference between two or more things that you can choose","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be spoilt for choice","def":"to have such a lot of things to choose from that it is very difficult to make a decision","examples":[]},{"idiom":"by choice","def":"because you have chosen","examples":["I wouldn't go there by choice.","I wouldn't have come to this bar by choice!"]},{"idiom":"of choice (for somebody/something)","def":"that is chosen by a particular group of people or for a particular purpose","examples":["It's the software of choice for business use."]},{"idiom":"of your choice","def":"that you choose yourself","examples":["First prize will be a meal for two at the restaurant of your choice."]},{"idiom":"you pays your money and you takes your choice","def":"used for saying that there is very little difference between two or more things that you can choose","examples":[]}],"phrasal":[],"related":["anti-choice","pro-choice","Hobson’s choice","multiple-choice"]},{"pos":"adjective","level":"","meanings":[{"def":"of very good quality","examples":[],"opposite":"","synonyms":""},{"def":"of very good, but not the highest, quality","examples":[],"opposite":"","synonyms":""},{"def":"rude language that is used deliberately to have an effect","examples":["She summed up the situation in a few choice phrases.","He used some pretty choice language."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]