[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cho/choos/choose__us_1.mp3","phonsUS":"/tʃuːz/","level":"A1","meanings":[{"def":"to decide which thing or person you want out of the ones that are available","examples":["You choose—I can't decide.","choose between A and/or B She had to choose between staying in the UK or going home.","choose something Sarah chose her words carefully.","It depends which career path you choose.","There are several different options you can choose.","This site has been chosen for the new school.","choose A from B We have to choose a new manager from a shortlist of five candidates.","There are plenty of restaurants to choose from.","choose A over B The children chose milk over juice.","choose somebody/something as/for something He chose banking as a career.","We chose Phil McSweeney as/for chairperson.","choose whether, what, etc… You'll have to choose whether to buy it or not.","choose to do something We chose to go by train.","They chose to ignore my advice.","choose somebody to be/do something We chose Phil McSweeney to be chairperson.","She chews her lip thoughtfully before replying.","The magazine will choose six young designers.","You choose—I can’t decide.","He was selected for the team.","a randomly selected sample of 23 schools","She picked the best cake for herself.","We’re still trying to decide on a venue.","After graduating she opted for a career in music.","After a lot of thought, I opted against buying a motorbike.","I think I’ll go for the fruit salad.","She had to choose between giving up her job and hiring a nanny.","There are several different models to choose from.","They can choose freely from a wide range of courses.","You are free to choose whichever courses you want to take.","I chose a seat by the hot fire.","There are many styles to choose from.","I feel I've chosen the right path.","Many companies are likely to choose this option.","They told him to accept the new regulation or get out, and he chose the latter.","Have they chosen a name for the baby yet?","a representative chosen by the students in each group","I chose my words carefully.","Voters will choose their favourite candidate.","He chose Judy as his deputy.","He chose Judy to be his deputy.","They were chosen for their leadership skills.","Soya oil was chosen because of its low cost.","The village was chosen from among four possible sites.","He has the freedom to choose his own projects.","There aren't many options to choose from.","She was forced to choose between her two parents.","Lucy got to choose which restaurant we went to.","a randomly/​carefully chosen sample of teenagers","your chosen profession/​career","Children should choose what they eat, not have someone else decide for them."],"opposite":"","synonyms":"choose"},{"def":"to prefer or decide to do something","examples":["Employees can retire at 60 if they choose.","choose to do something Many people choose not to marry.","With practice, you can consciously choose not to react in a stressed way.","We deliberately chose to stay in a cheap non-western hotel.","I am going to remain here for as long as I choose.","The government chose to ignore the matter altogether.","They chose to remain anonymous.","Many artists choose to live in this part of town.","She chose to use a different name.","They have the right to choose whether or not to vote."],"opposite":"","synonyms":""},{"def":"to choose only those things that you like or want very much","examples":["You have to take any job you can get—you can't pick and choose."],"opposite":"","synonyms":""},{"def":"there is very little difference between two or more things or people","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"pick and choose","def":"to choose only those things that you like or want very much","examples":["You have to take any job you can get—you can't pick and choose."]},{"idiom":"there is nothing/not much/little to choose between A and B","def":"there is very little difference between two or more things or people","examples":[]}],"phrasal":[],"related":["(choose, follow, take, etc.) the line/path of least resistance"]}]