[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cir/circu/circuit__us_1.mp3","phonsUS":"/ˈsɜːrkɪt/","level":"B2","meanings":[{"def":"a line, route or journey around a place","examples":["The race ended with eight laps of a city centre circuit.","The earth takes a year to make a circuit of (= go around) the sun.","We did a complete circuit of the park in twenty minutes.","Green Day moves into the lead as they turn into the straight on the first circuit.","Runners have to complete fifteen circuits of the two-mile circular course."],"opposite":"","synonyms":""},{"def":"the complete path of wires and equipment along which an electric current flows","examples":["an electrical circuit","a circuit diagram (= one showing all the connections in the different parts of the circuit)"],"opposite":"","synonyms":""},{"def":"a series of games or matches in which the same players regularly take part","examples":["This is her biggest triumph in nine years on the women's tennis circuit.","He announced his retirement from the professional circuit last year."],"opposite":"","synonyms":""},{"def":"a track for cars or motorcycles to race around","examples":[],"opposite":"","synonyms":""},{"def":"a series of places or events of a particular kind at which the same people appear or take part","examples":["the lecture/cabaret circuit","She's a well-known figure on the international lecture circuit.","Talent scouts spotted him playing on the amateur circuit.","Young's film has hit the festival circuit in the US."],"opposite":"","synonyms":""},{"def":"a series of different exercises that you do one after the other when doing circuit training in sport or fitness training","examples":["I do circuits in the gym twice a week."],"opposite":"","synonyms":""},{"def":"a regular journey made by a judge to hear court cases in each of the courts of law in a particular area","examples":["a circuit court/judge"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["circuit board","circuit court","logic circuit","ring circuit","short circuit","short-circuit","barbecue circuit","circuit breaker","circuit training","parallel circuit","printed circuit","integrated circuit","closed-circuit television","circuit boards","circuit courts","circuit breakers","Borscht circuit","printed circuit board"]}]