[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cir/circu/circulation__us_1.mp3","phonsUS":"/ˌsɜːrkjəˈleɪʃn/","level":"C1","meanings":[{"def":"the movement of blood around the body","examples":["Regular exercise will improve blood circulation.","to have good/bad circulation","I have poor circulation.","I've got poor circulation.","to have a massage to stimulate your circulation","People with poor circulation are more likely to suffer from the condition."],"opposite":"","synonyms":""},{"def":"the passing or spreading of something from one person or place to another","examples":["the circulation of money/information/ideas","in circulation A number of forged tickets are in circulation.","The coins were taken out of circulation.","Copies of the magazine were withdrawn from circulation.","putting computer viruses into circulation","Restricted circulation of the report will reduce the risk of leaks outside the ministry.","The new banknotes will go into general circulation next year.","the amount of money in circulation"],"opposite":"","synonyms":""},{"def":"the usual number of copies of a newspaper or magazine that are sold each day, week, etc.","examples":["a daily circulation of more than one million","The newspaper has a daily circulation of 20 000."],"opposite":"","synonyms":""},{"def":"the movement of something (for example air, water, gas, etc.) around an area or inside a system or machine","examples":["Poor air circulation can cause condensation.","The design of the shoe allows for a greater circulation of air around the foot, keeping it cool.","Disease can spread more easily in an environment with damp and poor air circulation."],"opposite":"","synonyms":""},{"def":"the fact that somebody takes part in social activities at a particular time","examples":["in circulation Anne has been ill but now she's back in circulation.","out of circulation I was out of circulation for months after the baby was born."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]