[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cir/circu/circumstance__us_3.mp3","phonsUS":"/ˈsɜːrkəmstæns/","level":"B2","meanings":[{"def":"the conditions and facts that are connected with and affect a situation, an event or an action","examples":["Police said there were no suspicious circumstances surrounding the boy's death.","under … circumstances Under normal circumstances, your white blood cells are able to fight infections.","in … circumstances The company reserves the right to cancel this agreement in certain circumstances.","In exceptional circumstances, detainees could be denied access to a lawyer.","I know I can trust her in any circumstance.","Due to unforeseen circumstances, we have had to reschedule the concert.","Britain is fortunately not facing the same set of circumstances.","The court will take into account all the circumstances of the case.","Police are investigating the circumstances of the death of a baby boy.","the present economic situation","The ship sank in mysterious circumstances.","She felt she was in a position of power.","We were forced to work outside in freezing conditions.","Hi, Jane! How are things?","Think things over before you decide.","If that is the case (= if the situation described is true), we need more staff.","How did this unhappy state of affairs come about?","changing social and political circumstances","He died in tragic circumstances.","In the present circumstances, there must be no military intervention whatsoever.","In similar circumstances, what would you have done?","Exceptions are made in special circumstances.","The ship sank in mysterious circumstances.","She never discovered the true circumstances of her birth.","His sentence was reduced because of the extenuating circumstances.","Estimates vary depending on the circumstances.","I felt that circumstances were conspiring against me.","In normal circumstances I would let you use my car, but today I need it.","Only if the circumstances are exceptional will we accept late applications.","She died in rather suspicious circumstances.","The bank will investigate the circumstances surrounding the robbery.","The delays were due to circumstances beyond our control.","The plan might work better with more favourable/​favorable circumstances.","We lost our position in the market due to a combination of circumstances.","an unfortunate set of circumstances that made her life difficult","life in the changing economic circumstances of China"],"opposite":"","synonyms":"situation"},{"def":"the conditions of a person’s life, especially the money they have","examples":["We want to work towards improving the often difficult circumstances in which people find themselves.","The particular circumstances of each individual claimant must be considered.","Grants are awarded according to your personal circumstances.","her family/domestic circumstances","the tragic circumstances of his early life","people facing adverse circumstances","The amount paid will vary according to circumstances.","He was a writer living in straitened circumstances."],"opposite":"","synonyms":""},{"def":"situations and events that affect and influence your life and that are not in your control","examples":["a victim of circumstance (= a person who has suffered because of a situation that they cannot control)","He had to leave the country through force of circumstance (= events made it necessary).","We were simply thrown together by circumstance on the long journey.","The survivors ate plants and insects by force of circumstance.","He was simply a victim of circumstance."],"opposite":"","synonyms":""},{"def":"used before or after a statement to show that you have thought about the conditions that affect a situation before making a decision or a statement","examples":["Under the circumstances, it seemed better not to tell him about the accident.","She did the job very well in the circumstances.","In the circumstances, you'd better call the police."],"opposite":"","synonyms":""},{"def":"used to emphasize that something should never happen or be allowed","examples":["Under no circumstances should you lend Paul any money.","Don't open the door, in any circumstances.","Under no circumstances should you leave the door unlocked."],"opposite":"","synonyms":""},{"def":"formal and impressive ceremony","examples":["Funerals of famous people were conducted with great pomp and circumstance."],"opposite":"","synonyms":""},{"def":"the state of being poorer than you were before. People say ‘living in reduced circumstances’ to avoid saying ‘poor’.","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in/under the circumstances","def":"used before or after a statement to show that you have thought about the conditions that affect a situation before making a decision or a statement","examples":["Under the circumstances, it seemed better not to tell him about the accident.","She did the job very well in the circumstances.","In the circumstances, you'd better call the police."]},{"idiom":"in/under no circumstances","def":"used to emphasize that something should never happen or be allowed","examples":["Under no circumstances should you lend Paul any money.","Don't open the door, in any circumstances.","Under no circumstances should you leave the door unlocked."]},{"idiom":"pomp and circumstance","def":"formal and impressive ceremony","examples":["Funerals of famous people were conducted with great pomp and circumstance."]},{"idiom":"reduced circumstances","def":"the state of being poorer than you were before. People say ‘living in reduced circumstances’ to avoid saying ‘poor’.","examples":[]}],"phrasal":[],"related":["Pomp and Circumstance"]}]