[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cir/circl/circle__us_2.mp3","phonsUS":"/ˈsɜːrkl/","level":"A2","meanings":[{"def":"a completely round flat shape","examples":["the centre/circumference/radius/diameter of a circle","concentric circles","a design of overlapping circles","circle of something Cut out two circles of paper.","Spread 1 tablespoon of the meat mixture on each circle of dough.","the circle of light thrown by the torch"],"opposite":"","synonyms":""},{"def":"the line that forms the edge of a circle","examples":["Draw a circle.","He traced a circle in the dust with his finger.","in a circle She walked the horse round in a circle.","circle around somebody/something He had dark circles around his eyes from lack of sleep.","The sharks were swimming in circles around her.","He turned the car in a tight circle.","How long does it take for the dial to rotate through a full circle?","If you follow the road signs you will simply find yourself going round in a circle.","If you follow the signs you find yourself going around in a circle.","The planets move in circles around the sun.","The water rippled in widening circles around the fountain."],"opposite":"","synonyms":""},{"def":"a thing or a group of people or things that is like a circle in shape","examples":["circle of somebody/something a circle of trees/chairs","in a circle The children stood in a circle.","circle around somebody/something The crowd formed a circle around the two boys.","The M25 motorway isn't quite a complete circle.","Arrange the candles to create a circle.","The children ran around the circle of chairs until the music stopped.","The stones form a complete circle."],"opposite":"","synonyms":""},{"def":"an upper floor of a theatre or cinema where the seats are arranged in curved rows","examples":["We had seats in the circle."],"opposite":"","synonyms":""},{"def":"a group of people who are connected because they have the same interests, jobs, etc.","examples":["Talk of religion was forbidden in the family circle.","She's well known in theatrical circles.","a large circle of friends","While she is lauded in London intellectual circles, she is less well-known to the general public.","She did not meet people outside her own small social circle.","Her ideas have caused controversy in scientific circles in recent years.","friends in government circles","They treat anyone outside their immediate circle with suspicion.","You need to widen your circle of friends.","She moves in the highest social circles.","She has a wide circle of acquaintances.","My brother and I move in completely different circles."],"opposite":"","synonyms":""},{"def":"to return to the situation in which you started, after a series of events or experiences","examples":[],"opposite":"","synonyms":""},{"def":"to work hard at something or discuss something without making any progress","examples":[],"opposite":"","synonyms":""},{"def":"to be busy doing something without achieving anything important or making progress","examples":[],"opposite":"","synonyms":""},{"def":"to do something that is considered to be impossible","examples":["Marketing companies are trying to square the circle of profitability and growth with strong ethical values and sustainability."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"come, turn, etc. full circle","def":"to return to the situation in which you started, after a series of events or experiences","examples":[]},{"idiom":"go round in circles","def":"to work hard at something or discuss something without making any progress","examples":[]},{"idiom":"run round in circles","def":"to be busy doing something without achieving anything important or making progress","examples":[]},{"idiom":"square the circle","def":"to do something that is considered to be impossible","examples":["Marketing companies are trying to square the circle of profitability and growth with strong ethical values and sustainability."]}],"phrasal":[],"related":["corn circle","crop circle","dress circle","inner circle","stone circle","upper circle","charmed circle","striking circle","traffic circle","turning circle","vicious circle","virtuous circle","Arctic Circle","Magic Circle","Antarctic Circle","National Book Critics Circle","New York Drama Critics Circle Award"]},{"pos":"verb","level":"A2","meanings":[{"def":"to draw a circle around something","examples":["circle something Luke circled a date on the kitchen calendar.","Respondents were asked to circle the appropriate answers.","circle something in something Spelling mistakes are circled in red ink.","She circled her birthday in red on the calendar.","Investigators circled bullet holes with chalk."],"opposite":"","synonyms":""},{"def":"to move in a circle, especially in the air","examples":["The helicopter was circling slowly, very low.","circle above/over something Police helicopters circled above the park.","circle around something He flew lower and circled around the lake.","circle around above/over something Seagulls circled around above his head.","circle overhead A buzzard was circling overhead.","circle somebody/something The plane circled the airport to burn up excess fuel.","The bell rang and the two boxers began circling each other.","Several airliners were circling above the airport.","The vultures were already circling around the dead animal.","A small aircraft was circling overhead.","Seagulls circled around the boat.","The circling birds in the sky above looked like vultures.","The plane had to circle the airport for another 30 minutes before landing."],"opposite":"","synonyms":""},{"def":"to join together with people who have the same ideas and beliefs as you, and avoid contact with those who do not, who may threaten or attack you","examples":["When your way of life is threatened, you have to circle the wagons and defend yourself.","They immediately circled the wagons around the senator to protect him."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"circle the wagons","def":"to join together with people who have the same ideas and beliefs as you, and avoid contact with those who do not, who may threaten or attack you","examples":["When your way of life is threatened, you have to circle the wagons and defend yourself.","They immediately circled the wagons around the senator to protect him."]}],"phrasal":[],"related":[]}]