[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cit/cite_/cite__us_1.mp3","phonsUS":"/saɪt/","level":"B2","meanings":[{"def":"to mention something as a reason or an example, or in order to support what you are saying","examples":["cite something She cited examples of companies the city has helped relocate or expand.","Citing unnamed sources, the newspaper reports that the two companies are nearing a deal.","There is no reason to doubt the information in the articles cited above.","He cited personal reasons for his decision to resign.","The Bank of England has cited concerns about inflation for the first time in four years.","Their method is similar to those used by many studies cited in this report.","cite something as something He cited his heavy workload as the reason for his breakdown.","Nobody mentioned anything to me about it.","I promised not to refer to the matter again.","Witnesses spoke of a great ball of flame.","He cited his heavy workload as the reason for his breakdown.","Can you quote me an instance of when this happened?","The most commonly cited reasons for stopping the treatment were side effects.","This is similar to the example cited above.","She cited the case of Leigh v. Gladstone.","One doctor cited the case of a three-year-old dying as a result of extreme obesity.","This album is often cited as an example of a truly great complete album."],"opposite":"","synonyms":"mention"},{"def":"to speak or write the exact words from a book, an author, etc.","examples":["cite somebody/something He cites no primary sources for his claims.","She cited a passage from the President’s speech.","cite somebody/something in something She is the author most often cited in his work."],"opposite":"","synonyms":""},{"def":"to order somebody to appear in court; to name somebody officially in a legal case","examples":["He was cited for contempt of court.","She was cited in the divorce proceedings."],"opposite":"","synonyms":""},{"def":"to mention somebody officially or publicly because they deserve special praise","examples":["He was cited for bravery."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]