[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cit/citiz/citizen__us_7.mp3","phonsUS":"/ˈsɪtɪzn/","level":"B2","meanings":[{"def":"a person who has the legal right to belong to a particular country","examples":["The defeat of the president did not change the lives of ordinary citizens for the better.","an economic slowdown that has left millions of our fellow citizens unemployed","She's Italian by birth but is now an Australian citizen.","Polish citizens living in other parts of the European Union","the government's failure to address the concerns of the average citizen","In light of the unrest in the country, the US embassy has urged private citizens to leave.","I became a naturalized American citizen when I was 18.","He said the primary responsibility of a state is to protect its citizens from attack.","This shows that the government respects the rights of citizens.","citizen of something Some politicians seem to be treating the citizens of this country with contempt.","They are fighting for acceptance as full citizens of the country.","Citizens of other European countries do not need work permits.","He later became a naturalized citizen of the United States.","The issues that interested most French citizens were domestic rather than foreign."],"opposite":"","synonyms":""},{"def":"a person who lives in a particular place","examples":["When you're old, people treat you like a second-class citizen.","There have been meetings of concerned citizens over proposed development plans.","citizen of something the decent, law-abiding citizens of this city","the citizens of Budapest","Our job is to protect the citizens of Belfast and make it a safe city to live in.","minorities who felt they had been treated as second-class citizens","This terrible crime has shocked all law-abiding citizens.","She is a prominent citizen of the town.","Gay people have had enough of being treated as second-class citizens.","It's not clear how the new law will affect the ordinary citizen.","The king was visiting France as a private citizen.","lawsuits brought against private citizens"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["non-citizen","Citizen Kane","active citizen","senior citizen","citizen journalism","citizen journalist","Citizen's Charter","citizen journalisms","citizen journalists"]}]