[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cla/claim/claim__us_1.mp3","phonsUS":"/kleɪm/","level":"B1","meanings":[{"def":"to say that something is true although it has not been proved and other people may not believe it","examples":["claim (that)… He claims (that) he was not given a fair hearing.","claim to be/do something I don't claim to be an expert.","She claimed to hate all art.","claim somebody/something to be/do something She's not the saint that many have claimed her to be.","After disappointing box office results, newspapers claimed the show to be a failure","claim something Scientists are claiming a major breakthrough in the fight against cancer.","it is claimed that… It was claimed that some doctors were working 80 hours a week.","+ speech ‘I did not tell any lies,’ she claimed.","Some critics argue that Picasso remained a great master all his life.","Others maintain that there is a significant deterioration in quality in his post-war work.","Picasso himself claimed that good art is created, but great art is stolen.","As Smith has noted, Picasso borrowed imagery from African art.","As the author points out, Picasso borrowed imagery from African art.","The writer challenges the notion that Picasso’s sculpture was secondary to his painting.","It has been suggested that Picasso’s painting was influenced by jazz music.","He tried to claim that he had acted in self-defence.","The company had falsely claimed that its products were biodegradable.","He successfully claimed unfair dismissal.","Several collectors are claiming ownership of the paintings.","Some critics claimed that the play was too complicated.","The report claims that house prices are still rising.","The book claims to represent all women.","Sources claim the company has now withdrawn from the deal.","He claims to have no interests or hobbies."],"opposite":"","synonyms":"claim"},{"def":"to state that you have done, gained or achieved something","examples":["He claimed victory in the presidential elections before all the results were in.","Nobody has claimed responsibility for the bombing."],"opposite":"","synonyms":""},{"def":"to ask for money from the government or a company because you have a right to it","examples":["claim something He's not entitled to claim housing benefit.","You might be entitled to claim compensation if you are injured at work.","claim something from something You could have claimed the cost of the hotel room from your insurance.","She claimed damages from the company for the injury she had suffered.","claim (on something) (for something) You can claim on your insurance for that coat you left on the train.","People who want to claim unemployment benefits must accept any legal job offered to them.","She is entitled to claim a deduction for travel costs."],"opposite":"","synonyms":""},{"def":"to demand or ask for something because you believe it is your legal right to own or to have it","examples":["A lot of lost property is never claimed.","The family arrived in the UK in the 1990s and claimed political asylum.","He is claiming his right to his family's fortune."],"opposite":"","synonyms":""},{"def":"to get or take somebody’s attention","examples":["A most unwelcome event claimed his attention."],"opposite":"","synonyms":""},{"def":"to gain, win or achieve something","examples":["She has finally claimed a place on the team."],"opposite":"","synonyms":""},{"def":"to cause somebody’s death","examples":["The car crash claimed three lives."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["claim back"],"related":["claim back","baggage claim","no-claim bonus","no-claim(s) discount","claim something","claim to fame","make no claim","lay claim to something","have a claim on somebody/something","stake (out) a/your claim (to/for/on something)","take, claim, seize, etc. the moral high ground"]},{"pos":"noun","level":"B1","meanings":[{"def":"a statement that something is true although it has not been proved and other people may not agree with or believe it","examples":["claim about somebody/something The company had made false claims about its products.","claim of something to reject/dismiss/deny claims of discrimination","a report examining claims of corrupt links between politicians","claim that… The singer has denied the magazine's claim that she is leaving the band.","Claims of corruption within the police force were denied.","There are conflicting claims about the cause of the fire.","They accepted her claim that she had been ill-treated.","They were able to produce witnesses to support their claim.","We have heard claims like this many times before.","the central claim of the book","to investigate claims about appalling prison conditions","There have been many claims and counterclaims about the relationship.","He refuted both claims.","It is difficult to substantiate claims by officials that he was responsible for the attack.","She is innocent, despite any claims to the contrary.","She resigned her position amid claims of bullying at the college.","There are several claims of responsibility being made for the attacks."],"opposite":"","synonyms":""},{"def":"a request for a sum of money that you believe you have a right to, especially from a company, the government, etc.","examples":["You can make a claim on your insurance policy.","claim for something to put in a claim for an allowance","a claim for £2 000","Make sure your claims for expenses are submitted by the end of the month.","a 3 per cent pay claim","Complete a claim form (= an official document which you must use in order to request money from an organization).","claims arising out of accidents at work","claims against the company for breach of contract","competing claims for public money","excessive wage claims","to file a civil claim for damages","to stake a claim to some of the prize money","Nurses have put in a three per cent pay claim.","His claim for compensation was upheld in court.","She brought a claim for damages against the company.","The police are investigating fraudulent claims for fire damage.","We will need extra funds to meet all the insurance claims.","The claim failed because the company had not been misled.","The court denied their claim for compensation.","The contamination crisis might result in big compensation claims.","Some expense claims were disputed.","The company has paid billions to settle claims against it."],"opposite":"","synonyms":""},{"def":"a right that somebody believes they have to something, especially property, land, etc.","examples":["nineteenth-century land claims","claim on something They had no claim on the land.","claim to something She has more claim to the campaign's success than anybody (= she is responsible for it).","He has a good claim to the land.","His children have a claim on his estate.","She renounced her claim to the property.","You will have to prove your claim to the property in a court of law.","Adams staked his claim for a place in the Olympic team with his easy win yesterday.","The court ruled that they had no claim on the land.","The princess was forced to renounce her claim to the throne.","She has made a claim for asylum."],"opposite":"","synonyms":""},{"def":"one thing that makes a person or place important or interesting","examples":["His main claim to fame is that he went to school with the prime minister.","The town’s only claim to fame is the castle."],"opposite":"","synonyms":""},{"def":"to have the right to demand time, attention, etc. from somebody","examples":["You have no claim on me any more.","I have many claims on my time.","She had a prior claim on his affections."],"opposite":"","synonyms":""},{"def":"to state that you have a right to own something","examples":["He laid claim to the property.","Four men laid claim to leadership of the country.","He went back to lay claim to his inheritance."],"opposite":"","synonyms":""},{"def":"used when you are saying that you cannot do something","examples":["I make no claim to understand modern art."],"opposite":"","synonyms":""},{"def":"to say or show publicly that you think something should be yours","examples":["Adams staked his claim for a place in the Olympic team with his easy win yesterday."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"claim to fame","def":"one thing that makes a person or place important or interesting","examples":["His main claim to fame is that he went to school with the prime minister.","The town’s only claim to fame is the castle."]},{"idiom":"have a claim on somebody/something","def":"to have the right to demand time, attention, etc. from somebody","examples":["You have no claim on me any more.","I have many claims on my time.","She had a prior claim on his affections."]},{"idiom":"lay claim to something","def":"to state that you have a right to own something","examples":["He laid claim to the property.","Four men laid claim to leadership of the country.","He went back to lay claim to his inheritance."]},{"idiom":"make no claim","def":"used when you are saying that you cannot do something","examples":["I make no claim to understand modern art."]},{"idiom":"stake (out) a/your claim (to/for/on something)","def":"to say or show publicly that you think something should be yours","examples":["Adams staked his claim for a place in the Olympic team with his easy win yesterday."]}],"phrasal":[],"related":[]}]