[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cla/clash/clash__us_1.mp3","phonsUS":"/klæʃ/","level":"C1","meanings":[{"def":"a short fight between two groups of people","examples":["Clashes broke out between police and demonstrators.","Eight people were wounded in a clash with border guards.","Several people were injured in violent clashes with the police.","He got into a fight with a man in the bar.","Clashes broke out between police and demonstrators.","a drunken brawl in a bar","There were no signs of a struggle at the murder scene.","He was involved in a scuffle with a photographer."],"opposite":"","synonyms":"fight"},{"def":"an argument between two people or groups of people who have different beliefs and ideas","examples":["There has been a head-on clash between the two candidates over education policy.","Differences in the aims of the two unions have led to serious clashes over policy.","The leaders are preparing for a head-on clash at the summit."],"opposite":"","synonyms":""},{"def":"the difference that exists between two things that are opposed to each other","examples":["a clash of interests/opinions/cultures","a personality clash with the boss","Simply put, the conflict comes down to a clash of cultures.","Personality clashes led to the break-up of the band."],"opposite":"","synonyms":""},{"def":"a situation in which two events happen at the same time so that you cannot go to or see them both","examples":["a clash in the timetable/schedule"],"opposite":"","synonyms":""},{"def":"a loud noise made by two metal objects being hit together","examples":["a clash of cymbals/swords"],"opposite":"","synonyms":""},{"def":"an occasion when two teams or players compete against each other","examples":["Bayern’s clash with Roma in the Champions League"],"opposite":"","synonyms":""},{"def":"the situation when two colours, designs, etc. look ugly when they are put together","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Clash"]},{"pos":"verb","level":"","meanings":[{"def":"to come together and fight or compete in a contest","examples":["The two sets of supporters clashed outside the stadium.","The two teams clash in tomorrow's final.","Demonstrators clashed violently with police.","They often clash violently with rival gangs."],"opposite":"","synonyms":""},{"def":"to argue or disagree seriously with somebody about something, and to show this in public","examples":["The leaders and members clashed on the issue.","The leaders clashed with party members on the issue.","He has clashed repeatedly with the team coach over training schedules.","He clashed with his father over politics.","The Prime Minister and his old rival clashed over European policy."],"opposite":"","synonyms":""},{"def":"to be very different and opposed to each other","examples":["His left-wing views clashed with his father's politics.","His views and his father's clashed.","They have clashing personalities."],"opposite":"","synonyms":""},{"def":"to happen at the same time so that you cannot go to or see them both","examples":["Unfortunately your party clashes with a wedding I'm going to.","There are two good movies on TV tonight, but they clash."],"opposite":"","synonyms":""},{"def":"to look ugly when put together","examples":["The wallpaper clashes with the carpet.","The wallpaper and the carpet clash.","Do you think these colours clash?"],"opposite":"","synonyms":""},{"def":"to hit together and make a loud ringing noise; to make two metal objects do this","examples":["clash (together) The long blades clashed together.","clash something (together) She clashed the cymbals."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]