[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cla/class/class__us_1.mp3","phonsUS":"/klæs/","level":"A1","meanings":[{"def":"a group of students who are taught together","examples":["in the/your class We were in the same class at school.","She is the youngest in her class.","He came top of the class.","The whole class was/were told to stay behind after school.","He sat at the back of the class.","She came top of the class in English.","Which history class are you in?","He finished top of the class.","Her sister is in my class.","Class size is limited to 30 participants.","a class discussion on solar energy","She teaches classes at both the undergraduate and graduate levels."],"opposite":"","synonyms":""},{"def":"an occasion when a group of students meets to be taught","examples":["I have a history class at 9 o'clock.","I was late for (a) class.","See me after class.","in class She works hard in class (= during the class).","I have an English class at 11.","Who's taking the class today?","He was late for class again.","We'll start the exercise in class and you can finish it for homework.","We have five science classes going on at one time but only two labs.","I skip class every now and then to spend time with my friends.","She cancels class on a regular basis.","The syllabus is discussed with students on the first day of class.","I remember learning about the 1st World War in history class in school."],"opposite":"","synonyms":""},{"def":"a series of classes on a particular subject","examples":["Are you still doing your French evening class?","class in something I've been taking classes in pottery.","She's going to evening classes in Italian.","The college offers classes in many subjects.","The institute holds evening classes throughout the year.","I'm taking a management class this semester.","I'm taking night classes in art appreciation.","The college runs specialist language classes.","art/​dance/​yoga classes","He attended evening classes in sculpture.","I decided to take a first-aid class.","The university offers classes through a distance-learning program.","Classes will be held each Tuesday for five weeks.","Classes start at the end of January.","I enrolled in a drawing class at the Boston Museum School."],"opposite":"","synonyms":""},{"def":"a group of students who finish their studies at school, college or university in a particular year","examples":["the class of 2020","the freshman/sophomore/junior/senior class"],"opposite":"","synonyms":""},{"def":"one of the groups of people in a society that are thought of as being at the same social or economic level","examples":["the working/middle/upper class","The party tries to appeal to all classes of society.","His ideas had an appeal among the wealthy, professional classes.","Membership of gardening clubs is drawn from all social classes.","It was an age in which all classes of society were expanding.","The ruling class won't give up their position without a fight.","The government defends the interests of the capitalist class.","They believe that membership in the political class comes with the privilege of shaping the world to their liking.","Composers tried to take advantage of the increased demand for public entertainment among the middle classes.","Nowadays, there are not so many clear distinctions between classes.","middle class families","He is a member of the privileged class.","She belongs to a lower social class than him."],"opposite":"","synonyms":""},{"def":"the way that people are divided into different social and economic groups","examples":["differences of class, race or gender","The old class system is not appropriate in a modern age.","a society in which class is more important than ability","A lot of British comedy is based on class differences.","She recognises class as an important concept."],"opposite":"","synonyms":""},{"def":"each of several different levels of comfort that are available to travellers in a plane, etc.","examples":["He always travels business class.","The first-class compartment is situated at the front of the train."],"opposite":"","synonyms":""},{"def":"a group of people, animals or things that have similar characteristics or qualities","examples":["It was good accommodation for a hotel of this class.","different classes of drugs","Dickens was in a different class from (= was much better than) most of his contemporaries.","As a jazz singer she's in a class of her own (= better than most others).","It was pretty cheap for this class of hotel.","It is the most reliable model in its class.","These writers form a distinct class in Russian literature.","There are several distinct classes of drugs.","a rare class of neurological diseases","a rare class of butterflies","to be in possession of class A/​B/C drugs","class B shares","Within each class of grapes there is much variation."],"opposite":"","synonyms":""},{"def":"one of the different groups in a competition","examples":["He came first in his class at every event."],"opposite":"","synonyms":""},{"def":"an attractive quality or a high level of skill that is impressive","examples":["She has class all right—she looks like a model.","There's a real touch of class about this team.","He has real class.","He's got real class.","The musical entertainment added a touch of class to the occasion.","a player of great class","A real parquet floor will add a touch of class to the room."],"opposite":"","synonyms":""},{"def":"one of the levels of achievement in a British university degree exam","examples":["a first-/second-/third-class degree"],"opposite":"","synonyms":""},{"def":"a group into which animals, plants, etc. that have similar characteristics are divided, below a phylum","examples":[],"opposite":"","synonyms":""},{"def":"the people in society who like to give their opinions on political or social issues","examples":["Constitutional reform is popular among the chattering classes.","topics being discussed at the breakfast tables of the chattering classes"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the chattering classes","def":"the people in society who like to give their opinions on political or social issues","examples":["Constitutional reform is popular among the chattering classes.","topics being discussed at the breakfast tables of the chattering classes"]}],"phrasal":[],"related":["class war","low-class","top-class","club class","first class","first-class","high-class","lower class","third class","third-class","upper class","word class","world-class","cattle class","class action","class warfare"]},{"pos":"verb","level":"","meanings":[{"def":"to think or decide that somebody/something is a particular type of person or thing","examples":["be classed as something Immigrant workers were classed as aliens.","The house could hardly be classed as a desirable property!","class somebody/something as something I wouldn't have classed you as a Shakespeare fan.","One in five people in the country are classed as poor.","Are the players classed as amateur or professional?","Snooker should be classed with other indoor non-contact sports.","Dementia is often classed with mental health issues, but we think this is neither correct nor appropriate.","Prisoners classed as illiterate were given a basic education."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adjective","level":"","meanings":[{"def":"very good","examples":["a class player/performer","She's a real class act."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]