[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cla/class/classic__us_2.mp3","phonsUS":"/ˈklæsɪk/","level":"B2","meanings":[{"def":"accepted or deserving to be accepted as one of the best or most important of its kind","examples":["a classic film/story/car/game","I grew up listening to classic rock.","a classic novel/study/goal","This classic novel was first published in 1938."],"opposite":"","synonyms":""},{"def":"with all the features you would expect to find; very typical","examples":["a classic example of poor communication","This was a classic case of what not to do.","She displayed the classic symptoms of depression.","I made the classic mistake of clapping in a pause in the music!"],"opposite":"","synonyms":""},{"def":"attractive, but simple and traditional in style or design; not affected by changes in fashion","examples":["a classic grey suit","classic design","a classic look","a classic movie/​work","a classic example/​mistake","classic design","a classical composer","a classical theory","a classical scholar","classical mythology.","She was wearing a classic little black dress.","The shop specializes in classic English style."],"opposite":"","synonyms":""},{"def":"people say That’s classic! when they find something very funny, when they think somebody has been very stupid or when something annoying, but not surprising, happens","examples":["She's not going to help? Oh, that's classic!"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["classic car","Classic FM","classic cars"]},{"pos":"noun","level":"B2","meanings":[{"def":"a book, film or song which is well known and considered to be of very high quality, setting standards for other books, etc.","examples":["The film is now a cult classic.","The song became an instant classic.","The novel may become a modern classic.","English classics such as ‘Alice in Wonderland’","His book is something of a classic of the genre.","one of the true classics of French cinema","Charles Dickens's timeless classic, ‘Oliver Twist’","one of the great classics of English literature"],"opposite":"","synonyms":""},{"def":"a thing that is an excellent example of its kind","examples":["That match was a classic.","The second goal was an absolute classic.","The professor's reply was a classic."],"opposite":"","synonyms":""},{"def":"a piece of clothing, a vehicle or other item that is admired for its beautiful style or design that is not affected by changes in fashion","examples":["Classics don't lose their style.","We pick out some collectors' cars and modern classics."],"opposite":"","synonyms":""},{"def":"the study of ancient Greek and Roman culture, especially their languages and literature","examples":["a degree in Classics"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]