[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cle/clear/clear__us_1.mp3","phonsUS":"/klɪr/","level":"A2","meanings":[{"def":"easy to understand and not confusing","examples":["She gave me clear and precise directions.","Are these instructions clear enough?","Your meaning needs to be clear.","You'll do as you're told—is that clear?","clear about something She was quite clear about her reasons for leaving.","This behaviour must stop—do I make myself clear (= express myself clearly so there is no doubt about what I mean)?","I hope I made it clear to him that he was no longer welcome here.","I hope I made it clear to him that he's not welcome here.","Our policy on pensions is perfectly clear.","She has a clear, simple writing style.","Your meaning needs to be crystal clear.","This is a clear and concise practical guide.","a clear and unambiguous statement","The plan is very clear and simple.","We have clear and consistent expectations for our students.","The figures will give a clearer picture of the financial benefits.","They made it absolutely clear that I was expected to help."],"opposite":"","synonyms":""},{"def":"obvious and leaving no doubt at all","examples":["This is a clear case of fraud.","She won the election by a clear majority.","His height gives him a clear advantage.","a clear warning of the risks","He left no clear indication of his wishes.","We must send a clear message to young people that cyberbullying will not be tolerated.","There is clear evidence that he was involved with the gang.","They made their intentions abundantly clear.","it is clear to somebody (that)… It was quite clear to me that she was lying.","It is clear from the graph that sales have dropped sharply.","clear what, how, whether, etc… It is not clear what they want us to do.","How he got there was not clear.","It was quite clear to me that she was lying.","It’s obvious from what he said that something is wrong.","It was apparent from her face that she was really upset.","The orchestra played with evident enjoyment.","He made it very plain that he wanted us to leave.","I hope I make myself obvious.","Try not to make it so clear/​plain.","an evident case of something","There is clear evidence that TV advertising influences what children buy.","It is clear from numerous studies that TV advertising influences what children buy.","Recent research demonstrates that TV advertising influences children’s spending habits.","Many parents think that TV advertising influences their children. This view is supported by the findings of a recent study, which show a clear link between television advertisements and children’s spending habits.","The findings also reveal that most children are unaware of the persuasive purpose of advertising.","There is little evidence that children understand the persuasive intent of advertising.","The results contradict claims that advertising is unrelated to children’s spending habits.","Manufacturers argue that it is difficult to prove that advertising alone influences what children buy.","It is vital that more is done to prevent the illegal trade in wild animals.","(Compare: We have to do more to stop people trading wild animals illegally.)","It is clear that more needs to be done to protect biodiversity.","(Compare: We clearly need to do more to protect biodiversity.)","It is unfortunate that the practice of keeping monkeys as pets still continues.","(Compare: It’s absolutely terrible that people still keep monkeys as pets.)","It is difficult for many people to understand the reasons why certain individuals choose to hunt animals for sport.","(Compare: I can’t understand why anyone would want to kill animals for fun.)","Unfortunately, it would seem that not enough is being done to support tiger conservation.","(Compare: Governments aren’t doing enough to help tiger conservation.)","There is no doubt that the greatest threat to polar bears comes from global warming.","(Compare: I believe that the greatest threat…)","It was clear to us there was a problem.","It wasn't entirely clear whether she wanted us to help.","There is a clear and present danger to national security.","to give a clear sign that we value all students","We need to make a clear distinction between private and public rooms.","The film is a clear example of Hitchcock's cleverness.","One clear winner stood out.","One thing is clear—she was not telling the truth.","The message of the play is clear. Love is pain.","It was immediately clear that she had been crying.","It was pretty clear that they didn't want me there.","It is becoming increasingly clear that consumers are interested in animal welfare.","It seems clear that her separation from the children caused her great distress.","You have to make your intentions crystal clear to them."],"opposite":"","synonyms":"clear"},{"def":"not confused; having no doubt","examples":["clear about something Are you clear about the arrangements for tomorrow?","clear on something My memory is not clear on that point.","clear what, how, whether, etc… I'm still not clear what the job involves.","We need a clear understanding of the problems involved.","‘Is that John over there?’ ‘I’m not sure.’","Are you sure about that?","England must win this game to be sure of qualifying.","I’m quite confident that you’ll get the job.","The team feels confident of winning.","I’m convinced that she’s innocent.","Are you absolutely certain about this?","She was positive that he’d been there.","‘Are you sure?’ ‘Positive.’","My memory isn’t really clear on that point.","I’m sorry, I didn’t quite understand.","Would you mind explaining that again? I’m not sure that I’ve understood correctly.","Sorry, I don't quite follow (you).","Can I just check that I’ve got this right?","I’m not quite/​exactly clear about/​really sure what I’m supposed to do.","Sorry, could you repeat that? I didn’t hear what you said.","Sorry, would you mind repeating what you just said?","If I understand you correctly, you want me to phone the customer and apologise?","Do you mean (to say) that the deal's off?","What exactly are you saying?","So you're saying that the meeting's cancelled?","Sorry, did you mean that I should wait here or come back later?","Can you just confirm your date of birth for me, please?","I'm still not clear whether she wants to come or not.","My memory isn't really clear on that point.","Everyone must be clear about their responsibilities.","She has a clear vision of the way things should go with the project.","Nobody had a clear idea of what was to come next.","We are very clear about what we want to accomplish."],"opposite":"","synonyms":"sure"},{"def":"thinking in a sensible and logical way, especially in a difficult situation","examples":["a clear thinker","You'll need to keep a clear head for your interview."],"opposite":"","synonyms":""},{"def":"easy to see or hear","examples":["The photo wasn't very clear.","The voice on the phone was clear and strong.","She was in Australia but I could hear her voice as clear as a bell.","The image was crisp and clear.","The colours in her paintings are very clear and bright."],"opposite":"","synonyms":""},{"def":"that you can see through; transparent","examples":["The water was so clear we could see the bottom of the lake.","clear glass","a clear colourless liquid","a sheet of clear cellophane","The beach was perfect—white sand and clear blue water.","The water comes out of the spring crystal clear and totally pure.","Items must be carried in a clear plastic bag.","The water was fairly clear.","The chairs were made of clear plastic."],"opposite":"","synonyms":""},{"def":"without cloud or mist","examples":["a clear blue sky","On a clear day you can see France.","It's likely to be a clear night, with temperatures dropping to freezing.","The weather was bright and clear.","a crisp, clear autumn morning","On a clear day, you can see the mountains in the distance.","clear night skies"],"opposite":"","synonyms":""},{"def":"without spots or marks","examples":["clear skin","a clear complexion"],"opposite":"","synonyms":""},{"def":"bright and lively","examples":["Her clear blue eyes sparkled."],"opposite":"","synonyms":""},{"def":"free from things that are blocking the way or covering the surface of something","examples":["The road was clear and I ran over.","All exits must be kept clear of baggage.","You won't get a clear view of the stage from here.","I always leave a clear desk at the end of the day.","Most roads are now clear of snow.","The roads are reasonably clear of snow.","Make sure you keep all gutters and drainpipes clear of leaves."],"opposite":"","synonyms":""},{"def":"if you have a clear conscience or your conscience is clear, you do not feel guilty","examples":[],"opposite":"","synonyms":""},{"def":"free from something that is unpleasant","examples":["They were still not clear of all suspicion.","We are finally clear of debt."],"opposite":"","synonyms":""},{"def":"not touching something; a distance away from something","examples":["The plane climbed until it was clear of the clouds.","Make sure you park your car clear of the entrance."],"opposite":"","synonyms":""},{"def":"whole or complete","examples":["Allow three clear days for the letter to arrive.","You must give seven clear days’ notice of the meeting."],"opposite":"","synonyms":""},{"def":"that remains when taxes, costs, etc. have been taken away","examples":["They had made a clear profit of £2 000."],"opposite":"","synonyms":""},{"def":"produced with the central part of the tongue close to the top of the mouth. In many accents of (= ways of pronouncing) English, clear /l/ is used before a vowel, as in leave.","examples":[],"opposite":"dark","synonyms":""},{"def":"to be simple and free from trouble","examples":[],"opposite":"","synonyms":""},{"def":"easy to see or understand","examples":[],"opposite":"","synonyms":""},{"def":"not clear at all; not easy to understand","examples":["Oh well, that's all as clear as mud, then."],"opposite":"","synonyms":""},{"def":"a complete difference or division between two people or groups","examples":["Voters want to see clear blue water between the main parties.","They failed to put clear blue water between themselves and their competitors."],"opposite":"","synonyms":""},{"def":"there is no danger of being seen or caught","examples":["As soon as the coast was clear, he climbed in through the window."],"opposite":"","synonyms":""},{"def":"to remain calm in a difficult situation","examples":["She needed to keep a clear head if she was to remain in control."],"opposite":"","synonyms":""},{"def":"to enable somebody to be successful in a particular area of activity because other people or groups have given up competing with them","examples":["The complete disarray of the opposition parties leaves the field clear for the government to implement urgent reforms."],"opposite":"","synonyms":""},{"def":"in a way that is very easy to understand","examples":["The message is coming through loud and clear."],"opposite":"","synonyms":""},{"def":"to find that it is possible or convenient to do something","examples":["Small builders cannot see their way clear to take on many trainees."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be clear/smooth sailing","def":"to be simple and free from trouble","examples":[]},{"idiom":"(as) clear as day","def":"easy to see or understand","examples":[]},{"idiom":"(as) clear as mud","def":"not clear at all; not easy to understand","examples":["Oh well, that's all as clear as mud, then."]},{"idiom":"clear blue water (between A and B)","def":"a complete difference or division between two people or groups","examples":["Voters want to see clear blue water between the main parties.","They failed to put clear blue water between themselves and their competitors."]},{"idiom":"the coast is clear","def":"there is no danger of being seen or caught","examples":["As soon as the coast was clear, he climbed in through the window."]},{"idiom":"keep your head | keep a clear/cool head","def":"to remain calm in a difficult situation","examples":["She needed to keep a clear head if she was to remain in control."]},{"idiom":"leave the field clear for somebody","def":"to enable somebody to be successful in a particular area of activity because other people or groups have given up competing with them","examples":["The complete disarray of the opposition parties leaves the field clear for the government to implement urgent reforms."]},{"idiom":"loud and clear","def":"in a way that is very easy to understand","examples":["The message is coming through loud and clear."]},{"idiom":"see your way (clear) to doing something/to do something","def":"to find that it is possible or convenient to do something","examples":["Small builders cannot see their way clear to take on many trainees."]}],"phrasal":[],"related":["clear up","clear-up","all-clear","clear-cut","clear off","clear out","clear-out","clear away","Clear Channel","clear-headed","clear-sighted","crystal clear","clear and present danger","clear-ups","clear-outs","clear-story","clear-stories"]},{"pos":"verb","level":"B1","meanings":[{"def":"to remove things that are not wanted or needed from something","examples":["clear something The settlers cleared the land and planted crops.","It was several hours before the road was cleared after the accident.","It's your turn to clear the table (= to take away the dirty plates, etc. after a meal).","They started clearing a path through the dense jungle.","The work of clearing the debris is in its final stages.","She cleared a space on the sofa for him to sit down.","I had cleared my desk before I left.","clear A of B I cleared my desk of papers.","The streets had been cleared of snow.","clear B from/off A Clear all those papers off the desk.","The remains of the snow had been cleared from the streets.","She hastily cleared a space for him to sit down.","The site must be completely cleared and made safe for children.","They cleared the mud from the steps.","We cleared the path of leaves.","I cleared my desk of papers and got down to work."],"opposite":"","synonyms":""},{"def":"to make people leave a place","examples":["Security officials tried to clear the area, fearing more bomb attacks.","After the bomb warning, police cleared the streets.","Police were still clearing the streets when the bomb went off.","In case of emergency, you should be able to clear the building within three minutes.","At the next station the train was cleared and the body was removed."],"opposite":"","synonyms":""},{"def":"to move freely again; to no longer be blocked","examples":["The traffic took a long time to clear after the accident.","The boy's lungs cleared and he began to breathe more easily."],"opposite":"","synonyms":""},{"def":"when smoke, fog, etc. clears, it disappears so that it is easier to see things","examples":["The mist will clear by mid-morning.","The fog was beginning to clear away.","As the dust cleared, we saw that the whole ceiling had come down.","As the smoke cleared, two fighter planes came into view."],"opposite":"","synonyms":""},{"def":"when the sky or the weather clears, it becomes brighter and free of cloud or rain","examples":["The next day the weather cleared.","The sky cleared after the storm.","The rain is clearing slowly.","The clouds had not yet cleared.","Hopefully the storm would clear soon."],"opposite":"","synonyms":""},{"def":"when a liquid clears, it becomes transparent and you can see through it","examples":["The muddy water slowly cleared."],"opposite":"","synonyms":""},{"def":"if your head or mind clears, or you clear it, you become free of thoughts that worry or confuse you or the effects of alcohol, a hit on the head, etc. and you are able to think clearly","examples":["As her mind cleared, she remembered what had happened.","clear something I went for a walk to clear my head.","Correct breathing helps to clear the mind and reduce tension.","I went for a walk to try to clear my head."],"opposite":"","synonyms":""},{"def":"if your face or expression clears, you stop looking angry or worried","examples":["His face suddenly cleared as understanding dawned."],"opposite":"","synonyms":""},{"def":"to prove that somebody is innocent","examples":["She was cleared of all charges against her.","Throughout his years in prison, he fought to clear his name.","He has finally been cleared of any wrongdoing.","After spending more than ten years on death row, the two men were finally cleared of a crime they did not commit.","The three defendants were formally cleared by the judge.","Four men accused of assault have been cleared of all charges."],"opposite":"","synonyms":""},{"def":"to give or get official approval for something to be done","examples":["clear something His appointment had been cleared by the board.","clear something with somebody/something I'll have to clear it with the manager.","I'll have to clear it with the manager before I can refund your money."],"opposite":"","synonyms":""},{"def":"to give official permission for a person, a ship, a plane or goods to leave or enter a place","examples":["The plane had been cleared for take-off.","The goods had been cleared through customs."],"opposite":"","synonyms":""},{"def":"to decide officially, after finding out information about somebody, that they can be given special work or allowed to see secret papers","examples":["She hasn't been cleared by security."],"opposite":"","synonyms":""},{"def":"if a payment that is made into your bank account clears, or a bank clears it, the money is available for you to use","examples":["Cheques usually take three working days to clear."],"opposite":"","synonyms":""},{"def":"to gain or earn a sum of money as profit","examples":["She cleared £1 000 on the deal."],"opposite":"","synonyms":""},{"def":"if you clear a debt or a loan, you pay all the money back","examples":["They sold $25 million in holdings in order to clear colossal bank debts.","We are economizing for a few months to try to clear our overdraft."],"opposite":"","synonyms":""},{"def":"to jump over or get past something without touching it","examples":["The horse cleared the fence easily.","The car only just cleared (= avoided hitting) the gatepost."],"opposite":"","synonyms":""},{"def":"if you clear a ball, or a ball clears, it is kicked or hit away from the area near your own goal","examples":[],"opposite":"","synonyms":""},{"def":"to help somebody have a fresh, lively state of mind again","examples":["A brisk walk should blow the cobwebs away."],"opposite":"","synonyms":""},{"def":"to improve a difficult or tense situation by talking about worries, doubts, etc.","examples":["This meeting will be an opportunity to clear the air and start the healing process."],"opposite":"","synonyms":""},{"def":"to make the air less dirty or less humid (= warm and wet)","examples":["Storms were supposed to clear the air."],"opposite":"","synonyms":""},{"def":"to prepare for an activity, event, etc. by removing anything that is not essential to it","examples":[],"opposite":"","synonyms":""},{"def":"to cough (= to force out air noisily through your throat) so that you can speak clearly","examples":[],"opposite":"","synonyms":""},{"def":"to remove things that are stopping the progress or movement of something","examples":["The ruling could clear the way for extradition proceedings."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"blow/clear the cobwebs away","def":"to help somebody have a fresh, lively state of mind again","examples":["A brisk walk should blow the cobwebs away."]},{"idiom":"clear the air","def":"to improve a difficult or tense situation by talking about worries, doubts, etc.","examples":["This meeting will be an opportunity to clear the air and start the healing process.","Storms were supposed to clear the air."]},{"idiom":"clear the decks","def":"to prepare for an activity, event, etc. by removing anything that is not essential to it","examples":[]},{"idiom":"clear your throat","def":"to cough (= to force out air noisily through your throat) so that you can speak clearly","examples":[]},{"idiom":"clear the way (for something/for something to happen)","def":"to remove things that are stopping the progress or movement of something","examples":["The ruling could clear the way for extradition proceedings."]}],"phrasal":["clear away","clear off","clear out","clear up"],"related":[]},{"pos":"adverb","level":"","meanings":[{"def":"away from something/somebody; not near or touching something/somebody","examples":["Stand clear of the train doors.","He injured his arm as he jumped clear of the car.","By lap two Walker was two metres clear of the rest of the runners."],"opposite":"","synonyms":""},{"def":"all the way to something that is far away","examples":["She could see clear down the highway into the town."],"opposite":"","synonyms":""},{"def":"to avoid a person or thing because they may cause problems","examples":["Steer clear of the centre of town at this time of the evening."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"keep/stay/steer clear (of somebody/something)","def":"to avoid a person or thing because they may cause problems","examples":["Steer clear of the centre of town at this time of the evening."]}],"phrasal":[],"related":[]},{"pos":"noun","level":"","meanings":[{"def":"no longer in danger or thought to be guilty of something","examples":["It seems that the original suspect is in the clear."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in the clear","def":"no longer in danger or thought to be guilty of something","examples":["It seems that the original suspect is in the clear."]}],"phrasal":[],"related":[]}]