[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cle/cleve/clever__us_1.mp3","phonsUS":"/ˈklevər/","level":"A2","meanings":[{"def":"quick at learning and understanding things","examples":["a clever child","Clever girl!","He's too clever by half, if you ask me (= it annoys me or makes me suspicious).","They're not clever enough to find the code."],"opposite":"","synonyms":"intelligent"},{"def":"showing skill","examples":["clever at something He's always been clever at crosswords.","clever at doing something She's clever at getting what she wants.","clever with something He's clever with his hands.","I became quite clever at making tasty meals out of nothing.","I'm not very clever at maths."],"opposite":"","synonyms":""},{"def":"showing intelligence or skill, for example in the design of an object, in an idea or somebody’s actions","examples":["a clever trick","What a clever idea!","That wasn't very clever (= what you just did wasn't sensible), was it?","clever marketing","Admitting her mistake may have been quite a clever move on her part.","it is clever of somebody to do something It was clever of him to have spotted the mistake.","How clever of you to work it out!","it is clever to do something 'Young people think it's clever to do that sort of thing, and it isn't,' she said.","clever of somebody Letting him think it was his idea was very clever of you.","That wasn't a very clever thing to do.","a simple yet fiendishly clever idea","a clever little gadget","The present owners have made clever use of the limited space in this room."],"opposite":"","synonyms":""},{"def":"quick with words in a way that annoys people or does not show respect","examples":["Don't you get clever with me!"],"opposite":"","synonyms":""},{"def":"to act in a clever way to get what you want, sometimes tricking somebody","examples":["Suzie realized that she had to box clever. She had to let Adam think she trusted him."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"box clever","def":"to act in a clever way to get what you want, sometimes tricking somebody","examples":["Suzie realized that she had to box clever. She had to let Adam think she trusted him."]}],"phrasal":[],"related":["clever Dick","clever Dicks","clever clogs","box clever","too clever, etc. by half","be as clever, stupid, etc. as they come"]}]