[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cli/climb/climb__us_1.mp3","phonsUS":"/klaɪm/","level":"A1","meanings":[{"def":"to go up something towards the top","examples":["climb (up) something to climb a mountain/tree","She climbed up the stairs.","to climb a ladder/wall","They climbed the steps to the front door.","The car slowly climbed the hill.","The boarding party began to climb up the side of the ship.","climb (up) As they climbed higher, the air became cooler.","You can climb to the top of the tower and take in the view.","He climbed up and inspected the damage to the roof.","Don't climb too high.","He climbed slowly up the ladder.","We climbed right to the top of the mountain.","I loved climbing trees when I was a kid."],"opposite":"","synonyms":""},{"def":"to go up mountains or climb rocks as a hobby or sport","examples":["He likes to go climbing most weekends.","He goes climbing every summer."],"opposite":"","synonyms":""},{"def":"to move somewhere, especially with difficulty or effort, using hands as well as feet","examples":["I climbed through the window.","She opened the passenger door and climbed in.","The boys climbed over the wall.","Sue climbed into bed.","Can you climb down?","He finished digging the grave and climbed out.","Two boys climbed onto the roof.","He climbed into the truck and drove off.","I climbed over the fence into the meadow."],"opposite":"","synonyms":""},{"def":"to increase in value or amount","examples":["The paper's circulation continues to climb.","climb + adv./prep. Interest rates climbed to 8 per cent.","The temperature had climbed above 30 degrees.","Prices have climbed sharply in recent months.","The dollar has been climbing all week.","Membership is climbing steadily.","The vaccination rate began to climb slowly.","Unemployment has climbed from two million to three million.","Unemployment is still climbing."],"opposite":"","synonyms":""},{"def":"to move to a higher position in a chart, table, society or organization","examples":["climb to something The team has now climbed to fourth in the league.","In a few years he had climbed to the top of his profession.","climb something The song also climbed the charts in North America.","(figurative) to climb the corporate/career ladder"],"opposite":"","synonyms":""},{"def":"to go higher in the sky","examples":["The plane climbed to 33 000 feet.","The sun climbed higher in the sky.","The plane took off and climbed to 20 000 feet."],"opposite":"","synonyms":""},{"def":"to slope upwards","examples":["From here the path climbs steeply to the summit.","The path began to climb quite steeply.","The path climbs steeply up the mountainside.","The road gradually climbs up from the town."],"opposite":"","synonyms":""},{"def":"to grow up a wall or frame","examples":["a climbing rose"],"opposite":"","synonyms":""},{"def":"to join others in doing something that is becoming fashionable because you hope to become popular or successful yourself","examples":["politicians eager to jump on the environmental bandwagon"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"climb/jump on the bandwagon","def":"to join others in doing something that is becoming fashionable because you hope to become popular or successful yourself","examples":["politicians eager to jump on the environmental bandwagon"]}],"phrasal":["climb down"],"related":["climb down","climb down (over something)","climb/jump on the bandwagon"]},{"pos":"noun","level":"B1","meanings":[{"def":"an act of climbing up a mountain, rock or large number of steps; a period of time spent climbing","examples":["an exhausting climb","It's an hour's climb to the summit.","After a steep climb we reached a plateau.","climb up something We began our climb up the hill.","I was fitter the first time I did the climb.","They began the long climb up the hill.","We rode to Pamba then made the final climb on foot.","the short climb from the road to the summit"],"opposite":"","synonyms":""},{"def":"a mountain or rock which people climb up for sport","examples":["Titan's Wall is the mountain's hardest rock climb."],"opposite":"","synonyms":""},{"def":"an increase in value or amount","examples":["the dollar’s climb against the euro","the upward climb of interest rates","a steady climb in the cost of travel"],"opposite":"","synonyms":""},{"def":"progress to a higher status, standard or position","examples":["a rapid climb to stardom","the long slow climb out of the recession"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]