[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/clo/cloud/cloud__us_1.mp3","phonsUS":"/klaʊd/","level":"A2","meanings":[{"def":"a grey or white mass that floats in the sky, made of very small drops of water","examples":["Dark clouds were gathering in the west.","The cloud cover is quite dense today.","black/grey clouds","thick/dense cloud","The sun went behind a cloud.","It was scorching and there wasn't a cloud in the sky.","in cloud The plane was flying in cloud most of the way.","through the clouds She could see the sun through the clouds.","Rain clouds were looming on the horizon.","The clouds broke a little, and the sun came out.","Thick cloud hung over the moor.","We were flying above the clouds.","White clouds scudded across the sky.","a layer of high cloud","skies of broken cloud","Above the mountains storm clouds were gathering."],"opposite":"","synonyms":""},{"def":"a large mass of something in the air, for example dust or smoke, or a number of insects flying all together","examples":["a dust cloud","The bees flew out of their hives, forming a thick black cloud.","cloud of something They watched the car disappearing in a cloud of dust.","I saw an enormous cloud of smoke rising over the city.","The sky turned dark as a great cloud of locusts blocked out the sun.","a great cloud of black smoke","a thick cloud of steam","The wind blew across the beach, forming clouds of sand."],"opposite":"","synonyms":""},{"def":"something that makes you feel sad or anxious","examples":["Her father's illness cast a cloud over her wedding day.","The only dark cloud on the horizon was that they might have to move house.","He still has a cloud of suspicion hanging over him."],"opposite":"","synonyms":""},{"def":"a network of servers (= computers that control or supply information to other computers) on which data and software can be stored or managed and to which users have access over the internet","examples":["Key company documents are now stored in the cloud, so you no longer need to save them to your computer’s hard drive."],"opposite":"","synonyms":""},{"def":"every sad or difficult situation has a positive side","examples":[],"opposite":"","synonyms":""},{"def":"to be thinking about something that is not connected with what you are doing","examples":[],"opposite":"","synonyms":""},{"def":"to have ideas, plans, etc. that are not realistic","examples":[],"opposite":"","synonyms":""},{"def":"extremely happy","examples":[],"opposite":"","synonyms":""},{"def":"if somebody is under a cloud, other people think that they have done something wrong and do not trust them","examples":["She left the company under a cloud."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"every cloud has a silver lining","def":"every sad or difficult situation has a positive side","examples":[]},{"idiom":"have your head in the clouds","def":"to be thinking about something that is not connected with what you are doing","examples":[]},{"idiom":"on cloud nine","def":"extremely happy","examples":[]},{"idiom":"under a cloud","def":"if somebody is under a cloud, other people think that they have done something wrong and do not trust them","examples":["She left the company under a cloud."]}],"phrasal":[],"related":["tag cloud","storm cloud","cloud forest","cloud computing","mushroom cloud","cloud cuckoo land","cloud computings"]},{"pos":"verb","level":"","meanings":[{"def":"if something clouds your judgement, memory, etc., it makes it difficult for you to understand or remember something clearly","examples":["Doubts were beginning to cloud my mind.","His judgement was clouded by jealousy."],"opposite":"","synonyms":""},{"def":"to show that you feel sad, afraid, angry, etc.; to make somebody look sad, afraid, angry, etc.","examples":["cloud (over) Her face clouded over with anger.","cloud something Suspicion clouded his face."],"opposite":"","synonyms":""},{"def":"to make something you are discussing or considering less clear, especially by introducing subjects that are not connected with it","examples":["Cost factors should not be allowed to cloud the issue.","Further clouding the picture is the question of gender."],"opposite":"","synonyms":""},{"def":"to fill with clouds","examples":["It was beginning to cloud over.","That day, the skies had clouded and it had become cool.","The sky clouded over and it started to rain."],"opposite":"","synonyms":""},{"def":"to make something less pleasant","examples":["His last years were clouded by financial worries.","Her happiness was clouded by having to leave her daughter behind in Jamaica.","His last years were clouded by ill health."],"opposite":"","synonyms":""},{"def":"if glass, water, etc. clouds, or if something clouds it, it becomes less easy to see through","examples":["cloud (with something) Her eyes clouded with tears.","cloud something Steam had clouded the mirror."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]