[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/clu/clue_/clue__us_1.mp3","phonsUS":"/kluː/","level":"B1","meanings":[{"def":"an object, a piece of evidence or some information that helps the police solve a crime","examples":["The burglar left no clues.","clue about something They are searching for clues about the kidnapping.","clue (as) to something The police think the CCTV recording may offer clues to the identity of the killer.","So far, the police haven't got any clues as to the motive for the crime.","The hat gives a clue to the identity of the killer.","The letter yielded no clues.","We must have missed some vital clue.","a clue as to her whereabouts","Is there any clue as to how the burglars entered the building?"],"opposite":"","synonyms":""},{"def":"a fact or a piece of evidence that helps you discover the answer to a problem","examples":["clue about something This data may provide clues about the current economic situation.","The trailer gives a few important clues about the film's plot.","clue (as) to something Diet may hold the clue to the causes of migraine.","The text offers few clues as to his identity.","The picture contains subtle clues about the site's history.","This research might provide an important clue about how cancer develops."],"opposite":"","synonyms":""},{"def":"some words or a piece of information that helps you find the answers to a crossword, a game or a question","examples":["‘You'll never guess who I saw today!’ ‘Give me a clue.’","a cryptic clue (= one that has a hidden meaning) from a crossword"],"opposite":"","synonyms":""},{"def":"to know nothing about something or about how to do something","examples":["I don't have a clue where she lives."],"opposite":"","synonyms":""},{"def":"to be very stupid","examples":["Don't ask him to do it—he doesn't have a clue!"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"not have a clue","def":"to know nothing about something or about how to do something","examples":["I don't have a clue where she lives.","Don't ask him to do it—he doesn't have a clue!"]}],"phrasal":[],"related":["clue in","Clue™","clue somebody in (on something)"]},{"pos":"verb","level":"","meanings":[],"idioms":[],"phrasal":["clue in"],"related":[]}]