[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/coa/coach/coach__us_1.mp3","phonsUS":"/kəʊtʃ/","level":"A2","meanings":[{"def":"a person who trains a person or team in sport","examples":["the head/assistant coach","a basketball/football coach","the team coach","the England coach","Italy’s national coach","Coach Bob Shapiro","the Giants coach Tom Coughlin","coach of/with/for somebody/something the coach of the New York Knicks","a coach with the Chicago Cubs","a coach for the US Olympic team","He is a former college football coach.","a top basketball coach","The Giants coach had this to say last night:…","The national athletics coach was interviewed after the event.","Who's the team coach?","See you tomorrow, Coach.","a pitching coach"],"opposite":"","synonyms":""},{"def":"a person who gives private lessons to somebody, often to prepare them for an exam","examples":["a maths coach"],"opposite":"","synonyms":""},{"def":"a person who is employed by somebody to give them advice about how to achieve the things they want in their life and work","examples":[],"opposite":"","synonyms":""},{"def":"a comfortable bus for carrying passengers over long distances","examples":["to take/get a coach","by coach Travel is by coach overnight to Berlin.","on a coach Four passengers on the coach were seriously injured in the crash.","a coach tour/journey/trip","coach to/for… She was seen boarding a coach to Southampton.","coach from… I got off the coach from London and walked home.","They went to Italy on a coach tour.","a coach driver/passenger/operator","a coach station (= where coaches start and end their journey)","a coach party (= a group of people travelling together on a coach)","They are planning to tour the United States by coach.","They travelled by coach from London to Berlin."],"opposite":"","synonyms":""},{"def":"a separate section of a train for carrying passengers","examples":["a railway coach","Our seats are in Coach D.","When the train finally came into the platform it only had two coaches."],"opposite":"","synonyms":""},{"def":"a large closed vehicle with four wheels, pulled by horses, used in the past for carrying passengers","examples":["This is the old coach road.","a gateway wide enough for a coach and four (= pulled by four horses) to drive through"],"opposite":"","synonyms":""},{"def":"the cheapest seats in a plane","examples":["to fly coach","coach fares/passengers/seats"],"opposite":"","synonyms":""},{"def":"to cause something to fail, for example a plan","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"drive a coach and horses through something","def":"to cause something to fail, for example a plan","examples":[]}],"phrasal":[],"related":["coach house","life coach","coach houses"]},{"pos":"verb","level":"B1","meanings":[{"def":"to train somebody to play a sport, to do a job better, or to improve a skill","examples":["coach somebody He has coached the team for five years.","She has coached hundreds of young singers.","coach somebody for something Her father coached her for the Olympics.","coach somebody in something Youngsters will be coached in the basics of the game.","coach something He coaches basketball and soccer."],"opposite":"","synonyms":""},{"def":"to give a student extra teaching in a particular subject especially so that they will pass an exam","examples":[],"opposite":"","synonyms":""},{"def":"to give somebody special instructions for what they should do or say in a particular situation","examples":["coach somebody (in/on something) They believed the witnesses had been coached on what to say.","coach somebody to do something The president's advisers coached him to adopt a more serious tone."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]