[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cod/code_/code__us_1.mp3","phonsUS":"/kəʊd/","level":"A2","meanings":[{"def":"a system of words, letters, numbers or symbols that represent a message or record information secretly or in a shorter form","examples":["to break/crack a code (= to understand and read the message)","in code It's written in code.","In the event of the machine not operating correctly, an error code will appear.","Tap your code number into the machine.","The code was difficult to crack."],"opposite":"","synonyms":""},{"def":"the numbers that are used for a particular town, area or country, in front of an individual phone number","examples":["There are three codes for London."],"opposite":"","synonyms":""},{"def":"a system of computer programming instructions","examples":["Bill wrote the computer code for the project.","malicious code that will infect your computer","You only need to add a few lines of code."],"opposite":"","synonyms":""},{"def":"a set of moral principles or rules of behaviour that are generally accepted by society or a social group","examples":["The school enforces a strict code of conduct.","a code of ethics","She lives by her own moral code.","Knights in the Middle Ages had a strong code of honour.","Many schoolchildren have a very strong code of honour.","There was a rigid code of honour associated with the cult.","There should be a clear ethical code for researchers working with human subjects.","A long-standing, unwritten code of behaviour governs relations between ministers and civil servants.","There is an unwritten code that says ‘Do not date your best friend's ex’."],"opposite":"","synonyms":""},{"def":"a system of laws or written rules that state how people in an institution or a country should behave","examples":["The law includes amendments to the penal code.","(North American English) The castle did not comply with modern building codes and was not accessible to the disabled.","The company has drawn up a new disciplinary code.","The Supreme Council adopted a new criminal code."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["QR code™","zip code","area code","code name","code word","hard-code","sort code","code-named","color code","color-code","colour code","colour-code","dress code","honour code","Morse code","object code","penal code","postal code"]},{"pos":"verb","level":"SYMBOL","meanings":[{"def":"to write or print words, letters, numbers, etc. on something so that you know what it is, what group it belongs to, etc.","examples":["Each order is coded separately."],"opposite":"","synonyms":""},{"def":"to put a message into code so that it can only be understood by a few people","examples":[],"opposite":"","synonyms":""},{"def":"to write a computer program by putting one system of numbers, words and symbols into another system","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]