[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/col/colla/collapse__us_1.mp3","phonsUS":"/kəˈlæps/","level":"B2","meanings":[{"def":"to fall down or fall in suddenly, often after breaking apart","examples":["The roof collapsed under the weight of snow.","The building had partially collapsed.","Several buildings have collapsed into the ocean.","Timber buildings may simply rot and collapse."],"opposite":"","synonyms":""},{"def":"to fall down (and usually become unconscious), especially because you are very ill","examples":["She collapsed and was rushed to hospital.","collapse + adv./prep. The man collapsed in a heap on the floor.","He collapsed in the street and died two hours later.","One night he practically collapsed from exhaustion","He collapsed with shock.","She collapsed suddenly from a heart attack.","The man collapsed against the wall and slid down it.","They finally arrived, collapsing from fatigue."],"opposite":"","synonyms":""},{"def":"to sit or lie down and relax, especially after working hard","examples":["When I get home I like to collapse on the sofa and listen to music."],"opposite":"","synonyms":""},{"def":"to fail suddenly or completely","examples":["Talks between management and unions have collapsed.","All opposition to the plan has collapsed.","The home side collapsed spectacularly in the second half.","The coalition collapsed under the pressure of differences between the two parties.","His building firm collapsed and he went bankrupt.","The scheme collapsed in the face of determined opposition.","The region's economy has virtually collapsed.","In November the strike finally collapsed."],"opposite":"","synonyms":""},{"def":"to decrease suddenly in amount or value","examples":["Share prices collapsed after news of poor trading figures.","She lost a lot of money when the property market collapsed."],"opposite":"","synonyms":""},{"def":"to fold something into a shape that uses less space; to be able to be folded in this way","examples":["The table collapses for easy storage."],"opposite":"","synonyms":""},{"def":"if a lung or blood vessel collapses or is collapsed, it falls in and becomes flat and empty","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["collapse, fall, etc. in a heap"]},{"pos":"noun","level":"B2","meanings":[{"def":"a sudden failure of something, such as an institution, a business or a course of action","examples":["the collapse of the Soviet Union","The peace talks were on the verge of collapse.","a decision which will push the country a step closer to economic collapse","the collapse of law and order in the area","They thought their strategy would cause the collapse of the regime.","The articles they published led to the collapse of the trial.","The present system is on the brink of collapse.","The war has led to the collapse of agriculture in the area.","a collapse into anarchy","He charted the villagers' collapse into poverty.","The administration moved to prevent the collapse of the privatized national airline.","Their downfall came with the financial collapse of the Canary Wharf project.","They were successful in bringing about the collapse of the Communist regime."],"opposite":"","synonyms":""},{"def":"the action of a building suddenly falling","examples":["The walls were strengthened to protect them from collapse.","the sudden collapse of the bridge"],"opposite":"","synonyms":""},{"def":"a medical condition when a person suddenly becomes very ill, or when somebody falls because they are ill or weak","examples":["a state of mental/nervous collapse","She was taken to hospital after her collapse at work.","He was in a state of mental and physical collapse.","She was on the verge of nervous collapse.","his collapse from exhaustion"],"opposite":"","synonyms":""},{"def":"a sudden fall in value","examples":["Shares suffered a fresh collapse today.","the collapse of share prices/the dollar/the market","collapse in something the collapse in the price of oil"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]