[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/col/colli/collision__us_1.mp3","phonsUS":"/kəˈlɪʒn/","level":"C1","meanings":[{"def":"an accident in which two vehicles or people crash into each other","examples":["collision between A and B a collision between two trains","collision with somebody/something Stewart was injured in a collision with another player.","a head-on collision (= between two vehicles that are moving towards each other)","a mid-air collision (= between two aircraft while they are flying)","in collision with somebody/something His car was in collision with a motorbike.","Wind and ice were blamed for the collision involving up to 12 vehicles.","I had a collision with a bus.","She was injured in a collision.","The car was in collision with a lorry.","The collision occurred near the hospital.","a head-on collision between two cars"],"opposite":"","synonyms":""},{"def":"a strong disagreement between two people or between ideas, opinions, etc. that are opposed to each other; the meeting of two things that are very different","examples":["collision between A and B a collision between two opposing points of view","collision of A and B In his work we see the collision of two different traditions.","The problem comes from a collision between two opposing points of view.","Australian food is an exciting collision of native, Asian and European cuisines."],"opposite":"","synonyms":""},{"def":"to be in a situation that is almost certain to cause an argument","examples":["I was on a collision course with my boss over the sales figures."],"opposite":"","synonyms":""},{"def":"to be moving in a direction in which it is likely that you will crash into somebody/something","examples":["A giant iceberg was on a collision course with the ship."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be on a collision course (with somebody/something)","def":"to be in a situation that is almost certain to cause an argument","examples":["I was on a collision course with my boss over the sales figures.","A giant iceberg was on a collision course with the ship."]}],"phrasal":[],"related":[]}]