[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/col/colle/collection__us_1.mp3","phonsUS":"/kəˈlekʃn/","level":"B1","meanings":[{"def":"a group of objects, often of the same sort, that have been collected","examples":["He wanted to share his vast art collection with the world.","a stamp/coin/record collection","collection of something an extensive collection of war photographs","The painting comes from his private collection.","A glass-fronted cabinet displayed a collection of china figurines.","He built up his collection over a period of ten years.","He donated his art collection to the Guggenheim Museum.","Historians frequently ask to consult the collection.","I was allowed to view his family collection of miniatures.","She had the task of organizing the collection of rare manuscripts.","She made a collection of Roman coins and medals.","She needed only one more stamp to complete her collection.","The collection contains some 500 items.","The collection covers all phases of Picasso's career.","The collection has been added to over the years.","The collection is rarely on view to the public.","The collection is to go on public display for the first time next month.","The exhibition features a magnificent collection of bronze statues.","The museum boasts a superb collection of medieval weapons.","The museum has a large reserve collection in storage, which members of the public rarely get to see.","The museum's collection is growing all the time.","The museum's collection spans 5 000 years of art history.","The permanent collection is displayed on the first floor, whilst the ground floor houses temporary exhibitions.","We have a small but representative collection of Brazilian art.","a historical archive collection of 20 000 documents","a new building to house the national collection of arms and armour","a new painting to add to their collection","a research collection available for study by archaeologists","a valuable collection of antique porcelain","major collections dating from the 11th to the 19th century","the largest private art collection in the world"],"opposite":"","synonyms":""},{"def":"a group of objects or people","examples":["There was a collection of books and shoes on the floor.","There is always a strange collection of runners in the London Marathon.","They appeared to be a motley collection of college students.","A somewhat strange collection of people had gathered in front of the building.","Running through the tale is a motley collection of loners looking for love."],"opposite":"","synonyms":""},{"def":"an act of taking something away from a place; an act of bringing things together into one place","examples":["The first stage in research is data collection.","waste/rubbish/garbage/refuse collection","The last collection from this postbox is at 5.15.","Your suit will be ready for collection on Tuesday.","the systematic collection of data","to assemble and analyse a representative collection of data","the need for more efficient tax collection","different methods of data collection","a refuse collection service","a lack of collection points for waste paper","Your car is awaiting collection at our garage.","We offer free collection of waste.","They will arrange collection of the chairs.","There are some difficulties with the collection of reliable data.","The council offers free collection of waste."],"opposite":"","synonyms":""},{"def":"a group of poems, stories or pieces of music published together as one book, etc.","examples":["a collection of stories by women writers","a collection of favourite Christmas music","to publish a collection of scholarly essays","The band has just released a collection of their greatest hits."],"opposite":"","synonyms":""},{"def":"an act of collecting money to help a charity or during a church service; the money collected","examples":["a house-to-house collection for Cancer Research","The total collection last week amounted to £250.","a collection box/bucket (= for people to put money in)","the church collection plate","a street collection for famine relief","We will have a collection for charity at the end of the concert.","A collection will be taken at the end of the service."],"opposite":"","synonyms":""},{"def":"a range of new clothes or items for the home that are designed, made and offered for sale, often for a particular season","examples":["Armani’s stunning new autumn collection","She has recently launched her new ready-to-wear collection.","the first designer to unveil his collection for the spring season"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Tate Collection","Burrell Collection","Wallace Collection"]}]