[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/col/colum/column__us_1.mp3","phonsUS":"/ˈkɑːləm/","level":"A2","meanings":[{"def":"one of the straight sections from top to bottom into which text on a page or screen is divided","examples":["a dictionary with two columns per page","column of something a column of text","at the bottom of the right-hand column of this page","The website has an attractive two-column format.","in a column Click on the name of your account in the left-hand column.","Put a mark in the appropriate column."],"opposite":"","synonyms":""},{"def":"a series of numbers or words arranged one under the other down a page","examples":["column of something to add up a column of figures","the fifth column of Table 4","in a column The numbers in the left-hand column are not relevant here.","The last column contains the probability of each of those outcomes occurring."],"opposite":"","synonyms":""},{"def":"a part of a newspaper, magazine or website that appears regularly and deals with a particular subject or is written by a particular writer","examples":["She writes a monthly column for a leading national newspaper.","a newspaper/weekly column","the financial column","in a column I disagree with a lot of what he writes in his column.","I always read her column in the local paper.","column on/about something The website features a regular column on parenting.","column by somebody She always read the column by the local vicar in the parish magazine.","He has a regular column in a weekly newspaper.","She saw his name in an obituary column.","a weekly column on films showing in London","a weekly column on movies showing in the capital","The website runs an online advice column for teenagers."],"opposite":"","synonyms":""},{"def":"a tall, solid post, usually round and made of stone, that supports or decorates a building or stands alone as a monument","examples":["The temple is supported by marble columns.","Nelson's Column in Trafalgar Square is one of London's best-known landmarks.","The roof is supported by four huge columns.","colonnades of fluted Doric columns","Corinthian columns are decorated with leaves at the top.","It was an Athenian temple with long colonnades of limestone columns.","The churches have classical columns and decoration.","The temple is supported by fluted marble columns."],"opposite":"","synonyms":""},{"def":"a thing that is like a column in shape","examples":["a column of smoke (= smoke rising straight up)"],"opposite":"","synonyms":""},{"def":"a long, moving line of people or vehicles","examples":["a long column of troops and tanks","to march in columns"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["column inch","advice column","agony column","fifth column","gossip column","spinal column","Nelson's Column","personal column","steering column"]}]