[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/combi/combination__us_1.mp3","phonsUS":"/ˌkɑːmbɪˈneɪʃn/","level":"B2","meanings":[{"def":"two or more things joined or mixed together to form a single unit","examples":["combination of something The tragedy was due to a combination of factors.","They recommend reducing expenditure, increasing taxes, or a combination of the two.","his unique combination of skills","His treatment was a combination of surgery, radiation and drugs.","What an unusual combination of flavours!","Try different combinations of exotic fruit in a fresh fruit salad.","The best approach may well be to use a combination of both methods.","Technology and good management. That's a winning combination (= one that will certainly be successful).","With 11 languages, the number of possible combinations, translating one into another, is 110.","Many course combinations are possible.","in a combination They continue to record and play concerts solo and in various combinations.","High debt and low earnings are a lethal combination.","The band played with a winning combination of gusto and precision.","a delicious combination of flavours","a delicious combination of herbs and spices","an unusual colour combination"],"opposite":"","synonyms":""},{"def":"the act of joining or mixing together two or more things to form a single unit","examples":["in combination with somebody/something The firm is working on a new product in combination with several overseas partners.","in combination These paints can be used individually or in combination.","The materials can be used singly or in combination.","combination of something Combination of these methods allowed us to achieve highly consistent results."],"opposite":"","synonyms":""},{"def":"a series of numbers or letters used to open a combination lock","examples":["I can't remember the combination."],"opposite":"","synonyms":""},{"def":"a piece of underwear covering the body and legs, worn in the past","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["combination lock","combination locks"]}]