[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/combi/combine__us_1.mp3","phonsUS":"/kəmˈbaɪn/","level":"B1","meanings":[{"def":"to come together to form a single thing or group; to join two or more things or groups together to form a single one","examples":["combine to do something Hydrogen and oxygen combine to form water.","Several factors had combined to ruin our plans.","combine with something (to do something) Hydrogen combines with oxygen to form water.","Archaeological and historical evidence combine to create a picture of what life must have been like at that time.","combine something a style that combines elements of tap, ballet and modern dance","I like to travel and make films, and I'm now able to combine the two.","combine A with B Combine the eggs with a little flour.","combine A and B (together) Combine the eggs and the flour.","combine something into something Small units, such as words, can be combined into larger units, such as clauses.","Combine all the ingredients in a bowl.","The earthquake and a series of underwater landslides combined to make a gigantic tsunami."],"opposite":"","synonyms":""},{"def":"to have two or more different features or characteristics; to put two or more different things, features or qualities together","examples":["combine something We are still looking for someone who combines all the necessary qualities.","The new councils combine the functions of district and regional councils.","combine A and/with B The hotel combines comfort with convenience.","These materials combine enormous strength with light weight.","This model combines a printer and scanner.","They have successfully combined the old with the new in this room.","The other room was a kitchen and dining room combined."],"opposite":"","synonyms":""},{"def":"to do two or more things at the same time","examples":["The trip will combine business with pleasure.","She has successfully combined a career and bringing up a family.","She successfully combines her career with family life.","The courses allow students to combine their studies with employment or other activities."],"opposite":"","synonyms":""},{"def":"to come together in order to work or act together; to put two things or groups together so that they work or act together","examples":["combine against somebody/something They combined against a common enemy.","combine with something The illustrations combine well with the text.","combine something (with something) You should try to combine exercise with a healthy diet."],"opposite":"","synonyms":""},{"def":"to work together in order to achieve a shared aim","examples":["The two firms joined forces to win the contract.","The two companies have joined forces to form a new consortium."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"join/combine forces (with somebody)","def":"to work together in order to achieve a shared aim","examples":["The two firms joined forces to win the contract.","The two companies have joined forces to form a new consortium."]}],"phrasal":[],"related":["combine harvester"]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/combi/combine__us_2.mp3","phonsUS":"/ˈkɑːmbaɪn/","level":"","meanings":[{"def":"a large farm machine that both cuts a crop and also separates the grains from the rest of the plant","examples":[],"opposite":"","synonyms":""},{"def":"a group of people or organizations acting together in business","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]