[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/comfo/comfort__us_1.mp3","phonsUS":"/ˈkʌmfərt/","level":"B2","meanings":[{"def":"the state of being physically relaxed and free from pain; the state of having a pleasant life, with everything that you need","examples":["The hotel offers a high standard of comfort and service.","I didn't want to leave the comfort of my bed.","in comfort They had enough money to live in comfort in their old age.","in the comfort of something Watch the latest movies in the comfort of your own home.","from the comfort of something From the comfort of your own armchair, you can witness all the action live.","for comfort I dress for comfort rather than elegance.","These tennis shoes are designed for comfort and performance.","He's beginning to find a comfort level with his teammates now.","He enjoys dangerous sports from the comfort of his couch.","I like to travel in reasonable comfort.","Learn a new language in the comfort of your own home.","They live in modest comfort.","a quilted cover for added comfort"],"opposite":"","synonyms":""},{"def":"a feeling of not suffering or worrying so much; a feeling of being less unhappy","examples":["I tried to offer a few words of comfort.","His words were of little comfort in the circumstances.","to take comfort from somebody’s words","His family can draw some comfort from the fact that the two men accused of his murder have pleaded guilty.","We know that they will find comfort in the knowledge that he died doing the job he loved","The announcement of a few new jobs will provide scant comfort to their many recently redundant employees.","comfort to somebody If it's any comfort to you, I'm in the same situation.","I drew comfort from his words.","His kind words brought some comfort to the grieving parents.","I need all the comfort I can get right now.","She found comfort in music.","They sought comfort in each other.","We took great comfort from the fact that our savings were safe."],"opposite":"","synonyms":""},{"def":"a person or thing that helps you when you are suffering, worried or unhappy","examples":["Her being with me was such a comfort.","comfort to somebody The children have been a great comfort to me through all of this.","it is a comfort to do something It's a comfort to know that she is safe.","it is a comfort to somebody to do something It was a comfort to her to know that I was never far away.","it is a comfort that… In some ways it's a comfort that they died together.","it is a comfort to somebody that… It will be a comfort to her family that justice has been done."],"opposite":"","synonyms":""},{"def":"a thing that makes your life easier or more comfortable","examples":["The hotel has all modern comforts/every modern comfort.","material comforts (= money and possessions)","She desperately missed her home comforts while camping.","He is someone who would take the comforts of home over the bright lights of Hollywood."],"opposite":"","synonyms":""},{"def":"so near that it is uncomfortable or dangerous","examples":["When she leaves the stage, the fans can get a little too close for comfort.","(figurative) They got the win but it was a tight match, definitely too close for comfort."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"too close for comfort","def":"so near that it is uncomfortable or dangerous","examples":["When she leaves the stage, the fans can get a little too close for comfort.","(figurative) They got the win but it was a tight match, definitely too close for comfort."]}],"phrasal":[],"related":["cold comfort","comfort break","comfort food","comfort zone","comfort blanket","comfort eating","comfort station","Southern Comfort™","Cold Comfort Farm","comfort foods","comfort zones","comfort eatings","comfort blankets","comfort stations","too close for comfort"]},{"pos":"verb","level":"B2","meanings":[{"def":"to make somebody who is worried or unhappy feel better by being kind and showing sympathy to them","examples":["comfort somebody The victim's widow was today being comforted by family and friends.","The idea that he was not alone comforted him greatly.","I am comforted by the fact that Jamie died doing what he liked best.","comfort yourself with something She comforted herself with the thought that it would soon be spring.","be comforted to do something He was comforted to know that most people in the class knew even less than he.","it comforts somebody to do something It comforted her to feel his arms around her."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]