[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/comfo/comfortable__us_4.mp3","phonsUS":"/ˈkʌmftəbl/","level":"A2","meanings":[{"def":"making you feel physically relaxed; pleasant to wear, sit on, etc.","examples":["It's such a comfortable bed.","These new shoes are not very comfortable.","clothes that are comfortable to wear","a warm comfortable house","Let me slip into something more comfortable (= change into more comfortable clothing).","The bed felt comfortable.","The hotel was comfortable enough.","an extremely comfortable chair","It is advisable to wear loose, comfortable clothing.","It's an elegant, comfortable house with good views from the windows.","We must think how we can make the room more comfortable for you.","I'll change into something more comfortable when I get home."],"opposite":"uncomfortable","synonyms":""},{"def":"feeling physically relaxed in a pleasant way; warm enough, without pain, etc.","examples":["Are you comfortable?","She shifted into a more comfortable position on the chair.","Please make yourself comfortable while I get some coffee.","The patient is comfortable (= not in pain) after his operation.","This bed is lumpy—I just can't seem to get comfortable."],"opposite":"uncomfortable","synonyms":""},{"def":"confident about something and not worried or afraid","examples":["She was clearly quite comfortable and relaxed.","comfortable with something/somebody He's more comfortable with computers than with people.","comfortable about something I was not entirely comfortable about the plans they had made.","comfortable about doing something I didn't feel comfortable about accepting the money.","comfortable doing something She seems comfortable giving a speech without notes.","comfortable in something He didn't look comfortable in his role as the vicar.","I never feel very comfortable in her presence.","comfortable in doing something Students will become more comfortable in expressing their ideas.","I don't feel comfortable with him.","She didn't feel comfortable about going out alone.","They didn't feel comfortable about her travelling alone."],"opposite":"uncomfortable","synonyms":""},{"def":"having enough money to buy what you want without worrying about the cost","examples":["They're not millionaires, but they're certainly very comfortable.","He makes a comfortable living.","They come from comfortable middle-class families.","I had a relatively comfortable life in Brazil.","affluent Western countries","His family is not very well off.","They’re not millionaires, but they’re certainly very comfortable."],"opposite":"","synonyms":"rich"},{"def":"quite large; allowing you to win easily","examples":["The party won with a comfortable majority.","a comfortable 2–0 win"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]