[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/comma/command__us_2.mp3","phonsUS":"/kəˈmænd/","level":"B2","meanings":[{"def":"an order given to a person or an animal","examples":["Begin when I give the command.","You must obey the captain's commands.","command to do something He issued the command to retreat.","Police said he ignored their commands to stop.","an army officer barking commands at his men","She has been teaching her dog simple commands."],"opposite":"","synonyms":""},{"def":"an instruction given to a computer","examples":["The computer executes commands successively in the order they arrive.","What is the startup command for the program?"],"opposite":"","synonyms":""},{"def":"control and authority over a situation or a group of people","examples":["under somebody's command He has 1 200 men under his command.","command of somebody/something He has command of 1  200 men.","The police arrived and took command of the situation.","In 1939 he assumed command of all French naval forces.","There were many disagreements over the command of the peacekeeping forces.","in command Who is in command here?","in command of something/yourself For the first time in years, she felt in command of her life.","He looked relaxed and totally in command of himself.","the chain of command","a breakdown in the command structure","He had command of 3 000 soldiers.","He was in complete command of the situation.","She has lost command of her senses.","She was in sole command of one million pounds.","The division was under the command of General George.","under the direct command of Lieutenant Sykes","Decisions that are beyond the competence of junior managers should be referred up the chain of command.","his command over resources"],"opposite":"","synonyms":""},{"def":"a part of an army, air force, etc. that is organized and controlled separately; a group of officers who give orders","examples":["Bomber Command"],"opposite":"","synonyms":""},{"def":"your knowledge of something; your ability to do or use something, especially a language","examples":["Applicants will be expected to have (a) good command of English.","She has an excellent command of French."],"opposite":"","synonyms":""},{"def":"if you have a skill or an amount of something at your command, you are able to use it well and completely","examples":["With all the words at my command, I could not express how I felt.","The vast knowledge he has at his command will be invaluable in the job."],"opposite":"","synonyms":""},{"def":"to be ready to obey somebody","examples":["I'm at your command—what would you like me to do?"],"opposite":"","synonyms":""},{"def":"used to say that you are ready to do whatever somebody asks you to do","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"at your command","def":"if you have a skill or an amount of something at your command, you are able to use it well and completely","examples":["With all the words at my command, I could not express how I felt.","The vast knowledge he has at his command will be invaluable in the job."]},{"idiom":"be at somebody’s command","def":"to be ready to obey somebody","examples":["I'm at your command—what would you like me to do?"]},{"idiom":"your wish is my command","def":"used to say that you are ready to do whatever somebody asks you to do","examples":[]}],"phrasal":[],"related":["command line","command post","high command","command-driven","command economy","command language","command module","command performance","second in command","United States Central Command","North American Aerospace Defense Command","command posts","command modules","command economies","command languages","command performances","seconds in command"]},{"pos":"verb","level":"B2","meanings":[{"def":"to tell somebody to do something","examples":["command somebody to do something He commanded his men to retreat.","command something She commanded the release of the prisoners.","command (somebody) + speech ‘Come here!’ he commanded (them).","‘Get back to your room,’ she commanded.","command that… (formal) The commission intervened and commanded that work on the building cease.","(British English also) The commission commanded that work on the building should cease."],"opposite":"","synonyms":""},{"def":"to be in charge of a group of people in the army, navy, etc.","examples":["In March 1942 he was appointed to command US naval forces in Europe","The troops were commanded by General Haig.","The squadron was commanded by Major Frank Broad.","He was the officer commanding the troops in the Western region."],"opposite":"","synonyms":""},{"def":"to deserve and get something because of the special qualities you have","examples":["to command sympathy/support","She was able to command the respect of the class.","The headlines commanded her attention.","As a top lawyer, he can expect to command a six-figure salary."],"opposite":"","synonyms":""},{"def":"to be in a position from where you can see or control something","examples":["The hotel commands a fine view of the valley.","They built a castle commanding the river crossing."],"opposite":"","synonyms":""},{"def":"to have control of something; to have something available for use","examples":["The party was no longer able to command a majority in Parliament.","the power and finances commanded by the police"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]