[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/commu/communication__us_2.mp3","phonsUS":"/kəˌmjuːnɪˈkeɪʃn/","level":"B1","meanings":[{"def":"the activity or process of expressing ideas and feelings or of giving people information","examples":["communication between A and B Good communication between team leaders and members is essential.","communication with somebody attempts to improve communication with customers","The campaign will appear across all communication channels.","helping students develop their communication skills","non-verbal communication such as gestures or facial expressions","in communication We are in regular communication by email.","Good communication is important for business.","I haven't had any communication with him for several years.","Letters are their only means of communication.","We are in regular communication with the kidnappers.","We need better communication with clients.","communication by letter","to keep open the channels of communication","to establish direct communication between the lookout towers","measures which prevented communication with the outside world","Speech is the fastest method of communication between people.","Doctors do not always have good communication skills.","Snow has prevented communication with the outside world for three days."],"opposite":"","synonyms":""},{"def":"methods of sending information, especially phones, radio, computers, etc. or roads and railways","examples":["communications technology","to launch a communications satellite","wireless/electronic/satellite communication","to intercept/disrupt/monitor communications","The new airport will improve communications between the islands.","Paris has good rail communications with other major cities.","They tried to disrupt communications between the two headquarters."],"opposite":"","synonyms":""},{"def":"a message, letter or phone call","examples":["a communication from the leader of the party","He received an official communication about the reorganization of the Ministry.","If you no longer wish to receive communications from us, follow the instructions at the bottom of the email.","a communication from the officer to the general"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["near field communication","computer-mediated communication","Communication Workers Union"]}]