[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/commi/commit__us_1.mp3","phonsUS":"/kəˈmɪt/","level":"B1","meanings":[{"def":"to do something wrong or illegal","examples":["to commit a crime/an offence","to commit murder/fraud/adultery","to commit an act of violence/terrorism","to commit an error/a sin","to commit atrocities","appalling crimes committed against innocent children","Most crimes are committed by young men.","The men are being held on suspicion of conspiracy to commit armed robbery.","He denied conspiring to commit robberies in April last year.","He was punished for a murder he did not commit.","I had committed a faux pas by referring to her ex-husband.","Was she capable of committing a crime?","committing an act of violence","What leads someone to commit murder?"],"opposite":"","synonyms":""},{"def":"to kill yourself deliberately","examples":["Her father had committed suicide."],"opposite":"","synonyms":""},{"def":"to promise sincerely that you will definitely do something, keep to an agreement or arrangement, etc.","examples":["commit somebody/yourself They want to see the text of the proposed treaty before fully committing themselves.","commit somebody/yourself to something Making an application does not commit you to anything.","commit somebody/yourself to doing something Borrowers should think carefully before committing themselves to taking out a loan.","commit somebody/yourself to do something Both sides committed themselves to settle the dispute peacefully.","He has now committed us to buying the house.","We need people to commit themselves to regular voluntary work.","Both candidates refused to commit themselves to tax cuts.","Several countries were reluctant to commit themselves to the treaty."],"opposite":"","synonyms":""},{"def":"to give an opinion or make a decision openly so that it is then difficult to change it","examples":["You don't have to commit yourself now—just think about it.","I don't know what his opinion is. He won't commit himself.","He had never committed himself to any ideology."],"opposite":"","synonyms":""},{"def":"to stay with and completely support one person, organization, etc. or give all your time and effort to your work, an activity, etc.","examples":["Why are so many men scared to commit? (= say they will stay with one person)"],"opposite":"","synonyms":""},{"def":"to spend money or time on something/somebody","examples":["The council has committed large amounts of money to housing projects.","The University committed substantial funds to assisting mature students."],"opposite":"","synonyms":""},{"def":"to order somebody to be sent to a hospital, prison, etc.","examples":["She was committed to a psychiatric hospital."],"opposite":"","synonyms":""},{"def":"to send somebody for trial in court","examples":["The attackers were committed for trial at Bristol Crown Court."],"opposite":"","synonyms":""},{"def":"to learn something well enough to remember it exactly","examples":["She committed the instructions to memory."],"opposite":"","synonyms":""},{"def":"to write something down","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]