[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/commi/commitment__us_1.mp3","phonsUS":"/kəˈmɪtmənt/","level":"B2","meanings":[{"def":"a promise to do something or to behave in a particular way; a promise to support somebody/something; the fact of committing yourself","examples":["I'm not ready to make a long-term commitment.","They have failed to honour their commitments.","commitment to somebody/something The company has shown a commitment to diversity over the years.","He questioned the government's commitment to public services.","We're looking for a firm commitment from both sides.","commitment to do/doing something This project demonstrates our commitment to improving the quality of the city's green spaces.","They reaffirmed their commitment to work for peace.","commitments under something Australia is determined to meet its commitments under the agreement.","The company is making a long-term commitment to breaking into the American market.","The government avoided giving any commitments on pensions.","The government has managed to gain the commitment of employers to the scheme.","The president made a firm commitment to increasing spending on health.","Is the government going to honour its commitments on the reduction of air pollution?","This is part of the farm's continued commitment to preserving wildlife.","The company's commitment to providing quality at a reasonable price has been vital to its success.","She doesn't want to make a big emotional commitment to Steve at the moment."],"opposite":"","synonyms":""},{"def":"the desire to work hard and give your energy and time to a job or an activity","examples":["He has demonstrated exceptional commitment and dedication.","commitment to something commitment to education/democracy/social justice","Not everyone will be happy with this level of commitment.","She was criticized for her lack of commitment.","Learning to play the violin requires strong commitment.","his lifelong commitment to the socialist cause","to demonstrate a commitment to human rights","I was saddened to see their lack of commitment.","They all played with commitment and determination.","This post demands a high level of commitment.","A career as an actor requires one hundred per cent commitment."],"opposite":"","synonyms":""},{"def":"a thing that you have promised or agreed to do, or that you have to do","examples":["He's busy for the next month with filming commitments.","Women very often have to juggle work with their family commitments.","I don't want to take on any more commitments."],"opposite":"","synonyms":""},{"def":"a promise to pay for something, especially regularly; a promise to use resources in order to achieve something","examples":["Taking on a mortgage is a huge financial commitment.","commitment (of something) (to something) the commitment of resources to education","Achieving success at this level requires a commitment of time and energy.","This will probably prove to be the largest financial commitment the industry has ever made.","Buying a house is a big financial commitment.","a heavy commitment of capital","The war on poverty requires a commitment of resources from the developing nations.","She can't meet her financial commitments."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]