[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/commi/commission__us_2.mp3","phonsUS":"/kəˈmɪʃn/","level":"B2","meanings":[{"def":"an official group of people who have been given responsibility to control something, or to find out about something, usually for the government","examples":["The commission is expected to report its findings next month.","(British English) The government has set up a commission of inquiry into the disturbances at the prison.","The election commission found that neither candidate received enough votes to avoid a run-off.","on a commission the British representative on the commission","before a commission The defendant will be brought to trial before a military commission.","commission on something She was also a member of the commission on religious education.","a commission on human rights","The government appointed an independent commission to investigate the causes of the disaster.","The government has set up a joint commission to consider the problem.","a commission on domestic violence","the Commission for Racial Equality","He was appointed to head a commission of enquiry into the recent riots.","She's a member of the IOC medical commission.","Sweden's Environment Commission has ruled against the dam project.","The government set up a fact-finding commission to investigate the circumstances surrounding the accident.","This is the first meeting of an intergovernmental commission on economic cooperation between the two countries.","the Atomic Energy Commission"],"opposite":"","synonyms":""},{"def":"an amount of money that is paid to somebody for selling goods and that increases with the amount of goods that are sold","examples":["commission on something You get a 10 per cent commission on everything you sell.","He earned £2 000 in commission last month.","on commission In this job you work on commission (= are paid according to the amount you sell).","to work on a commission basis","Most of the salespeople are on commission."],"opposite":"","synonyms":""},{"def":"an amount of money that is charged by a bank, etc. for providing a particular service","examples":["1 per cent commission is charged for exchanging foreign currency.","commission on something The bank charges a high commission on these transactions."],"opposite":"","synonyms":""},{"def":"a formal request to somebody to design or make a piece of work such as a building or a painting; the fact of making such a request","examples":["Eventually she agreed to accept the commission.","commission to do something He received a commission to design the new parliament building.","commission for something Sometimes I take commissions for portraits.","commission from somebody The exhibition was a success and brought commissions from wealthy patrons.","I have received a private commission to paint the prince's family.","Who won the commission to design the new town hall?","She would not accept the commission, saying it did not pay enough.","The firm will accept commissions for most types of architectural work."],"opposite":"","synonyms":""},{"def":"the position of an officer in the armed forces, typically with the rank of lieutenant or higher","examples":["He resigned his commission when he got married."],"opposite":"","synonyms":""},{"def":"the act of doing something wrong or illegal","examples":["the commission of a crime"],"opposite":"","synonyms":""},{"def":"available/not available to be used","examples":["Several of the airline's planes are temporarily out of commission and undergoing safety checks."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in/out of commission","def":"available/not available to be used","examples":["Several of the airline's planes are temporarily out of commission and undergoing safety checks."]}],"phrasal":[],"related":["high commission","Royal Commission","Audit Commission","Law Commission","Charity Commission","Competition Commission","European Commission","Forestry Commission","Gambling Commission","Millennium Commission","War Graves Commission","Press Complaints Commission","Commission for Racial Equality","Commission on Civil Rights","Equal Opportunities Commission","Federal Communications Commission","Equal Employment Opportunity Commission","Securities and Exchange Commission","Equality and Human Rights Commission"]},{"pos":"verb","level":"B2","meanings":[{"def":"to officially ask somebody to write, make or create something or to do a task for you","examples":["commission somebody to do something She has been commissioned to write a new national anthem.","commission something to commission a study/report","a specially commissioned piece of music","Publishers have commissioned a French translation of the book.","The survey on consumer taste was commissioned by local stores.","commission something from somebody The king commissioned portraits from foreign artists.","commission something for something the first opera commissioned for television"],"opposite":"","synonyms":""},{"def":"to choose somebody as an officer in one of the armed forces","examples":["be commissioned She was commissioned in 2014.","be commissioned (as) something He has just been commissioned (as a) pilot officer."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]