[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/comme/commercial__us_2.mp3","phonsUS":"/kəˈmɜːrʃl/","level":"B1","meanings":[{"def":"connected with the buying and selling of goods and services","examples":["residential and commercial properties","a commercial building/development","(especially North American English) commercial real estate","commercial activities","They have offices in the commercial heart of the city.","She is developing the commercial side of the organization.","a commercial vehicle (= one that is used for carrying goods or passengers who pay)","This book deals with the social, economic and political issues of the period.","She had got into financial difficulties.","Tokyo is a major financial centre.","closer European monetary union"],"opposite":"","synonyms":"economic"},{"def":"making or intended to make a profit","examples":["The movie was not a commercial success (= did not make money).","Risks arise when state-owned enterprises begin operating as commercial entities.","policies to attract new industrial or commercial enterprises","They are keen to see the technology licensed for commercial use.","The data cannot be used for commercial purposes.","The newspaper is acting solely in its own commercial interests.","commercial baby foods","the first commercial flights across the Atlantic","The play was very successful on Broadway.","The company has had another successful year.","a highly profitable business","The movie was not a commercial success (= made no profit).","They do a lot of business in lucrative overseas markets.","Small local shops stop being economic when a supermarket opens up nearby.","His first jobs were in the commercial sector.","They are an educational charity, not a commercial publisher.","The decision has been made on a purely commercial basis."],"opposite":"","synonyms":"successful"},{"def":"more interested in profit and being popular than in quality","examples":["Their more recent music is far too commercial.","The show was unashamedly commercial, with little artistic merit."],"opposite":"","synonyms":""},{"def":"paid for by the money charged for broadcasting advertisements","examples":["a commercial radio station/TV channel"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["commercial bank","commercial break","commercial farming","commercial traveller","commercial banks","commercial breaks","commercial travellers","commercial traveler","commercial travelers","commercial organization"]},{"pos":"noun","level":"B1","meanings":[{"def":"an advertisement on television, on the radio or on a website","examples":["a TV/television commercial","a radio commercial","a Republican campaign commercial","The marketing campaign is starting with four online commercials.","in a commercial actors in commercials","She began her career appearing in commercials.","commercial for something He did a number of commercials for major brands.","They ran advertisements on TV and on social media.","Dirty streets are no advertisement for a prosperous society.","She works in publicity.","There has been a lot of advance publicity for her new film.","We put an ad on that website.","an ad for a new chocolate bar","a special promotion of local products","She works in sales and promotion.","She ended up doing commercials, which ironically revived her acting career.","She's in a commercial for cars.","The commercial features a moody young man.","The commercial features a teenage girl with spots.","The company has made commercials for leading sportswear manufacturers."],"opposite":"","synonyms":"advertisement"}],"idioms":[],"phrasal":[],"related":[]}]