[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/comme/comment__us_1.mp3","phonsUS":"/ˈkɑːment/","level":"A2","meanings":[{"def":"something that you say or write that gives an opinion on or explains somebody/something","examples":["comment on something She made helpful comments on my work.","thoughtful/interesting/insightful comments","snide/critical/derogatory comments","comment about something Have you any comment to make about the cause of the disaster?","without comment He handed me the document without comment.","The director was not available for comment.","You have to register to post a comment.","Please leave a comment on our website.","Keep up to date with all the latest news and comment.","You can post a question in the comments section below.","(especially British English) What she said was fair comment (= a reasonable critcism).","A government spokesperson made a statement to the press.","She made helpful comments on my work.","the announcement of a peace agreement","He made a number of rude remarks about the food.","the declaration of war","He began by making a few general observations about the report.","Editorial comment in the press tended to support the government in this matter.","Feel free to post your comments if you have any.","He made a few casual comments to her about her hair and now she's chopped it all off!","Her novels were a vehicle for shrewd social comment.","Highly critical comments have been made about the conduct of some ministers.","I would prefer not to pass comment before I have more information on the case.","If you have any comments, please send them to the above address.","KPJ officials declined comment.","She accepted his diagnosis without comment.","She directed all her comments at Steve.","She made a cryptic comment about how the film mirrored her life.","The minister was unavailable for comment last night.","The school has invited comments from parents about the new curriculum.","The spokesman was not available for comment last night.","This idea deserves more than passing comment.","Viewers are encouraged to phone in questions and comments.","We have received many helpful comments from fellow-sufferers.","We welcome comments from readers.","a general comment on the weather"],"opposite":"","synonyms":"statement"},{"def":"criticism that shows the faults of something","examples":["The results are a clear comment on government education policy.","There was a lot of comment about his behaviour.","a book with critical comment on the various strands of feminism","The article attracted much adverse comment.","His visits were the source of much comment.","The attack is a sad comment on the public's understanding of mental illness."],"opposite":"","synonyms":""},{"def":"I have nothing to say about that","examples":["‘Will you resign, sir?’ ‘No comment!’","When asked about the allegations, the chairman replied ‘no comment’."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"no comment","def":"I have nothing to say about that","examples":["‘Will you resign, sir?’ ‘No comment!’","When asked about the allegations, the chairman replied ‘no comment’."]}],"phrasal":[],"related":[]},{"pos":"verb","level":"B1","meanings":[{"def":"to express an opinion about something","examples":["He refused to comment until after the trial.","She said she was unable to comment further.","comment on/upon something to comment on a case/report","I don't feel I can comment on their decision.","We were just commenting on how well you look.","He said nothing when asked to comment on the allegations.","comment about something She declined to comment about the current situation in the party.","comment (to somebody) that… A spokesperson commented that levels of carbon dioxide were very high.","comment (to somebody) + speech ‘Not his best performance,’ she commented to the woman sitting next to her.","He refused to comment until after the trial.","He noted in passing that the company’s record on safety issues was not good.","Critics remarked that the play was not original.","She observed that it was getting late.","He commented favourably on the proposals.","He refused to comment on the proposals.","People were commenting about her abilities.","She commented to me that she liked it."],"opposite":"","synonyms":"comment"}],"idioms":[],"phrasal":[],"related":[]}]