[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/commu/communicate__us_1.mp3","phonsUS":"/kəˈmjuːnɪkeɪt/","level":"A2","meanings":[{"def":"to share or exchange information, news, ideas, feelings, etc.","examples":["We only communicate by email.","They communicated in sign language.","Candidates must be able to communicate effectively.","communicate with somebody/something Dolphins use sound to communicate with each other.","Direct marketing allows a firm to communicate directly with its customers.","communicate something In times of uncertainty, a leader must be able to communicate a message of hope.","Language evolved as a means of communicating information between individuals.","communicate something to somebody He was eager to communicate his ideas to the group.","Her nervousness was communicating itself to the children.","communicate how/what, etc… They failed to communicate what was happening and why.","We talked on the phone for over an hour.","Have you discussed the problem with anyone?","I’ve spoken to the manager about it.","‘Can I speak to Susan?’ ‘Speaking.’ (= at the beginning of a phone conversation)","We only communicate by email.","Dolphins use sound to communicate with each other.","Politicians will be debating the bill later this week.","You shouldn’t have done it without consulting me.","By this age most children have begun to communicate verbally.","Newspapers are an important way of communicating information.","She is unable to communicate her ideas to other people.","We communicated through an interpreter.","We usually communicate by letter.","Nobody had communicated the information to us."],"opposite":"","synonyms":"talk"},{"def":"to have a good relationship because you are able to understand and talk about your own and other people’s thoughts, feelings, etc.","examples":["His inability to communicate has damaged their relationship beyond repair.","communicate with somebody The novel is about a family who can't communicate with each other.","couples who communicate well with one another"],"opposite":"","synonyms":""},{"def":"to pass a disease from one person, animal, etc. to another","examples":["The disease is communicated through dirty drinking water."],"opposite":"","synonyms":""},{"def":"if two rooms communicate, they are next to each other and you can get from one to the other","examples":["a communicating door (= one that connects two rooms)"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]