[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/compa/compare__us_2.mp3","phonsUS":"/kəmˈper/","level":"A1","meanings":[{"def":"to examine people or things to see how they are similar and how they are different","examples":["compare A and B It is interesting to compare their situation and ours.","We compared the two reports carefully.","The internet allows you to compare prices from a variety of companies.","How can you compare the two things? They are so different!","Compare and contrast the characters of Jack and Ralph.","compare A with/to B We compared the results of our study with those of other studies.","My own problems seem insignificant compared with other people's.","I've had some difficulties, but they were nothing compared to yours (= they were not nearly as bad as yours).","Standards in healthcare have improved enormously compared to 40 years ago.","They receive just over three years of schooling, compared to a national average of 7.3.","an increase of over 11% compared to the same period last year","About a third of American adults are obese compared with 24 per cent of Britons","This survey highlights a number of differences in the way that teenage boys and girls in the UK spend their free time.","One of the main differences between the girls and the boys who took part in the research was the way in which they use the internet.","Unlike the girls, who use the internet mainly to keep in touch with friends, the boys questioned in this survey tend to use the internet for playing computer games.","The girls differ from the boys in that they tend to spend more time keeping in touch with friends on the phone or on social networking websites.","Compared to the boys, the girls spend much more time chatting to friends on the phone.","On average the girls spend four hours a week chatting to friends on the phone. In contrast, very few of the boys spend more than five minutes a day talking to their friends in this way.","The boys prefer competitive sports and computer games, whereas/while the girls seem to enjoy more cooperative activities, such as shopping with friends.","When the girls go shopping, they mainly buy clothes and cosmetics. The boys, on the other hand, tend to purchase computer games or gadgets.","This bar chart illustrates how many journeys people made on public transport over a three-month period.","This table compares bus, train, and taxi use between April and June.","The results are shown in the chart below.","In this pie chart, the survey results are broken down by age.","This pie chart breaks down the survey results by age.","As can be seen from these results, younger people use buses more than older people.","According to these figures, bus travel accounts for 60 per cent of public transport use.","From the data in the above graph, it is apparent that buses are the most widely used form of public transport.","We carefully compared the first report with the second.","The study was designed to compare the performance of the two methods.","Before purchasing an insurance policy, be sure to compare the rates offered by the different companies.","The clinical trial compared two groups of children aged between 8 and 10."],"opposite":"","synonyms":""},{"def":"to be similar to somebody/something else, either better or worse","examples":["This school compares with the best in the country (= it is as good as them).","This house doesn't compare with our previous one (= it is not as good).","Their prices compare favourably to those of their competitors.","The region's wines compare well with those from elsewhere in Germany.","Few things compare with the joy of walking on a bright spring morning.","The city compares favourably with other parts of Brazil.","These mountains do not compare with the Himalayas.","Athletics just can't compare with professional sport in terms of material gain.","Nothing compares with the sight of your child swimming for the first time.","Our productivity compares well with our UK competitors'.","This Roman gold doesn't compare to a recent find by a local farmer, which is worth millions.","This government's record compares favourably with that of our predecessors.","Average speeds for the journey compare unfavourably with the rest of the rail network.","How do these results compare with last year's?","Few trees can compare with our native rowan for ease of cultivation.","The profit of £23 million compares with a £32 million loss in the previous financial year."],"opposite":"","synonyms":""},{"def":"to show or state that somebody/something is similar to somebody/something else","examples":["The critics compared his work to that of Martin Amis.","In her early career she was often compared to Ella Fitzgerald.","Some observers compare the situation to that of the early 1980s."],"opposite":"","synonyms":""},{"def":"if two or more people compare notes, they each say what they think about the same event, situation, etc.","examples":["We saw the play separately and compared notes afterwards.","Let's compare notes on our experiences."],"opposite":"","synonyms":""},{"def":"it is impossible to say that one thing is better than another if the two are completely different","examples":["They are both great but you can't compare apples and oranges.","No, you’re trying to compare apples and oranges."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"compare notes (with somebody)","def":"if two or more people compare notes, they each say what they think about the same event, situation, etc.","examples":["We saw the play separately and compared notes afterwards.","Let's compare notes on our experiences."]},{"idiom":"you can’t compare apples and oranges","def":"it is impossible to say that one thing is better than another if the two are completely different","examples":["They are both great but you can't compare apples and oranges.","No, you’re trying to compare apples and oranges."]}],"phrasal":[],"related":["beyond/without compare"]},{"pos":"noun","level":"","meanings":[{"def":"better than anything else of the same kind","examples":["a diamond beyond compare","Our professional service promises you a wedding without compare."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"beyond/without compare","def":"better than anything else of the same kind","examples":["a diamond beyond compare","Our professional service promises you a wedding without compare."]}],"phrasal":[],"related":[]}]