[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/compa/comparison__us_2.mp3","phonsUS":"/kəmˈpærɪsn/","level":"B1","meanings":[{"def":"the process of comparing two or more people or things","examples":["For Durkheim, comparison was the most important method of analysis in sociology.","comparison with somebody/something Comparison with other oil-producing countries is extremely interesting.","The two situations bear no comparison (= they are not at all similar).","for comparison I enclose the two plans for comparison.","Let's put them side by side for comparison.","Our problems don't bear comparison with those elsewhere.","The pandemic in some respects stands comparison with the Great Fire of London in 1666","The similarity between the two invites comparison.","a price-comparison site","to provide a basis for comparison","One of the groups serves as a comparison group or ‘control’ for the other."],"opposite":"","synonyms":""},{"def":"an occasion when two or more people or things are compared","examples":["The films are too different for a fair comparison.","comparison of A and B a comparison of the rail systems in Britain and France","comparison of A with B a comparison of men’s salaries with those of women","comparison between A and B comparisons between Britain and the rest of Europe","comparison of A to B a comparison of the brain to a computer (= showing what is similar)","comparison with somebody/something It is difficult to make a comparison with her previous book—they are completely different.","You can draw comparisons with the situation in Ireland (= say how the two situations are similar).","There is no published information that would allow a direct comparison with other regions or countries.","This chart provides a comparison of the ways that teenage boys and girls in the UK spend their free time.","In many cases, the results for boys and girls are virtually the same/identical.","In many cases, the results for boys are virtually the same as/identical to the results for girls.","Both boys and girls spend the bulk of their free time with friends.","Most of the boys do more than two hours of sport a week, as do many of the girls.","Like many of the girls, most of the boys spend a large part of their free time using the internet.","The girls particularly enjoy using social networking websites. Similarly, nearly all the boys said they spent at least two to three hours a week on these sites.","a comparison with other schools","a comparison of unemployment rates over the past 15 years","a comparison between figures for last year and this year"],"opposite":"","synonyms":""},{"def":"used especially at the beginning of a sentence when the next thing that is mentioned is compared with something in the previous sentence","examples":["By comparison, expenditure on education increased last year.","His problems seemed trivial by comparison."],"opposite":"","synonyms":""},{"def":"when compared with somebody/something","examples":["The second half of the game was dull by comparison with the first.","The tallest buildings in London are small in comparison with New York's skyscrapers.","The glasses are small in comparison with the old ones.","Jane is still quite young, and Fiona seems old by comparison."],"opposite":"","synonyms":""},{"def":"to seem less important when compared with something else","examples":["Last year's riots pale in comparison with this latest outburst of violence.","Our problems pale into insignificance when compared to theirs."],"opposite":"","synonyms":""},{"def":"used to emphasize the difference between two people or things that are being compared","examples":["In terms of price there's no comparison (= one thing is much more expensive than the other)."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"by comparison","def":"used especially at the beginning of a sentence when the next thing that is mentioned is compared with something in the previous sentence","examples":["By comparison, expenditure on education increased last year.","His problems seemed trivial by comparison."]},{"idiom":"by/in comparison (with somebody/something)","def":"when compared with somebody/something","examples":["The second half of the game was dull by comparison with the first.","The tallest buildings in London are small in comparison with New York's skyscrapers.","The glasses are small in comparison with the old ones.","Jane is still quite young, and Fiona seems old by comparison."]},{"idiom":"pale beside/next to something | pale in/by comparison (with/to something) | pale into insignificance","def":"to seem less important when compared with something else","examples":["Last year's riots pale in comparison with this latest outburst of violence.","Our problems pale into insignificance when compared to theirs."]},{"idiom":"there’s no comparison","def":"used to emphasize the difference between two people or things that are being compared","examples":["In terms of price there's no comparison (= one thing is much more expensive than the other)."]}],"phrasal":[],"related":["comparison-shop","comparison site","comparison shopping","comparison-shops","comparison-shopped","comparison sites","comparison website","comparison-shopping","comparison shoppings"]}]