[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/compe/competitive__us_3.mp3","phonsUS":"/kəmˈpetətɪv/","level":"B1","meanings":[{"def":"used to describe a situation in which people or organizations compete against each other","examples":["competitive games/sports","Graduates have to fight for jobs in an increasingly competitive market.","Those businesses are operating in an extremely competitive environment.","The company has succeeded in a highly competitive industry.","a fiercely competitive sport","A competitive approach to learning is discouraged.","It's a fiercely competitive market.","Japan's banks face daunting competitive pressures."],"opposite":"","synonyms":""},{"def":"trying very hard to be better than others","examples":["You have to be highly competitive to do well in sport these days.","a very competitive person","He had an assertive, competitive manner and asked all the right questions.","He has a strong competitive streak.","Her competitive nature often overshadows the other qualities in her game.","The ‘heart-attack personality’ was described as aggressive, impatient, competitive, and ambitious."],"opposite":"uncompetitive","synonyms":""},{"def":"as good as or better than others","examples":["a shop selling clothes at competitive prices (= as low as any other shop)","to gain a competitive advantage over rival companies","How do we maintain our competitive edge?","What is your strategy for helping the company stay competitive in a global market?","competitive with somebody/something We need to work harder to remain competitive with other companies.","We offer loans at competitive rates.","We aim to provide a first-rate competitive service.","They sell quality computers at very competitive prices.","They had gained a competitive advantage over rival companies.","highly competitive prices","skills training to make our industries more competitive in world markets","Investment in research is needed to keep Britain competitive with countries like Japan."],"opposite":"","synonyms":"cheap"}],"idioms":[],"phrasal":[],"related":[]}]