[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/compo/composition__us_1.mp3","phonsUS":"/ˌkɑːmpəˈzɪʃn/","level":"C1","meanings":[{"def":"the different parts that something is made of; the way in which the different parts are organized","examples":["the chemical composition of the soil","the composition of the board of directors","the size and composition of an average class","the structure of the building/​human body","the social structure of society","the grammatical structures of a language","a salary structure","The report provides a framework for further research.","As a photographer, shape and form were more important to him than colour.","recent changes in the composition of the workforce","ships of steel construction","This is a trend which threatens the very fabric of society.","Has household composition changed in the last decade?","Irradiation changes the chemical composition of a spice.","The overall composition of the Senate was Democrats 57 and Republicans 43.","elections to determine the composition of the assembly","the changing composition of the labour force","the character of the state and its internal composition","the ethnic composition of the region","The two drugs are nearly identical in composition.","recent changes in the composition of the workforce"],"opposite":"","synonyms":"structure"},{"def":"a short text that is written as a school exercise; a short essay","examples":["a composition on the effects of crime","In the exam you will have to do a composition."],"opposite":"","synonyms":""},{"def":"a piece of music or art, or a poem","examples":["one of Beethoven’s finest compositions","a composition by John Cage","a composition by the sculptor, Bernt Notke","a composition for violin and piano","an original composition by a popular young composer"],"opposite":"","synonyms":""},{"def":"the act of composing something, especially a piece of music; the art of writing music","examples":["pieces performed in the order of their composition","to study composition"],"opposite":"","synonyms":""},{"def":"the arrangement of people or objects in a painting or photograph","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]