[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/compe/competition__us_1.mp3","phonsUS":"/ˌkɑːmpəˈtɪʃn/","level":"A2","meanings":[{"def":"an event in which people compete with each other to find out who is the best at something","examples":["a design/an art/a talent competition","an international/a national competition","Hundreds of schools entered the competition.","She's won a prestigious singing competition.","in a competition He won fourth place in the competition.","a competition to do something a competition to design the new Parliament building","There will be a painting competition for children of different age groups.","They twice won the European Cup, a knockout competition between the top teams in Europe.","I encouraged her to enter the essay competition.","wines that won medals at major wine competitions","a competition for the best chef","a competition between the best teams in the country","We're going to have a competition to see who can swim the fastest.","The competition is open to all readers of the magazine.","The American women dominated the competition, winning all the events.","I won the car in a competition.","She won an international dancing competition."],"opposite":"","synonyms":""},{"def":"a situation in which people or organizations compete with each other for something that not everyone can have","examples":["stiff/fierce/intense/tough competition","competition between A and B competition between two similar products","competition among somebody/something The government said the new laws would enhance competition among banks.","competition for something competition for resources/jobs/food, etc.","competition to do something competition to secure a place on the course","competition from somebody/something The firm is facing stiff competition from its online rivals.","in competition with somebody/something Public education is run in direct competition with the private sector.","in competition with somebody/something for something We are in competition with four other companies for the contract.","in competition with somebody/something to do something The programme puts two couples in competition with each other to redecorate one another's homes.","Competition is heating up and sales are shrinking.","We won the contract in the face of tough competition.","Fierce competition exists between schools in the area.","The gas companies are having to lay off staff in the face of stiff competition from oil.","Their rivalry had been one of friendly competition.","There is a lot of competition between rival airlines.","There is head-to-head competition in production and distribution.","They won the order against fierce international competition.","This intensified the competition for the same investors' funds.","We are in competition with some very large companies.","We face strong competition from other countries.","intense competition for the contract","policies aimed at fostering greater competition in the industry","to fight off competition from foreign firms","to go into competition with British Telecom","The company is having to lay off workers in the face of stiff competition.","There is now intense competition between schools to attract students."],"opposite":"","synonyms":""},{"def":"the people who are competing against somebody","examples":["We'll be able to assess the competition at the conference.","This car consistently outperforms the competition."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Competition Commission","Competition and Markets Authority"]}]