[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/compr/compromise__us_1.mp3","phonsUS":"/ˈkɑːmprəmaɪz/","level":"C1","meanings":[{"def":"an agreement made between two people or groups in which each side gives up some of the things they want so that both sides are happy at the end","examples":["After lengthy talks the two sides finally reached a compromise.","In any relationship, you have to make compromises.","a compromise solution/agreement/candidate","After much discussion, she offered a compromise.","He might be an attractive compromise candidate if both sides' first choices are rejected.","I'm not making any more compromises.","It is best to try to seek a compromise rather than a perfect solution.","They came to a compromise over the exact amount to be paid.","They're still trying to work out an acceptable compromise."],"opposite":"","synonyms":""},{"def":"a solution to a problem in which two or more things cannot exist together as they are, in which each thing is reduced or changed slightly so that they can exist together","examples":["This model represents the best compromise between price and quality.","It was a fair compromise between the two sides."],"opposite":"","synonyms":""},{"def":"the act of reaching a compromise","examples":["Compromise is an inevitable part of life.","There is no prospect of compromise in sight.","There could be no compromise with the nationalists."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Missouri Compromise"]},{"pos":"verb","level":"C1","meanings":[{"def":"to give up some of your demands in order to reach an agreement after disagreeing with somebody","examples":["Neither side is prepared to compromise.","compromise (with somebody) (on something) After much argument, the judges finally compromised on (= agreed to give the prize to) the 18-year old pianist.","They were unwilling to compromise with the terrorists.","He wanted his own way and refused to compromise.","They debated whether to compromise with the opposition parties.","Unions and management seem ready to compromise on the level of the increase."],"opposite":"","synonyms":""},{"def":"to do something that is against your principles or does not reach standards that you have set","examples":["compromise something I refuse to compromise my principles.","compromise (on something) We are not prepared to compromise on safety standards."],"opposite":"","synonyms":""},{"def":"to cause somebody/something/yourself to be in danger or to be suspected of something, especially by acting in a way that is not very sensible","examples":["She had already compromised herself by accepting his invitation.","Defeat at this stage would compromise their chances (= reduce their chances) of reaching the finals of the competition.","The affair seriously compromised the party's prospects of electoral success."],"opposite":"","synonyms":""},{"def":"to cause something to be in danger of attack or of working less well","examples":["Users perform tasks every day that can compromise the security of their computers.","Alcohol and drug abuse can compromise your health, not to mention your life."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]