[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/compl/complex__us_1_rr.mp3","phonsUS":"/kəmˈpleks/","level":"B1","meanings":[{"def":"made of many different things or parts that are connected; difficult to understand","examples":["a complex problem/issue/process/system","a complex argument/subject","complex machinery","the complex structure of the human brain","Scientists need a better understanding of the complex interactrions that cause hurricanes to intensify.","We live in an increasingly complex world.","a highly complex situation","technically complex surgery","She managed to put over a fairly complex argument in a brilliantly simple way.","The mechanism involves a complex arrangement of rods and cogs.","How does the press explore thecomplex relationship between the two countries?"],"opposite":"","synonyms":""},{"def":"containing one main part (= the root of a word or main clause of a sentence) and one or more other parts (called affixes or subordinate clauses)","examples":["In the complex sentence, ‘I'd like to go to the beach, if it's warm enough’, ‘I'd like to go to the beach’ is the main clause, and ‘if it's warm enough’ is the subordinate clause."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["complex number","Electra complex","Oedipus complex","inferiority complex","persecution complex","superiority complex"]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/compl/complex__us_4.mp3","phonsUS":"/ˈkɑːmpleks/","level":"B2","meanings":[{"def":"a group of buildings of a similar type together in one place","examples":["a sports/leisure/shopping complex","an industrial complex (= a site with many factories)","(especially North American English) an apartment complex","(especially North American English) a housing complex","complex of something a complex of buildings covering about 300 square metres","We have a buyer who would like to view the property.","The price of property has risen enormously.","The company is looking for larger premises.","a leisure complex","The pier is a wooden structure.","a block of flats","the school’s science block"],"opposite":"","synonyms":"building"},{"def":"a group of things that are connected","examples":["This is just one of a whole complex of issues.","There is a huge complex of different traditions and religions in the area.","He will be just one detective working amongst a much bigger complex of colleagues."],"opposite":"","synonyms":""},{"def":"a mental state that is not normal","examples":["He suffers from a guilt complex."],"opposite":"","synonyms":""},{"def":"if somebody has a complex about something, they are worried about it in way that is not normal","examples":["Don’t mention her weight—she has a complex about it.","She has a complex about her big ears.","Don't keep on at him about his handwriting or he'll get a complex."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]