[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/compl/complaint__us_1.mp3","phonsUS":"/kəmˈpleɪnt/","level":"B1","meanings":[{"def":"a reason for not being satisfied; a statement that somebody makes saying that they are not satisfied","examples":["a formal complaint","She said the police had immediately investigated the complaint.","complaint about somebody/something I'd like to make a complaint about the noise.","(formal) to file/lodge (= make) a complaint","The most common complaint is about poor service.","complaint of something The Tribunal upheld his complaint of discrimination.","complaint against somebody/something I believe you have a complaint against one of our nurses.","complaint to somebody They said their complaints to the police were often not acted on.","complaint from somebody Council bosses said they would respond to complaints from residents.","complaint from somebody about something We received a number of complaints from customers about the lack of parking facilities.","complaint by somebody ‘Complaints by patients are now at their lowest level,’ she said.","complaint (that…) a complaint that he had been unfairly treated","My only complaint is that the website is a little difficult to use.","We have a clear and effective complaints procedure.","I have a complaint about the food.","I haven't heard any complaints about the approach we're taking.","One of the chief complaints is the cost.","The tribunal heard complaints against the director.","They filed a complaint with the Commission.","We have had some serious complaints from parents.","a complaint about working conditions","a complaint against the police","a complaint from a customer","a complaint from the neighbours","a complaint of unfair dismissal","complaints arising from late payment","to make a complaint to the authorities","I believe you have a serious complaint against one of our nurses.","The couple have lodged an official complaint against the hospital.","The police have an independent complaints procedure to deal with such issues."],"opposite":"","synonyms":""},{"def":"the act of complaining","examples":["I can see no grounds for complaint.","The way I was treated gave me no cause for complaint.","I'm planning to write a formal letter of complaint.","without complaint Workers were expected to accept pay cuts without complaint.","I'm afraid I'm not satisfied with this.","I'm sorry. This isn't acceptable/​good enough. We've been waiting half an hour.","I'd like to make a complaint. The radio I bought doesn't work.","Excuse me—this isn't what I asked for. I'm having/​I ordered the soup, not the salad.","I'd like to speak to the manager. I've got a complaint about something I bought."],"opposite":"","synonyms":""},{"def":"an illness, especially one that is not serious, and often one that affects a particular part of the body","examples":["He has a minor skin complaint.","Not being able to sleep at night is a very common complaint.","He suffers from a skin complaint called ‘rosacea’."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]