[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/compl/complete__us_1.mp3","phonsUS":"/kəmˈpliːt/","level":"A1","meanings":[{"def":"including all the parts, etc. that are necessary; whole","examples":["a complete list/sequence/picture/profile","I've collected the complete set.","a complete guide to events in Oxford","the complete works of Tolstoy","You will receive payment for each complete day that you work.","You've made my life complete.","A Chinese New Year celebration would not be complete without fireworks.","No trip to Moscow would be complete without a visit to Lenin's tomb.","The book survives complete only in the second edition of 1533.","a remarkably complete account of the negotiations"],"opposite":"incomplete","synonyms":""},{"def":"finished","examples":["The job is almost complete.","Ther ordering process is nearly complete.","Construction of the new airport is scheduled to be complete by late September.","Work on the office building will be complete at the end of the year."],"opposite":"incomplete","synonyms":""},{"def":"used when you are emphasizing something, to mean ‘to the greatest degree possible’","examples":["We were in complete agreement.","Refrigerators brought about a complete change in people's lifestyle.","They sat in complete silence.","He was a complete stranger to me.","The council's response shows a complete lack of understanding of the situation.","The army remains in complete control of the country.","It came as a complete surprise.","I felt a complete idiot.","You are talking complete and utter rubbish.","The whole thing has been a complete waste of time.","The film was a complete failure at the box office.","Their claims were widely believed despite a complete absence of evidence.","The whole procedure has become a complete farce.","The train came to a complete standstill.","The play was a complete disaster from beginning to end.","The accident caused the complete closure of the road.","It's a complete myth that he has royal blood.","He was in complete command of the situation.","After they had gone there was complete silence."],"opposite":"","synonyms":""},{"def":"including something as an extra part or feature","examples":["The furniture comes complete with tools and instructions for assembly.","The cruise ship is really a floating village, complete with shops, cafes and a doctor's surgery."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"A1","meanings":[{"def":"to finish making or doing something","examples":["to complete a course/project","to complete a task/mission","to complete your education/training","She's just completed a master's degree in Law.","He has recently completed his first year at Durham University.","The work should be completed by December.","She successfully completed the London Marathon in April.","I've fully completed my training.","The project should be completed within a year.","The police have now completed their investigations.","The project has now been successfully completed.","We have recently completed a 10-year study.","Arrangements for the trip have now been completed.","Construction of the new road has now been successfully completed.","He went to America to complete his education.","It is unlikely that the repairs will be completed on time.","When he has completed his studies, he'll travel the world.","Implementation is likely to require two to three years to complete.","The merger is expected to be completed by the end of the year.","Greaves completed his hat-trick (= scored his third goal in the match) in the 75th minute."],"opposite":"","synonyms":""},{"def":"to write all the information you are asked for on a form","examples":["2 000 shoppers completed our questionnaire.","Has the form been correctly completed?","Participants completed a survey designed to collect several types of information."],"opposite":"","synonyms":""},{"def":"to make something whole or perfect","examples":["I only need one more card to complete the set.","Complete the following sequence: 2, 3, 5, 13…"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]