[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/com/compe/compete__us_1.mp3","phonsUS":"/kəmˈpiːt/","level":"A2","meanings":[{"def":"to take part in a contest or game","examples":["The games were an outstanding success, with almost 2 400 athletes competing.","compete in something He's hoping to compete in the London marathon.","Only 21 bodybuilders competed in the event.","compete against somebody They are competing against teams of full-time professional players.","compete for something He is expected to compete for the title of world champion next year.","He regularly competes in races.","They have what it takes to compete at the highest level of their sport.","He welcomed the chance to compete against professional athletes."],"opposite":"","synonyms":""},{"def":"to try to be more successful or better than somebody else who is trying to do the same as you","examples":["They simply cannot compete in the international market.","compete for something Several companies are competing for the contract.","Young children will usually compete for their mother's attention.","The result is more applicants competing for fewer jobs.","compete with somebody/something Small independent bookshops find it difficult to compete with the online stores.","compete against somebody/something For too long UK shipyards have been competing against each other.","compete on something We can't compete with them on price.","to compete on quality/cost","compete to do something There are too many magazines competing to attract readers.","Small traders cannot compete in the face of cheap foreign imports.","The price must be right in order to compete internationally.","The big companies are competing fiercely on price.","The company is prepared to compete head-to-head with the market giants.","Their products compete directly with ours.","We have to compete with several larger companies.","a readiness to compete actively in the global system","Colleges will have to compete to attract the best students.","Several projects are competing against each other for scarce resources."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]