[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xconc/xconclude__us_2.mp3","phonsUS":"/kənˈkluːd/","level":"B1","meanings":[{"def":"to decide or believe something as a result of what you have heard or seen","examples":["conclude something It is too early for us to conclude anything.","conclude something from something What do you conclude from that?","conclude (that)… The report concluded (that) the cheapest option was to close the laboratory.","conclude from something that… He concluded from their remarks that they were not in favour of the plan.","it is concluded that… It was concluded that the level of change necessary would be low.","+ speech ‘So it should be safe to continue,’ he concluded.","In conclusion, the study has provided useful insights into the issues relating to people’s perception of crime.","On the basis of this study, it can be concluded that the introduction of new street lighting did not reduce reported crime.","To sum up, no evidence can be found to support the view that improved street lighting reduces reported crime.","The available evidence clearly leads to the conclusion that the media do have an influence on the public perception of crime.","The main conclusion to be drawn from this study is that public perception of crime is significantly influenced by crime news reporting.","This study has shown that people’s fear of crime is out of all proportion to crime itself.","Fear of crime is out of all proportion to the actual level of crime, and the reasons for this can be summarized as follows. First…","Overall/In general, women are more likely than men to feel insecure walking alone after dark.","‘There really isn't much hope left,’ she concluded.","It was concluded that there was little that could be done.","Whatever you conclude, remember that there are certain things we may not know."],"opposite":"","synonyms":""},{"def":"to come to an end; to bring something to an end","examples":["This was how the negotiations finally concluded.","Let me make just a few concluding remarks.","the concluding chapter of the book","conclude with something The programme concluded with Stravinsky's ‘Rite of Spring’.","conclude by doing something He concluded by wishing everyone a safe trip home.","conclude something The commission concluded its investigation last month.","And that concludes our programme for today.","The main responsibility of a salesperson is to conclude a sale successfully.","conclude something with something She concluded her speech with a quotation from Shakespeare.","conclude+ speech ‘Anyway, she should be back soon,’ he concluded."],"opposite":"","synonyms":""},{"def":"to arrange and settle an agreement with somebody formally and finally","examples":["They concluded a treaty with Turkey.","A trade agreement was concluded between the two countries.","The problems arose from the failure to conclude a new agreement."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]