[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xconc/xconcede__us_1.mp3","phonsUS":"/kənˈsiːd/","level":"C1","meanings":[{"def":"to admit that something is true, logical, etc. after first denying it or resisting it","examples":["+ speech ‘Not bad,’ she conceded grudgingly.","concede (that)… He was forced to concede (that) there might be difficulties.","concede something I had to concede the logic of this.","concede something to somebody He reluctantly conceded the point to me.","concede somebody something He reluctantly conceded me the point.","it is conceded that… It must be conceded that different judges have different approaches to these cases.","It was a stupid thing to do, I admit.","She refuses to acknowledge the need for reform.","They recognized the need to take the problem seriously.","He was forced to concede (that) there might be difficulties.","She was reluctant to confess her ignorance.","He confessed to the murder.","Yes, I suppose you're right.","Yes, I guess you're right.","Yes, I see what you mean.","OK, I take/​see your point about the expense, but I still think it's worth it.","Well, I guess you've got a point there.","OK, that’s a good point.","No, possibly/​I guess not.","I suppose not.","Well, yes, OK. I hadn't really appreciated/​understood that before.","Well, I can’t/​won’t argue with that.","That’s true. We’ll need to take that into consideration.","He reluctantly conceded that he was not fit enough to play in the match.","He was not prepared to concede that he had acted illegally.","She readily concedes that there is much work still to be done.","The company seems to be implicitly conceding that sales have been poor."],"opposite":"","synonyms":"admit"},{"def":"to admit that you have lost a game, an election, etc.","examples":["After losing this decisive battle, the general was forced to concede.","Injury forced Hicks to concede defeat."],"opposite":"","synonyms":""},{"def":"to give something away, especially unwillingly; to allow somebody to have something","examples":["concede something (to somebody) The president was obliged to concede power to the army.","England conceded a goal immediately after half-time.","concede somebody something Women were only conceded full voting rights in the 1950s.","The firm should concede a significant salary increase to its employees."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]