[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xconc/xconcession__us_1.mp3","phonsUS":"/kənˈseʃn/","level":"C1","meanings":[{"def":"something that you allow or do, or allow somebody to have, in order to end an argument or to make a situation less difficult","examples":["The firm will be forced to make concessions if it wants to avoid a strike.","to win a concession from somebody","a major/an important concession","She made no concession to his age; she expected him to work as hard as she did.","The company will be forced to make concessions to the union.","The pressure group has won a number of concessions on environmental policy.","They made no concessions to his disability.","They remained unwilling to make any substantial concessions."],"opposite":"","synonyms":""},{"def":"the act of giving something or allowing something; the act of conceding","examples":["the concession of university status to some colleges","Clinton’s concession speech (= when she admitted that she had lost the election)","Military support was offered in return for the concession of territory."],"opposite":"","synonyms":""},{"def":"a reduction in an amount of money that has to be paid; a ticket that is sold at a reduced price to a particular group of people","examples":["They may grant tax concessions to encourage foreign investors.","Tickets are £3; there is a £1 concession for students.","Adults £2.50, concessions £2, family £5","Travel concessions are available to older people."],"opposite":"","synonyms":""},{"def":"a right or an advantage that is given to a group of people, an organization, etc., especially by a government or an employer","examples":["The Bolivian government has granted logging concessions covering 22 million hectares.","The company has just won a mining concession in the north of the country."],"opposite":"","synonyms":""},{"def":"the right to sell something in a particular place; the place where you sell it, sometimes an area that is part of a larger building or store","examples":["the burger concessions at the stadium","(especially US English) They went to the concession stand to get a hot dog."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]