[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xconc/xconclusion__us_2.mp3","phonsUS":"/kənˈkluːʒn/","level":"B1","meanings":[{"def":"something that you decide when you have thought about all the information connected with the situation","examples":["We can safely draw some conclusions from our discussion.","He arrived at a different conclusion.","There is abundant evidence to support this conclusion.","Other studies have yielded the same conclusion.","The final section summarizes the conclusions of the study.","conclusion (that)… I've come to the conclusion that he's not the right person for the job.","New evidence might lead to the conclusion that we are wrong.","conclusion about/on somebody/something It is too soon to reach any conclusions about voting trends.","The present findings point to a similar conclusion.","It is difficult to base a definitive conclusion on their data.","He bases his conclusions on very limited research.","How did he reach this startling conclusion?","I can't draw any conclusions from what she said.","It all points to the conclusion that nobody knew what was going on.","It is difficult to draw any firm conclusions at such an early stage.","Only tentative conclusions can be drawn from these results.","The data he collected strengthened his conclusions.","This does not warrant the conclusion that he failed.","What did you base these conclusions on?"],"opposite":"","synonyms":""},{"def":"the end of something such as a speech or a piece of writing","examples":["The conclusion of the book was disappointing.","After his death, his assistant completed chapters nine and ten and wrote the conclusion.","If we took this argument to its logical conclusion…","conclusion to something The film is a fitting conclusion to the series.","in conclusion In conclusion (= finally), I would like to thank…","In conclusion, the study has provided useful insights into the issues relating to people’s perception of crime.","On the basis of this study, it can be concluded that the introduction of new street lighting did not reduce reported crime.","To sum up, no evidence can be found to support the view that improved street lighting reduces reported crime.","The available evidence clearly leads to the conclusion that the media do have an influence on the public perception of crime.","The main conclusion to be drawn from this study is that public perception of crime is significantly influenced by crime news reporting.","This study has shown that people’s fear of crime is out of all proportion to crime itself.","Fear of crime is out of all proportion to the actual level of crime, and the reasons for this can be summarized as follows. First…","Overall/In general, women are more likely than men to feel insecure walking alone after dark.","The story's ultimate conclusion does not come as a surprise.","In conclusion, I would like to thank you all for your hard work.","This performance was a fitting conclusion to his career.","The meeting was brought to a hasty conclusion."],"opposite":"","synonyms":""},{"def":"the formal and final arrangement of something official","examples":["the successful conclusion of a trade treaty","I’m afraid time is running out/​we’re running out of time, so we'll have to make this the final question.","We've only got a couple of minutes left, so can we summarize what we've agreed?","I'd like to close the session with a few final remarks…","We'll have to leave it there, but thank you all very much for your input.","Well, that's all we have time for today, but we'll meet again on Tuesday.","I'd like to thank you all for coming and for a very productive meeting."],"opposite":"","synonyms":""},{"def":"if you say that something is a foregone conclusion, you mean that it is a result that is certain to happen","examples":["The outcome of the vote is a foregone conclusion.","The result of the game was a foregone conclusion."],"opposite":"","synonyms":""},{"def":"to make a decision about somebody/something too quickly, before you know or have thought about all the facts","examples":["There I go again—jumping to conclusions.","Don't jump to conclusions.","We don't want to jump to the wrong conclusion."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a foregone conclusion","def":"if you say that something is a foregone conclusion, you mean that it is a result that is certain to happen","examples":["The outcome of the vote is a foregone conclusion.","The result of the game was a foregone conclusion."]},{"idiom":"jump/leap to conclusions | jump/leap to the conclusion that…","def":"to make a decision about somebody/something too quickly, before you know or have thought about all the facts","examples":["There I go again—jumping to conclusions.","Don't jump to conclusions.","We don't want to jump to the wrong conclusion."]}],"phrasal":[],"related":[]}]