[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xconc/xconcerned__us_3.mp3","phonsUS":"/kənˈsɜːrnd/","level":"B2","meanings":[{"def":"worried and feeling concern about something/somebody","examples":["Concerned citizens can have a huge impact.","concerned parents/residents/parents/locals","concerned about something/somebody The president is deeply concerned about this issue.","We are extremely concerned about her.","concerned for something/somebody He didn't seem in the least concerned for her safety.","We were concerned for his welfare.","I told him but he didn't seem overly concerned (= he was not very concerned)","concerned (that)… She was concerned that she might miss the turning and get lost.","concerned over something Local residents are concerned over the impact of the project.","concerned at something I was rather concerned at the severity of the punishment.","concerned by something Her parents are growing increasingly concerned by her erratic behaviour.","a concerned look/glance","She was not unduly concerned by the prospect of managing on her own.","The leadership was concerned at the perceived failure to find a solution.","Doctors are concerned at the prospect of heart patients having to wait up to a year for surgery.","We are now deeply concerned for his safety.","Concerned parents held a meeting."],"opposite":"","synonyms":"worried"},{"def":"affected by something; involved in something","examples":["The loss was a tragedy for all concerned.","Where our children's education is concerned, no compromise is acceptable.","The individuals concerned have some explaining to do.","The meetings were often embarrassing for all concerned.","be concerned in something Everyone who was directly concerned in (= had some responsibility for) the incident has now resigned."],"opposite":"","synonyms":""},{"def":"interested in something; dealing with something","examples":["The public is increasingly concerned with how food is produced.","Mathematics is concerned essentially with understanding abstract concepts.","Social anthropology is centrally concerned with the diversity of culture.","You shouldn't be concerned with what they think.","They were more concerned with how the other women had dressed than with what the speaker was saying."],"opposite":"","synonyms":""},{"def":"to think it is important to do something","examples":["She was concerned to write about situations that everybody could identify with."],"opposite":"","synonyms":""},{"def":"used to give your personal opinion on something","examples":["As far as I am concerned, you can do what you like."],"opposite":"","synonyms":""},{"def":"used to give facts or an opinion about a particular aspect of something","examples":["She's doing fine as far as French is concerned, it's her German I'm worried about."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"as/so far as I am concerned","def":"used to give your personal opinion on something","examples":["As far as I am concerned, you can do what you like.","The book is about homeless people in the cities.","The report deals with the issue of homelessness in London.","The writer discusses the problems faced by homeless people.","The article presents an overview of the issues surrounding homelessness.","The novel explores the theme of friendship among homeless people.","The first chapter examines the relationship between homelessness and drug addiction.","The paper considers the question of why so many young people become homeless."]},{"idiom":"as/so far as somebody/something is concerned","def":"used to give facts or an opinion about a particular aspect of something","examples":["She's doing fine as far as French is concerned, it's her German I'm worried about."]}],"phrasal":[],"related":["as far as I'm concerned","be concerned with something"]}]