[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xconc/xconcern__us_3.mp3","phonsUS":"/kənˈsɜːrn/","level":"B2","meanings":[{"def":"to affect somebody/something; to involve somebody/something","examples":["Don't interfere in what doesn't concern you.","To whom it may concern… (= used for example, at the beginning of a public notice or of a job reference about somebody’s character and ability)","Please pay attention because this information concerns all of you.","The letter is for both of us, but it mainly concerns you."],"opposite":"","synonyms":""},{"def":"to be about something","examples":["The story concerns the prince's efforts to rescue Pamina.","The book is primarily concerned with Soviet-American relations during the Cold War.","My question concerns the way he handles the evidence.","concern itself with something This chapter concerns itself with the historical background.","One major difference between these computers concerns the way in which they store information.","The issue here concerns the way in which lexis and grammar relate to each other.","The really important point concerns the effect on the worker."],"opposite":"","synonyms":""},{"def":"to worry somebody","examples":["What concerns me is our lack of preparation for the change.","Fair use is one issue concerning most musicians.","it concerns somebody that… It concerns me that you no longer seem to care.","It really concerns me that he doesn't eat properly."],"opposite":"","synonyms":""},{"def":"to take an interest in something","examples":["He didn't concern himself with the details."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Age Concern","a going concern"]},{"pos":"noun","level":"B2","meanings":[{"def":"a feeling of worry, especially one that is shared by many people","examples":["concern about something/somebody Villagers expressed concern about the level of traffic.","There is growing concern about violence in the media.","concern over something/somebody The report raises serious concerns over safety at the plant.","concern for something/somebody She hasn't been seen for four days and there is concern for her safety.","to raise/voice concerns","We are trying to address the concerns of residents.","Don't hesitate to ask if you have any questions or concerns.","concern among somebody The school's recent examination results have sparked concern among parents.","concern that… There is widespread concern that new houses will be built on protected land.","security/safety concerns","He had to resign from his job because of health concerns.","The president's health was giving serious cause for concern.","The continuing drought is causing concern among farmers.","concern to somebody This is a matter of grave concern to our members.","with concern We view these developments with concern.","something is of concern The cost of the scheme is of major concern.","He felt some concern for her safety.","I was surprised by her lack of concern.","Increased use of drugs is of great concern to parents.","Out of concern for her health, we suggested she take a week off work.","She expressed her deep concern about conditions at the factory.","The lack of firefighting equipment has caused concern.","There is particular concern about the use of pesticides.","a common concern for new parents","public concern about increased taxes","In the meeting, voters raised concerns about healthcare.","Stress at work is a matter of concern to staff and management."],"opposite":"","synonyms":""},{"def":"a desire to protect and help somebody/something","examples":["concern for somebody/something parents’ concern for their children","deep/genuine/real concern","He showed deep concern for his employees.","She forgot her own worries in her concern for him.","I appreciate everyone's concern and help at this difficult time.","Thanks for your concern and sympathy.","He demonstrated genuine concern for others."],"opposite":"","synonyms":""},{"def":"something that is important to a person, an organization, etc.","examples":["Our main concern is to ensure the safety of the children.","What are your biggest concerns as a writer?","The government's primary concern is to reduce crime.","a big/major concern","The overriding concern of the organizers is the safety of the participants.","Practical necessity overrides any other concerns.","I have other, more pressing concerns.","Censorship reflects the social concerns and even fears of society and government at the time.","Environmental concerns have been thrust to the head of the party agenda.","This new technology brings with it security concerns."],"opposite":"","synonyms":""},{"def":"something that is your responsibility or that you have a right to know about","examples":["This matter is their concern.","How much money I make is none of your concern.","How much we paid is none of your concern."],"opposite":"","synonyms":""},{"def":"a company or business","examples":["The scheme has been set up by a major publishing concern.","a successful publishing concern"],"opposite":"","synonyms":""},{"def":"a business or an activity that is making a profit and is expected to continue to do well","examples":["He sold the cafe as a going concern.","They knew that, as a going concern, the cafe would command a higher price with prospective buyers."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a going concern","def":"a business or an activity that is making a profit and is expected to continue to do well","examples":["He sold the cafe as a going concern.","They knew that, as a going concern, the cafe would command a higher price with prospective buyers."]}],"phrasal":[],"related":[]}]