[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xconc/xconcept__us_1.mp3","phonsUS":"/ˈkɑːnsept/","level":"B2","meanings":[{"def":"an idea or a principle that is connected with something abstract","examples":["concept of something the concept of social class","helping students grasp abstract concepts such as leadership and teamwork","basic/fundamental/key/core concepts","concept that… the concept that everyone should have equality of opportunity","the concept behind something the concepts behind an artist's work","‘Mental handicap’ should be replaced with the broader concept of ‘learning difficulties’.","Culture is a fairly nebulous concept.","He formulated the concept of imaginary time.","Not all companies have embraced the concept of diversity in the workplace.","She finds it difficult to grasp abstract concepts.","Students must be able to apply classroom concepts to practical situations.","Teachers should have a clear concept of what a multiracial society is.","The book provides concrete interpretations of some rather abstract concepts.","The concept of ‘adequate medical care’ is too vague.","The concept of my book is very simple.","The whole concept of responsibility was alien to him.","the need to create new words to frame new concepts","Industry has endorsed the concept that every young person should have the opportunity of work experience before leaving school.","The concept of infinity is almost impossible for us to comprehend.","We discussed concepts such as ‘democracy’ and ‘equality’.","We need to instil in children basic concepts of right and wrong.","He can't grasp the basic concepts of mathematics.","concepts such as ‘civilization’ and ‘government’"],"opposite":"","synonyms":""},{"def":"an idea for something new","examples":["a novel/innovative concept","concept in something an exciting new concept in city living","a novel marketing concept","a design concept for a new school","Bachelors have no concept of food shopping.","He has no concept of structure, which is surprising for a man who learnt his craft in the theatre.","I was the kind of child that had absolutely no concept of patience.","People have no concept of what he has done for this industry."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["concept album","high-concept","proof of concept","concept albums","proofs of concept"]}]