[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcond/xcondition__us_2.mp3","phonsUS":"/kənˈdɪʃn/","level":"A2","meanings":[{"def":"the state that something is in","examples":["in… condition to be in pristine/excellent/perfect condition","Many of the paintings are in poor condition.","the condition of something The condition of the roads is poor.","the present state of medical knowledge","We’re worried about his mental state.","What a state this room is in (= very bad).","The car is in excellent condition","The car is still in excellent condition.","The clock was restored to its original condition.","I didn't like to think about the condition of my finances.","The car was in perfect condition.","The furniture was not in a particularly good condition.","The poor condition of our schools should be of concern to all of us.","What kind of condition is the washing machine in?"],"opposite":"","synonyms":""},{"def":"the state of somebody’s health or how fit they are","examples":["He is overweight and out of condition (= not physically fit).","in (a)… condition The motorcyclist was in a critical condition (= at risk of dying) in hospital last night.","in a stable/serious condition","You are in no condition (= too ill/sick, etc.) to go anywhere.","(informal) in somebody's condition She shouldn't be smoking in her condition (= because she is pregnant).","Her condition has deteriorated.","You're in no condition to tackle the stairs.","a young athlete in peak condition","Without this treatment, her condition won't improve.","Doctors say his condition is now stable.","I haven't been exercising much recently, so I'm a bit out of condition.","In his weakened condition, it took a long time for the wound to heal.","There has been a marked deterioration in her mental condition.","Her condition is said to be stable.","She shouldn't be drinking so much in her condition.","He is still in (a) critical condition in the hospital."],"opposite":"","synonyms":""},{"def":"an illness or a medical problem that you have for a long time because it is not possible to cure it","examples":["Does your child have any kind of medical condition that we should know about?","She has a serious health condition.","a heart/skin condition","He suffers from a serious heart condition.","The drug is used to treat conditions such as epilepsy.","He suffers from a rare blood disease.","She died after a long illness.","a rare disorder of the liver.","a throat infection","a heart condition","childhood ailments","a nasty flu bug","All three babies were born with an incurable heart condition.","Doctors used to regard pregnancy as a pathological condition.","He has a rare skin condition.","She was unable to give informed consent because of a mental condition.","The insurance will not cover you for a pre-existing condition."],"opposite":"","synonyms":"disease"},{"def":"the circumstances or situation in which people live, work or do things","examples":["working/living conditions","economic/market conditions","under… conditions They were working under appalling conditions.","a strike over pay and conditions","conditions for somebody to improve conditions for workers","(in) conditions of something He grew up in conditions of poverty.","the present economic situation","The ship sank in mysterious circumstances.","She felt she was in a position of power.","We were forced to work outside in freezing conditions.","Hi, Jane! How are things?","Think things over before you decide.","If that is the case (= if the situation described is true), we need more staff.","How did this unhappy state of affairs come about?","An enormous number of people live in conditions of poverty.","The working conditions in the factory are dreadful.","an effort to improve working conditions at the plant","people working under stressful conditions","Conditions are ideal for starting a business."],"opposite":"","synonyms":"situation"},{"def":"the physical situation that affects how something happens","examples":["in … conditions The plants grow best in cool, damp conditions.","The boat sank in adverse weather conditions.","dry/wet/harsh, etc. conditions","under… conditions Studies show that the drug may be harmful under certain conditions.","extreme environmental conditions","treacherous driving conditions","Conditions are ideal for sailing today.","Animals adapt to changing environmental conditions.","As long as these weather conditions prevail, we are unable to rescue the climbers.","Paint shades can vary under different lighting conditions.","The chamber simulates conditions found at high altitudes.","The experiment is conducted under strictly controlled conditions.","The samples are heated under experimental conditions.","Warm, wet weather can create ideal conditions for plant diseases.","adverse conditions for driving","freak weather conditions","in normal flight operating conditions","plants that can survive dry conditions"],"opposite":"","synonyms":""},{"def":"a rule or decision that you must agree to, sometimes forming part of a contract or an official agreement","examples":["Read the terms and conditions carefully before you sign.","The offer is subject to certain conditions.","on (the) condition that… They agreed to lend us the car on condition that (= only if) we returned it before the weekend.","on condition of something The officials spoke on condition of anonymity.","They will give us the money on one condition—that we pay it back within six months.","under the condition that… (especially North American English) They agreed under the condition that the matter be dealt with promptly.","Congress can impose strict conditions on the bank.","to satisfy/meet/fulfill a condition","They have agreed to a ceasefire provided their conditions are met.","He denied being in breach of bail conditions.","I'll agree to the plan on one condition: my name doesn't get mentioned to the press.","Special conditions apply to the use of the library's rare books.","The UN has imposed strict conditions on the ceasefire.","The bar was licensed subject to the condition that no children be admitted.","They would not agree to our conditions.","To get a basic pension you must satisfy two conditions.","Under the conditions of the agreement, all foreign troops will leave by May.","the conditions attached to the grant of a residential licence","the terms and conditions of the contract"],"opposite":"","synonyms":""},{"def":"a situation that must exist in order for something else to happen","examples":["condition for something Stable political leadership is a necessary condition for economic growth.","conditions for investment/success/development","We are working to create the conditions for peace.","as a condition of something Applicants must agree to teach for three years as a condition of admission to the program.","as a condition of doing something You can't make a consumer buy something as a condition of getting a loan.","Letting go of the past is one of the conditions for a lasting peace.","a necessary and sufficient condition for the eradication of unemployment"],"opposite":"","synonyms":""},{"def":"the state of a particular group of people because of their situation in life, their problems, etc.","examples":["He spoke angrily about the condition of the urban poor.","Work is basic to the human condition (= the fact of being alive).","We are aiming to improve the condition of the urban poor."],"opposite":"","synonyms":""},{"def":"new or as good as new; in perfect condition","examples":["We sell first editions of rare books in mint condition."],"opposite":"","synonyms":""},{"def":"not in any situation; never","examples":["You must on no condition tell them what happened."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in mint condition","def":"new or as good as new; in perfect condition","examples":["We sell first editions of rare books in mint condition."]},{"idiom":"on no condition","def":"not in any situation; never","examples":["You must on no condition tell them what happened."]}],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to train somebody/something to behave in a particular way or to become used to a particular situation","examples":["be conditioned to something Patients can become conditioned to particular forms of treatment.","be conditioned to do something The rats had been conditioned to ring a bell when they wanted food.","the difference between inborn and conditioned reflexes (= reactions that are learned/not natural)"],"opposite":"","synonyms":""},{"def":"to have an important effect on somebody/something; to influence the way that something happens","examples":["be conditioned (by something) Gender roles are often conditioned by cultural factors.","National choices are conditioned by the international political economy."],"opposite":"","synonyms":""},{"def":"to keep something such as your hair or skin healthy","examples":["a shampoo that cleans and conditions hair","a polish for conditioning leather"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]