[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcond/xconduct__us_1.mp3","phonsUS":"/kənˈdʌkt/","level":"B2","meanings":[{"def":"to organize and/or do a particular activity","examples":["to conduct an experiment/inquiry/investigation/interview","to conduct a survey/poll/study/review","to conduct a test/trial","to conduct research/business","There are concerns about the way in which the firm conducts its acitvities.","The battalion had been preparing to conduct operations in the same area.","Police conducted a thorough search of the building.","The negotiations have been conducted in a positive manner.","They conducted a vigorous campaign for a shorter working week.","They conduct workshops on topics such as women's legal rights.","Education was conducted separately for males and females.","The enquiry must be independently conducted.","Today, 50% of opinion polls are conducted online.","We regularly conduct safety inspections.","a survey conducted jointly by two teams of researchers","Because of the war they were obliged to conduct their courtship by post.","People have criticized the way she conducted her election campaign.","The interrogation was conducted by senior police officers.","The search for the missing men was conducted in poor weather conditions.","We conducted the experiment under controlled circumstances."],"opposite":"","synonyms":""},{"def":"to direct a group of people who are singing or playing music","examples":["a concert by the London Philharmonic Orchestra, conducted by Marin Alsop","He conducted a programme of Sibelius and Tchaikovsky.","She will conduct works by Brahms and Schumann in tonight's concert.","She sang Gluck's Orfeo at Covent Garden, with Sir Thomas Beecham conducting."],"opposite":"","synonyms":""},{"def":"to lead or guide somebody through or around a place","examples":["a conducted tour of Athens (= one with a guide, giving information about it)","The guide conducted us around the ruins of the ancient city.","A guide conducted us around the museum.","How about a personally conducted tour of the house?","He conducted her into his private office.","The guide conducted them around the ancient ruins."],"opposite":"","synonyms":""},{"def":"to behave in a particular way","examples":["He conducted himself far better than expected.","The report challenges them to examine how they conduct themselves in the workplace.","He always conducted himself as a gentleman.","She conducts herself with great dignity.","They have conducted themselves in a very professional manner."],"opposite":"","synonyms":""},{"def":"to allow heat or electricity to pass along or through it","examples":["Copper conducts electricity well.","Water conducts heat 20 times more efficiently than air.","Copper conducts electricity better than other materials do.","Superconductors are materials that can conduct electricity without resistance at low temperatures."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["safe conduct","disorderly conduct","Financial Conduct Authority"]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcond/xconduct__us_2.mp3","phonsUS":"/ˈkɑːndʌkt/","level":"B2","meanings":[{"def":"a person’s behaviour in a particular place or in a particular situation","examples":["The sport has a strict code of conduct.","improving standards of training and professional conduct","Any allegation of criminal conduct has to be taken seriously.","a complaint about the conduct of a police officer","conduct towards somebody The United player was fined £5 000 for improper conduct towards an official.","He was arrested for disorderly conduct.","a charge of engaging in conduct likely to cause death or serious injury","It is tempting to think of morality as a guide to human conduct.","Our organization sets high standards of professional conduct.","The committee concluded that the senators had engaged in improper conduct.","The minister was called to court to explain his conduct.","The police chief was asked to explain his conduct.","The prisoner was released early for good conduct.","The violent conduct by the strikers was condemned.","conduct constituting a crime","her conduct towards her husband","rules governing police conduct","a study of conduct problems in children"],"opposite":"","synonyms":""},{"def":"the way in which a business or an activity is organized and managed","examples":["There was growing criticism of the government's conduct of the war.","The release of this information could compromise the proper conduct of the investigation.","Most directors are not involved in the day-to-day conduct of the business.","The elders were responsible for the proper conduct of community life.","The business conduct of this bank will be subject to UK rules."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]