[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xconf/xconfusion__us_1.mp3","phonsUS":"/kənˈfjuːʒn/","level":"B2","meanings":[{"def":"a state of not being certain about what is happening, what you should do, what something means, etc.","examples":["The announcement caused a lot of confusion.","confusion about/over something There is some confusion about what the correct procedure should be.","confusion as to something There was a confusion as to what to do next.","The announcement caused a lot of confusion among the students.","The government needs to clear up the confusion surrounding its policy on water.","There has been considerable confusion regarding the facts of her death.","a few key tips to help you avoid any confusion","There is widespread confusion about the government's health policy.","confusion as to the whereabouts of the man"],"opposite":"","synonyms":""},{"def":"the fact of making a mistake about who somebody is or what something is","examples":["To avoid confusion, please write the children's names clearly on all their school clothes.","confusion between A and B confusion between letters of the alphabet like ‘o’ or ‘a’","I kept my own last name when I got married to prevent confusion.","They are very hard to tell apart, so the confusion is understandable.","To avoid confusion, label each box clearly.","medication labels that minimize confusion","the confusion of this book with her last one"],"opposite":"","synonyms":""},{"def":"a situation in which you feel embarrassed because you do not understand something and are not sure what to do","examples":["in confusion He looked at me in confusion and did not answer the question.","Sacha felt confusion sweeping over her as she read the letter.","She stared at them both in utter confusion.","I could sense her confusion and frustration.","His expression was one of pure confusion."],"opposite":"","synonyms":""},{"def":"a confused situation in which people do not know what action to take","examples":["Fighting had broken out and all was chaos and confusion.","Her unexpected arrival threw us into total confusion.","His cross caused confusion in the penalty box.","The protesters set off smoke bombs to create confusion and panic.","He managed to escape in the confusion.","This latest decision has only added to the general confusion.","The local council has been thrown into total confusion by her resignation.","In the confusion that followed, she managed to slip away unnoticed.","Confusion reigned when the two managers gave conflicting instructions."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]