[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xconf/xconfident__us_1.mp3","phonsUS":"/ˈkɑːnfɪdənt/","level":"B1","meanings":[{"def":"feeling sure about your own ability to do things and be successful","examples":["She was in a relaxed, confident mood.","Beneath his confident and charming exterior, lurked a mass of insecurities.","confident about something I was actually fairly confident about my chances.","confident about doing something The teacher wants the children to feel confident about asking questions when they don't understand.","confident in something He'd learned to be confident in his ability to handle anything life threw at him.","Going to university has made her more confident.","He was overly confident, perhaps to the point of arrogance.","He's becoming more confident as he gets older.","She gradually grew more confident.","She sauntered onto the set, looking serenely confident.","You get young people who appear to be socially confident, but inside they are a bundle of neuroses.","They gave a very confident performance of the piece.","I'm very confident in our ability to maintain leadership."],"opposite":"","synonyms":""},{"def":"feeling certain that something will happen in the way that you want or expect","examples":["confident of something The Democrats were confident of victory.","confident of doing something The team feels confident of winning.","confident about something We are confident about the future.","confident (that)… I'm confident that you will get the job.","He said he remained confident that the dispute could be resolved.","We're pretty confident we can win the case.","She was quietly confident that everything would go as planned.","‘Is that John over there?’ ‘I’m not sure.’","Are you sure about that?","England must win this game to be sure of qualifying.","I’m quite confident that you’ll get the job.","The team feels confident of winning.","I’m convinced that she’s innocent.","Are you absolutely certain about this?","She was positive that he’d been there.","‘Are you sure?’ ‘Positive.’","My memory isn’t really clear on that point.","I'm quite confident that you'll get the job.","We feel confident that these results are accurate.","I'm fully confident of winning the title.","I'm 95% confident of success.","They gave a confident prediction that things would improve.","He came out of the interview feeling quietly confident."],"opposite":"","synonyms":"sure"}],"idioms":[],"phrasal":[],"related":["self-confident"]}]