[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xconf/xconference__us_3.mp3","phonsUS":"/ˈkɑːnfərəns/","level":"A2","meanings":[{"def":"a large official meeting, usually lasting for a few days, at which people with the same work or interests come together to discuss their views","examples":["The hotel is used for exhibitions, conferences and social events.","to host/organize a conference","to speak at/address a conference","The conference will be held in Glasgow.","Delegates to the Labour Party's annual conference will be staying in the Grand Hotel.","the national conference of the American Psychiatric Association","at a conference We met at an international conference.","The resolution will be debated at the party conference in Brighton.","conference on something She is attending a three-day conference on AIDS education.","conference for somebody a conference for health professionals from around the world","a conference room/centre","The conference adopted a resolution on minority rights.","The conference agreed to adopt a set of compromise proposals.","The conference brought together historians working in a variety of fields.","The conference featured a keynote address by one of our most eminent scientists.","The conference heard an appeal from a representative from one of the more deprived areas.","The party leader made a morale-boosting speech from the conference platform.","a conference devoted to the topic of peace","a conference entitled ‘Strategies for Epidemic Control’","a conference examining cross-border cooperation","a conference for catering managers","a conference on economic aid","an inter-governmental conference examining cross-border cooperation","The meeting was held in a conference centre in Birmingham."],"opposite":"","synonyms":""},{"def":"a meeting at which people have formal discussions","examples":["They agreed to convene a peace conference by mid-November.","conference with somebody Her working day consists of conferences with foreign diplomats.","in conference (with somebody) He was in conference with his lawyers all day.","Ministers from all four countries involved will meet at the conference table this week.","Management had a joint conference with the union.","a conference between the warring parties","He scheduled a conference for the following week to discuss what should happen next."],"opposite":"","synonyms":""},{"def":"a group of sports teams that play against each other in a league","examples":["Southeast Conference football champions"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["conference call","news conference","press conference","conference committee","Lambeth Conference","American Football Conference","National Football Conference","Southern Christian Leadership Conference","sidebar conference","conference committees","the American Football Conference","the National Football Conference"]}]