[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xconf/xconfidence__us_2.mp3","phonsUS":"/ˈkɑːnfɪdəns/","level":"B2","meanings":[{"def":"the feeling that you can trust, believe in and be sure about the abilities or good qualities of somebody/something","examples":["The president's actions hardly inspire confidence.","confidence in somebody/something The players all have confidence in their manager.","He believes his reforms will restore confidence in the financial markets.","The survey revealed a lack of confidence in the government.","She has the utmost confidence in her students' abilities.","Our aim is to increase public confidence in the democratic process.","The university is facing a crisis of confidence about its future role.","The new contracts have undermined the confidence of employees.","Are we to place confidence in a man who cannot remember a phone call he made last week?","Confidence has returned to the market.","Investor confidence plunged to a 30-year low last week.","The police need to enjoy the full confidence of the public.","The quarterly survey showed an improvement in business confidence.","The commanding officer was relieved of his duty because of a loss of confidence in his leadership.","Confidence is high among the team's supporters.","Generally there is low public confidence in government institutions.","To maintain confidence in the criminal justice system, the judiciary needs to engage with the public.","He expressed confidence in the new plans.","Higher profits should raise business confidence.","Only if the chairperson resigns will we be able to restore the confidence of our members.","Only one bank scandal is needed to shake the confidence in the financial markets.","Security institutions have to have the confidence of all communities.","The Cabinet must enjoy the confidence of Parliament.","The captain of the football team said he had every confidence in his men.","The captain was not lacking in confidence about his team's prospects.","The company needs the full confidence of its investors.","The company's record does not really inspire confidence.","The general's confidence in his army proved misplaced.","The government lost a confidence vote.","They are gradually instilling confidence in their staff.","They have no confidence in the legal system.","This government has lost the confidence of the public.","This government no longer enjoys the confidence of the public.","This is a tremendous vote of confidence for the government.","We all have complete confidence in this product.","a loss of confidence among investors","an effort to renew investor confidence in corporate America","an environment which builds mutual confidence","efforts to build confidence between employers and unions","public confidence in the government","to maintain public confidence in the system of justice"],"opposite":"","synonyms":""},{"def":"a belief in your own ability to do things and be successful","examples":["People often lose confidence when they are criticized.","He gained confidence when he went to college.","Receiving compliments from my work colleagues has boosted my confidence.","The course will help you build your confidence and develop your study skills.","While girls lack confidence, boys often overestimate their abilities.","He suffers from a lack of confidence.","with confidence She answered the questions with confidence.","confidence in something/yourself I didn't have any confidence in myself at school.","Winning the award has given me much more confidence in my writing.","confidence to do something The training programmes have given workers the confidence to take on more responsibility.","Women often lose confidence when they stop work to have a baby.","Their confidence grew with each success.","A lot of children are lacking in confidence.","All his false confidence had drained away.","As the weeks went by he grew in confidence.","During his illness he really lost his confidence.","The training is designed to give staff confidence in managing problems.","Failing his exams really dented his confidence.","Getting the certificate does a lot in terms of confidence building.","He's really striking the ball well and has got his confidence back.","I lacked confidence about how I looked.","My confidence went completely after my first major defeat.","She gave an outward appearance of quiet confidence.","She has very little confidence in her own abilities.","She spoke in a tone of easy confidence.","She's gained a lot of confidence over the last year.","Since she got the new job, she's been brimming with confidence.","The home side badly need a confidence booster.","Winning the competition really boosted her confidence.","a man who exudes confidence","his confidence in himself","to instil confidence in staff who feel nervous about taking on new roles"],"opposite":"","synonyms":""},{"def":"the feeling that you are certain about something","examples":["He said he wished that he shared her confidence.","with confidence They could not say with confidence that he would be able to walk again after the accident.","No one can predict with complete confidence what will happen in the financial markets.","confidence that… She expressed her confidence that they would win."],"opposite":"","synonyms":""},{"def":"a feeling of trust that somebody will keep information private","examples":["It took a long time to gain her confidence (= make her feel she could trust me).","in confidence Eva told me about their relationship in confidence.","This is in the strictest confidence.","Enquiries will be dealt with in the strictest confidence.","I really can't talk about this—she told me in confidence.","She promised not to break his confidence.","She told me in confidence—I couldn't break that confidence, could I?","Telling other people what I'd said was a total breach of confidence."],"opposite":"","synonyms":""},{"def":"a secret that you tell somebody","examples":["The girls exchanged confidences.","I could never forgive Mike for betraying a confidence.","She didn't encourage confidences.","The girls exchanged whispered confidences.","Can you keep a confidence?"],"opposite":"","synonyms":""},{"def":"to be trusted with somebody’s secrets","examples":["He is said to be very much in the president's confidence."],"opposite":"","synonyms":""},{"def":"to tell somebody secrets and personal information about yourself","examples":["She took me into her confidence and told me about the problems she was facing.","She thought she might take Leo into her confidence."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be in somebody’s confidence","def":"to be trusted with somebody’s secrets","examples":["He is said to be very much in the president's confidence."]},{"idiom":"take somebody into your confidence","def":"to tell somebody secrets and personal information about yourself","examples":["She took me into her confidence and told me about the problems she was facing.","She thought she might take Leo into her confidence."]}],"phrasal":[],"related":["confidence trick","self-confidence","consumer confidence","confidence trickster","vote of confidence","vote of no confidence","confidence game","confidence tricks","confidence tricksters","votes of confidence","votes of no confidence"]}]