[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xconf/xconflict__us_1.mp3","phonsUS":"/ˈkɑːnflɪkt/","level":"B2","meanings":[{"def":"a situation in which people, groups or countries disagree strongly or are involved in a serious argument","examples":["The violence was the result of political conflicts.","conflict between A and B (over something) a conflict between two cultures","His task will be to resolve potential conflicts between the British and Scottish goverments.","conflict with somebody The prime minister wants to avoid conflict with the unions.","conflict over something The government has done nothing to resolve the conflict over nurses' pay.","in conflict with somebody (over something) She found herself in conflict with her parents over her future career.","John often comes into conflict with his boss.","conflict within something The terms of the will became a source of conflict within the family.","She has received training in conflict resolution.","His work brought him into conflict with more conventional scientists.","The conflict arose from different ambitions within the team.","The decision led to a bitter conflict between the management and unions.","There is more to a successful relationship than simply managing conflict.","They found themselves in conflict over the future of the company.","They hid their feelings to avoid conflict.","a conflict over ownership of the land","conflicts between different ethnic groups","in conflict with management","serious conflicts within the ruling party","the key to successful conflict management"],"opposite":"","synonyms":""},{"def":"a violent situation or period of fighting between two countries","examples":["armed/military conflict","The country has experienced internal conflict over the last decade.","Hopes of ending the conflict in the region are fading.","international efforts to find a peaceful solution to the conflict","conflict with somebody This isolated state faces the risk of another violent conflict with its neighbour.","conflict over something They are engaged in a bloody conflict over the disputed territory.","conflict between A and B (over something) A conflict between the two countries could easily spread across the whole region.","Thousands have been arrested in violent ethnic conflicts in the region.","to end the conflict with France","Conflict between the two groups has left more than 8 000 dead.","Peace talks have failed to end the 6-year-old conflict.","The UN are hoping to resolve the conflict quickly.","Our ability to mobilize large numbers of trained men in time of emergency could forestall future conflict."],"opposite":"","synonyms":""},{"def":"a situation in which there are ideas, opinions, feelings or wishes that are opposed to each other; a situation in which it is difficult to choose","examples":["Her diary was a record of her inner conflict.","conflict between A and B The story tells of a classic conflict between love and duty.","in conflict with something Many of these ideas appear to be in conflict with each other.","conflict of something He faced a conflict of loyalties.","a serious conflict of opinion","in direct conflict with his wishes","the conflict between science and religion","the inherent conflict between what farmers and environmentalists want","the inherent conflict between the demands of farmers and wishes of environmentalists"],"opposite":"","synonyms":""},{"def":"a situation in which somebody has two jobs, aims, roles, etc. and cannot treat both of them equally and fairly at the same time","examples":["There was a conflict of interest between his business dealings and his political activities.","One member of the planning committee had a conflict of interest as he lived near the proposed road.","There is often a conflict of interests between farmers and conservationists."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"conflict of interest(s)","def":"a situation in which somebody has two jobs, aims, roles, etc. and cannot treat both of them equally and fairly at the same time","examples":["There was a conflict of interest between his business dealings and his political activities.","One member of the planning committee had a conflict of interest as he lived near the proposed road.","There is often a conflict of interests between farmers and conservationists."]}],"phrasal":[],"related":["conflict diamond","conflict diamonds"]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xconf/xconflict__us_2.mp3","phonsUS":"/kənˈflɪkt/","level":"B2","meanings":[{"def":"if two ideas, beliefs, stories, etc. conflict, it is not possible for them to exist together or for them both to be true","examples":["Reports conflicted on how much of the aid was reaching the famine victims.","There are several major areas where their interests conflict.","conflict with something These results conflict with earlier findings."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]