[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcong/xcongress__us_1.mp3","phonsUS":"/ˈkɑːŋɡrəs/","level":"","meanings":[{"def":"a large formal meeting or series of meetings where representatives from different groups discuss ideas, make decisions, etc.","examples":["an international congress of trades unions","It was a year before the association met again in congress.","The Republican congress applauded this news enthusiastically.","The committee will call a national congress of 1 000 delegates.","The general secretary opened the congress on global warming.","Three hundred delegates attended the Liberal party congress.","We met again at the annual congress.","We wanted to offer the congress participants a greater diversity of content.","a congress on language in education"],"opposite":"","synonyms":""},{"def":"(in the US and some other countries) the name of the group of people who are elected to make laws, in the US consisting of the Senate and the House of Representatives","examples":["Congress will vote on the proposals tomorrow.","Congress adjourned for the year without approving an economic stimulus package.","Congress annually enacts legislation to fund NASA.","Congress appropriated $75 million for the program.","Congress approved most of the new powers.","Congress authorized $18 billion to launch the program.","Congress debated the issue at length.","Congress is currently considering legislation that would authorize the US nuclear weapons laboratories to study new types of nuclear weapons.","Congress passed a series of important measures.","Congress voted to delay a decision.","Outraged, he took his case to Congress.","The Liberals in Congress felt the reforms did not go far enough.","They will have to go to Congress to get the money.","legislation for the next session of Congress","President Fujimori suspended Congress and the judiciary.","Within two years of coming to power, he dissolved Congress and the courts.","The congress agreed to the tax-cutting package."],"opposite":"","synonyms":""},{"def":"a political organization or society","examples":["the African National Congress"],"opposite":"","synonyms":""},{"def":"the action of coming together","examples":["sexual congress"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Congress House","Member of Congress","Continental Congress","Library of Congress","Trades Union Congress","Congress of Racial Equality","Members of Congress","American Federation of Labor and Congress of Industrial Organizations"]}]