[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xconn/xconnect__us_1.mp3","phonsUS":"/kəˈnekt/","level":"A2","meanings":[{"def":"to join together two or more things; to be joined together","examples":["connect A and B The towns are connected by train and bus services.","connect A to B The island is connected to the mainland by a bridge.","connect A with B The canal was built to connect Sheffield with the Humber estuary.","The rooms on this floor connect.","a connecting door (= one that connects two rooms)","A corridor connects his office with the main building.","The canal was built to connect the city with the port.","The two bedrooms connect.","There is a connecting door between the two bedrooms.","There were buses that connected the two villages not only to each other but also with the city."],"opposite":"","synonyms":""},{"def":"to join something to the main supply of electricity, gas, water, etc. or to another piece of equipment","examples":["connect something We're waiting for the broadband to be connected.","connect something to something First connect the printer to the computer.","Connect the machine to the power supply.","Downstairs toilets were connected directly to the drains."],"opposite":"disconnect","synonyms":""},{"def":"to join a computer or a mobile device to the internet or to a computer network","examples":["The device can be hooked up to a mobile phone to connect wirelessly.","connect to something Click ‘Continue’ to connect to the internet.","laptops that connect wirelessly to the Net","connect something The system harnesses the processing power of many computers connected by a high-speed network.","connect something to something Simply connect your device to the camera's Wi-Fi signal.","Many guests leave their laptops connected to the hotel network when they're not in their rooms."],"opposite":"disconnect","synonyms":""},{"def":"to notice or make a link between people, things, events, etc.","examples":["connect A and B I was surprised to hear them mentioned together: I had never connected them before.","connect A with/to B There was nothing to connect him with the crime.","He made a statement connecting the terrorist group to the attack.","Bad diet is closely connected with many common illnesses.","I think Seb was connected to the murder.","I was feeling alive and connected to nature.","The entire family is connected to the Mafia.","The police were looking for evidence to connect him with the crime.","Those details are only loosely connected to the plot.","I found it hard to relate/​connect the two ideas in my mind.","I've been applying for jobs connected with the environment.","The two factors are directly linked/​connected.","The two subjects are closely connected.","They are connected by marriage."],"opposite":"","synonyms":""},{"def":"to arrive just before another one leaves so that passengers can change from one to the other","examples":["His flight to Amsterdam connects with an afternoon flight to New York.","There's a connecting flight at noon."],"opposite":"","synonyms":""},{"def":"to put somebody in contact by phone","examples":["After a long wait I was connected to customer services."],"opposite":"disconnect","synonyms":""},{"def":"to form a good relationship with somebody so that you like and understand each other","examples":["They met a couple of times but they didn't really connect."],"opposite":"","synonyms":""},{"def":"to hit somebody/something","examples":["The blow connected and she felt a surge of pain."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["connect up"],"related":["connect up","connect something"]}]