[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xconn/xconnection__us_2.mp3","phonsUS":"/kəˈnekʃn/","level":"B1","meanings":[{"def":"something that connects two facts, ideas, etc.","examples":["connection between A and B Scientists have established a connection between cholesterol levels and heart disease.","connection with something a direct/close/strong connection with something","His resignation must have some connection with the recent scandal.","connection to something Consumers are more likely to buy something from a person or shop they feel a personal connection to.","How did you make the connection (= realize that there was a connection between two facts that did not seem to be related)?","He denied any connection to the scam.","He maintained his southern connection through summer visits with his relatives.","His death had no connection with drugs.","Kierkegaard draws a connection between anxiety and free will.","Researchers have now established a connection between air pollution and asthma.","She did not make the connection between her diet and her poor health.","She wanted to sever all her connections with the company.","There is a close connection between family background and academic achievement.","This essay explores the connections between technology and nature.","This helps companies strengthen their connections to their customers.","We need to feel a connection to nature.","What is your connection with the school?","a deep physical and spiritual connection with nature","a government initiative to forge new connections with industry","a set of connections among brain regions","the connection between crime and alcohol","The union did not have a direct connection with any political party."],"opposite":"","synonyms":""},{"def":"the act of connecting or the state of being connected","examples":["a broadband/wireless/Wi-Fi/network connection","I'm having problems with my internet connection.","connection to something Connection to the gas supply was delayed for three days.","Unable to establish a connection to the internet.","Sorry, could you repeat that? This is a very bad connection.","We're waiting for connection to the water mains.","Each laptop has a wireless Ethernet connection.","a high-speed network connection that makes accessing the internet easy","speedy, always-on internet connections"],"opposite":"","synonyms":""},{"def":"a point, especially in an electrical system, where two parts connect","examples":["A faulty connection caused the machine to stop.","If you break the connection, the light won't come on."],"opposite":"","synonyms":""},{"def":"a train, bus or plane at a station or an airport that a passenger can take soon after getting off another in order to continue their journey","examples":["I missed the connection by five minutes.","We'll be lucky if we make our connection.","connection to… We arrived in good time for the connection to Paris."],"opposite":"","synonyms":""},{"def":"a means of travelling to another place","examples":["There are good bus and train connections between the resort and major cities.","good connections with New York"],"opposite":"","synonyms":""},{"def":"a person or an organization that you know and that can help or advise you in your social or professional life","examples":["One of my business connections gave them my name.","He got his job through connections.","He has connections.","I have some good business connections in New York.","She used her connections to get the job.","They helped establish connections among labs from Honolulu to Paris.","You can form strong connections when you work with people who share a mutual interest.","The way you establish a real emotional connection with someone is by sharing your inner worlds.","Anna helped Rachel re-establish her connection with her brother.","He and John seem to share a connection.","His deepest connection is with his father, Frank Sr."],"opposite":"","synonyms":""},{"def":"people who are your relatives, but not members of your close family","examples":["She is British but also has German connections.","a network of family connections in Italy"],"opposite":"","synonyms":""},{"def":"for reasons connected with somebody/something","examples":["A man has been arrested in connection with the murder of the teenager.","I am writing to you in connection with your recent job application."],"opposite":"","synonyms":""},{"def":"for reasons connected with something recently mentioned","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in connection with somebody/something","def":"for reasons connected with somebody/something","examples":["A man has been arrested in connection with the murder of the teenager.","I am writing to you in connection with your recent job application."]},{"idiom":"in this/that connection","def":"for reasons connected with something recently mentioned","examples":[]}],"phrasal":[],"related":[]}]