[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcons/xconsider__us_1.mp3","phonsUS":"/kənˈsɪdər/","level":"A2","meanings":[{"def":"to think about something carefully, especially in order to make a decision","examples":["I'd like some time to consider.","consider something She is considering her options.","Let us consider the facts.","We are considering various possibilities.","He was seriously considering an appeal.","a carefully considered response","The company is being actively considered as a potential partner (= it is thought possible that it could become one).","consider doing something Have you considered starting your own business?","consider how/what, etc… We need to consider how the law might be reformed.","He was considering what to do next.","The court must consider whether the employer was negligent.","consider somebody/something for something We are considering her for the job of designer.","The book is about homeless people in the cities.","The report deals with the issue of homelessness in London.","The writer discusses the problems faced by homeless people.","The article presents an overview of the issues surrounding homelessness.","The novel explores the theme of friendship among homeless people.","The first chapter examines the relationship between homelessness and drug addiction.","The paper considers the question of why so many young people become homeless.","I did briefly consider going on my own.","I was strongly considering leaving her on her own.","I'm seriously considering the possibility of emigrating.","It was a carefully considered decision.","You wouldn’t consider marrying a man for his money, then?","We're considering buying a new car."],"opposite":"","synonyms":""},{"def":"to think of somebody/something in a particular way","examples":["consider somebody/something + noun I consider her a friend.","The award is considered a great honour.","He considers it his duty.","consider somebody/something to be, have, etc. something She is widely considered to be the greatest player ever.","Who do you consider to be responsible for the accident?","He's generally considered to have the finest tenor voice in the country.","consider yourself + noun He considers himself an expert on the subject.","consider somebody/something + adj. They will take any steps they consider necessary.","Certain subjects were not considered appropriate for female artists.","consider somebody/something as something You should consider this as a long-term investment.","consider (that)… She considers that it is too early to form a definite conclusion.","it is considered that… It is considered that the proposed development would create much-needed jobs.","The Home Secretary will release prisoners only if he considers it is safe to do so.","Consider yourself lucky you weren't fired.","These children are considered as a high-risk group."],"opposite":"","synonyms":"regard"},{"def":"to think about something, especially the feelings of other people, and be influenced by it when making a decision, etc.","examples":["You should consider other people before you act."],"opposite":"","synonyms":""},{"def":"to look carefully at somebody/something","examples":["He stood there, considering the painting."],"opposite":"","synonyms":""},{"def":"thinking carefully about all the facts, especially the problems or difficulties, of a situation","examples":["She's had a lot of problems since her husband died but she seems quite cheerful, all things considered."],"opposite":"","synonyms":""},{"def":"your opinion that is the result of careful thought","examples":["It is my considered opinion that you are wrong."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"all things considered","def":"thinking carefully about all the facts, especially the problems or difficulties, of a situation","examples":["She's had a lot of problems since her husband died but she seems quite cheerful, all things considered."]},{"idiom":"your considered opinion","def":"your opinion that is the result of careful thought","examples":["It is my considered opinion that you are wrong."]}],"phrasal":[],"related":[]}]