[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcons/xconsistent__us_1.mp3","phonsUS":"/kənˈsɪstənt/","level":"B2","meanings":[{"def":"always behaving in the same way, or having the same opinions, standards, etc.","examples":["a consistent approach to the problem","a consistent pattern of behaviour","He has been Milan's most consistent player (= who plays well most often) this season.","consistent in something She's not very consistent in the way she treats her children.","consistent in doing something We must be consistent in applying the rules.","Each generation becomes ever more consistent in its thinking.","His attitude isn't absolutely consistent.","It is desirable that domestic and EU law should be mutually consistent."],"opposite":"","synonyms":""},{"def":"happening in the same way and continuing for a period of time","examples":["We have had enough of the party's consistent failure to come up with any new policies.","There has been a pattern of consistent growth in the economy.","Defence spending levels have remained consistent.","The Sunday paper failed to sell its target of 30  000 copies a week on a consistent basis.","The percentage of personal income paid in taxes stayed fairly consistent across various income levels.","The pattern is strikingly consistent in the four samples.","These findings are consistent across all the studies.","These findings were statistically consistent among studies.","These results were consistent between genders, and regardless of age and parent education level.","This is relatively consistent across all age groups.","These findings appear consistent across all groups in society."],"opposite":"","synonyms":""},{"def":"in agreement with something; not contradicting something","examples":["The results are entirely consistent with our earlier research.","These findings are consistent with other studies.","injuries consistent with a fall from an upper storey (= similar to those such a fall would have caused)","The portrait of Powell in the book is pretty consistent with what everybody knows.","The figures are fully consistent with last year's results.","Our results are generally consistent with the results of other analyses.","The results of this study are surprisingly consistent with previous estimates."],"opposite":"","synonyms":""},{"def":"having different parts that all agree with each other","examples":["a well-thought-out and consistent argument","His argument is not even internally consistent."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]