[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcons/xconsensus__us_1.mp3","phonsUS":"/kənˈsensəs/","level":"C1","meanings":[{"def":"an opinion that all members of a group agree with","examples":["consensus (about/on something) She is skilled at achieving consensus on sensitive issues.","There is a growing consensus of opinion on this issue.","an attempt to reach a consensus","There now exists a broad political consensus in favour of economic reform.","consensus politics (= that people in general agree with)","consensus (among somebody) (about/on something) There is a general consensus among teachers about the need for greater security in schools.","consensus that… There seems to be a consensus that the plan should be rejected.","by consensus They have always governed by consensus.","A general consensus on the problem is beginning to emerge.","Computer science has reached a rough consensus on this issue.","He was the first to break the consensus and criticize the proposal.","It is difficult to reach a consensus about electoral reform.","No clear consensus exists over the next stage of the plan.","Over time a consensus formed.","That seems to be the prevailing consensus.","The agency helped develop a consensus on conservation.","The general consensus of opinion is that a high-fat diet is bad for you.","The measures represented a consensus that people and the environment must be protected from the excesses of the market.","The scientific consensus is that failure to take action could lead to widespread droughts.","The war broke the broad consensus of liberals.","The world's scientists have reached a nearly unanimous consensus that the surface of the Earth is warming as a result of human activities.","There are guidelines in a 2007 consensus statement from the Institute.","There are signs that the consensus is breaking down.","There is a bipartisan consensus against the legalization of drugs.","There is no scholarly consensus on how these terms are defined.","These standards represent expert consensus on generally accepted social scientific standards for research on child development.","This is not consensus opinion yet.","a magazine attempting to build a consensus about sustainable science","a universal consensus about the problems of the exchange rate system","citizens who work together to forge consensus regarding important public safety issues","no consensus among the members","the current consensus about AIDS in Africa","the general consensus within the criminal justice system","the liberal consensus represented by President Johnson's landslide victory in 1964","I am a great believer in consensus politics."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]