[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcons/xconsciousness__us_1.mp3","phonsUS":"/ˈkɑːnʃəsnəs/","level":"C1","meanings":[{"def":"the state of being able to use your senses and mental powers to understand what is happening","examples":["I can't remember any more—I must have lost consciousness.","She did not regain consciousness and died the next day.","She hit her head on a rock and lost consciousness.","The cold water brought me back to full consciousness.","When she regained consciousness she was in a hospital bed."],"opposite":"","synonyms":""},{"def":"the state of being aware of something","examples":["his consciousness of the challenge facing him","class-consciousness (= consciousness of different classes in society)","He claims that it's a form of false consciousness for working people to vote.","I left the room with full consciousness of the impression I would make.","In some cultures shamans use drugs to alter consciousness.","The words slowly entered her consciousness.","They have succeeded in raising consciousness on many issues.","a growing consciousness of environmental issues among children","a new consciousness about the health consequences of pesticides","an altered state of consciousness","powerful states of cosmic consciousness","the modern study of animal consciousness","the practices that are used by yogis to reach divine consciousness","to aspire to a higher consciousness","Her consciousness of the challenge that faced her did not put her off.","The memory remained deep in his consciousness.","There has always been a strong social consciousness in the city.","We need to raise people's consciousness of environmental issues."],"opposite":"","synonyms":""},{"def":"the ideas and opinions of a person or group","examples":["her newly developed political consciousness","issues affecting the popular consciousness of the time","Hip-hop exploded into popular consciousness at the same time as the music video.","Our role as educators is to develop a critical consciousness among our students.","The idea firmly lodged itself in the public consciousness.","These memories became an important component of Polish historical consciousness.","a book that has changed cultural consciousness in the US","a change that altered our collective consciousness forever","a decline in civic consciousness and a growing indifference to public affairs","a new political consciousness among young people","a sense of ethnic consciousness among Lithuanian Americans","imagery that has entered the national consciousness through the media","In popular consciousness he will always be a hero.","a key position in feminist consciousness","She sees racism as a form of false consciousness, where a society collectively believes untrue things about other races."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["class-consciousness","self-consciousness","consciousness-raising","stream of consciousness","streams of consciousness"]}]