[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcons/xconsultation__us_1.mp3","phonsUS":"/ˌkɑːnslˈteɪʃn/","level":"C1","meanings":[{"def":"the act of discussing something with somebody or with a group of people before making a decision about it","examples":["a consultation document/paper/period/process","consultation with somebody/something The decision was taken after close consultation with local residents.","in consultation with somebody/something acting in consultation with all the departments involved","Discussions are still taking place between the two leaders.","a telephone conversation","The novel has long descriptions and not much dialogue.","The President told waiting reporters there had been a constructive dialogue.","I had a long talk with my boss about my career prospects.","a debate on prison reform","There have been extensive consultations between the two countries.","We had a good gossip about the boss.","The company has promised wide consultation on its expansion plans.","The plan was developed in close consultation with the local community.","There will be a period of public consultation before a decision is reached.","They have taken this decision without any consultation.","We need more consultation with the unions.","You should seek expert consultation.","A consultation period will be required.","He has been acting in consultation with all the departments involved."],"opposite":"","synonyms":"discussion"},{"def":"a formal meeting to discuss something","examples":["There have been extensive consultations between the two countries.","Discussions are still taking place between the two leaders.","a telephone conversation","The novel has long descriptions and not much dialogue.","The President told waiting reporters there had been a constructive dialogue.","I had a long talk with my boss about my career prospects.","a debate on prison reform","There have been extensive consultations between the two countries.","We had a good gossip about the boss.","a consultation between teachers and parents","The police chiefs will hold a consultation with all the relevant groups."],"opposite":"","synonyms":"discussion"},{"def":"a meeting with an expert, especially a doctor, to get advice or treatment","examples":["A 30-minute consultation will cost £50.","a job interview","He confessed after four days under interrogation.","The Pope granted her a private audience.","I had a consultation with a dermatologist.","The practice provides medical consultations for drug addicts.","a joint consultation with doctors and patients"],"opposite":"","synonyms":"interview"},{"def":"the act of looking for information in a book, etc.","examples":["There is a large collection of texts available for consultation on-screen."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]