[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcons/xconsumer__us_2.mp3","phonsUS":"/kənˈsuːmər/","level":"B1","meanings":[{"def":"a person who buys goods or uses services","examples":["consumer spending/demand","links between producers and consumers","Health-conscious consumers want more information about the food they buy.","a consumer society (= one where buying and selling is considered to be very important)","a consumer watchdog (= somebody whose job is to protect consumers' rights)","The consumer (= consumers as a group) is well served by competition.","This tool may be considered too expensive for the average consumer.","consumer of something consumers of news/electricity/healthcare","providers and consumers of public services","We need to educate consumers about this technology.","Consumer watchdogs have accused banks of ‘appalling arrogance’ in the way they treat customers.","Economists forecast that falling consumer confidence will cut into household purchases.","Government policy encouraged a consumer boom followed by a deep recession.","Green consumers should be wary of manufacturers' claims that their products are environmentally friendly.","Mass culture turns audiences into passive consumers, their participation limited to the choice between buying and not buying.","The UK is the biggest consumer of tropical hardwoods after Japan.","The country could face a consumer boycott of its beef exports.","They exploit consumers by charging high prices.","We are living in a consumer society.","We are the biggest consumers of tropical hardwoods after Japan.","We supply domestic consumers","What can be done to protect the ordinary consumer from unscrupulous operators?","two years of research among consumers","The big stores are, of course, responding to consumer demand."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["consumer credit","consumer durables","consumer economy","consumer goods","consumer group","Consumer Reports","consumer spending","consumer confidence","consumer electronics","business-to-consumer","consumer price index","National Consumer Council","consumer groups","consumer economies","consumer prices index","consumer price indexes","consumer price indices","harmonized index of consumer prices"]}]