[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcons/xconsequence__us_1_rr.mp3","phonsUS":"/ˈkɑːnsɪkwens/","level":"B1","meanings":[{"def":"a result of something that has happened, especially an unpleasant result","examples":["Remember that actions have consequences.","to suffer/face the consequences of something","dire/disastrous/negative/adverse consquences","Have you considered the possible consequences?","Reform often produces unintended consequences.","They must be prepared to accept the consequences of their actions.","A White House spokesman said that civilian casualties were an inevitable consequence of war.","consequence for somebody/something This decision could have serious consequences for the industry.","as a consequence (of something) Two hundred people lost their jobs as a direct consequence of the merger.","with… consequences He drove too fast, with tragic consequences.","She died as a result of her injuries.","This book is the result of 25 years of research.","This decision could have serious consequences for the industry.","We are waiting to hear the final outcome of the negotiations.","One consequence of changes in diet over recent years has been a dramatic increase in cases of childhood obesity.","Many parents today do not have time to cook healthy meals for their children. Consequently/As a consequence, many children grow up eating too much junk food.","Many children spend their free time online instead of playing outside. As a result, more and more of them are becoming overweight.","Last year junk food was banned in schools. The effect of this has been to create a black market in the playground, with pupils bringing sweets from home to sell to other pupils.","He knew the potential consequences of his decision.","The long-term consequences of this policy have not yet been fully assessed.","Her documentary examines the consequences of laws allowing reduced sentences for drug offenders.","The Act could have certain unintended consequences.","The kidnappers threatened him with dire consequences if their demands were not met immediately.","The practical consequences of his decision were considerable.","The practice had far-reaching environmental consequences.","There could be grave consequences for the economy.","They cannot predict the precise consequences of an increase in average temperature.","They fear the consequences of rebellion.","They help women cope with the emotional consequences of miscarriage.","This could have serious consequences for the economy.","This is a tragic yet unavoidable consequence of war.","You must accept the full consequences of your actions.","a debate with potentially significant legal consequences","a gritty look at war and its consequences on human life","a new sonar system that could have deadly consequences for whales","better planning to ensure that there are fewer unanticipated consequences","the important electoral consequences that will follow from this decision","the links between dietary choices and health consequences","the negative consequences resulting from previous alcohol and drug use","to face up to the physical consequences of ageing","Actions have consequences.","At some point you will have to face the consequences of your actions.","Fearing the consequences, she left the company."],"opposite":"","synonyms":"result"},{"def":"importance","examples":["Don't worry. It's of no consequence.","people of some consequence in the art world","His work made him a person of some consequence in the art world.","I'd never done anything of consequence in my life.","Matters of justice are of great consequence.","Minor slips are of no consequence.","Scorsese's first feature film of any consequence","The majority of these losses are of little consequence."],"opposite":"","synonyms":""},{"def":"a game in which each player writes the first line of a story on a piece of paper and then passes it to the next player who writes the second line, and so on. Each player folds the paper so that the next player cannot see what is already written. The result is a number of crazy and often funny stories. The stories follow a pattern that always begins with the names of two people and ends with the sentence 'And the consequence was…’","examples":[],"opposite":"","synonyms":""},{"def":"as a result of something","examples":["The child was born deformed in consequence of an injury to the mother.","It had been a humiliating day for Flora and she bore the director a grudge in consequence.","The employer is liable for compensation payable in consequence of injury to one of its employees."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in consequence (of something)","def":"as a result of something","examples":["The child was born deformed in consequence of an injury to the mother.","It had been a humiliating day for Flora and she bore the director a grudge in consequence.","The employer is liable for compensation payable in consequence of injury to one of its employees."]}],"phrasal":[],"related":[]}]