[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcons/xconscious__us_2.mp3","phonsUS":"/ˈkɑːnʃəs/","level":"B2","meanings":[{"def":"aware of something; noticing something","examples":["conscious of something She's very conscious of the problems involved.","I am conscious of the fact that there's a limit to what we can achieve here.","conscious of doing something He became acutely conscious of having failed his parents.","conscious that… I was vaguely conscious that I was being watched.","Barely conscious of the flashing lights around him, Kevin recklessly weaved in and out of traffic.","He fell, and was dimly conscious of Tara standing over him.","He was completely conscious of her warm body next to his.","I am very conscious of the need for secrecy.","I was hardly conscious of my surroundings.","She became acutely conscious that someone was watching her.","We are now deeply conscious of these issues.","He was painfully conscious of his mother's embarrassment."],"opposite":"unconscious","synonyms":""},{"def":"able to use your senses and mental powers to understand what is happening","examples":["A patient who is not fully conscious should never be left alone.","She remained conscious throughout the operation.","Try to keep the patient conscious.","The patient is not yet fully conscious.","She was heavily sedated but struggled to stay conscious.","One man was so drunk as to be barely conscious.","I was only half conscious.","Erin was only partially conscious.","treatment decisions for persons in a minimally conscious state"],"opposite":"unconscious","synonyms":""},{"def":"deliberate; done in a careful way","examples":["a conscious choice","to make a conscious decision","I made a conscious effort to get there on time.","a conscious act of cruelty","He drifted into it rather than as a result of any conscious political choice.","She made a conscious decision to spend more time with her family."],"opposite":"unconscious","synonyms":""},{"def":"being particularly interested in something","examples":["to be environmentally/politically conscious","the band's socially conscious lyrics","They have become increasingly health-conscious.","an image-conscious reality star"],"opposite":"","synonyms":""},{"def":"directly under the control of the person concerned","examples":["When you go to sleep, it is only the conscious mind that shuts down."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["class-conscious","fashion-conscious","self-conscious"]}]