[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcons/xconsent__us_1.mp3","phonsUS":"/kənˈsent/","level":"C1","meanings":[{"def":"permission to do something, especially given by somebody in authority","examples":["The written consent of a parent is required.","consent to something Children under 16 cannot give consent to medical treatment.","to refuse/withhold your consent","without (somebody's) consent He is charged with taking a car without the owner's consent.","A record of their written consent must be on file.","At any time during the study, parents could withdraw their consent.","Completion of the survey was taken as implied consent to participate.","Do you have the consent of your employer?","Doctors must obtain the informed consent of all patients before giving any treatment.","Doctors pressed her to sign a consent form for emergency surgery.","He gave his consent for treatment.","He withheld his consent to the marriage.","In 1998 they signed a consent agreement.","Informed oral consent was obtained from each individual.","Judge Roberts nodded his consent and she began.","No action can be taken without the prior consent of the owner.","Spousal consent is necessary to secure the loan.","The article is reprinted by consent of the author.","The consent decree required the state to institute certain programs that were not required by federal law.","The information should generally be considered private unless there is explicit consent to disclose it.","The investigators secured the consent of the suspects to take their computers away.","The removal of the patient consent requirement was denounced by the opposition.","They provided verbal consent for the interview to be taped.","You must give written consent before the documents can be released.","Your property cannot be sold without your consent.","Your silence implies tacit consent to these proposals.","additional measures to strengthen informed consent procedures","consent from the parents","students who had provided parental consent to participate","the policy of presumed consent for organ donation","A tenant may not sublet the property without the consent in writing from the landlord.","He was accused of taking a vehicle without the owner's consent.","Her father gave his consent to the marriage.","Informed consent must be obtained from all patients before they take part in the study.","Patients sign a consent form before surgery.","The drug was given without the patient's knowledge or consent.","The landlord may not withhold consent unreasonably.","These appointments are subject to the consent of the Prime Minister."],"opposite":"","synonyms":""},{"def":"agreement about something","examples":["She was chosen as leader by common consent (= everyone agreed to the choice).","By mutual consent they didn't go out (= they both agreed not to).","The advertising authority is, by general consent, a very reasonable body.","The marriage ended by mutual consent.","The museum bought the collection for $2 million, by common consent a very good price.","By unspoken consent they carried on working through the night.","government by consent","The proposal received unanimous consent.","The contract can only be broken by mutual consent.","By unanimous consent, the Senate inserted a moratorium."],"opposite":"","synonyms":""},{"def":"an official document giving permission for something","examples":["Your family, in effect, signs the consent for you."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["age of consent","informed consent","ages of consent"]},{"pos":"verb","level":"C1","meanings":[{"def":"to agree to something or give your permission for something","examples":["When she told them what she intended, they readily consented.","consent to something He reluctantly consented to the proposal.","consent to do something She finally consented to answer our questions.","He agreed to let me go early.","They accepted the court’s decision.","The committee unanimously approved the plan.","She just goes along with everything he suggests.","She finally consented to answer our questions.","He has kindly consented to give us some of his valuable time.","He reluctantly consented to the material being edited.","I asked him to provide it and he willingly consented.","Mrs Meade has graciously consented to supervise your detention."],"opposite":"","synonyms":"agree"}],"idioms":[],"phrasal":[],"related":[]}]