[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcont/xcontribution__us_1.mp3","phonsUS":"/ˌkɑːntrɪˈbjuːʃn/","level":"B2","meanings":[{"def":"a gift or payment that is made to a person or an organization in order to help pay for something","examples":["All contributions will be gratefully received.","We rely entirely on voluntary contributions.","campaign contributions","contribution to something to make a substantial contribution to charity","contribution towards something valuable contributions towards the upkeep of the cathedral","contribution towards doing something She argued that a greater contribution towards reducing Britain's record debts should be asked of the better off.","contribution from/by somebody/something Financial contributions from individuals paid for office and printing expenses.","I'd like to make a small contribution to the cost of the holiday.","We were asked to make a contribution towards the cost of the meal.","Contributions of cakes and other items for the cake sale can be left in the school office."],"opposite":"","synonyms":""},{"def":"a sum of money that you pay regularly to your employer or the government in order to pay for benefits such as health insurance, a pension, etc.","examples":["pension contributions","National Insurance contributions","contribution to something You can increase your monthly contributions to the pension plan.","contribution from/by somebody Pension funds base retirement income on the level of contributions from employees and employers.","ten monthly payments of $50","payment in advance","an insurance premium","a premium for express delivery","You can increase your monthly contributions to the pension plan.","a subscription to Netflix","the repayments on the loan","We've put down a 5 per cent deposit on the house.","We paid for the car by/​in instalments.","employers' pension and health insurance contributions","Residents made a net contribution to public finances of $2.6 billion."],"opposite":"","synonyms":"payment"},{"def":"an action or a service that helps to cause or increase something, usually (but not necessarily) something good or valuable","examples":["contribution to something He made a very positive contribution to the success of the project.","a significant contribution to scientific knowledge","The star is being given the award for his ‘outstanding contribution to the entertainment field’.","This book represents a major contribution to our understanding of the Holocaust.","She feels the world has overlooked his crucial contribution to the development of rock and roll.","the car’s contribution to the greenhouse effect","contribution towards something She was honoured posthumously for her contribution towards the war effort.","contribution towards doing something These measures would make a valuable contribution towards reducing industrial accidents.","contribution of somebody/something (to something) She says the US needs to do more to recognize the contributions of women and minorities to society.","They studied the relative contribution of various risk factors for suicide.","He made a major contribution to peace in the region.","He was recognized for his unique contribution to the arts.","Researchers have argued over the relative contributions of nature and nurture to the human personality.","We like to think that we are making a positive contribution to society.","a valuable contribution to science","She has made a significant contribution to scientific knowledge."],"opposite":"","synonyms":""},{"def":"an item that forms part of a book, magazine, website broadcast, discussion, etc.","examples":["All contributions for the May issue must be received by Friday.","contribution to something an important contribution to the debate","Thank you for your contributions to the blog.","contribution from/by somebody There are no contributions by scholars based in North America.","The author acknowledges the contributions of scientist Charles Green.","Each of these writers has made an individual contribution to the discussion."],"opposite":"","synonyms":""},{"def":"the act of giving something, especially money, to help a person or an organization","examples":["The institute is totally funded by voluntary contribution."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["defined contribution"]}]