[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcont/xcontract__us_1.mp3","phonsUS":"/ˈkɑːntrækt/","level":"B2","meanings":[{"def":"an official written agreement","examples":["All employees have a written contract of employment.","a research/modelling/recording contract","a lucrative government contract","contract with somebody to enter into/negotiate/sign a contract with the supplier","contract between A and B These clauses form part of the contract between buyer and seller.","contract for something a contract for the supply of vehicles","contract to do something to win/be awarded a contract to build a new school","to renew/extend/terminate/cancel a contract","on a contract I was on a three-year contract that expired last week.","under contract to/with somebody/something She is under contract to (= has a contract to work for) a major American computer firm.","out of contract The phone costs several hundred dollars more out of contract (= without a contract with a phone company).","The midfielder will be out of contract at the end of the season (= his contract with his club will have finished).","a contract worker (= one employed on a contract for a fixed period of time)","Under the terms of the contract the job should have been finished yesterday.","They were sued for breach of contract (= not doing what they agreed to do in a contract).","He had a release clause written into his contract.","subject to contract The offer has been accepted, subject to contract (= the agreement is not official until the contract is signed).","By using cheaper materials, the company has broken the terms of its contract.","Do you have a contract with your employer?","Eighteen companies are bidding for the contract.","Either party can terminate the contract at any time.","He entered into a contract with his former employer.","He's on a three-year fixed-term contract.","If you go on strike you will be in breach of contract.","Many workers do not have written contracts.","My advertising firm just won a lucrative contract with a cigarette company.","She managed to negotiate a permanent contract with the company.","The company is being sued for breach of contract.","The contract expires at the end of next year.","The contract was declared void.","The firm lost the contract to a large London company.","The successful bidder must exchange contracts immediately and pay a deposit.","They put a clause in the contract stipulating that the work should be finished by next month.","They won a contract for the delivery of five fighter planes.","Under her contract of employment, Mrs Lee could not be required to work at a different site.","You should make sure that you have a formal contract of employment.","a series of major contracts worth millions of pounds","the company fulfilling the construction contract","the contract between the employer and the employee","the firm carrying out the construction contract","The company is currently negotiating a contract to build a new hotel development."],"opposite":"","synonyms":""},{"def":"an agreement to kill somebody for money","examples":["She took out a contract on her ex-husband.","He has a contract out on you."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["contract in","contract out","contract bridge","social contract","contract in (to something)","contract out (of something)","contract something"]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcont/xcontract__us_2.mp3","phonsUS":"/kənˈtrækt/","level":"B2","meanings":[{"def":"to become less or smaller; to make something become less or smaller","examples":["Glass contracts as it cools.","The universe is expanding rather than contracting.","a contracting market","The economy will contract by 2 per cent this year.","The heart muscles contract to expel the blood.","contract something The exercise consists of stretching and contracting the leg muscles.","contract something to something ‘I will’ and ‘I shall’ are usually contracted to ‘I'll’ (= made shorter).","The electrical market is forecast to contract by 2% this year.","The exercise consists of contracting and expanding the leg muscles."],"opposite":"expand","synonyms":""},{"def":"to get an illness","examples":["to contract a virus/a disease/measles","Condoms can help to minimize the risk of contracting HIV.","He contracted malaria while abroad."],"opposite":"","synonyms":""},{"def":"to make a legal agreement with somebody for them to work for you or provide you with a service","examples":["contract somebody to do something The player is contracted to play until August.","contract somebody (to something) Several computer engineers have been contracted to the finance department.","He can't work for them because he is contracted with another company."],"opposite":"","synonyms":""},{"def":"to make a legal agreement to work for somebody or provide them with a service","examples":["She has contracted to work 20 hours a week."],"opposite":"","synonyms":""},{"def":"to formally agree to marry somebody/form an alliance with somebody","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["contract in","contract out"],"related":[]}]