[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcont/xcontribute__us_1.mp3","phonsUS":"/kənˈtrɪbjuːt/","level":"B2","meanings":[{"def":"to give something, especially money or goods, to help achieve or provide something","examples":["Do you wish to contribute?","contribute to/towards something Would you like to contribute to our collection?","to contribute to your pension","contribute something Check with your financial planner to make sure that you are contributing the correct amounts.","contribute something to/towards something We contributed £5 000 to the earthquake fund.","I would like to contribute to the church restoration fund.","Many people contributed generously to the appeal.","The company contributed $50 000 towards training costs.","a situation where husband and wife contribute equally to the family budget","The writer personally contributed £5 000 to the earthquake fund."],"opposite":"","synonyms":""},{"def":"to be one of the causes of something","examples":["Human error may have been a contributing factor.","contribute to something It is well known that UV radiation contributes to the development of skin cancer.","Investment in transport contributes to overall economic growth.","Medical negligence was said to have contributed to her death.","England fans are contributing hugely to the success of this event.","US policy has contributed to the problem.","Several factors may be contributing to the fall in the number of applicants.","Childhood obesity can cause/lead to long-term health problems.","Changes in lifestyle and diet over the last twenty years have caused/led to/resulted in a sharp increase in childhood obesity.","Several factors, including changes in diet and lifestyle, have contributed to the increase in childhood obesity.","Research suggests that fast food and soft drinks directly contribute to childhood obesity.","Genetics, lifestyle and diet are all important factors in cases of childhood obesity.","Even small changes in lifestyle and diet can bring about significant weight loss.","Several factors might contribute to the development of the disease.","These images could potentially contribute to the development of eating disorders.","Unemployment contributes directly to homelessness.","countries that contribute disproportionately to global warming"],"opposite":"","synonyms":""},{"def":"to increase, improve or add to something","examples":["contribute to something Immigrants have contributed to British culture in many ways.","Parental involvement contributes significantly to children's learning.","Hall's work contributed greatly to our knowledge of the disease.","contribute something to something This book contributes little to our understanding of the subject.","His research has contributed enormously to our understanding of this disease.","people who want to contribute positively to their communities"],"opposite":"","synonyms":""},{"def":"to write things for a newspaper, book, website, etc. or a radio or television programme; to speak during a meeting or conversation, especially to give your opinion","examples":["The blog now has about 20 people contributing regularly.","a contributing editor","contribute to something We hope everyone will contribute to the discussion.","Associated Press contributed to this report.","contribute something He contributed a piece on Canadian law.","contribute something to something She contributed a number of articles to the magazine.","He contributes regularly to the magazine ‘New Scientist’.","Students are encouraged to contribute articles to the university magazine.","a talented photographer who contributed regularly to ‘The Face’"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]