[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcont/xcontrast__us_1.mp3","phonsUS":"/ˈkɑːntræst/","level":"B1","meanings":[{"def":"a difference between two or more people or things that you can see clearly when they are compared or put close together; the fact of comparing two or more things in order to show the differences between them","examples":["The two cities make an interesting contrast.","contrast between A and B There is an obvious contrast between the cultures of East and West.","in contrast In contrast, the south suffered very little hurricane damage.","in contrast to somebody/something The situation when we arrived was in marked contrast to the news reports.","The poverty of her childhood stands in total contrast to her life in Hollywood.","The company lost $7 million this quarter in contrast to a profit of $6.2 million a year earlier.","contrast with somebody/something to show a sharp/stark/striking contrast with something","contrast in something A wool jacket complements the silk trousers and provides an interesting contrast in texture.","by contrast When you look at their new system, ours seems very old-fashioned by contrast.","contrast of A and B Careful contrast of the two plans shows some important differences.","This survey highlights a number of differences in the way that teenage boys and girls in the UK spend their free time.","One of the main differences between the girls and the boys who took part in the research was the way in which they use the internet.","Unlike the girls, who use the internet mainly to keep in touch with friends, the boys questioned in this survey tend to use the internet for playing computer games.","The girls differ from the boys in that they tend to spend more time keeping in touch with friends on the phone or on social networking websites.","Compared to the boys, the girls spend much more time chatting to friends on the phone.","On average the girls spend four hours a week chatting to friends on the phone. In contrast, very few of the boys spend more than five minutes a day talking to their friends in this way.","The boys prefer competitive sports and computer games, whereas/while the girls seem to enjoy more cooperative activities, such as shopping with friends.","When the girls go shopping, they mainly buy clothes and cosmetics. The boys, on the other hand, tend to purchase computer games or gadgets.","The company lost $13 million this year, in contrast with a profit of $15 million last year.","The contrast between the sisters was very strong.","The contrast in appearance between the sisters was striking.","The flowers provide a contrast with the dark background.","The fresh fruit provides a contrast to the rich chocolate pudding.","The writer emphasizes the contrast between conventional and alternative medicine.","When you look at their new system, ours seems very old-fashioned by contrast.","Their attitudes to marriage stand in stark contrast to those of their parents.","There is a stark contrast between the lives of the rich and those of the poor.","There is a striking contrast between the two painters' work."],"opposite":"","synonyms":""},{"def":"a person or thing that is clearly different from somebody/something else","examples":["The work you did today is quite a contrast to (= very much better/worse than) what you did last week.","This busy social life was a complete contrast to his old quiet life.","Her hair was black, a stunning contrast to her pale complexion."],"opposite":"","synonyms":""},{"def":"differences in colour or in light and dark, used in photographs and paintings to create a special effect","examples":["The artist's use of contrast is masterly."],"opposite":"","synonyms":""},{"def":"the amount of difference between light and dark in a photograph or the picture on a television screen","examples":["Use this button to adjust the contrast."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcont/xcontrast__us_1_rr.mp3","phonsUS":"/kənˈtræst/","level":"B1","meanings":[{"def":"to compare two things in order to show the differences between them","examples":["contrast A and B The poem contrasts youth and age.","Compare and contrast the two novels (= discuss how they are similar and how they are different).","contrast A with B It is interesting to contrast the British legal system with the American one.","Compare and contrast the two main characters in the play.","He contrasted her brashness unfavourably with his mother's gentleness."],"opposite":"","synonyms":""},{"def":"to show a clear difference when close together or when compared","examples":["A contrasts with B Her actions contrasted sharply with her promises.","A and B contrast Her actions and her promises contrasted sharply.","This statement contrasts starkly with his previous statements.","The open approach contrasts favourably with the exclusivity of some universities.","His cream shirt contrasted beautifully with his tan skin."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]