[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcont/xcontroversy__us_1.mp3","phonsUS":"/ˈkɑːntrəvɜːrsi/","level":"B2","meanings":[{"def":"public discussion and argument about something that many people strongly disagree about, think is bad, or are shocked by","examples":["to arouse/cause controversy","a bitter controversy over/about the site of the new airport","The controversy surrounding his latest movie continues.","The President resigned amid considerable controversy.","Controversy exists as to how safe these drugs are.","Controversy is raging over the route of the new motorway.","He has resigned amid continuing controversy over his expense claims.","His views have excited a lively controversy among fellow scientists.","Ms Benjamin, who is no stranger to controversy herself, said the scandal could have serious repercussions.","Much controversy surrounds the new exam.","Public funding could resolve the controversy surrounding campaign finance.","The book raised a storm of controversy.","The controversy centred on the issue of compensation for the victims.","The minister has resigned amid continuing controversy over his education proposals.","The network ran into controversy over claims of faked documentary footage.","The president seemed anxious to avoid controversy about these appointments.","The singer deliberately courts controversy with his racist and sexist lyrics.","There has been a lot of controversy over the use of these drugs.","This year's championships have been dogged by controversy.","Today, the controversy continues over whether Shakespeare wrote all his plays.","What they are doing is bound to stir up controversy.","controversy among historians","controversy between the two leaders","her long-running controversy with fellow academics","the bitter controversy surrounding the introduction of the new regulations","This is a subject that always causes controversy."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]