[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcont/xcontext__us_1.mp3","phonsUS":"/ˈkɑːntekst/","level":"A2","meanings":[{"def":"the situation in which something happens and that helps you to understand it","examples":["Such databases are being used in a wide range of contexts.","to examine the wider/broader context of the war","the historical/cultural/social context","The government must consider the context of the protests.","in a context This kind of propaganda is used in many different contexts.","Institutions provide a context in which individuals can take on different roles.","in/within the context of something This speech needs to be set in the context of Britain in the 1960s.","in context His decision can only be understood in context.","I think it's important to put this into context.","context for something A ceasefire is the essential context for meaningful negotiations.","Children need meaningful contexts for their work in science.","How can teachers create the right context for kids?","It is natural to find conflict in the work environment, in the family, or any other human context.","Similar problems have arisen in other contexts.","These actions only have meaning within certain specific contexts.","You can't just look at it in terms of the immediate problem. You've got to see it in a wider context.","You have to look at these remarks within the context of the recent scandals.","You have to see the problem in a wider context.","a neutral context for sharing and debating ideas"],"opposite":"","synonyms":""},{"def":"the words that come just before and after a word, phrase or statement and help you to understand its meaning","examples":["You should be able to guess the meaning of the word from the context.","The context of the quotation makes her meaning quite clear.","out of context This quotation has been taken out of context (= repeated without referring to the rest of the text).","in context You need to look at the words in context.","to present examples of language in use in an appropriate context","Her reply was quoted out of context and seemed to mean something quite different from what she had intended."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["keyword in context"]}]