[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcont/xcontrol__us_3.mp3","phonsUS":"/kənˈtrəʊl/","level":"A2","meanings":[{"def":"the power to make decisions about how a country, an area, an organization, etc. is run","examples":["control of somebody/something The party expects to gain control of the council in the next election.","Militants have taken control of the town.","The Democrats have lost control of Congress.","A military junta seized control of the country.","The founders eventually regained control of the company.","control over somebody/something He defended the tradition of civilian control over the military.","in the control of somebody/something The city is in the control of enemy forces.","under… control The area remains under international control.","Editors do not exercise control over large sections of their newspapers.","Enemy forces have now regained control of the area.","He wants to hand over control of social security to the private sector.","Parking is outside my control.","The department was under the control of Bryce Thompson.","The idea is to give councils full control of their own budgets.","They have little control over that side of the business.","attempts to wrest control of the town from government forces","government plans to centralize control of schools","The family has sold most of its shares and will lose control of the company.","The city is under enemy control."],"opposite":"","synonyms":""},{"def":"the ability to make somebody/something do what you want","examples":["control over somebody/something The teacher had no control over the children.","He fought hard to retain control over his work.","control of something She struggled to keep control of her voice.","She lost control of her car on the ice.","He got so angry he lost control (= shouted and said or did things he would not normally do).","beyond/outside somebody's control Owing to circumstances beyond our control, the flight to Rome has been cancelled.","under control The situation is under control.","The coach made the team work hard on ball control (= in a ball game).","The aim is to give people more control over their own lives.","He lost control of the car when he swerved to avoid a bicycle.","The event has been cancelled due to circumstances beyond our control."],"opposite":"","synonyms":""},{"def":"the act of limiting or managing something; a method of doing this","examples":["traffic control","talks on arms control","controls on something tight controls on government spending","Price controls on food were ended.","control of something exciting advances in the control of malaria","state control of the economy","It was an exercise in damage control (= trying to prevent further damage).","A pest control officer was called in to deal with the rat problem.","The EU has set strict limits on pollution levels.","the speed limit","There are no restrictions on the amount of money you can withdraw.","arms control","We have to work within severe constraints of time and money.","The government has imposed export restraints on some products.","The unions are unlikely to accept any sort of wage restraint.","They would resist any limitation of their powers.","calls for tougher export controls","Many teenagers have poor impulse control.","plans to relax price controls","the water pressure control valve","They have introduced controls on public spending.","The government has imposed strict controls on new building.","The country has tightened its border controls.","New crime control measures have failed.","The police are experts in crowd control.","A new advance has been made in the control of malaria.","government controls on trade and industry"],"opposite":"","synonyms":"limit"},{"def":"the switches and buttons, etc. that you use to operate a machine or a vehicle","examples":["the controls of an aircraft","the control panel","the volume control of a TV","at the controls The co-pilot was at the controls when the plane landed.","Chief Air Officer Sedley was at the controls of the Boeing 707.","Once we were in the air, I was allowed to take the controls.","a programmable control unit"],"opposite":"","synonyms":""},{"def":"a person, thing or group used as a standard of comparison for checking the results of a scientific experiment; an experiment whose result is known, used for checking working methods","examples":["The study showed that women with the disease have had fewer children than the controls.","One group was treated with the new drug, and the control group was given a sugar pill."],"opposite":"","synonyms":""},{"def":"a place where orders are given or where checks are made; the people who work in this place","examples":["We went through passport control and into the departure lounge."],"opposite":"","synonyms":""},{"def":"(on a computer keyboard) a key that you press when you want to perform a particular operation","examples":[],"opposite":"","synonyms":""},{"def":"to direct or manage an organization, an area or a situation","examples":["He's reached retiring age, but he's still firmly in control.","There has been some violence after the match, but the police are now in control of the situation.","The elected government is back in control."],"opposite":"","synonyms":""},{"def":"to be able to organize your life well and keep calm","examples":["In spite of all her family problems, she's really in control."],"opposite":"","synonyms":""},{"def":"to be or become impossible to manage or to control","examples":["The children are completely out of control since their father left.","A truck ran out of control on the hill.","The car went out of control on the icy road.","I had this feeling that things were out of control."],"opposite":"","synonyms":""},{"def":"to be being dealt with successfully","examples":["Don't worry—everything's under control!"],"opposite":"","synonyms":""},{"def":"to succeed in dealing with something so that it does not cause any damage or hurt anyone","examples":["It took two hours to bring the fire under control.","Please keep your dog under control!","They soon got the situation under control.","Weeds should be kept under strict control."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be in control (of something)","def":"to direct or manage an organization, an area or a situation","examples":["He's reached retiring age, but he's still firmly in control.","There has been some violence after the match, but the police are now in control of the situation.","The elected government is back in control.","In spite of all her family problems, she's really in control."]},{"idiom":"be/get/run/etc. out of control","def":"to be or become impossible to manage or to control","examples":["The children are completely out of control since their father left.","A truck ran out of control on the hill.","The car went out of control on the icy road.","I had this feeling that things were out of control."]},{"idiom":"be under control","def":"to be being dealt with successfully","examples":["Don't worry—everything's under control!"]},{"idiom":"bring/get/keep something under control","def":"to succeed in dealing with something so that it does not cause any damage or hurt anyone","examples":["It took two hours to bring the fire under control.","Please keep your dog under control!","They soon got the situation under control.","Weeds should be kept under strict control."]}],"phrasal":[],"related":["gun control","arms control","birth control","control freak","control room","control tower","dual control","self-control","climate control","control centre","cruise control","ground control","Mission Control","parental control","quality control","remote control","air traffic control","animal control officer","Centers for Disease Control and Prevention"]},{"pos":"verb","level":"A2","meanings":[{"def":"to have power over a person, company, country, etc. so that you are able to decide what they must do or how it is run","examples":["By the age of 21 he controlled the company.","The whole territory is now controlled by the army.","Can't you control your children?","a multinational company based in Britain but controlled from South Africa","We want to control our own destiny (= decide what happens to us).","attempts by corporations to control access to information","Each school is controlled by a Board of Governors.","Government forces have proved incapable of controlling the rebels.","It is a multi-national company based in Britain but controlled from South Africa.","Mounted police had been called to control the crowds.","The National Bank is directly controlled by the government.","The clubs were found guilty of failing to control their fans."],"opposite":"","synonyms":""},{"def":"to limit something or make it happen in a particular way","examples":["control something It is essential for businesses to control costs.","government attempts to control immigration","Local industries were tightly controlled.","Many biological processes are controlled by hormones.","Try to control your breathing.","They built a reservoir to control the flow of water.","control what/how, etc… Parents should control what their kids watch on television.","Conditions in the greenhouse are carefully controlled.","Expenditure within the company is tightly controlled.","The government has announced new measures to control immigration","This government has failed to control inflation.","Time out is an effective way of controlling aggressive behaviour.","In many countries the production of the drug is illegal or tightly controlled."],"opposite":"","synonyms":""},{"def":"to stop something from spreading or getting worse","examples":["control something Firefighters are still trying to control the blaze.","to control a disease","She was given drugs to control the pain.","control something with something Most of the symptoms can be controlled with medication.","Symptoms can be controlled in most patients.","His diabetes can be controlled by diet.","He had an emergency operation in which surgeons attempted to control the bleeding."],"opposite":"","synonyms":""},{"def":"to make something such as a machine or system work in the way that you want it to","examples":["control something This knob controls the volume.","The traffic lights are controlled by a central computer.","The entrance gates are electronically controlled.","control something with something lighting that you can control with your smartphone","control something via something The thermostat can be controlled via an app.","control something from something toys that can be controlled from your mobile device","The shutters can be electronically controlled.","You can easily control the speed of the fan."],"opposite":"","synonyms":""},{"def":"to manage to make yourself remain calm, even though you are upset or angry","examples":["control yourself I was so angry I couldn't control myself.","control something He was finding it difficult to control his feelings.","You can learn to control your emotions.","She was struggling to control her temper.","The clerk could scarcely control his excitement.","He was finding it hard to control his feelings.","I was so furious I couldn't control myself and I hit him."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]