[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcont/xcontinue__us_1.mp3","phonsUS":"/kənˈtɪnjuː/","level":"A2","meanings":[{"def":"to keep existing or happening without stopping","examples":["If the current trend continues, that number will increase 165 per cent by 2050.","Police have not yet made any arrests, but investigations continue.","+ adv./prep. The exhibition continues until 25 July.","Fighting continued for four years.","The rain will continue into the evening.","Unions declared that the strike would continue indefinitely.","Life continued on as normal.","Work continues apace on the second phase of the development.","The tradition continues to this day.","+ adj. The violence continues unabated.","continue to do something The economy is continuing to grow.","The number of car accident deaths is continuing to decline.","Costs continued to rise.","The rain continued to fall all afternoon.","continue doing something The rain continued falling all afternoon.","The process continued throughout the day.","Work continued until nightfall.","The trial is expected to continue for three months.","Work on the new road is expected to continue for another two months."],"opposite":"","synonyms":""},{"def":"to keep doing something without stopping","examples":["continue doing something She wanted to continue working until she was 60.","He vowed to continue fighting.","continue to do something We will continue to work closely with our international partners on this.","He continued to ignore everything I was saying.","continue something to continue a tradition/trend","The board of inquiry is continuing its investigations.","An estimated 2 per cent of the population continue their education beyond secondary school.","She moved to New York to continue her studies.","He continued his work in secret.","His mother vowed to continue her fight for justice.","continue (with something) Are you going to continue with the project?","At the age of 70 she still runs 5 kilometres every day and intends to continue for as long as she can.","We need your support to enable us to continue with our work.","She wanted to continue working after the baby was born.","The council has voted to continue using pesticides in public parks.","The orchestra continues its policy of commissioning major new works.","Both governments will continue efforts to iron out their political differences.","Please continue with the work you were doing before."],"opposite":"","synonyms":""},{"def":"to go or move further in the same direction","examples":["The rough track continues, but it quickly disappears into undergrowth.","+ adv./prep. The path continued over rough, rocky ground.","He continued on his way.","The road continues through the village of Knightwick."],"opposite":"","synonyms":""},{"def":"to remain in a particular job or condition","examples":["She will continue in her present job until a replacement can be found.","continue as something I want you to continue as project manager."],"opposite":"","synonyms":""},{"def":"to start or start something again after stopping for a time","examples":["The story continues in our next issue.","continue something They had to continue their journey on foot.","We shall continue our discussion of retailing in Chapter 7.","The story will be continued in our next issue."],"opposite":"","synonyms":""},{"def":"to start speaking again after stopping","examples":["Please continue—I didn't mean to interrupt.","continue something She simply turned her back to me and continued her phone conversation.","+ speech ‘In fact,’ he continued, ‘I'd like to congratulate you.’"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]