[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xcont/xcontact__us_1.mp3","phonsUS":"/ˈkɑːntækt/","level":"B1","meanings":[{"def":"the act of communicating with somebody, especially regularly","examples":["contact with somebody I don't have much contact with my uncle.","We've been unable to establish radio contact with the pilot.","She's lost contact with (= no longer sees or writes to) her son.","I finally made contact with (= succeeded in speaking to or meeting) her in Paris.","contact between A and B There is little contact between the two organizations.","in contact We're no longer in regular contact.","in contact with somebody The Foreign Office is currently in close contact with the Indian authorities.","Have you kept in contact with any of your friends from college (= do you still see them or speak or write to them)?","The organization put me in contact with other people in a similar position (= gave me their addresses or phone numbers).","Anyone with any information about the incident is asked to get in contact with the police (= phone them or go to see them).","two people avoiding eye contact (= avoiding looking directly at each other)","Please ensure we have your contact number (= phone number) in case we need to reschedule.","I'll give you my contact details (= phone number, email address, etc.)","The society's website provides contact information.","Here's my contact number while I'm away.","He carefully avoided eye contact.","You should make contact with them by email before you call.","Have you had any direct contact with the director of the company?","He never makes eye contact with me.","I put my cousin in contact with a friend who works at the company.","I have very little contact with Simon now.","Let's try to stay in contact!","Maintaining contact after many years can be difficult.","She is still in close contact with Sarah.","She was deprived of all human contact for three weeks.","There has been no contact between them for several years.","When I arrive Delhi I'll get in contact with him.","We first established contact with the organization in 1999."],"opposite":"","synonyms":""},{"def":"the state of meeting somebody or having to deal with something","examples":["contact with somebody/something She always avoided contact with the press.","in contact with somebody/something He'd prefer a job where he doesn't have to be in direct contact with the public.","In her job she often comes into contact with (= meets) lawyers.","Children should be brought into contact with poetry at an early age."],"opposite":"","synonyms":""},{"def":"an occasion on which you meet or communicate with somebody; a relationship with somebody","examples":["Even the US, which has no embassy there, is beginning to forge contacts.","contact with somebody We have good contacts with the local community.","The company has maintained trade contacts with India."],"opposite":"","synonyms":""},{"def":"a person that you know, especially somebody who can be helpful to you in your work","examples":["social/personal contacts","I've made some useful contacts in journalism.","She has several contacts in New York.","He has a contact at the White House.","He has a lot of good contacts in the music industry.","He used his contacts to get his son a publishing job.","I made a lot of useful business contacts at the conference.","It takes time to build up contacts."],"opposite":"","synonyms":""},{"def":"the state of touching something","examples":["a fear of physical contact","The disease is spread by contact.","infections transmitted through sexual contact","in contact with something His fingers were briefly in contact with the ball.","This substance should not come into contact with food.","on contact This pesticide kills insects on contact (= as soon as it touches them).","on contact with something This chemical is liable to explode on contact with water.","contact of something + adv./prep. She blushed at the sudden contact of his hand against her arm.","The disease is transmitted through physical contact.","For a brief moment their lips were in contact.","The light will go out on contact with water.","There should be no contact between the separate samples."],"opposite":"","synonyms":""},{"def":"an electrical connection","examples":["The switches close the contacts and complete the circuit."],"opposite":"","synonyms":""},{"def":"a contact lens (= a small round piece of thin plastic that you put on your eye to help you see better)","examples":[],"opposite":"","synonyms":""},{"def":"a person who has recently been near to somebody with a contagious disease and so might have caught the infection from them","examples":[],"opposite":"","synonyms":""},{"def":"a place where you go or a person that you speak to when you are dealing with an organization","examples":["The receptionist is the first point of contact most people have with the clinic."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"point of contact","def":"a place where you go or a person that you speak to when you are dealing with an organization","examples":["The receptionist is the first point of contact most people have with the clinic."]}],"phrasal":[],"related":["contact lens","contact sport","contact tracer","contact tracing","contact improvisation","non-contact sport","contact lenses","contact sports"]},{"pos":"verb","level":"B1","meanings":[{"def":"to communicate with somebody, for example by phone, letter or email","examples":["I've been trying to contact you all day.","Witnesses to the accident are asked to contact the police.","Anyone interested is requested to contact a member of the committee.","contact somebody/something for something For further information, contact your local careers office.","contact somebody/something on something (British English) He can be contacted on 01865…","contact somebody/something at something (North American English) He can be contacted at 212…","contact somebody/something by something Anyone with tickets will be contacted by phone, letter or email and offered a full refund.","He can be contacted by phone on the number given below.","Please do not hesitate to contact me if you have any questions."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]