[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xconv/xconvert__us_1.mp3","phonsUS":"/kənˈvɜːrt/","level":"B2","meanings":[{"def":"to change or make something change from one form, purpose, system, etc. to another","examples":["convert something They took just nine months to convert the building.","You need to ensure that you've converted the data properly.","The pub is a converted warehouse.","convert something into something The hotel is going to be converted into a nursing home.","What rate will I get if I convert my dollars into euros?","convert something to something The system is eco-friendly because the waste heat is converted to electricity.","convert from something Japan was at the time still converting from an agricultural economy.","convert into/to something A lot of conventional farmers have converted to organic production.","convert from something to something We've converted from oil to gas central heating.","They live in a converted mill.","to convert securities into shares"],"opposite":"","synonyms":""},{"def":"to be able to be changed from one form, purpose, or system to another","examples":["a sofa that converts into a bed","In fruits, starch converts into sugar."],"opposite":"","synonyms":""},{"def":"to change your religion or beliefs; to make somebody change their religion or beliefs","examples":["convert from something He converted from Catholicism 20 years ago.","convert to something She converted to Judaism to marry him.","convert from something to something He converted from Christianity to Islam.","convert somebody from something Evangelical Christian groups tried to convert local people from their indigenous religions.","convert somebody to something She was soon converted to the socialist cause.","convert somebody from something to something Mongolia was converted from shamanism to Buddhism in the late 16th century."],"opposite":"","synonyms":""},{"def":"to change an opinion, a habit, etc.","examples":["convert (from something) to something I've converted to organic food.","convert somebody (from something) (to something) I didn't use to like opera but my husband has converted me.","The Prime Minister was in favour of the idea but he never managed to convert the party.","I've never liked opera but you might convert me!"],"opposite":"","synonyms":""},{"def":"to score extra points after a try or a touchdown","examples":[],"opposite":"","synonyms":""},{"def":"to speak to people in support of views that they already hold","examples":["I realize I may be preaching to the converted, but I think he's gorgeous."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"preach to the converted","def":"to speak to people in support of views that they already hold","examples":["I realize I may be preaching to the converted, but I think he's gorgeous."]}],"phrasal":[],"related":[]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xconv/xconvert__us_2.mp3","phonsUS":"/ˈkɑːnvɜːrt/","level":"","meanings":[{"def":"a person who has changed their religion, beliefs or opinions","examples":["a convert to Islam","converts from other faiths","a convert to the cause","Pope Clement was a convert from paganism.","a recent convert to Catholicism","an attempt to gain converts to Communism"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]