[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xconv/xconviction__us_1.mp3","phonsUS":"/kənˈvɪkʃn/","level":"C1","meanings":[{"def":"the act of finding somebody guilty of a crime in court; the fact of having been found guilty","examples":["He plans to appeal against his conviction.","conviction for something She has six previous convictions for theft.","on conviction an offence that carries, on conviction, a sentence of not more than five years’ imprisonment","A reward is offered for information leading to the conviction of the attacker.","He appealed against his conviction for murder.","He believes that too many defendants are escaping conviction by claiming that they are insane.","He has three criminal convictions.","Her lawyer said that she plans to appeal her conviction.","His sentence on conviction would be life imprisonment.","Keeping this information from the jury could result in a wrongful conviction.","The appeal court overturned the conviction against her.","The conviction rate for rape is extremely low.","The men's convictions were declared unsafe.","They need strong evidence to secure a conviction.","You are not obliged to acknowledge spent convictions.","a conviction based on very slim evidence","a conviction for murder"],"opposite":"acquittal","synonyms":""},{"def":"a strong opinion or belief","examples":["strong political/moral convictions","She was motivated by deep religious conviction.","conviction that… We were sustained by the conviction that all would be well in the end.","The new party is based on the firm conviction that secular government is in the interests of all.","Judges should not let their personal moral convictions influence sentencing.","These experiences reinforced my conviction that music helps learning.","The ex-leaders share a deep conviction that their views on world matters are still vitally important.","The demise of consensus and the rise of conviction politics.","The American Constitution reflects certain religious convictions.","She had this absolute conviction that what she liked others would like.","Nothing could shake her conviction that she could not be beaten.","Nothing could shake her conviction that ‘abroad’ was a dangerous place.","It is the firm conviction of the governors that this child should not be admitted to the school.","It is my firm conviction that nothing will change until we address the root causes of the problem.","He had a strong personal conviction about the power of the printed word."],"opposite":"","synonyms":""},{"def":"the quality of showing that you believe strongly in what you are saying","examples":["‘Not true!’ she said with conviction.","He said he agreed but his voice lacked conviction.","The leader's speech in defence of the policy didn't carry much conviction.","There was no great conviction in his voice.","Her arguments lacked conviction.","Her explanation failed to carry conviction in the face of the facts."],"opposite":"","synonyms":""},{"def":"to be/not be brave enough to do what you feel to be right","examples":["You need to have the courage of your convictions."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"have/lack the courage of your convictions","def":"to be/not be brave enough to do what you feel to be right","examples":["You need to have the courage of your convictions."]}],"phrasal":[],"related":[]}]