[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xconv/xconventional__us_1.mp3","phonsUS":"/kənˈvenʃənl/","level":"B2","meanings":[{"def":"tending to follow what is done or considered acceptable by society in general; normal and ordinary, and perhaps not very interesting","examples":["conventional behaviour/morality","She's very conventional in her views.","He turned out to be a very conventional young man.","The imagery in the poem is somewhat conventional.","They rejected what they saw as the hypocrisy of conventional society."],"opposite":"unconventional","synonyms":""},{"def":"following what is traditional or the way something has been done for a long time","examples":["conventional methods/approaches","It's not a hotel, in the conventional sense, but rather a whole village turned into a hotel.","You can use a microwave or cook it in a conventional oven.","Her face is not beautiful in conventional terms.","My sister was taught to read by more conventional methods.","Raising such a large amount of money from conventional sources would be difficult.","She had a fairly conventional start to her career."],"opposite":"unconventional","synonyms":""},{"def":"using the usual scientific methods of Western medicine such as artificial drugs and operations","examples":["conventional medicine","Conventional treatments for this condition have been only partially successful."],"opposite":"","synonyms":""},{"def":"not nuclear","examples":["conventional forces/weapons","A conventional war would still cause unacceptable devastation.","a conventional power station (= using oil or coal as fuel, rather than nuclear power)"],"opposite":"","synonyms":""},{"def":"the view or belief that most people hold","examples":["Conventional wisdom has it that riots only ever happen in cities.","Conventional wisdom has it that all sense of community has gone, but that is not the case where I live.","The received wisdom is that the book is always better than the film.","Contrary to conventional wisdom, stress is not always a bad thing.","Popular wisdom has it that higher oil prices are bad for economic growth."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"conventional/received/popular wisdom","def":"the view or belief that most people hold","examples":["Conventional wisdom has it that riots only ever happen in cities.","Conventional wisdom has it that all sense of community has gone, but that is not the case where I live.","The received wisdom is that the book is always better than the film.","Contrary to conventional wisdom, stress is not always a bad thing.","Popular wisdom has it that higher oil prices are bad for economic growth."]}],"phrasal":[],"related":[]}]