[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/x/xco/xconv/xconvention__us_1.mp3","phonsUS":"/kənˈvenʃn/","level":"B2","meanings":[{"def":"the way in which something is done that most people in a society expect and consider to be polite or the right way to do it","examples":["the rigid social conventions of Victorian Britain","She is a young woman who enjoys flouting conventions.","by convention By convention the deputy leader was always a woman.","Convention demands that a club member should resign in such a situation.","By convention, planets are named after Roman gods.","By convention, the Queen gives the Royal Assent to all measures passed by Parliament.","Convention dictated that dangerous physical action is the part of heroes, not heroines.","He had the freedom of spirit to cut through convention.","Her work refuses any concession to polite conventions of ‘good taste’.","In a surprising break with convention, she wore a red wedding dress.","Life with the Leighs was not hidebound by rules or convention.","No young politician can afford to flout convention in this way.","She knew that she had broken an important social convention.","They followed the Greek convention of pinning gifts of money to the bride's dress.","Here we decided to break with convention.","The handshake is a social convention.","They showed a refreshing disrespect for convention."],"opposite":"","synonyms":""},{"def":"a large meeting of the members of a profession, a political party, etc.","examples":["to hold a convention","the Democratic Party Convention (= to elect a candidate for president)","Dallas is one of the top convention cities in the United States.","He addressed the annual Republican convention.","She was at the Democratic convention.","journalists reporting from the convention floor","The party's annual convention will be held on April 6."],"opposite":"","synonyms":""},{"def":"an official agreement between countries or leaders","examples":["the Geneva convention","the United Nations convention on the rights of the child","Most countries have adhered to the convention.","Over 60 countries have yet to ratify the climate convention.","The convention established procedures for the transport of toxic waste.","This is forbidden under the Convention on Human Rights.","This practice breaches the arms convention.","a convention governing the conditions under which mining is permitted","the 1869 convention between Turkey and Persia","the 1951 United Nations Convention on refugees","the Berne Convention for the Conservation of European Wildlife","the UN convention against torture"],"opposite":"","synonyms":""},{"def":"a traditional method or style in literature, art or the theatre","examples":["the conventions of Greek tragedy","It's an established convention that the part is played by a woman.","The novel refuses to conform to the narrative conventions of 19th century realism.","The novel conforms to the conventions of nineteenth-century realism.","He challenged the conventions of painting."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Geneva Convention","national convention","Convention for a Democratic South Africa"]}]