[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cop/copy_/copy__us_1.mp3","phonsUS":"/ˈkɑːpi/","level":"A2","meanings":[{"def":"a thing that is made to be the same as something else, especially a document or a work of art","examples":["The thieves replaced the original painting with a copy.","copy of something a copy of a letter/report/document","a copy of a gene","to have/get/obtain/receive a copy of something","He made careful copies of all the documents he found in the library.","I will send you a copy of the report.","Copies of the article were circulated to members of the committee.","Even with the new legislation pirate copies will circulate.","I attach a copy of the report.","I don't keep copies of my own letters.","It must be certified as a true copy of the original document.","It was not the original painting, but a crude copy.","Please find enclosed a copy of the draft document.","Remember to keep copies of all your correspondence.","Take a photocopy of the master copy.","The candidate must submit two bound copies of his or her thesis.","pirated copies of the latest movie releases"],"opposite":"","synonyms":""},{"def":"a single example of a book, newspaper, etc. of which many have been made","examples":["The book sold 20 000 copies within two weeks.","to have/get/obtain/buy/order a copy","There are a limited number of copies still available.","copy of something a copy of a book","a copy of ‘The Times’","a free copy of the software","Author Bob Woodhouse will be signing copies of his new book.","Charles I's personal copy of the psalter","my battered copy of Shakespeare's plays","my own copy of ‘Beowulf’","Free copies of the leaflet are available from the Department of the Environment."],"opposite":"","synonyms":""},{"def":"written material that is to be published in a newspaper, magazine, etc.; news or information that can be used in a newspaper article or advertisement","examples":["The subeditors prepare the reporters' copy for the paper and write the headlines.","This will make great copy for the advertisement.","Copy date for the next issue is 1 May."],"opposite":"","synonyms":""},{"def":"a copy of a document, etc. made by a machine that photographs and then prints","examples":["Could I have ten copies of this page, please?","The copier had been set for multiple copies.","I ran off a couple of copies of the letter."],"opposite":"","synonyms":""},{"def":"a book used by students for writing exercises, etc. in","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["copy in","back copy","copy-edit","fair copy","hard copy","carbon copy","copy editor","copy typist","knocking copy","copy-edits","copy-edited","copy-editing","copy editors","copy typists","carbon copy (to)","blind carbon copy (to)"]},{"pos":"verb","level":"A2","meanings":[{"def":"to make something that is exactly like something else","examples":["copy something He taught himself by copying paintings in the Louvre.","The product has been widely copied by other manufacturers.","copy something from something They copied the designs from those on Greek vases."],"opposite":"","synonyms":""},{"def":"to write something exactly as it is written somewhere else","examples":["copy something The monks spent their days copying manuscripts.","copy something from something The children copied the sentences from the whiteboard.","copy something (from something) into/onto something She copied the phone number into her address book.","copy something out I copied out several poems.","copy something down You do not have to copy down every word in a lecture.","She copied all the addresses into her address book.","I copied down several phone numbers from the list.","He copied all the details from the brochure onto a piece of paper.","They laboriously copied out manuscripts.","copying a recipe off the packet","laboriously copying out an old manuscript"],"opposite":"","synonyms":""},{"def":"to create an identical (= similar in every detail) version of data, a program, etc. so that you can use it again somewhere else","examples":["copy something The software has been illegally copied.","copy something to something You can copy the data to your new laptop in the usual way.","You can copy the selected text to the clipboard.","copy something into/onto something All the files were copied onto memory sticks.","copy something from something Use the clipboard to copy and paste information from websites.","copy something from something into/onto something She copied all the addresses from the website into her address book."],"opposite":"","synonyms":""},{"def":"to behave or do something in the same way as somebody else","examples":["She copies everything her sister does.","Their tactics have been copied by other terrorist organizations.","He was just a little kid copying his idol.","She slavishly copies the older girl's style.","He copied that mannerism from his brother."],"opposite":"","synonyms":""},{"def":"to cheat in an exam, school work, etc. by writing what somebody else has written and pretending it is your own work","examples":["He was punished by his teacher for copying in the exam.","copy from/off somebody She was caught copying off another student.","copy something Copying other students' work is not acceptable."],"opposite":"","synonyms":""},{"def":"to make a photocopy of something","examples":["Finally, the notes can be copied and distributed to the audience."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["copy in"],"related":[]}]