[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cor/core_/core__us_1.mp3","phonsUS":"/kɔːr/","level":"B2","meanings":[{"def":"the most important or central part of something","examples":["This report goes to the core of the argument.","Dutch paintings form the core of the collection.","at the core of something Concern for the environment is at the core of our policies.","Our need for love lies at the very core of our being.","She claimed the original six countries of the EU constituted an inner core within the larger union.","None of the characters really gives the film an emotional core.","A new spirit welled up from the very core of the nation.","At the core of our convictions is belief in individual liberty.","There was a hollow core of sadness inside me.","These ideas formed the core of his philosophy.","This is seen as the central core of the government's policy.","We want to get to the core of the problem.","a common core of shared understanding about law and government","the emotional core of her music","This was a man he detested from the core of his heart."],"opposite":"","synonyms":""},{"def":"the central part of an object","examples":["the earth’s core","the core of a nuclear reactor","The standards of housing and education are often lower in the older urban cores (= the centres of towns or cities).","heat from the earth's core","Each fibre has a hollow core trapping still air and aiding warmth."],"opposite":"","synonyms":""},{"def":"the hard central part of a fruit such as an apple, that contains the seeds","examples":["an apple core"],"opposite":"","synonyms":""},{"def":"the muscles of the lower back and stomach area which help you to maintain good balance, etc.","examples":["Your posture will improve as your core becomes stronger."],"opposite":"","synonyms":""},{"def":"a small group of people who take part in a particular activity","examples":["He gathered a small core of advisers around him."],"opposite":"","synonyms":""},{"def":"so that the whole of a thing or a person is affected","examples":["She was shaken to the core by the news.","He's a politician to the core (= in all his attitudes and actions)."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"to the core","def":"so that the whole of a thing or a person is affected","examples":["She was shaken to the core by the news.","He's a politician to the core (= in all his attitudes and actions)."]}],"phrasal":[],"related":["CORE","non-core","hard core","hard-core","soft-core","Common Core","Common Core Standards"]},{"pos":"adjective","level":"B2","meanings":[{"def":"most important; main or essential","examples":["core subjects (= subjects that all the students have to study) such as English and mathematics","the core curriculum","We need to concentrate on our core business.","The government's proposed solution fails to address the core issue.","core to something The use of new technology is core to our strategy.","the core area of management studies","What are the core activities of the job?","Maths, English and science are the core subjects.","We need to stop this expansion and concentrate on the core business.","Students study five core subjects."],"opposite":"","synonyms":""},{"def":"used to describe the most important or central beliefs, etc. of a person or group","examples":["core beliefs/principles","The party is losing touch with its core values."],"opposite":"","synonyms":""},{"def":"used to describe the most important members of a group","examples":["The team is built around a core group of players."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to take out the core of a fruit","examples":["You need four cooking apples, cored and sliced."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cor/core_/core_1_us_1.mp3","level":"","meanings":[{"def":"Congress of Racial Equality","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]