[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cor/corne/corner__us_1.mp3","phonsUS":"/ˈkɔːrnər/","level":"A2","meanings":[{"def":"a part of something where two or more sides, lines or edges join","examples":["the four corners of a square","I hit my knee on the corner of the table.","Write your address in the top right-hand corner of the letter.","the left/right corner","the north-west/north-east/south-east/south-west corner","A smile lifted the corner of his mouth.","in the corner of something a speck of dirt in the corner of her eye","He scored with a shot into the bottom corner of the goal.","She tucked the ball into the corner of the net.","He parked in the far corner of the car park.","Smooth rounded corners make cleaning easier.","the four corners of his bed"],"opposite":"","synonyms":""},{"def":"with the number of corners mentioned; involving the number of groups mentioned","examples":["a three-cornered hat","a three-cornered fight"],"opposite":"","synonyms":""},{"def":"the place inside a room or a box where two sides join; the area around this place","examples":["A large desk occupies another corner of the room.","He found a quiet corner and got on with his work.","in the corner They made straight for the table in the corner.","in the corner of something She spotted him sitting in the corner of the bar.","We found an empty booth in a dark corner of the pub.","There was a television in the far corner of the bedroom.","a corner table/seat/cupboard","He took a seat in the far corner of the cafe.","Make sure the staircase is well lit, with no awkward corners.","She sat in a dark corner of the room.","She tucked herself away in a corner and read all day.","The box had been tucked away in an odd corner of the attic.","The waiter led us to a corner table.","They chose a table right in the corner of the restaurant."],"opposite":"","synonyms":""},{"def":"a place where two streets join","examples":["The wind hit him as he turned the corner.","corner of A and B the last house before the corner of Beach Road and Hill Avenue","on the corner There was a group of youths standing on the street corner.","on the corner of something There’s a hotel on the corner of my street.","at the corner (of something) Turn right at the corner of Sunset and Crescent Heights Boulevards.","around/round the corner The bus stop is around the corner, I think.","around/round the corner from something the bookshop around the corner from our hotel","(at the) corner with something the big tree at the corner with Hill Street","the bank on the corner of Mount Street","at the corner of West Street and Park Street","Turn right at the first corner.","There were a lot of young men hanging about on street corners."],"opposite":"","synonyms":""},{"def":"a sharp bend in a road","examples":["The car was taking the corners too fast.","I hate coming out of that lane because it's a blind corner.","It's a rather sharp corner and she took it a little too fast.","As they turned the corner all the bags slid to one side."],"opposite":"","synonyms":""},{"def":"a region or an area of a place (sometimes used for one that is far away or difficult to reach)","examples":["She lives in a quiet corner of rural Yorkshire.","Students come here from the four corners of the world.","He knew every corner of the old town.","Welcome to our little corner of Philadelphia.","a cool shady corner of the garden","a remote corner of Afghanistan","He pushed the thought back into the darkest corner of his mind."],"opposite":"","synonyms":""},{"def":"a difficult situation","examples":["to back/drive/force somebody into a corner","They had got her in a corner, and there wasn't much she could do about it.","He was used to talking his way out of tight corners.","It is important to avoid being pushed into a corner.","He had her backed into a corner a couple of times with new facts she didn't know.","I'm in a bit of a corner over finding staff for Friday evening.","He was used to having to talk his way out of tight corners."],"opposite":"","synonyms":""},{"def":"a free kick or hit that you take from the corner of your opponent’s end of the field","examples":["Moore took the corner.","The referee awarded a corner.","Sancho took the corner and Kane headed it into the net.","He put the goalkeeper under pressure and managed to force a corner.","James blocked the shot but conceded a corner."],"opposite":"","synonyms":""},{"def":"any of the four corners of a ring; the supporters who help in the corner","examples":[],"opposite":"","synonyms":""},{"def":"very near","examples":["Her house is just around the corner.","(figurative) There were good times around the corner (= they would soon come)."],"opposite":"","synonyms":""},{"def":"to support and encourage somebody; to have somebody who supports and encourages you","examples":["He's been in my corner all these years and I can never thank him enough."],"opposite":"","synonyms":""},{"def":"to go across the corner of an area and not around the sides of it, because it is quicker","examples":["There’s a worn patch on the grass because everyone cuts (off) the corner."],"opposite":"","synonyms":""},{"def":"to do something in the easiest, cheapest or quickest way, often by ignoring rules or leaving something out","examples":["To be competitive, they paid low wages and cut corners on health and safety."],"opposite":"","synonyms":""},{"def":"to defend your/somebody’s position against other people","examples":[],"opposite":"","synonyms":""},{"def":"to like somebody/something","examples":["She's always had a soft corner for you."],"opposite":"","synonyms":""},{"def":"in a difficult situation","examples":["The captain's knee injury leaves the team in a tight corner.","She’ll always help if you’re in a tight spot."],"opposite":"","synonyms":""},{"def":"in a difficult situation","examples":["She’ll always help you if you’re in a spot.","This could put the banks in a tight spot.","The captain's knee injury leaves the team in a tight corner."],"opposite":"","synonyms":""},{"def":"to see something by accident or not very clearly because you see it from the side of your eye and are not looking straight at it","examples":["Out of the corner of her eye, she saw him coming closer."],"opposite":"","synonyms":""},{"def":"to pass a very important point in an illness or a difficult situation and begin to improve","examples":["The country's economy has finally turned the corner."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"(just) around/round the corner","def":"very near","examples":["Her house is just around the corner.","(figurative) There were good times around the corner (= they would soon come)."]},{"idiom":"be in somebody's corner | have somebody in your corner","def":"to support and encourage somebody; to have somebody who supports and encourages you","examples":["He's been in my corner all these years and I can never thank him enough."]},{"idiom":"cut the corner","def":"to go across the corner of an area and not around the sides of it, because it is quicker","examples":["There’s a worn patch on the grass because everyone cuts (off) the corner."]},{"idiom":"cut corners","def":"to do something in the easiest, cheapest or quickest way, often by ignoring rules or leaving something out","examples":["To be competitive, they paid low wages and cut corners on health and safety."]},{"idiom":"fight your/somebody’s corner","def":"to defend your/somebody’s position against other people","examples":[]},{"idiom":"have a soft corner for somebody/something","def":"to like somebody/something","examples":["She's always had a soft corner for you."]},{"idiom":"in a (tight) corner/spot","def":"in a difficult situation","examples":["The captain's knee injury leaves the team in a tight corner.","She’ll always help if you’re in a tight spot."]},{"idiom":"in a (tight) spot/corner","def":"in a difficult situation","examples":["She’ll always help you if you’re in a spot.","This could put the banks in a tight spot.","The captain's knee injury leaves the team in a tight corner."]},{"idiom":"see something out of the corner of your eye","def":"to see something by accident or not very clearly because you see it from the side of your eye and are not looking straight at it","examples":["Out of the corner of her eye, she saw him coming closer."]},{"idiom":"turn the corner","def":"to pass a very important point in an illness or a difficult situation and begin to improve","examples":["The country's economy has finally turned the corner."]}],"phrasal":[],"related":["corner kick","corner shop","Poets' Corner","Speakers' Corner","catty-corner(ed)","hole-and-corner","kitty-corner(ed)","corner kicks","corner shops","every nook and corner","have a soft corner for somebody/something","in a tight corner"]},{"pos":"verb","level":"","meanings":[{"def":"to get a person or an animal into a place or situation from which they cannot escape","examples":["The man was finally cornered by police in a garage.","If cornered, the snake will defend itself."],"opposite":"","synonyms":""},{"def":"to go towards somebody in a determined way, because you want to speak to them","examples":["I found myself cornered by her on the stairs."],"opposite":"","synonyms":""},{"def":"to get control of the trade in a particular type of goods","examples":["They've cornered the market in silver.","The firm has cornered the UK computer market.","He made his millions by cornering the estate-agency business in the town."],"opposite":"","synonyms":""},{"def":"to go around a corner","examples":["The car corners well (= it is easy to go around corners in it)."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]