[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cor/corre/correspondence__us_1_rr.mp3","phonsUS":"/ˌkɔːrəˈspɑːndəns/","level":"C1","meanings":[{"def":"the letters, emails, etc. a person sends and receives","examples":["personal/private correspondence","The editor welcomes correspondence from readers on any subject.","the correspondence column/page (= in a newspaper)","correspondence with somebody Jane Austen's correspondence with her sister","He was leafing through piles of correspondence.","I have seen the correspondence between the company and the college.","Numerous items of correspondence have been received on this subject.","Please send correspondence to ‘Money Monthly’.","The department intercepted the correspondence of foreign diplomats.","The secretary deals with all the correspondence.","copies of her correspondence with the composer","files full of confidential correspondence relating to the company's expansion plans","the correspondence columns of the ‘London Review of Books’"],"opposite":"","synonyms":""},{"def":"the activity of writing letters","examples":["correspondence (with somebody) I refused to enter into any correspondence (= to exchange letters) with him about it.","in correspondence We have been in correspondence for months.","We kept up a correspondence for many years.","I have been in correspondence with the manager of the store.","I have had correspondence with the company director on this matter.","I would spend the time reading or catching up on my correspondence.","It would be foolish for a doctor to enter into correspondence with a patient.","a lively correspondence in ‘The Times’ about ways of preparing tripe"],"opposite":"","synonyms":""},{"def":"a connection between two things; the fact of two things being similar","examples":["There is a close correspondence between the two extracts.","The child can see the one-to-one correspondence of the buttons and buttonholes.","a close correspondence between theory and practice"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["correspondence course","correspondence courses"]}]