[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cor/corre/correct__us_1.mp3","phonsUS":"/kəˈrekt/","level":"A1","meanings":[{"def":"accurate or true, without any mistakes","examples":["Do you have the correct time?","the correct answer","When asked to pick the correct meaning from four alternatives, students consistently chose the correct one.","Please check that these details are correct.","‘Are you in charge here?’ ‘That's correct.’","As always, your grandmother is absolutely correct.","correct in something They were correct in their assessment of the situation.","correct in doing something Am I correct in saying that you know a lot about wine?","it is correct to do something It is correct to say that Camus's philosophy can be divided into two periods.","it is correct (that)… It is correct that there are some similarities between the two cases.","Are the following statements true or false?","Is it true (that) she’s leaving?","I got about half the answers right.","What’s the right time?","Only one of the answers is correct.","Check that all the details are correct.","His estimate has turned out to be more or less correct.","His first idea proved correct.","I think I am correct in saying that this project is the first of its kind in this country.","None of the explanations offered is demonstrably correct—or demonstrably incorrect.","The diagram is correct in every detail.","The flower drawings are all to scale and botanically correct.","The sentence is grammatically correct, but not very idiomatic.","What you say is perfectly correct, but it gives the wrong impression.","Am I correct in thinking that you know a lot about wine?","Check that all the details are correct.","I don't think she's correct to say he's incompetent.","Only one of the answers is correct.","They say that he was against women getting the vote, but that's not entirely correct."],"opposite":"incorrect","synonyms":"true"},{"def":"right and suitable, so that something is done as it should be done","examples":["the correct procedure/approach","Do you know the correct way to shut the machine down?","I think you've made the correct decision.","You’re right to be cautious.","You made the right decision.","‘It’s not easy.’ ‘Yes, you’re right.’","What’s the correct way to shut the machine down?","I don’t think she’s correct to say he’s incompetent."],"opposite":"","synonyms":"right"},{"def":"taking care to speak or behave in a way that follows the accepted standards or rules","examples":["a correct young lady","He is always very correct in his speech."],"opposite":"incorrect","synonyms":""},{"def":"used to say that all the things or people who should be there are now there","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"all present and correct","def":"used to say that all the things or people who should be there are now there","examples":[]}],"phrasal":[],"related":["politically correct"]},{"pos":"verb","level":"A1","meanings":[{"def":"to make something right or accurate, for example by changing it or removing mistakes","examples":["correct something to correct an error","Read through your work and correct any mistakes that you find.","I thought we had corrected the problem.","Their eyesight can be corrected in just a few minutes by the use of a laser.","They issued a statement correcting the one they had made earlier.","correct yourself He stopped and corrected himself. ‘I mean fifteen, not fifty.’","correct something for something The data were corrected for differences in age.","At this stage you should be able to correct at least some of your own mistakes.","I'd like to correct the impression that my client has any kind of criminal record.","Minor problems with eyesight can now be corrected in a few seconds.","They issued a statement correcting what they had said earlier."],"opposite":"","synonyms":""},{"def":"to mark the mistakes in a piece of work (and sometimes give a mark to the work)","examples":["I spent all evening correcting essays.","It's simply not true that teachers no longer correct bad spellings.","When I've corrected your assignments, I want you to write them out again."],"opposite":"","synonyms":""},{"def":"to tell somebody that they have made a mistake","examples":["correct somebody Correct me if I'm wrong, but isn't this last year's brochure?","Yes, you're right—I stand corrected (= I accept that I made a mistake).","correct somebody + speech ‘It's Yates, not Wates,’ she corrected him.","‘She's his girlfriend.’ ‘His sister,’ Ian corrected.","I'll be there at five fifteen, I mean five fifty—ten to six.","It'll be Tuesday—sorry, I meant to say Thursday.","Sorry, what I mean is, we need two handouts per person.","We can meet in the conference centre—or rather in front of the centre.","The painter—or should I say, the sculptor—was born in Padua.","It's one t and double s—no, sorry, one s and double t.","It's on the fifth floor—no, actually, it's the fourth.","Can I get two lattes and an espresso—no, scratch that—three lattes?","There are three items on tonight's agenda. Correction, four items."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]