[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cor/corri/corridor__us_1_rr.mp3","phonsUS":"/ˈkɔːrɪdɔːr/","level":"B2","meanings":[{"def":"a long narrow passage in a building, with doors that open into rooms on either side","examples":["His room is along the corridor.","It was interesting to walk the corridors of my old school.","Narrow corridors lead off from the main hallway.","Portraits line the corridors of the palace.","She led us through a maze of hotel corridors to our room.","The corridor links the old part of the hospital with the new.","The corridor runs down the middle of the building.","The office is just down the corridor on the left.","a corridor that leads to the kitchen","the labyrinthine corridors of the building","Go along the corridor, turn left, and you'll see his office in front of you."],"opposite":"","synonyms":""},{"def":"a long narrow piece of land belonging to one country that passes through the land of another country; a part of the sky over a country that planes, for example from another country, can fly through","examples":["UN troops will secure the land corridor so that food supplies can reach the trapped civilians."],"opposite":"","synonyms":""},{"def":"a long narrow piece of land that follows the course of an important road or river","examples":["the electronics industry in the M4 corridor","a now-submerged land corridor between northern Africa and southern Europe"],"opposite":"","synonyms":""},{"def":"a passage along the side of some railway trains, from which doors lead into separate compartments","examples":[],"opposite":"","synonyms":""},{"def":"the higher levels of government, where important decisions are made","examples":["She had considerable influence in the corridors of power.","She was a minister with considerable influence in the corridors of power."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the corridors of power","def":"the higher levels of government, where important decisions are made","examples":["She had considerable influence in the corridors of power.","She was a minister with considerable influence in the corridors of power."]}],"phrasal":[],"related":["air corridor"]}]