[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cos/cost_/cost__us_1.mp3","phonsUS":"/kɔːst/","level":"A1","meanings":[{"def":"the amount of money that you need in order to buy, make or do something","examples":["cost of something the high/low cost of housing","at a cost of something A new computer system has been installed at a cost of £80 000.","You could buy a used car at a fraction of the cost of a new one.","We did not even make enough money to cover the cost of the food.","Consumers will have to bear the full cost of these pay increases.","The plan had to be abandoned on grounds of cost.","cost to somebody The total cost to you (= the amount you have to pay) is £3 000.","cost for somebody/something Energy is a major cost for businesses.","He estimates the cost for this project at $150 000.","house prices","How much are these? They don’t have a price on them.","I can’t afford it at that price.","A new computer system has been installed at a cost of £80 000.","The winner will receive a prize to the value of £1 000.","The garden was transformed at great expense.","Running a car is a big expense.","He has a personal net worth of $10 million.","A total of 3.6 million tickets at an average cost of $58 are available for the Games.","Allow €100 per day to cover the cost of meals.","Competition will drive the price down near to the marginal cost.","Contractors can now be required to carry the cost of delays.","Delegates receive allowances to meet the cost of travel.","I would put the cost of a new employee at $80 000 a year.","It is essential that we operate with the lowest possible cost base and most efficient facilities.","Now people can access the internet at minimal cost.","She was unwilling to pay the extra cost to get a room to herself.","The corporation will pay all costs and expenses incurred with its written consent.","The cost of dental treatment is increasing.","The cost of repairs would be prohibitive.","The cost to the government will be quite high.","The entire project carries a cost of $2 million.","The high cost of energy was a problem for consumers.","The hotel offers tea and coffee at no extra cost.","There were cost overruns on each project.","We're hoping that we'll at least cover costs at the conference.","What is the current replacement cost of these assets?","You can spread the cost of your loan repayment over 10 years.","You will have to bear the full cost of the building work.","the cost per day for an electrician","the pursuit of cost reduction","The true cost of running a car is much greater than just the price of the petrol you use."],"opposite":"","synonyms":"price"},{"def":"the total amount of money that needs to be spent by a business","examples":["The use of cheap labour helped to keep costs down.","Reducing costs means we can keep prices as low as possible.","We have to find new ways of cutting costs.","The company is focused on lowering its operating costs.","We have had to raise our prices because of rising costs.","Opinion was divided on the potential costs and benefits of the scheme.","labour/​production costs","rising costs","public spending","More spending on health was promised.","expenditure on education","legal expenses","travel expenses","High overheads mean small profit margins.","The best equipment is costly but is well worth the outlay.","The company's costs have risen over the last 5 years.","the costs associated with buying and selling property","The capital cost of these projects is some $100 million—then there'll be the operating costs.","research and development costs"],"opposite":"","synonyms":"costs"},{"def":"the effort, loss or damage that is involved in order to do or achieve something","examples":["the cost of something the terrible cost of the war in death and suffering","the environmental cost of nuclear power","at the cost of something She saved him from the fire at the cost of her own life (= she died).","at… cost Victory came at a high cost.","at… cost in something They advanced a few hundred metres, but at a heavy cost in life.","at (a) cost to something He worked non-stop for three months, at considerable cost to his health.","cost in something I felt a need to please people, whatever the cost in time and energy.","The victory was achieved at great cost to the country's infrastrucure.","The raid was foiled, but at a cost: an injured officer who was lucky to survive.","The country has suffered the enormous cost of trade sanctions.","Do the benefits outweigh the costs?","the costs and benefits of this strategy"],"opposite":"","synonyms":""},{"def":"the sum of money that somebody is ordered to pay for lawyers, etc. in a legal case","examples":["He was ordered to pay £2 000 costs.","He was fined £200 and ordered to pay costs.","Both sides incurred costs of over $50 000.","If you win your case you will normally be awarded costs."],"opposite":"","synonyms":""},{"def":"whatever is needed to achieve something","examples":["You must stop the press from finding out at all costs."],"opposite":"","synonyms":""},{"def":"under any circumstances","examples":["He is determined to win at any cost."],"opposite":"","synonyms":""},{"def":"for only the amount of money that is needed to make or get something, without any profit being added on","examples":["goods sold at cost"],"opposite":"","synonyms":""},{"def":"to feel the bad effects of a mistake, an accident, etc.","examples":["The town is now counting the cost of its failure to provide adequate flood protection."],"opposite":"","synonyms":""},{"def":"to know something because of something unpleasant that has happened to you","examples":["He's a ruthless businessman, as I know to my cost."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"at all cost/costs","def":"whatever is needed to achieve something","examples":["You must stop the press from finding out at all costs."]},{"idiom":"at any cost","def":"under any circumstances","examples":["He is determined to win at any cost."]},{"idiom":"at cost","def":"for only the amount of money that is needed to make or get something, without any profit being added on","examples":["goods sold at cost"]},{"idiom":"count the cost (of something)","def":"to feel the bad effects of a mistake, an accident, etc.","examples":["The town is now counting the cost of its failure to provide adequate flood protection."]},{"idiom":"know/learn/find something to your cost","def":"to know something because of something unpleasant that has happened to you","examples":["He's a ruthless businessman, as I know to my cost."]}],"phrasal":[],"related":["cost–benefit","low-cost","cost centre","cost price","direct cost","first cost","prime cost","cost-cutting","indirect cost","cost accounting","cost-effective","cost-effectively","cost-efficiency","cost-efficient","cost-efficiently","opportunity cost","cost-effectiveness","cost of living","cost center"]},{"pos":"verb","level":"A1","meanings":[{"def":"if something costs a particular amount of money, you need to pay that amount in order to buy, make or do it","examples":["cost something How much did it cost?","I didn't get it because it cost too much.","Tickets cost ten dollars each.","Calls to the helpline cost 45p per minute.","Don't use too much of it—it cost a lot of money.","All these reforms will cost money (= be expensive).","Good food need not cost a fortune (= cost a lot of money).","cost somebody something The meal cost us about £40.","This is costing the taxpayer £10 billion a year.","cost something to do something The hospital will cost an estimated £2 billion to build.","It costs a fortune to fly first class."],"opposite":"","synonyms":""},{"def":"to cause the loss of something","examples":["cost somebody something That one mistake almost cost him his life.","The allegations cost me my job.","A late penalty cost United the game (= meant that they did not win the game).","Such behaviour could cost you your place in the team.","cost something The closure of the factory is likely to cost 1 000 jobs.","The war has cost the lives of countless civilians."],"opposite":"","synonyms":""},{"def":"to involve you in making an effort or doing something unpleasant","examples":["The accident cost me a visit to the doctor.","Financial worries cost her many sleepless nights.","She would never know how much it cost him to tell her."],"opposite":"","synonyms":""},{"def":"to estimate how much money will be needed for something or the price that should be charged for something","examples":["cost something The project needs to be costed in detail.","fully costed proposals","cost something at something Their accountants have costed the project at $8.1 million.","cost something out Have you costed out these proposals yet?"],"opposite":"","synonyms":""},{"def":"to cost/pay a lot of money","examples":[],"opposite":"","synonyms":""},{"def":"to cost somebody a lot of money","examples":["The campaign for the presidency has cost him dear."],"opposite":"","synonyms":""},{"def":"to make somebody suffer a lot","examples":["That one mistake has cost him dear over the years."],"opposite":"","synonyms":""},{"def":"used to say that something will be expensive","examples":["There is a deluxe model available, but it'll cost you."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"cost/pay an arm and a leg","def":"to cost/pay a lot of money","examples":[]},{"idiom":"cost somebody dear","def":"to cost somebody a lot of money","examples":["The campaign for the presidency has cost him dear.","That one mistake has cost him dear over the years."]},{"idiom":"it will cost you","def":"used to say that something will be expensive","examples":["There is a deluxe model available, but it'll cost you."]}],"phrasal":[],"related":[]}]