[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cou/count/country__us_2.mp3","phonsUS":"/ˈkʌntri/","level":"A1","meanings":[{"def":"an area of land that has or used to have its own government and laws","examples":["European countries","developing countries","It's good to meet people from different parts of the country.","in a country She didn't know what life in a foreign country would be like.","It's the most popular music festival in the country.","across the country House prices are rising across the whole country.","around the country Demonstrations were held in cities around the country.","from a country people from other countries","the member states of the EU","The state provides free education.","All goods must be clearly labelled with their country of origin.","He cannot be deported to his country of origin.","He loved his country deeply.","He plans to travel the country by motorcycle.","He travelled the country on his motorbike.","I'm proud to serve my country.","It's difficult to live in a foreign country when you don't speak the language.","Many refugee servicemen gave their lives for their adopted country.","New schools are being built throughout the country.","OECD member countries","Over 30 countries participated in the Games.","She represented her country at the Beijing Olympics.","The country exports around 80% of its output.","The former president has been forced to flee the country.","The play has been enjoyed by audiences in this country and abroad for many years.","The refugees do jobs that workers in the host country refuse to do.","The two countries signed a basic treaty of cooperation.","There will be rain in many parts of the country tomorrow.","They are holding special events all over the country.","They drove across the country.","This is just one of 30 sites around the country.","We must remember those who died defending their country.","We operate in ten countries around the globe.","What must it be like, to grow old in a strange country?","Years of civil war had ravaged the country.","a commander who saved his country from invasion","countries bordering the Black Sea","economically advanced countries","industrially backward countries","new restrictions on goods entering the country","people who live in this country","students from overseas countries","the country of his birth","this great country of ours","I like going to different countries and meeting new people.","Sugar is only produced in tropical countries.","We need to improve the standards of education in this country."],"opposite":"","synonyms":""},{"def":"any area outside towns and cities, with fields, woods, farms, etc.","examples":["in the country I live in the country.","We spent a pleasant day in the country.","The house is at the end of a narrow country lane.","She lives in the country.","an area of wooded country","This pattern of woods and fields is typical of the English landscape.","Many younger people are leaving the land to find work in the cities.","We stopped on the mountain pass to admire the scenery.","The country air should do you good.","There have often been disagreements between town and country.","They drove along a remote country road.","a little country town","a typical country cottage with roses around the door","I don't really enjoy country life.","She lives in the country."],"opposite":"","synonyms":"country"},{"def":"an area of land, especially with particular physical features, suitable for a particular purpose or connected with a particular person or people","examples":["The town is surrounded by miles and miles of open country.","This part of Africa is rich farming country.","superb walking country","Explore Thomas Hardy country.","Whole tracts of country, once fertile, have become arid.","a beautiful stretch of country","We came to an area of wooded country.","They tramped across miles of open country."],"opposite":"","synonyms":""},{"def":"the people of a country; the nation as a whole","examples":["They have the support of most of the country.","The rich benefited from the reforms, not the country as a whole.","The whole country is depending on you.","Our country needs a leader like her.","He accused the government of leading the country to disaster.","The country is suffering from rising unemployment.","The country was ruled by a brutal dictatorship.","The issue of the single currency has divided the country.","the politicians who run the country"],"opposite":"","synonyms":""},{"def":"a type of popular music in the style of the traditional music of the southern US, with singing and dance tunes played on violin, guitar and banjo","examples":["pop, folk and country"],"opposite":"","synonyms":""},{"def":"directly across fields, etc.; not by a main road","examples":["riding across country"],"opposite":"","synonyms":""},{"def":"to hold an election to choose a new parliament","examples":[],"opposite":"","synonyms":""},{"def":"used as a reply when somebody suggests that you should not do something, or when somebody has asked permission or said they are going to do something","examples":["It's a free country; I'll say what I like!","Wear what you like. It's a free country.","‘It's a free country!’ he shouted. ‘I can do what I like!’"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"across country","def":"directly across fields, etc.; not by a main road","examples":["riding across country"]},{"idiom":"go to the country","def":"to hold an election to choose a new parliament","examples":[]},{"idiom":"it’s a free country","def":"used as a reply when somebody suggests that you should not do something, or when somebody has asked permission or said they are going to do something","examples":["It's a free country; I'll say what I like!","Wear what you like. It's a free country.","‘It's a free country!’ he shouted. ‘I can do what I like!’"]}],"phrasal":[],"related":["up-country","country club","country dance","country house","Country Life","country mile","country music","country park","country seat","cross-country","God’s country","north-country","country bumpkin","country cousin","country dancing","flyover country","mother country"]}]