[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cou/counc/council__us_3.mp3","phonsUS":"/ˈkaʊnsl/","level":"B2","meanings":[{"def":"a group of people who are elected to govern an area such as a city or county","examples":["a town council","The decision still has to be ratified by the full council.","on the council She's on the local council.","He won a seat on the council in a by-election.","She has served on the council for four years.","a member/meeting of the council","the leader of the council","a council member/leader","a council meeting/chamber"],"opposite":"","synonyms":""},{"def":"the organization that provides services in a city or county, for example education, houses, libraries, etc.","examples":["Residents have complained to the council about the noise.","She has been working for the council since March.","Students should apply to their local council for a grant.","council workers/staff/officials/officers","cuts to council services"],"opposite":"","synonyms":""},{"def":"a group of people chosen to give advice, make rules, do research, provide money, etc.","examples":["the Medical Research Council","In Britain, the Arts Council gives grants to theatres.","He'll have to appear before the professional conduct committee of the General Medical Council.","There are plans to establish a funding council for higher education.","the governing council of the Mormon Church","They are setting up a new council for the arts.","The Arts Council gives grants for local projects.","As a struggling young composer, she applied to the California Arts Council for grant money.","You should visit your local training and enterprise council."],"opposite":"","synonyms":""},{"def":"(especially in the past) a formal meeting to discuss what action to take in a particular situation","examples":["The king held a council at Nottingham from 14 to 19 October 1330."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["council tax","Arts Council","band council","city council","council area","council flat","council house","works council","council chamber","council estate","council of war","county council","district council","parish council","research council","school council","student council","Bar Council","Privy Council","British Council"]}]