[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cou/coupl/couple__us_2.mp3","phonsUS":"/ˈkʌpl/","level":"A2","meanings":[{"def":"two people or things","examples":["I saw a couple of men get out."],"opposite":"","synonyms":""},{"def":"a small number of people or things","examples":["We went there a couple of years ago.","a couple of minutes/hours/days/weeks/months","a couple of people/friends/guys","I've seen her a couple of times before.","I'll be with you in a minute. There are a couple of things I have to do first.","We can do it in the next couple of weeks.","There have been some new developments in the past couple of days.","The last couple of years have been difficult.","There are a couple more files to read first.","The country's population could fall to 30 million within a couple of decades.","I would like to make a couple of points at the outset.","I just have a couple of questions.","I've played a couple of games for the reserves recently."],"opposite":"","synonyms":""},{"def":"two people who are seen together, especially if they are married or in a romantic or sexual relationship","examples":["married couples","same-sex/gay/lesbian couples","a young couple","an elderly couple","The royal couple will visit New Zealand next year.","Several couples were on the dance floor.","The couple was/were married in 2016.","couple from… We met a couple from Chicago, who were travelling with their three children.","childless couples seeking to adopt","We stood and drank a toast to the happy couple.","They make a beautiful couple.","The hotel was full of honeymoon couples."],"opposite":"","synonyms":""},{"def":"very soon","examples":["We’ll be there in a couple of shakes."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in two shakes | in a couple of shakes","def":"very soon","examples":["We’ll be there in a couple of shakes."]}],"phrasal":[],"related":["couple up","happy couple","power couple","couple up (with somebody)","kill an hour, a couple of hours, etc."]},{"pos":"verb","level":"","meanings":[{"def":"to join together two parts of something, for example two vehicles or pieces of equipment","examples":["be coupled together The two railway trucks had been coupled together.","be coupled to something This energy is converted into electrical energy by the generator that is coupled to the turbine."],"opposite":"","synonyms":""},{"def":"to have sex","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["couple up","coupled with"],"related":[]}]