[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cou/court/court__us_1.mp3","phonsUS":"/kɔːrt/","level":"B1","meanings":[{"def":"the place where legal trials take place and where crimes, etc. are judged","examples":["the civil/criminal courts","Her lawyer made a statement outside the court.","in court Relatives of the dead girl were in court.","She will appear in court tomorrow.","to court They took their landlord to court for breaking the contract.","The case took five years to come to court (= to be heard by the court).","There wasn't enough evidence to bring the case to court (= start a trial).","out of court The case was settled out of court (= a decision was reached without a trial).","He won the court case and was awarded damages.","She can't pay her tax and is facing court action.","During the court hearing, the prosecutor said she would seek maximum prison sentences.","The prison is opposite the law court.","I was at school with her sister.","I have a ten-year-old in school.","Court documents showing illegal transactions were released to the press.","Court was adjourned for the weekend.","Divorce no longer requires a court appearance.","He received a court summons for non-payment of tax.","He should be tried at the International Court in the Hague.","He will appear in court tomorrow charged with the murder.","Once a lawsuit is filed, a court date is set.","She should seek damages through the civil courts.","The banks may decide to appeal to a higher court.","The case should not be allowed to go to court.","The case was appealed to a higher court.","The case will be tried before a criminal court.","The dispute was settled out of court.","Their neighbours took them to court.","There wasn't enough evidence to bring the case to court.","They are likely to end up in divorce court.","They could now face a court battle for compensation.","This is the highest court in the country.","We are prepared to go to court to get our compensation."],"opposite":"","synonyms":""},{"def":"the people in a court, especially those who make the decisions, such as the judge and jury","examples":["Please tell the court what happened.","The court heard how the man collapsed after being stabbed.","The court ruled in favour of her claim.","This is not a case to be decided by the courts.","before the court This evidence was not put before the court.","Airlines could face huge compensation bills following a court ruling on flight delays.","The company argued there was no case to answer, but the court disagreed.","The company asked the court to overrule the tribunal's decision.","The court acquitted Reece of the murder of his wife.","The court dismissed the appeal.","The court heard how the mother had beaten the 11-year-old boy.","The court held that she was entitled to receive compensation.","The court issued an injunction.","The court sentenced him to life in prison.","The court upheld the plaintiff's claim of unfair dismissal.","The court was presided over by Judge Owen.","She is too young to appear before the court.","We were trying to convince the court that the rules should be changed.","Will you please tell the court what happened on that morning?"],"opposite":"","synonyms":""},{"def":"a place where games such as tennis and basketball are played","examples":["a tennis/squash/basketball court","on court He won after only 52 minutes on court.","off court The players are good friends off court and train together.","Do you prefer playing tennis on grass courts or hard courts?","He hopes to repeat his success on the grass courts of Wimbledon.","He was a real gentleman both on and off court and a delight to play.","Off court she is just as aggressive as she is on the court.","She is a good player on hard courts.","The players have been on court for an hour.","an indoor volleyball court"],"opposite":"","synonyms":""},{"def":"the official place where kings and queens live","examples":["the court of Queen Victoria","at court He was presented to the queen at court.","life at the court of Charles I","life at court"],"opposite":"","synonyms":""},{"def":"the king or queen, their family, and the people who work for them and/or give advice to them","examples":["The painting shows the emperor with his court.","Mozart quickly became a favourite in court circles.","a member of the imperial court of Kyoto"],"opposite":"","synonyms":""},{"def":"an open space that is partly or completely surrounded by buildings and is usually part of a castle, a large house, etc.","examples":[],"opposite":"","synonyms":""},{"def":"used in the names of blocks of flats or apartment buildings, or of some short streets; (in the UK) used in the names of some large houses","examples":["The building is situated in a medieval court at the top of Edinburgh's royal mile."],"opposite":"","synonyms":""},{"def":"a large open section of a building, often with a glass roof","examples":[],"opposite":"","synonyms":""},{"def":"it is your/somebody’s responsibility to take action next","examples":["They've offered me the job, so the ball's in my court now."],"opposite":"","synonyms":""},{"def":"to entertain people by telling them interesting or funny things","examples":["I met Giles holding court with some tourists in a cafe."],"opposite":"","synonyms":""},{"def":"to completely reject an idea, a story, etc. that you think is not worth taking seriously at all","examples":["All his attempts at explanation were simply laughed out of court."],"opposite":"","synonyms":""},{"def":"to treat somebody with great respect in order to gain favour with them","examples":[],"opposite":"","synonyms":""},{"def":"to say that something is completely wrong or not worth considering, especially in a trial","examples":["The charges were thrown out of court.","Well that's my theory ruled out of court."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the ball is in your/somebody’s court","def":"it is your/somebody’s responsibility to take action next","examples":["They've offered me the job, so the ball's in my court now."]},{"idiom":"hold court (with somebody)","def":"to entertain people by telling them interesting or funny things","examples":["I met Giles holding court with some tourists in a cafe."]},{"idiom":"laugh somebody/something out of court","def":"to completely reject an idea, a story, etc. that you think is not worth taking seriously at all","examples":["All his attempts at explanation were simply laughed out of court."]},{"idiom":"pay court to somebody","def":"to treat somebody with great respect in order to gain favour with them","examples":[]},{"idiom":"rule/throw something out of court","def":"to say that something is completely wrong or not worth considering, especially in a trial","examples":["The charges were thrown out of court.","Well that's my theory ruled out of court."]}],"phrasal":[],"related":["law court","clay court","court card","court costs","court order","court shoe","Crown Court","food court","grass court","half-court","hard court","high court","moot court","tout court","youth court","appeal court","circuit court","county court"]},{"pos":"verb","level":"","meanings":[{"def":"to try to please somebody in order to get something you want, especially the support of a person, an organization, etc.","examples":["Both candidates have spent the last month courting the media.","He spent three months assiduously courting a newspaper editor.","The band has actively courted a young audience."],"opposite":"","synonyms":""},{"def":"to try to obtain something","examples":["He has never courted popularity."],"opposite":"","synonyms":""},{"def":"to do something that might result in something unpleasant happening","examples":["to court danger/death/disaster","As a politician he has often courted controversy."],"opposite":"","synonyms":""},{"def":"to have a romantic relationship with somebody that you hope to marry","examples":["He had been courting Jane for six months.","He courted Jane for two years before she finally agreed to marry him.","At that time they had been courting for several years.","Your grandfather and I were still courting at the time."],"opposite":"","synonyms":""},{"def":"(of a male bird or other animal) to try to attract a female","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]