[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cou/coura/courage__us_2.mp3","phonsUS":"/ˈkɜːrɪdʒ/","level":"B2","meanings":[{"def":"the ability to do something dangerous, or to face pain or opposition, without showing fear","examples":["He showed great courage and determination.","moral/physical courage","courage to do something They had the courage to stand up and fight for what they believed in.","He couldn't find the courage to tell his daughters what had happened.","Many said that the women's stories gave them the courage to pursue their goals","I haven't yet plucked up the courage to ask her.","It takes courage to sing in public.","His courage in battle won him a promotion.","She displayed remarkable courage in the face of danger.","courage in doing something I admire your courage in saying what you think.","with courage They fought with courage, but were no match for the enemy.","He lacked the courage to try something new.","He showed great calmness and courage under fire.","I didn't have the courage to tell him.","I finally plucked up enough courage to speak to Rachel.","This is a chance for him to show leadership and political courage.","an act of personal courage that moved people","stories of incredible physical courage","Unfortunately, they lack the moral courage to speak out against what is happening."],"opposite":"","synonyms":""},{"def":"to be/not be brave enough to do what you feel to be right","examples":["You need to have the courage of your convictions."],"opposite":"","synonyms":""},{"def":"to force yourself to be brave enough to do something","examples":["I finally screwed up my courage and went to the dentist."],"opposite":"","synonyms":""},{"def":"to begin to feel happier and more confident because of something","examples":[],"opposite":"","synonyms":""},{"def":"to make yourself do something that you are afraid of","examples":["Taking her courage in both hands, she opened the door and walked in."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"have/lack the courage of your convictions","def":"to be/not be brave enough to do what you feel to be right","examples":["You need to have the courage of your convictions."]},{"idiom":"screw up your courage","def":"to force yourself to be brave enough to do something","examples":["I finally screwed up my courage and went to the dentist."]},{"idiom":"take courage (from something)","def":"to begin to feel happier and more confident because of something","examples":[]},{"idiom":"take your courage in both hands","def":"to make yourself do something that you are afraid of","examples":["Taking her courage in both hands, she opened the door and walked in."]}],"phrasal":[],"related":["Dutch courage","have/lack the courage of your convictions","pluck up (the) courage (to do something)"]}]