[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cra/crash/crash__us_1.mp3","phonsUS":"/kræʃ/","level":"B2","meanings":[{"def":"an accident in which a vehicle hits something, for example another vehicle, usually causing damage and often injuring or killing the passengers","examples":["a car/plane crash","A man has been arrested in connection with a fatal crash on the M4 motorway.","It is not clear what caused the crash.","in a crash A girl was killed yesterday in a crash involving a stolen car.","34 people died in the train crash.","There were no other vehicles involved in the crash.","Mechanical failures were to blame for the crash of the helicopter.","He had survived a plane crash.","He had survived a spectacular crash in a truck race.","He was killed in a train crash.","In thirty years of driving she had never had a crash.","She swerved to avoid a crash.","The crash claimed three lives.","a crash involving two cars and a bus","a fiery crash which killed the pilot","a major air crash"],"opposite":"","synonyms":""},{"def":"a sudden loud noise made, for example, by something falling or breaking","examples":["The tree fell with a great crash.","The first distant crash of thunder shook the air.","She heard the crash of shattering glass as the vehicles collided.","The bike hit the street and made a loud crash.","The plates fell to the floor with an almighty crash.","There was a sickening crash as her head hit the ground.","the crash of the waves"],"opposite":"","synonyms":""},{"def":"a sudden serious fall in the price or value of something; the occasion when a business, etc. fails","examples":["Some economists have been predicting another crash for years.","the 2008 stock market crash","crash of… the crash of 2008","crash in something a crash in share prices"],"opposite":"","synonyms":""},{"def":"a sudden failure of a machine or system, especially of a computer or computer system","examples":["Users won't lose important data if a hardware problem causes a crash.","a computer crash","A systems crash in the morning and a bomb scare in the afternoon provided enough excitement for one day."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["car crash","crash out","crash pad","crash-dive","crash-land","crash team","crash test","crash-test","crash barrier","crash helmet","crash landing","crash-test dummy","crash-dives","crash-dived","crash-lands","crash pads","crash teams"]},{"pos":"verb","level":"B2","meanings":[{"def":"if a vehicle crashes or the driver crashes it, it hits an object or another vehicle, causing damage","examples":["I was terrified that the plane would crash.","We're going to crash, aren't we?","crash into something A truck went out of control and crashed into the back of a bus.","crash something I crashed my motorcycle on the way to a training session.","crash something into something He crashed his car into a wall.","I was terrified that the plane would crash.","The car skidded and slammed into a tree.","The car and the van collided head-on in thick fog.","Ram-raiders smashed a stolen car through the shop window.","He crashed the car into a tree.","Look out! We're going to crash!"],"opposite":"","synonyms":"crash"},{"def":"to hit something hard while moving, causing noise and/or damage; to make something hit somebody/something in this way","examples":["crash + adv./prep. A brick crashed through the window.","With a sweep of his hand he sent the glasses crashing to the floor.","The huge tree came crashing down during the storm.","Waves crashed against the shore.","crash + adj. The door crashed open.","crash something + adj. She stormed out of the room and crashed the door shut behind her."],"opposite":"","synonyms":""},{"def":"to make a loud noise","examples":["Thunder crashed overhead.","They dance to the loud music of pounding drums and crashing cymbals.","The waves crashed deafeningly."],"opposite":"","synonyms":""},{"def":"to lose value or fail suddenly and quickly","examples":["Share prices crashed to an all-time low yesterday.","The company crashed with debts of £50 million.","We were badly affected when the stock market crashed in 2008.","Their investments were wiped out when technology stocks crashed."],"opposite":"","synonyms":""},{"def":"if a computer crashes or you crash a computer, it stops working suddenly","examples":["Files can be lost if the system suddenly crashes.","Their website crashed repeatedly on Tuesday.","crash something A surge of traffic crashed their servers."],"opposite":"","synonyms":""},{"def":"gatecrash (= to go to a party or social event without being invited)","examples":[],"opposite":"","synonyms":""},{"def":"to lose very badly in a sports game","examples":["The team crashed to their worst defeat this season."],"opposite":"","synonyms":""},{"def":"to go to sleep, especially suddenly or in a place where you do not usually sleep","examples":["I was so tired I crashed out on the sofa.","I've come to crash on your floor for a couple of nights.","They crashed on my floor for a couple of nights.","Can I crash at your place tonight?"],"opposite":"","synonyms":""},{"def":"if somebody crashes, their heart stops beating","examples":[],"opposite":"","synonyms":""},{"def":"to go wrong or to fail badly and suddenly","examples":["His career crashed and burned after he threatened a journalist.","The stock markets are getting ready to crash and burn.","She continued to crash and burn through personal controversies that included driving drunk."],"opposite":"","synonyms":""},{"def":"a very boring person, activity, event or subject","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"crash and burn","def":"to go wrong or to fail badly and suddenly","examples":["His career crashed and burned after he threatened a journalist.","The stock markets are getting ready to crash and burn.","She continued to crash and burn through personal controversies that included driving drunk."]},{"idiom":"a crashing bore","def":"a very boring person, activity, event or subject","examples":[]}],"phrasal":["crash out"],"related":[]},{"pos":"adjective","level":"","meanings":[{"def":"involving hard work or a lot of effort over a short period of time in order to achieve quick results","examples":["a crash course in computer programming","a crash diet"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]