[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cre/creat/create__us_1.mp3","phonsUS":"/kriˈeɪt/","level":"A1","meanings":[{"def":"to make something happen or exist","examples":["Scientists disagree about how the universe was created.","The main purpose of industry is to create wealth.","The government plans to create more jobs for young people.","Create a new directory and put all your files into it.","Try this new dish, created by our head chef.","The agreement will create new opportunities for the aviation industry.","Severe storms created some travel problems.","the newly created position of executive editor","She makes her own clothes.","She made a good impression on the interviewer.","He did a beautiful drawing of a house.","Who’s doing the food for the party?","Scientists disagree about how the universe was created.","to develop new software","a factory that produces microchips","to generate electricity","Brainstorming is a good way of generating ideas.","Rearrange the letters to form a new word.","The chain is formed from 136 links."],"opposite":"","synonyms":"make"},{"def":"to produce a particular feeling or impression","examples":["He's eager to create a good impression at work.","The company is trying to create a young energetic image.","The announcement only succeeded in creating confusion.","The reorganization has created a lot of bad feeling.","They've painted it red to create a feeling of warmth.","We work hard to create a pleasant environment for patients, visitors and staff."],"opposite":"","synonyms":""},{"def":"to give somebody a particular rank or title","examples":["create something The government has created eight new peers.","create something + noun He was created a baronet in 1715."],"opposite":"","synonyms":""},{"def":"to be noticed and have an impact","examples":["It's a film that promises to create ripples.","The debate has barely made a ripple here."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"create/make ripples | create/make a ripple","def":"to be noticed and have an impact","examples":["It's a film that promises to create ripples.","The debate has barely made a ripple here."]}],"phrasal":[],"related":[]}]