[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cre/credi/credit__us_1.mp3","phonsUS":"/ˈkredɪt/","level":"A2","meanings":[{"def":"an arrangement that you make, with a shop for example, to pay later for something you buy","examples":["to get credit","on credit We bought the dishwasher on credit.","to offer interest-free credit (= allow somebody to pay later, without any extra charge)","Someone with a bad credit history is less likely to be lent money.","a credit agreement","a credit facility","Your credit limit is now £2 000.","He's a bad credit risk (= he is unlikely to pay the money later).","The credit crisis is far from over.","I bought it on credit.","If you don't have a regular income you may be unable to get credit.","Most shops selling furniture or electrical goods will offer credit.","The credit report will show all the consumer debt a person has.","When poorer people use credit, mail order is the key source.","people with poor credit histories","We offer two months' interest-free credit."],"opposite":"","synonyms":""},{"def":"money that you borrow from a bank; a loan","examples":["The bank refused further credit to the company.","Local lenders are more likely to extend credit (= lend money) to smaller, more marginal borrowers.","We propose to expand credit in order to create demand.","increases in debt created by credit expansion"],"opposite":"","synonyms":""},{"def":"the status of being trusted to pay back money to somebody who lends it to you","examples":["Her credit isn't good anywhere now."],"opposite":"","synonyms":""},{"def":"money that you have in your bank account; if you or your bank account are in credit, there is money in the account","examples":["You have a credit balance of £250.","My account is in credit."],"opposite":"","synonyms":""},{"def":"a sum of money paid into a bank account; a record of the payment","examples":["a credit of £50","You'll be paid by direct credit into your bank account.","I have three credits on my bank statement."],"opposite":"debit","synonyms":""},{"def":"the right to use a service up to a certain limit, paid for in advance","examples":["My phone's run out of credit.","to add credit to your phone"],"opposite":"","synonyms":""},{"def":"a payment that somebody has a right to for a particular reason","examples":["The child tax credit is subject to strict income limitations.","Export credits are granted to firms in developing countries to give them a breathing space to pay for goods exported to them."],"opposite":"","synonyms":""},{"def":"praise or approval because you are responsible for something good that has happened","examples":["to get/deserve/receive/take/claim the credit","He's a player who rarely seems to get the credit he deserves.","We did all the work and she gets all the credit!","credit for (doing) something I can't take all the credit for the show's success—it was a team effort.","At least give him credit for trying (= praise him because he tried, even if he did not succeed)","Credit will be given in the exam for good spelling and grammar.","His courage brought great credit to his regiment.","We should give due credit to all who helped make the event a success.","We should give due credit to the organizers of this event.","Why should she get all the credit?","The success of the venture reflects great credit on the organizers."],"opposite":"","synonyms":""},{"def":"a person or thing whose qualities or achievements are praised and who therefore earns respect for somebody/something else","examples":["She is a credit to the school.","Your children are a great credit to you.","He's a great credit to the school."],"opposite":"","synonyms":""},{"def":"the act of mentioning somebody who worked on a project such as a film or a television programme","examples":["She was given a programme credit for her work on the costumes for the play.","The credits (= the list of all the people involved) seemed to last almost as long as the film!","From the opening credits, the movie is non-stop action.","The end credits came as a welcome relief.","We left before the final credits began to roll."],"opposite":"","synonyms":""},{"def":"a film, play, television programme, etc. that somebody has worked on","examples":["His film credits included ‘The Witches’ and ‘Halloween III’."],"opposite":"","synonyms":""},{"def":"a unit of study at a college or university (in the US, also at a school); the fact of having successfully completed a unit of study","examples":["My math class is worth three credits.","Participants were given course credit for their participation in the study.","Students may have difficulty transferring credits to other institutions.","Tuition costs are based on the number of credit hours enrolled.","modules offering continuing education credits","He took some advanced courses to earn college credits."],"opposite":"","synonyms":""},{"def":"if something does credit to a person or an organization, they deserve to be praised for it","examples":["Your honesty does you great credit.","Your concern does you credit."],"opposite":"","synonyms":""},{"def":"to give somebody the praise they deserve, even if you do not really want to","examples":["Give credit where credit is due—what the man does, he does well."],"opposite":"","synonyms":""},{"def":"to have achieved something","examples":["He's only 30, and he already has four novels to his credit."],"opposite":"","synonyms":""},{"def":"used to introduce the good points about somebody/something, especially after the bad points have been mentioned","examples":["On the credit side, she’s always willing to work very late."],"opposite":"","synonyms":""},{"def":"making somebody deserve praise or respect","examples":["To his credit, Jack never told anyone exactly what had happened.","It was to her credit that she managed to stay calm.","To her credit, she gave them lunch.","To her eternal credit, she gave them a home.","To her great credit, she does not try to avoid the truth."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"do somebody credit | do credit to somebody/something","def":"if something does credit to a person or an organization, they deserve to be praised for it","examples":["Your honesty does you great credit.","Your concern does you credit."]},{"idiom":"give credit where credit is due","def":"to give somebody the praise they deserve, even if you do not really want to","examples":["Give credit where credit is due—what the man does, he does well."]},{"idiom":"have something to your credit","def":"to have achieved something","examples":["He's only 30, and he already has four novels to his credit."]},{"idiom":"on the credit side","def":"used to introduce the good points about somebody/something, especially after the bad points have been mentioned","examples":["On the credit side, she’s always willing to work very late."]},{"idiom":"to somebody’s credit","def":"making somebody deserve praise or respect","examples":["To his credit, Jack never told anyone exactly what had happened.","It was to her credit that she managed to stay calm.","To her credit, she gave them lunch.","To her eternal credit, she gave them a home.","To her great credit, she does not try to avoid the truth."]}],"phrasal":[],"related":["credit card","credit line","credit note","tax credit","carbon credit","credit agency","credit bureau","credit crunch","credit rating","credit score","credit union","consumer credit","credit account","credit transfer","line of credit","Universal Credit","letter of credit"]},{"pos":"verb","level":"B2","meanings":[{"def":"to add an amount of money to somebody’s bank account","examples":["credit something They credited my account two days later.","credit A with B Your account has been credited with $50 000.","The bank credited the oil company with $500 000.","credit B to A $50 000 has been credited to your account."],"opposite":"","synonyms":""},{"def":"to believe or say that somebody is responsible for doing something, especially something good","examples":["be credited All the contributors are credited on the title page.","be credited as somebody/something She has been wrongly credited as the author.","be credited with doing something The group has been widely credited with creating the sound of heavy metal.","The company is credited with inventing the industrial robot.","be credited with something This therapy has long been credited with many benefits.","be credited for doing something Ray Charles is largely credited for creating soul music.","be credited for something Matthews was credited for the winning goal.","be credited to something The invention of the industrial robot is credited to the company.","She is generally credited as having written over 50 novels.","The work has been credited to a 16th-century bishop.","He is widely credited with having started the Middle East peace process."],"opposite":"","synonyms":""},{"def":"to believe that somebody/something has a particular good quality or feature","examples":["I credited you with a little more sense.","Credit me with some intelligence."],"opposite":"","synonyms":""},{"def":"to believe that somebody/something is of a particular type or quality","examples":["be credited as something The cheetah is generally credited as the world's fastest animal."],"opposite":"","synonyms":""},{"def":"to believe something, especially something surprising or unexpected","examples":["He's been promoted—would you credit it?","I could hardly credit it when she told me she was leaving.","I find what he says rather hard to credit."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]