[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cre/crew_/crew__us_1.mp3","phonsUS":"/kruː/","level":"B2","meanings":[{"def":"all the people working on a ship, plane, etc.","examples":["crew members","in a crew all the men and women in the crew","None of the passengers and crew were injured.","The crew of the plane instructed everyone to remain seated.","a change of crew in Frankfurt"],"opposite":"","synonyms":""},{"def":"all the people working on a ship, plane etc. except the officers who are in charge","examples":["the officers and crew"],"opposite":"","synonyms":""},{"def":"a group of people with special skills working together","examples":["a film/camera/TV crew","a fire/an emergency/a rescue crew","It took ambulance crews more than an hour to free them.","(North American English) Ten people answer to the crew chief.","Fire crews were called to the scene.","He crews for a billionaire on his yacht.","We're taking a cruise around the Mediterranean.","I'd love to cruise down the Nile.","Fire crews were called to the scene.","The cast and crew of the movie are giving it their all.","Fire crews were called to the house at around 5 o'clock.","Maintenance crews have been working 18-hours shifts to repair the damage.","The film crew and the actors had all left the studio by then.","Our support crew followed behind in two Land Rovers.","The house was soon besieged by TV crews and photographers.","Two crews of six men carried out the work in shifts.","We have camera crews from ABC, CBS and NBC coming.","a maintenance/​support crew"],"opposite":"","synonyms":""},{"def":"a group of people","examples":["The people she invited were a pretty motley crew (= a strange mix of types of people).","Let's get a crew together and go to the pub.","We found him in the canteen with a crew of assorted computer geeks."],"opposite":"","synonyms":""},{"def":"a team of people who row boats in races","examples":["a member of the Cambridge crew"],"opposite":"","synonyms":""},{"def":"the sport of rowing with other people in a boat","examples":["I’m thinking of going out for crew this semester (= joining the rowing team)."],"opposite":"","synonyms":""},{"def":"a person or team of people who sail boats in races or for pleasure (usually not including the captain)","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["crew cut","crew-cut","J. Crew™","crew neck","cabin crew","flight crew","ground crew","crew cuts","crew-cuts","crew necks"]},{"pos":"verb","level":"","meanings":[{"def":"to be part of a crew, especially on a ship","examples":["crew (something) Normally the boat is crewed by five people.","crew (for somebody) I crewed for him on his yacht last summer.","Fire crews were called to the scene.","He crews for a billionaire on his yacht.","We're taking a cruise around the Mediterranean.","I'd love to cruise down the Nile."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]