[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cri/crime/crime__us_1.mp3","phonsUS":"/kraɪm/","level":"A2","meanings":[{"def":"activities that involve breaking the law","examples":["This month's figures show an increase in violent crime.","There needs to be a partnership between police and public in the fight against crime.","Stores spend more and more on crime prevention every year.","DNA data is extremely useful in fighting serious crime.","He began to drift into a life of petty crime (= crime that is not very serious).","gun/knife crime","a rise in street crime","the connection between drugs and organized crime","He turned to crime when he dropped out of school.","The crime rate is rising.","crime fiction/novels (= stories about crime)","crime figures/statistics","Victims of crime may be able to obtain compensation.","She’s a crime writer (= she writes stories about crime).","We need to do more to tackle knife crime.","Corporate crime—committed by businesses—should not be confused with white-collar crime, which refers to the occupation of the perpetrator and may be directed against a business.","Fear of crime imprisons many elderly people in their homes.","Gun crime is just part of an increasingly lawless society.","He says that bored youngsters turn to crime.","How can we reduce knife crime in our cities?","Police forces will exchange ideas on cracking crime.","The computers were sent to a crime lab for analysis.","The public have a crucial role to play in detecting crime.","Unemployed young people were likely to be tempted into a life of crime.","a crackdown on drug-related crime","a new short story by the popular crime writer","a senior detective with the serious crime squad","a time of great poverty and rampant crime","attempts to prevent hacking and computer crime","one of New York's biggest crime lords","the country's crime problem","the latest TV crime series","the newspaper's crime reporter","More needs to be done to help the victims of crime.","She writes crime novels."],"opposite":"","synonyms":""},{"def":"an illegal act or activity that can be punished by law","examples":["There is no proof that he committed a crime (= did something illegal).","In his mind he was about to commit the perfect crime.","Arson is a serious crime.","crime against something/somebody The massacre was a crime against humanity.","crime of something Sometimes murder is a crime of passion.","DNA testing can be used to solve old crimes.","An abandoned car was found near the scene of the crime.","Hate crimes are not punished severely enough in my opinion.","He boasted of having carried out the perfect crime.","He confessed his crime to his sister.","He was charged with the lesser crime of possessing a forged bond, rather than actually forging it.","He was charged with the lesser crime of possession.","Insider dealing has been called a victimless crime.","Many crimes are never reported to the police.","No weapon was found at the scene of the crime.","She claimed that the real crime is that burglars and muggers usually get a light sentence.","She never faced trial for her many alleged crimes.","The crime occurred in broad daylight.","The punishment should fit the crime.","a man who solves crimes using old-fashioned detective work","a system of justice to prosecute crimes of terrorism","an apparently motiveless crime","crimes against humanity","crimes involving firearms","crimes punishable by death","one of the most horrific crimes of recent times","one of the most notorious crimes in British history","the biggest crime since the Great Train Robbery","the danger of copycat crimes in the wake of the shootings","She had never committed a crime in her life."],"opposite":"","synonyms":""},{"def":"an act that you think is morally wrong or is a big mistake","examples":["It's a crime to waste so much money.","Not returning phone calls is a grave crime in today's culture."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["crime lab","war crime","crime scene","crime wave","hate crime","true crime","crime-busting","scene-of-crime","Costa del Crime","National Crime Agency","CSI: Crime Scene Investigation","Serious Organised Crime Agency","crime labs","crime waves","crime scenes","scenes-of-crime"]}]