[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cri/crimi/criminal__us_3.mp3","phonsUS":"/ˈkrɪmɪnl/","level":"A2","meanings":[{"def":"a person who commits a crime","examples":["a convicted criminal","Police sometimes put themselves in danger when arresting violent criminals.","Society does not know how to deal with hardened criminals (= people who regularly commit crimes and are not sorry for what they do).","(especially North American English) a career criminal (= who earns their income through criminal activities)","He admits to being a petty criminal (= who commits crimes that are not very serious).","white-collar criminals","a gang of criminals","He has been associating with known criminals.","I told him to pass the information to the police so they could catch the criminals.","She was treated like a common criminal.","Sending these youngsters to prison simply trains them to become professional criminals.","serial killers and other kinds of violent criminals"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["criminal law","war criminal","criminal damage","criminal record","Police and Criminal Evidence Act","Criminal Justice and Public Order Act","criminal records","Criminal Investigation Department"]},{"pos":"adjective","level":"B1","meanings":[{"def":"connected with or involving crime","examples":["criminal offences/activities","a criminal act punishable by up to five years in jail","They were charged with criminal damage (= the crime of damaging somebody's property deliberately).","She has been cleared of criminal negligence (= the illegal act of somebody failing to do something that they should do, with the result that somebody else is harmed).","It should be a criminal offence to inflict cruelty on any wild animal."],"opposite":"","synonyms":""},{"def":"connected to the laws that deal with crime","examples":["the criminal justice system","to bring criminal charges against somebody","a criminal lawyer/court/trial","a criminal investigation","a criminal prosecution/conviction","a criminal case","The former minister could face criminal proceedings over his involvement in the deal."],"opposite":"","synonyms":""},{"def":"morally wrong","examples":["This is a criminal waste of resources."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]