[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cri/crisi/crisis__us_4.mp3","phonsUS":"/ˈkraɪsɪs/","level":"B2","meanings":[{"def":"a time of great danger, difficulty or doubt when problems must be solved or important decisions must be made","examples":["an economic/a financial crisis","The government is attempting to solve the debt crisis through spending cuts.","The government is facing a political crisis.","a humanitarian crisis created by war and drought","a housing/an energy crisis","to resolve/solve/address a crisis","in crisis The business is still in crisis but it has survived the worst of the recession.","The Labour Party was facing an identity crisis.","an expert in crisis management","We provide help to families in crisis situations.","I know which friends I can turn to in times of crisis.","crisis of something The party was suffering a crisis of confidence among its supporters (= they did not trust it any longer).","Agriculture is facing a crisis.","The city's fiscal crisis has deepened.","In times of crisis it's good to have someone you can rely on for advice.","She's no good in a crisis.","The company is suffering a severe crisis of confidence.","The government is in crisis.","The plan could save the country from a looming energy crisis.","Three people died during the hostage crisis.","Union leaders are taking immediate steps to defuse the crisis.","We are just waiting for the next crisis to arise.","With competition from cheap imports, the British coal industry is facing a serious crisis.","a crisis over pensions","an expert in crisis management","attempts to ease the town's housing crisis","the Third World debt crisis","the growing crisis in education","the worst economic crisis for fifty years","A succession of economic crises had limited the money available for new social policies.","He is one of the world's leading experts in crisis management.","It is hoped that his resignation will end the latest political crisis in the country."],"opposite":"","synonyms":""},{"def":"a time when a problem, a bad situation or an illness is at its worst point","examples":["Their marriage has reached crisis point.","The fever has passed its crisis.","The team's dismal season has reached crisis point."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Crisis","climate crisis","midlife crisis","Suez Crisis","abdication crisis","hostage crisis","Cuban missile crisis"]},{"pos":"","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cri/crisi/crisis__us_3.mp3","level":"","meanings":[{"def":"a British charity for homeless people that began in 1972, and that offers education, employment, housing and other services. Each year it also uses empty buildings in large cities to give people shelter, food and clothing in the time around Christmas. This service is run by Crisis at Christmas.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]