[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cro/crowd/crowd__us_1.mp3","phonsUS":"/kraʊd/","level":"A2","meanings":[{"def":"a large number of people gathered together in a public place, for example in the streets or at a sports game","examples":["He pushed his way through the crowd.","A small crowd had gathered outside the church.","Police had to break up the crowd.","crowd of somebody/something Crowds of people poured into the street.","He left the hotel surrounded by crowds of journalists.","Several speakers addressed the crowd at the rally.","a large/huge crowd","The match attracted a capacity crowd of 80 000 (= the maximum number of people who could attend).","before a crowd The President spoke before a crowd of more than 50 000 in the city's football stadium.","among a crowd The mayor of Paris was among the crowd that had gathered for the street celebration.","to attract/draw a crowd","I want to get there early to avoid the crowds.","The crowd cheered the winning hit.","Nearly 300 marshals will be involved in crowd control.","crowd trouble","A whole crowd of us (= a lot of us) are going to the ball.","A crowd thronged around the wounded man.","After the ambulance drove off, the crowd dispersed.","An expectant crowd gathered outside his house.","Boxing is a sport that always attracts large crowds.","Crowds have been flocking to the beaches in this hot weather.","Crowds lined the streets of the city as the president's car approached.","I saw some familiar faces in the crowd.","If you want to avoid the crowds, get there early.","Police were called to disperse the crowd.","She didn't win but she was clearly the crowd favourite/​favorite.","She fought her way through the crowd.","She was afraid she might get lost in the crowd.","The crowd grew to over 15 000.","The crowd rushed forward.","The president read a declaration to a vast assembled crowd.","We pushed our way through the milling crowds of guests.","a big crowd of football supporters","crowds thronging the streets of Rio"],"opposite":"","synonyms":""},{"def":"a particular group of people","examples":["Bob introduced her to some of the usual crowd (= people who often meet each other).","the bright young theatrical crowd","They were a bit of a motley crowd.","They are a great crowd of people to work with.","The bar attracts a slightly older crowd.","He got in with the wrong crowd.","Do you ever see any of the old crowd from college?","By this time, it was attracting a more Bohemian and disreputable crowd.","the usual motley crowd of tourists, hawkers, and pigeons"],"opposite":"","synonyms":""},{"def":"ordinary people, not special or unusual in any way","examples":["We all like to think we stand out from the crowd (= are different from and better than other people).","He prefers to be one of the crowd.","She's quite happy to follow the crowd.","To her I'm just another face in the crowd."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["crowd in","in-crowd","crowd out","crowd into","crowd onto","crowd round","crowd around","crowd-pleaser","crowd-puller","Far from the Madding Crowd","crowd-pullers","crowd-pleasers","crowd round (somebody/something)","crowd into something | crowd in","crowd onto something | crowd in","crowd somebody/something out","crowd around (somebody/something)","crowd in (on somebody) | crowd into something","crowd somebody/something into something | crowd somebody/something in"]},{"pos":"verb","level":"","meanings":[{"def":"to fill a place so there is little room to move","examples":["Thousands of people crowded the narrow streets."],"opposite":"","synonyms":""},{"def":"to fill your mind so that you can think of nothing else","examples":["Memories crowded his mind."],"opposite":"","synonyms":""},{"def":"to stand very close to somebody so that they feel uncomfortable or nervous","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["crowd around","crowd in","crowd into","crowd onto","crowd out","crowd round"],"related":[]}]