[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cul/cultu/culture__us_2.mp3","phonsUS":"/ˈkʌltʃər/","level":"A1","meanings":[{"def":"the customs and beliefs, art, way of life and social organization of a particular country or group","examples":["African/American/European/Islamic culture","working-class culture","the study of Japanese language and culture","Cooking is a hugely important part of French culture.","He is no longer in touch with youth culture.","The film examines the culture clash between the generations.","Jokes are an important part of our popular oral culture.","These ideas have always been central to Western culture.","a country containing many language and culture groups","immigrants who embrace American culture","The Romans gradually assimilated the culture of the people they had conquered.","Prisoners are isolated from the wider culture of society at large."],"opposite":"","synonyms":""},{"def":"a country, group, etc. with its own beliefs, etc.","examples":["The children are taught to respect different cultures.","the effect of technology on traditional cultures","Children need to learn to understand cultures other than their own.","In some cultures children have an important place."],"opposite":"","synonyms":""},{"def":"art, music, literature, etc., thought of as a group","examples":["Venice is a beautiful city, full of culture and history.","the Minister for Culture","The paintings reflect African American culture.","She is a woman of wide culture."],"opposite":"","synonyms":""},{"def":"the beliefs and attitudes about something that people in a particular group or organization share","examples":["We are living in a consumer culture.","Corporate culture has become the dominant culture.","The political cultures of the United States and Europe are very different.","You can't change the culture of an organization overnight.","culture of something She believes the media have created a culture of fear.","The company promotes a culture of innovation.","A culture of failure exists in some schools.","Newcomers to the company are soon assimilated into the culture.","The computer has changed the culture of the design profession.","The new director is trying to foster a culture of open communication within the company.","The social security system has been accused of producing a culture of dependency.","the development of the enterprise culture in Britain"],"opposite":"","synonyms":""},{"def":"the growing of plants or producing of particular animals in order to get a particular substance or crop from them","examples":["the culture of silkworms (= for silk)"],"opposite":"","synonyms":""},{"def":"a group of cells or bacteria, especially one taken from a person or an animal and grown for medical or scientific study, or to produce food; the process of obtaining and growing these cells","examples":["a culture of cells from the tumour","Yogurt is made from active cultures.","to do/take a throat culture"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["pop culture","culture shock","cancel culture","canteen culture","culture vulture","culture warrior","popular culture","Department for Digital, Culture, Media and Sport","culture vultures","culture warriors"]},{"pos":"verb","level":"","meanings":[{"def":"to grow a group of cells or bacteria for medical or scientific study","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]