[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cur/cure_/cure__us_1.mp3","phonsUS":"/kjʊr/","level":"B2","meanings":[{"def":"to make a person or an animal healthy again after an illness","examples":["cure somebody Will you be able to cure him, Doctor?","cure somebody of something The doctor managed to cure her of her illness.","He was now completely cured of his illness.","She still believed that somehow she could be miraculously cured.","She was miraculously cured.","They will try to cure her of her alcoholism."],"opposite":"","synonyms":""},{"def":"to make an illness go away","examples":["cure something It is better to prevent rather than cure diseases.","Finding it early is the key to curing most cancers.","TB is a serious illness, but it can be cured.","cure something with something The disease can be cured with antibiotics."],"opposite":"","synonyms":""},{"def":"to deal with a problem successfully","examples":["cure something I finally managed to cure the rattling noise in my car.","Charities alone can't cure basic social injustices.","He bought some special software that was supposed to cure hard disk problems.","cure something with something Most of the team's faults could be cured with good coaching."],"opposite":"","synonyms":""},{"def":"to stop somebody from behaving in a particular way, especially a way that is bad or annoying","examples":["I thought I had finally cured him of this annoying habit."],"opposite":"","synonyms":""},{"def":"to treat food or tobacco with smoke, salt or heat, etc. in order to preserve it","examples":["cured ham/bacon"],"opposite":"","synonyms":""},{"def":"used to say that what you are going to do will either be very successful or fail completely","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"kill or cure","def":"used to say that what you are going to do will either be very successful or fail completely","examples":[]}],"phrasal":[],"related":["cure-all","dry-cure","rest cure","cure-alls","prevention is better than cure","an ounce of prevention is better than a pound of cure"]},{"pos":"noun","level":"B2","meanings":[{"def":"a medicine or medical treatment that cures an illness","examples":["cure for something the search for a cure for cancer","Researchers are working to find a cure for the disease.","There is no miracle cure for this condition.","There is no known cure but the illness can be treated.","The only real cure is rest.","If the disease is detected early, it has a cure.","The cure works by boosting the body's immune system.","There is no instant cure for this condition.","There is no known cure for the disease.","scientists seeking a cure for AIDS","the search for a cure for the common cold","Although there is no cure for this illness, it can be treated to reduce the pain."],"opposite":"","synonyms":""},{"def":"the act of curing somebody of an illness or the process of being cured","examples":["Doctors cannot effect a cure if the disease has spread too far.","The cure took six weeks.","These drugs can sometimes effect miraculous cures."],"opposite":"","synonyms":""},{"def":"something that will solve a problem, improve a bad situation, etc.","examples":["a cure for poverty","Science cannot provide a cure for all the world's problems."],"opposite":"","synonyms":""},{"def":"it is better to stop something bad from happening rather than try to deal with the problems after it has happened","examples":["Prevention is better than cure, so start looking after your heart now.","Prevention is better than cure, so start taking care of yourself."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"prevention is better than cure","def":"it is better to stop something bad from happening rather than try to deal with the problems after it has happened","examples":["Prevention is better than cure, so start looking after your heart now.","Prevention is better than cure, so start taking care of yourself."]}],"phrasal":[],"related":[]}]