[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cur/curre/current__us_1.mp3","phonsUS":"/ˈkɜːrənt/","level":"B1","meanings":[{"def":"happening now; of the present time","examples":["The necklace would be worth over $5 000 at current prices.","the current situation","Oil prices are expected to remain at current levels.","What's the budget for the current year?","Under the current system, the entire process takes about two weeks.","I need the actual figures, not an estimate.","How long have you been in your present job?","The factory cannot continue its current level of production.","your current employer","Our current financial situation is not good.","What are the current unemployment figures?"],"opposite":"","synonyms":""},{"def":"being used by or accepted by most people","examples":["words that are no longer current"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["rip current","cross-current","current account","current affairs","current events","direct current","alternating current","current accounts"]},{"pos":"noun","level":"B2","meanings":[{"def":"the movement of water in the sea or a river; the movement of air in a particular direction","examples":["with the current It's easier to go with the current.","against the current He swam to the shore against a strong current.","Seed pods float and are borne naturally for long distances on ocean currents.","Birds use warm air currents to help their flight.","current of something currents of air","Birds of prey use warm air currents to lift them high in the sky.","He was swimming against the current.","She was swept away by the treacherous currents.","The boat was carried along in the current.","The prevailing current flows from east to west.","Changes in ocean currents can have drastic effects on marine life."],"opposite":"","synonyms":""},{"def":"the flow of electricity through a wire, etc.","examples":["wires carrying electric currents","Check all your wiring before switching on the current.","Measure the current flowing in the wire.","He leaped as though a powerful electric current had passed through him."],"opposite":"","synonyms":""},{"def":"the supply of electricity","examples":["The current failure lasted three hours.","Electric wires are out of current for as long as 18 hours a day."],"opposite":"","synonyms":""},{"def":"the fact of particular ideas, opinions or feelings being present in a group of people","examples":["Ministers are worried by this current of anti-government feeling."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]