[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cus/custo/customer__us_1.mp3","phonsUS":"/ˈkʌstəmər/","level":"A1","meanings":[{"def":"a person or an organization that buys goods or services from a shop or business","examples":["marketing strategies to target potential customers","The company rewards loyal customers with discounts.","one of the shop’s best customers","They know me—I'm a regular customer.","the customer service department","Improving customer satisfaction is a core company strategy.","The firm has excellent customer relations.","How do you attract new online customers?","Our success is measured by how well we serve our customers.","If you have a complaint, contact the customer care unit.","It's a special offer to attract new customers.","Part of good customer relations is knowing how to deal with complaints.","The questionnaire is to test customer reaction to the new store design.","The terms of the guarantee will be set out in the customer agreement.","There are a large number of potential customers for the new product.","They are one of our biggest customers.","They carried out a customer satisfaction survey.","They organized an evening's entertainment for favoured customers.","This cheaper model was produced in response to customer demand.","We can't afford to lose any more customers.","We like to think that we have satisfied customers.","Draw up a customer profile and write a description of your typical customer.","He comes in twice a week and is one of our best customers.","I'd like to speak to someone in the customer service department, please.","Is there a set procedure for dealing with customer complaints?","Schools are among the biggest customers for this service."],"opposite":"","synonyms":""},{"def":"used after an adjective to describe a particular type of person","examples":["an awkward customer","a cool customer (= somebody who is always calm, even when in trouble)","an ugly customer (= somebody who may become violent)"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["customer base","customer-facing","customer service","customer engagement","customer services","business-to-customer"]}]