[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cus/custo/custom__us_1.mp3","phonsUS":"/ˈkʌstəm/","level":"B1","meanings":[{"def":"an accepted way of behaving or of doing things in a society or a community","examples":["It's a local custom.","an ancient custom","a burial/marriage custom","a tribal custom","She grew up with Chinese customs and traditions.","according to custom According to custom, one son inherited all the family property.","custom of doing something Widows observed the custom of wearing black","it is the custom for somebody to do something It is the custom in that country for women to marry young.","The custom died out in the nineteenth century.","The rules have grown up through custom and are not laid down by law.","These customs still prevail in remote areas.","They poured wine around the trees in accordance with local custom.","They still follow the custom of pinning money to the bride's dress.","It is the custom here to put flowers on the graves at Easter.","The custom of using Latin for legal records came to an end.","They were unfamiliar with local customs and culture.","the custom of giving presents at Christmas","Guyanese custom dictates that the child be given a piece of gold jewellery for good luck soon after birth."],"opposite":"","synonyms":""},{"def":"the way a person always behaves","examples":["It was her custom to rise early.","As was his custom, he knocked three times.","When I reply to debates, it is my custom to have heard all the speeches.","They were seated, as was their custom, in the summer house.","He then repeated the question, as his custom was."],"opposite":"","synonyms":""},{"def":"the fact of a person or people buying goods or services at a shop or business","examples":["Thank you for your custom. Please call again.","We've lost a lot of custom since prices went up."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["custom-made","custom-built"]},{"pos":"adjective","level":"","meanings":[{"def":"designed and built for a particular person","examples":["a custom motorcycle"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]