[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cut/cut__/cut__us_1.mp3","phonsUS":"/kʌt/","level":"A1","meanings":[{"def":"to make an opening or a wound in something, especially with a sharp tool such as a knife or scissors","examples":["cut something She cut her finger on a piece of glass.","cut yourself He cut himself (= his face) shaving.","Sometimes people experiencing distress cut themselves (= deliberately).","cut something + adj. She had fallen and cut her head open.","cut into something She picked up the knife and cut into the meat.","cut through something You need a powerful saw to cut through metal.","(figurative) The canoe cut through the water."],"opposite":"","synonyms":""},{"def":"to divide something into two or more pieces with a knife, etc.","examples":["cut something Don't cut the string, untie the knots.","The bus was cut in two by the train.","Now cut the tomatoes in half.","cut something into something He cut the loaf into thick slices.","She cut the loaf in two and gave me one of the halves.","Make sure you cut the bread nice and thick.","I'll cut the apple in half.","He cut the bread into thin slices.","Cut the cake into six pieces.","Cut the carrots in half lengthwise.","Cut the courgette in half lengthways.","Cut the stem cleanly, just beneath a leaf joint."],"opposite":"","synonyms":""},{"def":"to make something shorter by cutting","examples":["cut something She cuts hair for a living.","to cut the grass/lawn/hedge","the smell of freshly cut grass","cut something + adj. He's had his hair cut really short.","I'm going to get/​have my hair cut really short.","Her hair had been very well cut.","I told the stylist I wanted my hair cut short."],"opposite":"","synonyms":""},{"def":"to remove something or a part of something, using a knife, etc.","examples":["cut something First, cut a long piece of string.","cut something from something He cut four thick slices from the loaf.","a bunch of cut flowers","cut somebody something I cut them all a piece of birthday cake.","cut something for somebody I cut a piece of birthday cake for them all.","freshly cut flowers","Shall I cut you a piece of cake?"],"opposite":"","synonyms":""},{"def":"to make or form something by removing material with a knife, etc.","examples":["cut something in something Workmen cut a hole in the pipe.","The climbers cut steps in the ice.","cut something into something homemade biscuits cut into heart shapes","cut something Cut a circle of waxed paper to fit the bottom of the pan."],"opposite":"","synonyms":""},{"def":"to be capable of cutting","examples":["This knife won't cut."],"opposite":"","synonyms":""},{"def":"to be capable of being cut","examples":["Sandstone cuts easily."],"opposite":"","synonyms":""},{"def":"to reduce something by removing a part of it","examples":["cut something to cut costs/prices/spending/taxes","Buyers will bargain hard to cut the cost of the house they want.","a plan to drastically cut emissions","cut something by… His salary has been cut by ten per cent.","cut something to… The Bank of England has cut interest rates to 1.5 per cent.","cut something from… to… Could you cut your essay from 5 000 to 3 000 words?","The President has promised to cut taxes significantly.","Buyers will bargain hard to cut the cost of the house they want.","His salary has been cut by ten per cent.","Could you cut your essay from 5 000 to 3 000 words?","The workforce has been slashed by half.","We had to cut back production.","The IMF has scaled back its growth forecasts for the next decade.","We have managed to cut our costs drastically.","The department has to cut its spending by 30 per cent.","The price has been cut from €250 to €175.","The President has promised to cut taxes significantly."],"opposite":"","synonyms":"cut"},{"def":"to allow somebody to escape from somewhere by cutting the rope, object, etc. that is holding them","examples":["cut somebody (from something) The injured driver had to be cut from the wreckage.","cut somebody + adj. Two survivors were cut free after being trapped for twenty minutes."],"opposite":"","synonyms":""},{"def":"to design and make a piece of clothing in a particular way","examples":["be cut + adj. The swimsuit was cut high in the leg."],"opposite":"","synonyms":""},{"def":"to remove something from something","examples":["This scene was cut from the final version of the movie."],"opposite":"","synonyms":""},{"def":"to delete (= remove) part of a text on a computer screen in order to place it somewhere else","examples":["You can cut and paste between different programs."],"opposite":"","synonyms":""},{"def":"used to tell somebody to stop doing something","examples":["Cut the chatter and get on with your work!"],"opposite":"","synonyms":""},{"def":"to completely end a relationship or all communication with somebody","examples":["She has cut all ties with her family.","He has refused to cut links with these companies."],"opposite":"","synonyms":""},{"def":"to prepare a film or tape by removing parts of it or putting them in a different order","examples":[],"opposite":"","synonyms":""},{"def":"to stop filming or recording","examples":["The director shouted ‘Cut!’"],"opposite":"","synonyms":""},{"def":"to move quickly from one scene to another","examples":["The scene cuts from the bedroom to the street."],"opposite":"","synonyms":""},{"def":"to stay away from a class that you should go to","examples":["He's always cutting class."],"opposite":"","synonyms":""},{"def":"to hurt somebody emotionally","examples":["His cruel remarks cut her deeply."],"opposite":"","synonyms":""},{"def":"to divide a pack of playing cards by lifting a section from the top, in order to reveal a card to decide who is to play first, etc.","examples":["Let's cut for dealer."],"opposite":"","synonyms":""},{"def":"to cross another line","examples":["The line cuts the circle at two points."],"opposite":"","synonyms":""},{"def":"to have a new tooth beginning to appear through the gum","examples":["When did she cut her first tooth?"],"opposite":"","synonyms":""},{"def":"to make a sound recording on a record, CD, etc.","examples":["The Beatles cut their first disc in 1962."],"opposite":"","synonyms":""},{"def":"to mix an illegal drug such as heroin with another substance","examples":[],"opposite":"","synonyms":""},{"def":"to make a quick or sudden escape","examples":[],"opposite":"","synonyms":""},{"def":"to (not) be as good as is expected or needed","examples":["He won't cut it as a professional singer."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"cut and run","def":"to make a quick or sudden escape","examples":[]},{"idiom":"(not) cut it","def":"to (not) be as good as is expected or needed","examples":["He won't cut it as a professional singer."]}],"phrasal":["be cut out for","be cut out to be","cut across","cut away","cut back","cut down","cut in","cut off","cut out","cut through","cut up"],"related":["cut in","cut-in","cut up","bias-cut","boot-cut","buzz cut","crew cut","crew-cut","cut-off","cut away","cut back","cut down","cut-down","cut off","cut out","cut-out","jump cut","low-cut"]},{"pos":"noun","level":"B1","meanings":[{"def":"a wound caused by something sharp","examples":["cuts and bruises on the face","Blood poured from the deep cut on his arm.","Clean the cut and cover it to prevent infection.","He has a small cut on his finger.","One man was attacked and suffered cuts to his face.","She got a bad cut over her right eye.","He came home covered in cuts and bruises.","She suffered only minor cuts and grazes as a result of the accident."],"opposite":"","synonyms":""},{"def":"a hole or an opening in something, made with something sharp","examples":["Using sharp scissors, make a small cut in the material.","a high-quality blade that gives a clean cut"],"opposite":"","synonyms":""},{"def":"a reduction in amount, size, supply, etc.","examples":["tax/budget/price/funding cuts","The company has made another round of job cuts this year.","cut in something They announced cuts in public spending.","They had to take a 20% cut in pay.","job/​salary/​pay cuts","The company has announced a new round of job cuts.","The cuts will come into effect next May.","The staff have all had to take a cut in salary.","They are planning to make substantial cuts in the service.","cuts in public spending","proposed tax cuts"],"opposite":"","synonyms":""},{"def":"an act of cutting somebody’s hair; the style in which it is cut","examples":["Your hair could do with a cut (= it is too long).","a cut and blow-dry","The stylish cut of her hair is distinctively modern and urban."],"opposite":"","synonyms":""},{"def":"the shape and style that a piece of clothing has because of the way the cloth is cut","examples":["the elegant cut of her dress","trousers with a loose cut designed for comfortable wear"],"opposite":"","synonyms":""},{"def":"a share in something, especially money","examples":["They were rewarded with a cut of 5% from the profits.","He takes a cut of the profits.","If there's money to be made from selling photos of her, she wants her cut.","By the time the organizers have had their cut, there won't be much left.","There wasn't much left after his agents took their cut."],"opposite":"","synonyms":""},{"def":"an act of removing part of a film, play, piece of writing, etc.","examples":["The director objected to the cuts ordered by the censor.","She made some cuts before handing over the finished novel."],"opposite":"","synonyms":""},{"def":"a piece of meat cut from an animal","examples":["a lean cut of pork","cheap cuts of stewing lamb","The recipe calls for a good lean cut of beef."],"opposite":"","synonyms":""},{"def":"better than somebody/something","examples":["His latest novel is a cut above the rest."],"opposite":"","synonyms":""},{"def":"the lively or aggressive way that something is done","examples":["the cut and thrust of political debate","his cut-and-thrust management style"],"opposite":"","synonyms":""},{"def":"to reach or maintain the required standard","examples":["I had to explain to the applicants why they didn't make the cut."],"opposite":"","synonyms":""},{"def":"(in golf) to achieve a good enough score to be able to take part in the next stage of a competition","examples":["Woods needed a 69 to make the cut."],"opposite":"","synonyms":""},{"def":"to be included after parts have been removed","examples":["When a book is made into a movie not every scene will make the cut."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a cut above somebody/something","def":"better than somebody/something","examples":["His latest novel is a cut above the rest."]},{"idiom":"the cut and thrust (of something)","def":"the lively or aggressive way that something is done","examples":["the cut and thrust of political debate","his cut-and-thrust management style"]},{"idiom":"make the cut","def":"to reach or maintain the required standard","examples":["I had to explain to the applicants why they didn't make the cut.","Woods needed a 69 to make the cut.","When a book is made into a movie not every scene will make the cut."]}],"phrasal":[],"related":[]}]