[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/c/cyc/cycle/cycle__us_1.mp3","phonsUS":"/ˈsaɪkl/","level":"A2","meanings":[{"def":"a bicycle or motorcycle","examples":["He was riding his cycle home when he was hit by a lorry.","We went for a cycle ride on Sunday.","on a cycle Lots of people arrived in cars or on cycles.","by cycle They completed their journey by cycle."],"opposite":"","synonyms":""},{"def":"the fact of a series of events being repeated many times, always in the same order","examples":["Every business goes through cycles.","cycle of something the cycle of the seasons","The argument is that reprisals simply perpetuate the cycle of violence.","They could not break the cycle of harvest failure, food shortage, price increase and misery.","in a cycle Front runners generally establish themselves early in the election cycle.","The percentage of companies being downgraded was typical for this point in the economic cycle.","different phases of the cell cycle","Life is a natural cycle, just like the changing seasons.","Male and female adults mate, the female lays eggs, and the cycle begins all over again.","The European market is simply going through an economic cycle.","The number of young produced per breeding cycle varies from species to species.","This cycle of events continually repeats itself.","To complete the cycle, oxygen is necessary.","a diagram of the water cycle","at this point in the cycle","caught up in a vicious cycle of bingeing and dieting","part of the cycle of birth and death","the 76-year solar cycle","the annual cycle of church festivals","women with irregular menstrual cycles"],"opposite":"","synonyms":""},{"def":"a complete set or series, for example of movements in a machine","examples":["eight cycles per second","the rinse cycle (= in a washing machine)"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["cycle lane","cycle path","life cycle","lunar cycle","song cycle","carbon cycle","cycle rickshaw","nitrogen cycle","water cycle","National Cycle Network","cycle lanes","cycle paths","cycle track","vicious cycle","cycle rickshaws","cycle-rickshaw"]},{"pos":"verb","level":"A2","meanings":[{"def":"to ride a bicycle; to travel by bicycle","examples":["measures to encourage more people to cycle","+ adv./prep. I usually cycle home through the park.","He cycles ten miles to and from work every day."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]