[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dam/damag/damage__us_1.mp3","phonsUS":"/ˈdæmɪdʒ/","level":"B1","meanings":[{"def":"physical harm caused to something which makes it less attractive, useful or valuable","examples":["serious/severe damage","The building suffered extensive damage by fire in 1925.","permanent/irreparable/irreversible damage","The accident caused no permanent damage.","She suffered minor brain damage at birth.","liver/nerve/kidney damage","flood/storm/smoke/water/fire damage","damage to something The earthquake caused damage to property estimated at $6 billion.","The storm didn't do much damage.","Industry could inflict further damage on the island's ecology.","It could take years to repair the damage.","Make sure you insure your camera against loss or damage.","There is growing awareness of the environmental damage caused by cars.","All three compounds caused substantial DNA damage.","He was prosecuted for criminal damage to a vehicle.","In war, there is always collateral damage.","At the moment it is difficult to assess the extent of the damage.","Let's take a look at the damage.","I insist on paying for the damage.","Crops are sprayed with chemicals to prevent damage from insects.","The attempt at stopping the floods turned into a damage-limitation exercise.","The insurance policy covers the building for accidental damage.","The power plant will cause untold damage to the local environment.","The property damage is expected to exceed $10 billion."],"opposite":"","synonyms":""},{"def":"harmful effects on somebody/something","examples":["The children suffered psychological and emotional damage.","irreparable/permanent/lasting damage","damage to somebody/something This could cause serious damage to the country's economy.","It will be hard to repair the damage to his reputation.","Don't you think you've done enough damage already?","Don't try to apologize—the damage is done.","Serious damage control was needed after the information was leaked to the papers.","The incident did permanent damage to relations between the two countries.","They inflicted severe psychological damage on their opponents."],"opposite":"","synonyms":""},{"def":"an amount of money that a court decides should be paid to somebody by the person, company, etc. that has caused them harm or injury","examples":["He was ordered to pay damages totalling £30 000.","They intend to sue for damages.","Ann was awarded £6 000 (in) damages.","She was awarded damages of £6 000 .","A woman is to bring a civil damages claim against the two men.","He received damages for personal injury.","If goods are lost in transit, the carrier will be liable for damages.","The court will assess the damages.","The judge upheld her claim for damages against her former employer.","damages incurred by the unfairly sacked workers"],"opposite":"","synonyms":""},{"def":"a way of asking how much something costs","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"what’s the damage?","def":"a way of asking how much something costs","examples":[]}],"phrasal":[],"related":["brain damage","collateral damage","criminal damage","damage limitation","damage control"]},{"pos":"verb","level":"B1","meanings":[{"def":"to have a bad or harmful effect on something/somebody","examples":["The church was badly damaged by the 1997 earthquake.","Smoking seriously damages your health.","to be severely/heavily damaged in the fire","Our car was damaged beyond repair in the crash.","She fears the allegations could permanently damage her reputation.","She was psychologically damaged by her experiences.","A number of houses were damaged or destroyed by the fire.","Injuries were minimal, but some business property was damaged.","Damp has damaged some of the paintings irreparably.","The government has the power to fine companies that damage the environment.","Many feel the organization's credibility has been damaged.","The fire badly damaged the town hall.","emotionally damaged children","Hard work never hurt anyone.","Pollution can harm marine life.","Even one drink can impair driving performance."],"opposite":"","synonyms":"damage"}],"idioms":[],"phrasal":[],"related":[]}]