[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dan/dange/danger__us_1.mp3","phonsUS":"/ˈdeɪndʒər/","level":"A2","meanings":[{"def":"the possibility of something happening that will injure, harm or kill somebody, or damage or destroy something","examples":["Danger! Keep Out!","Firefighters face danger every day.","in danger Children's lives are in danger every time they cross this road.","in grave/mortal danger","They found themselves in grave danger.","in danger of something species in imminent danger of extinction","out of danger Doctors said she is now out of danger (= not likely to die).","Despite the high levels of radiation, people are now moving back into the danger zone.","He recognized the danger signs and gave up smoking.","He was admitted to hospital in critical condition, but is now off the danger list.","He was convicted of causing danger to other road users.","No one foresaw the danger.","On their journey across the desert they faced danger of all sorts.","She knew that she was now in mortal danger.","Some people take crazy risks because they get a thrill from courting danger.","The animal seemed to sense danger.","The divers were paid danger money for working in such hazardous conditions.","The task was fraught with danger.","There is no danger to the public from these chemicals.","They ran until they were out of danger.","We waited until all danger had passed.","We weren't in any danger.","Where would they hide if danger threatened?"],"opposite":"","synonyms":""},{"def":"the possibility of something bad or unpleasant happening","examples":["danger of something There is no danger of a bush fire now.","danger of doing something They reminded residents of the potential dangers of living so near an active volcano.","‘Nicky won't find out, will she?’ ‘Oh, no, there's no danger of that.’","in danger of doing something The building is in danger of collapsing.","How many people are in danger of losing their jobs?","danger that… There is a danger that the political disorder of the past will return.","Most people are aware of the dangers posed by online fraudsters.","There is little danger of another crash.","The danger lies in becoming too complacent.","They are in grave danger of losing everything.","Vigorous action is needed to avert the danger of runaway inflation.","We're in serious danger of becoming a nation of worriers.","the ever-present danger of crime","There are around 5 000 species of animals in danger of extinction.","the dangers posed by the possession of nuclear weapons"],"opposite":"","synonyms":""},{"def":"a person or thing that may cause damage, or harm somebody","examples":["There are many hidden dangers for small children in the home.","danger to somebody/something Smoking is a serious danger to health.","Police said the man was a danger to the public.","One of the biggest dangers facing us may be climate change.","The pollution from the factory is a public danger.","The hackers' actions are a clear and present danger to our banking system.","There are inherent dangers in the system.","We're only now waking up to the true dangers of pesticides.","The United manager believes Figo is the opposition's danger man."],"opposite":"","synonyms":""},{"def":"to be so ill that you may die; to no longer be very ill","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be on/off the danger list","def":"to be so ill that you may die; to no longer be very ill","examples":[]}],"phrasal":[],"related":["danger zone","danger money","clear and present danger","danger pay","danger zones"]}]