[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dan/dange/dangerous__us_1.mp3","phonsUS":"/ˈdeɪndʒərəs/","level":"A1","meanings":[{"def":"likely to injure or harm somebody, or to damage or destroy something","examples":["The situation is extremely dangerous.","Fog and ice are making the roads very dangerous.","potentially dangerous levels of pesticides","It's one of the most dangerous places in the world.","The prisoners who escaped are violent and dangerous.","(British English) a conviction for dangerous driving","dangerous for somebody Poor air quality is particularly dangerous for young children.","dangerous for somebody to do something It would be dangerous for you to stay here.","dangerous to somebody/something The evidence is clear that smoking is dangerous to health.","This route through the mountains is notoriously dangerous.","Conditions have become difficult and dangerous.","This treatment is extremely dangerous for the mother.","The substance is not dangerous to humans.","Flu can be a dangerous illness for some people, including the very young.","The plans would create more traffic and be dangerous for children and old people."],"opposite":"","synonyms":""},{"def":"likely to cause problems or have a bad result","examples":["This ruling sets a dangerous precedent.","Raising income tax is considered politically dangerous.","dangerous to do something As always, it's dangerous to generalize."],"opposite":"","synonyms":""},{"def":"a situation in which somebody takes risks, usually hoping to gain an advantage","examples":["Both gangs are playing a very dangerous game."],"opposite":"","synonyms":""},{"def":"a situation or subject that is likely to make somebody angry, or that involves risk","examples":["Would I be on dangerous ground if I asked why?"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a dangerous game","def":"a situation in which somebody takes risks, usually hoping to gain an advantage","examples":["Both gangs are playing a very dangerous game."]},{"idiom":"dangerous ground","def":"a situation or subject that is likely to make somebody angry, or that involves risk","examples":["Would I be on dangerous ground if I asked why?"]}],"phrasal":[],"related":["tread a difficult, dangerous, solitary, etc. path"]}]