[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dat/data_/data__us_3_rr.mp3","phonsUS":"/ˈdeɪtə/","level":"A2","meanings":[{"def":"facts or information, especially when examined and used to find out things or to make decisions","examples":["We collected publicly available data over a 10-day period.","to gather/obtain data","What methods are you using to interpret the data?","data on something Researchers analysed the data on 2 515 patient visits at the Children's Hospital.","data for something Table 2 provides data for southeast Nebraska.","Our model is based on experimental data.","published/unpublished data","scientific/historical/clinical data","It is essential to protect your personal data.","raw data (= that has not been analysed)","Multiple data collection methods were used.","(specialist) These data show that most cancers are detected as a result of clinical follow-up.","Although we were using the same set of data, we obtained different results.","The fuller data set for this period permits a much more detailed analysis.","Data about patients is only released with their permission.","Data indicates that most crime is committed by young males.","My aim is to synthesize data from all the surveys.","One vital item of data was missing from the table.","The data derived from this project has increased our knowledge of how genes work.","The government departments refused to provide the data that we required.","The next step is to feed in all this data.","There is no hard data to support these theories.","These demands could breach EU data-protection laws.","They are not allowed to hold data on people's private finances.","This data reflects the magnitude of the problem.","This theory seems to fit the available data.","We have found some very interesting things in the data.","We have no data for southern Mexico.","Weather conditions have made accurate data collection difficult.","These data were collected over a period of several months.","data on the effects of pollution","The data was collected from 67 countries.","There is very little reliable data available."],"opposite":"","synonyms":""},{"def":"information that is stored by a computer","examples":["All this data is stored on hundreds of servers in San Francisco.","data storage/transfer","The computer can manipulate massive amounts of data.","They are testing some new data capture software.","Our capacity to generate and transmit data has grown exponentially."],"opposite":"","synonyms":""},{"def":"a person, book, etc. that can give you a lot of information on a particular subject","examples":["This book is a mine of information on the Romans.","The internet can be a mine of information.","The questionnaire results proved to be a rich mine of empirical data."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a mine of information/data (about/on somebody/something)","def":"a person, book, etc. that can give you a lot of information on a particular subject","examples":["This book is a mine of information on the Romans.","The internet can be a mine of information.","The questionnaire results proved to be a rich mine of empirical data."]}],"phrasal":[],"related":["big data","data set","data type","data centre","data-driven","data mining","data point","data capture","data terminal","data processing","data projector","data protection","data warehouse","data warehousing","Data Protection Act","data sets","data center","data points","data types"]}]