[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dat/date_/date__us_1.mp3","phonsUS":"/deɪt/","level":"A1","meanings":[{"def":"a particular day of the month, sometimes in a particular year, given in numbers and words","examples":["‘What's the date today?’ ‘The 10th.’","Write today's date at the top of the page.","They haven't set a date for the wedding yet.","We need to fix a date for the next meeting.","I can't come on that date.","Please give your name, address and date of birth.","(especially North American English) name, address and birth date","There's no word yet on a UK release date for the film.","a start/launch/completion date","There's no date on this letter.","Anyone who knows of the vehicle’s whereabouts from that date until 31 October is asked to contact Bangor police station.","Give me a couple of dates that are good for you.","I can't give you specific dates.","I have two meetings on that date.","She suggested an earlier date for the meeting.","The baby was born exactly on its due date.","The agreement runs from that date.","The building was not finished by the completion date.","The closing date for applications is May 22.","the date of the election","We cannot accept applications received after this date.","A trial date is expected to be announced next month."],"opposite":"","synonyms":""},{"def":"a particular day or year when a particular event happened or will happen","examples":["1066 is the most famous date in English history.","the biggest date in the country music calendar","I hated history at school—I could never remember all those dates.","What were Beethoven's dates (= the years of his birth and death)?","What was the date of the Battle of Hastings?","The painting bears the date 1626.","Historians disagree on the cut-off date for the medieval period.","It's difficult to put a date on when the idea started.","A large carved stone gives the dates of birth and death of her three sons."],"opposite":"","synonyms":""},{"def":"a time in the past or future that is not a particular day","examples":["The details can be added at a later date.","The work will be carried out at a future date.","This was an important trade route from an early date.","a building of late Roman date","The election is scheduled to take place at an unspecified date in the autumn.","The building has certain features in common with cathedrals of a similar date.","The foundations are Roman, but the rest of the building is of more recent date."],"opposite":"","synonyms":""},{"def":"an arrangement to meet somebody at a particular time","examples":["Call me next week and we'll try and make a date.","Next Friday? Fine—it's a date!","We must make a date to have lunch.","She wanted to arrive in time to keep her date.","He was late, and ended up breaking their dinner date."],"opposite":"","synonyms":""},{"def":"a meeting that you have arranged with a boyfriend or girlfriend or with somebody who might become a boyfriend or girlfriend","examples":["a date with somebody I've got a date with Lucy tomorrow night.","on a date We agreed to go out on a date.","Do you think I should ask him out on a date?","Paul's not coming. He's got a hot date (= an exciting one).","She's out on a date with her new boyfriend.","I have a date with Camilla on Friday night.","It's a great date movie."],"opposite":"","synonyms":""},{"def":"a boyfriend or girlfriend with whom you have arranged a date","examples":["My date is meeting me at seven.","I need to find a date for Friday."],"opposite":"","synonyms":""},{"def":"a sweet sticky brown fruit that grows on a tree called a date palm, common in North Africa and West Asia","examples":[],"opposite":"","synonyms":""},{"def":"until now","examples":["To date, we have received over 200 replies.","The exhibition contains some of his best work to date."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"to date","def":"until now","examples":["To date, we have received over 200 replies.","The exhibition contains some of his best work to date."]}],"phrasal":[],"related":["date to","due date","date back","date from","Date Line","date rape","play date","post-date","pull date","rain date","blind date","Blind Date","double date","double-date","expiry date","closing date","out of date","up to date","expiration date"]},{"pos":"verb","level":"B2","meanings":[{"def":"to write or print the date on something","examples":["Thank you for your letter dated 24th March.","The forms should be dated and signed and sent back immediately."],"opposite":"","synonyms":""},{"def":"to say when something old existed or was made","examples":["date something It has not yet been possible to date the paintings accurately.","date something at something The skeleton has been dated at about 2000 BC.","date something to something The manuscript has been dated to the sixteenth century.","date something between A and B There are five self-portraits by Kahlo, dated between 1937 and 1943."],"opposite":"","synonyms":""},{"def":"to become old-fashioned","examples":["She designs classic clothes which do not date."],"opposite":"","synonyms":""},{"def":"if something dates you, it shows that you are fairly old or older than the people you are with","examples":["I was at the Woodstock festival—that dates me, doesn't it?"],"opposite":"","synonyms":""},{"def":"to have a romantic relationship with somebody","examples":["She's been dating Ron for several months.","How long have you two been dating?"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["date back","date from","date to"],"related":[]}]