[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/deb/debat/debate__us_1.mp3","phonsUS":"/dɪˈbeɪt/","level":"B2","meanings":[{"def":"a formal discussion of an issue at a public meeting or in a parliament. In a debate two or more speakers express opposite views and then there is often a vote on the issue.","examples":["the first ever televised presidential debate","The minister opened the debate (= was the first to speak).","After a long debate, Congress approved the proposal.","debate on something a debate on transport policy","under debate The motion under debate (= being discussed) was put to a vote.","Discussions are still taking place between the two leaders.","a telephone conversation","The novel has long descriptions and not much dialogue.","The President told waiting reporters there had been a constructive dialogue.","I had a long talk with my boss about my career prospects.","a debate on prison reform","There have been extensive consultations between the two countries.","We had a good gossip about the boss.","a debate on prison reform","The president will open the debate.","The environmentalists seem to have lost the debate over the building of this road.","The poll showed that the Democrat won last night's presidential debate.","Many of these points were raised during the debate on prison reform.","The debate focused on who should pay for the changes.","legislative debates over gay marriage","a parliamentary debate on the fishing industry","Experts pore over the President's debate performances.","The union holds debates for students.","The motion under debate was put to a vote.","Three major issues have dominated the education debate."],"opposite":"","synonyms":"discussion"},{"def":"an argument or a discussion expressing different opinions","examples":["The issue has sparked debate across the industry.","to provoke/stimulate debate","a fierce/vigorous debate","The theatre's future is a subject of lively public debate.","Intense political debate focused on the merits of the two alternative schemes.","debate about something There has been heated debate about whether the film should be allowed.","debate on something There has been much debate on the issue of childcare.","debate over something the ongoing debate over American foreign policy","Whether he deserved what happened to him is open to debate (= cannot be certain or decided yet).","under debate The issue is still under debate.","The proposed changes to the law have been the subject of much debate.","the debate surrounding contemporary art","the growing debate on school reform","Many leading charities have contributed to the debate on world poverty.","You cannot separate unemployment from the wider debate about the economy.","We had a brief debate about whether or not to accept the offer.","This accident has sparked off an intense debate on road safety.","These events shifted debate from economic issues to social ones.","The nature of this book is to provoke reasoned debate.","The incident has reignited public debate over the role of teachers.","The club started admitting women in 1901 after years of bitter debate.","He was reluctant to enter the debate for or against war.","He accused the government of trying to stifle debate.","Efforts to reduce the budget have led to a lot of internal debate at the studio.","What went on behind the scenes remains a matter for debate ."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"B2","meanings":[{"def":"to discuss something, especially formally, before making a decision or finding a solution","examples":["debate (something) Politicians will be debating the bill later this week.","It is time to debate the issue of school funding.","They debated endlessly, without ever reaching a decision.","The question of the origin of the universe is still hotly debated (= strongly argued about) by scientists.","to be openly/widely/publicly debated","debate whether, what, etc… The committee will debate whether to lower the age of club membership to 16.","We talked on the phone for over an hour.","Have you discussed the problem with anyone?","I’ve spoken to the manager about it.","‘Can I speak to Susan?’ ‘Speaking.’ (= at the beginning of a phone conversation)","We only communicate by email.","Dolphins use sound to communicate with each other.","Politicians will be debating the bill later this week.","You shouldn’t have done it without consulting me.","The question of security needs to be debated publicly.","The report has been widely debated in the industry.","a presidential candidate debating with his opponent"],"opposite":"","synonyms":"talk"},{"def":"to think carefully about something before making a decision","examples":["debate (with yourself) She debated with herself for a while, and then picked up the phone.","debate whether, what, etc… We're debating whether or not to go skiing this winter.","debate doing something For a moment he debated going after her."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]