[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/deb/debt_/debt__us_1.mp3","phonsUS":"/det/","level":"B2","meanings":[{"def":"a sum of money that somebody owes","examples":["to pay/repay a debt","I need to pay off all my debts.","I've finally cleared all my debts.","After settling his debts he was left with just £2000.","an outstanding debt of £300","He had run up huge credit card debts.","They had incurred debts of over $1 million.","After a series of meetings, the banks were forced to write off the company's debts.","He was burdened with crippling debts.","a company faced with mounting debts","He wanted to consolidate his debts into one payment.","The company has reached a deal allowing it to restructure its debts.","Only two payments were made, leaving an outstanding debt of £300.","Data show that debt levels at private companies are increasing.","Managing your student loan debt is not easy.","The country has a national debt of 80% of GNP.","The company wrote it off as a bad debt.","debts arising from bad investments","a debt secured on property","The fall in exports has left the country unable to service its debts.","Without a job, he'll never clear his debts.","The company defaulted on its debt and its assets were seized."],"opposite":"","synonyms":""},{"def":"the situation of owing money, especially when you cannot pay","examples":["in debt He died heavily in debt.","The club is £4 million in debt.","We were poor but we never got into debt.","out of debt It's hard to stay out of debt when you are a student.","The country's debt burden is increasing.","a solution to the debt crisis of the developing world","We offer financial and debt-management advice.","Faced with a mounting burden of debt, he sold off the company.","Governments may find it increasingly difficult to manage their debt repayments.","She faces a mountain of debt—$60 000 in student loans and $15 000 in credit card balances."],"opposite":"","synonyms":""},{"def":"the fact that you should feel grateful to somebody because they have helped you or been kind to you","examples":["I owe them a debt of gratitude that I can never repay.","I would like to acknowledge my debt to my teachers.","She was simply repaying a debt, saving his career in return for him saving hers."],"opposite":"","synonyms":""},{"def":"to feel grateful to somebody for their help, kind behaviour, etc.","examples":["I am in Ruth's debt for the excellent advice she gave me."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be in somebody’s debt","def":"to feel grateful to somebody for their help, kind behaviour, etc.","examples":["I am in Ruth's debt for the excellent advice she gave me."]}],"phrasal":[],"related":["bad debt","carbon debt","debt relief","debt ceiling","national debt","debt collector","sovereign debt","debt ceilings","debt reliefs","debt collectors"]}]