[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dec/decis/decision__us_4.mp3","phonsUS":"/dɪˈsɪʒn/","level":"A2","meanings":[{"def":"a choice or judgement that you make after thinking and talking about what is the best thing to do","examples":["I think I've made the right decision.","(British English) No decisions have yet been taken.","decision on something We need a decision on this by next week.","decision about something I will consult colleagues before making a final decision about how to proceed.","We must come to a decision about what to do next.","We finally reached a decision (= decided after some difficulty).","decision to do something Who made the decision to go ahead with the project?","Choosing a college is a big decision for students and their families.","a difficult/tough/hard decision","It is almost impossible for the average person to make an informed decision (= one based on evidence).","The government plans to appeal the decision in the High Court.","to reverse/overturn a decision on appeal","The editor's decision is final.","a decision on her future","Her parents respected her decision not to marry.","I didn't want to influence his decision.","Nobody has the authority to overrule his decision.","plans to challenge this decision in the High Court","She defended her decision not to give him the job.","The management committee upheld her decision to fire two of her staff.","I had to make a snap decision about what to do with the money.","We need a firm decision by Friday.","She now faces the toughest decision of her life.","I need more facts before I can make an informed decision.","Key decisions are always taken by the editor.","Presidents must make momentous life-and-death decisions while in office.","In a landmark decision, the court agreed to hear evidence from twenty years earlier.","The decision is irreversible.","In the end, the decision to scrap the project was unanimous.","It's decision time, and deciding is difficult.","The committee will give us their decision tomorrow."],"opposite":"","synonyms":""},{"def":"the process of deciding something","examples":["The moment of decision had arrived.","The power of decision remained with the directors.","The most persuasive talker often dominates the decision process."],"opposite":"","synonyms":""},{"def":"the ability to decide something clearly and quickly","examples":["This is not a job for someone who lacks decision."],"opposite":"indecision","synonyms":""},{"def":"to not decide or make a judgement about something until a later time","examples":["I'd prefer to reserve judgement until I know all the facts.","Three judges have decided to reserve their decision until a later date."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"reserve (your) decision/judgement","def":"to not decide or make a judgement about something until a later time","examples":["I'd prefer to reserve judgement until I know all the facts.","Three judges have decided to reserve their decision until a later date."]}],"phrasal":[],"related":["Bakke decision","decision-maker","decision-making","decision theory","Miranda decision","decision-makers","Dred Scott decision"]}]