[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dec/decid/decide__us_2.mp3","phonsUS":"/dɪˈsaɪd/","level":"A1","meanings":[{"def":"to think carefully about the different possibilities that are available and choose one of them","examples":["It's up to you to decide.","You will have to decide soon.","I can't tell you what to do—you'll have to decide for yourself.","decide to do something We've decided not to go away after all.","Why did you decide to look for a new job?","She gave up politics and decided instead to focus on charity work.","decide (that)… The government has already decided that the law needs to be changed.","She decided that she wanted to live in France.","decide what, whether, etc… You have the right to decide what you want to do.","I can't decide what to wear.","She couldn’t decide whether he was telling the truth or not.","decide between A and B It was difficult to decide between the two candidates.","decide against something She finally decided against a career in medicine.","decide against doing something They decided against taking legal action.","decide something Sales figures will ultimately decide the future of these types of games.","We might be hiring more people but nothing has been decided yet.","The venue for the concert has yet to be decided.","it is decided (that)… It was decided that the school should purchase new software.","You choose—I can't decide.","It's time to decide whether you want to continue.","We've reluctantly decided to sell the house.","They had unanimously decided to go with the captain's plan.","The exact time of the meeting is still to be decided.","They decided in favour of reducing the fees."],"opposite":"","synonyms":""},{"def":"to make an official or legal judgement","examples":["decide something The case will be decided by a jury.","decide for/in favour of somebody | decide in somebody’s favour The Appeal Court decided in their favour.","decide against somebody It is always possible that the judge may decide against you.","decide on something He challenged her right as governor to decide on the matter."],"opposite":"","synonyms":""},{"def":"to affect the result of something","examples":["decide something A mixture of skill and good luck decided the outcome of the game.","decide if, whether, etc… A number of factors decide whether a movie will be successful or not."],"opposite":"","synonyms":""},{"def":"to be the reason why somebody does something","examples":["For most customers, price is the deciding factor.","decide somebody (to do something) They offered me free accommodation for a year, and that decided me.","decide something (for somebody) That decided it for me: I wasn't carrying my bike back up those stairs."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["decide on","decide upon"],"related":["decide on","decide upon","decide on something","decide upon something"]}]