[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dec/decla/declaration__us_1.mp3","phonsUS":"/ˌdekləˈreɪʃn/","level":"C1","meanings":[{"def":"an official or formal statement, especially about the plans of a government or an organization; the act of making such a statement","examples":["to issue/sign a declaration","the declaration of war","the Declaration of Independence (= of the United States)","The declaration asked governments to consider introducing new environmental taxes.","All four countries have adopted the declaration against hunting these rare animals.","The government will issue a formal declaration tomorrow.","the UN declaration on Human Rights"],"opposite":"","synonyms":""},{"def":"a written or spoken statement, especially about what people feel or believe","examples":["a declaration of love/faith/guilt","She had been waiting for him to make a declaration of love.","The Russian leader received a ringing declaration of support yesterday.","A government spokesperson made a statement to the press.","She made helpful comments on my work.","the announcement of a peace agreement","He made a number of rude remarks about the food.","the declaration of war","He began by making a few general observations about the report."],"opposite":"","synonyms":"statement"},{"def":"an official written statement giving information","examples":["a declaration of income","customs declarations (= giving details of goods that have been brought into a country)","The company will only provide insurance if the information on the proposal form and declaration is correct and complete.","We were asked to sign a declaration to the effect that we were UK citizens.","False declaration of hours worked may lead to dismissal."],"opposite":"","synonyms":""},{"def":"an official announcement of the number of votes each candidate has received in an election","examples":["The declaration of the poll will take place tomorrow morning."],"opposite":"","synonyms":""},{"def":"the act of ending an innings before all your players have batted","examples":["After England's declaration at 379 for 6, they overwhelmed their hapless opponents."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Balfour Declaration","Declaration of Independence","Downing Street Declaration"]}]