[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dec/decla/declare__us_2.mp3","phonsUS":"/dɪˈkler/","level":"B2","meanings":[{"def":"to say something officially or publicly","examples":["declare something The government has declared a state of emergency.","Germany declared war on France on 1 August 1914.","The government has declared war on (= officially stated its intention to stop) illiteracy.","He will probably have to declare bankruptcy.","Neither side was able to declare victory.","She declared her intention of running for the presidency.","to declare your interest/candidacy","declare that… The court declared that strike action was illegal.","declare something/somebody + noun In the end, they were both declared winners of the tournament.","The area has been declared a national park.","declare something to be something The painting was declared to be a forgery.","declare something as something Excess weight has been declared as one of the top ten health risks in the world.","declare something/somebody + adj. I declare this bridge open.","A doctor had declared him unfit to travel.","Kenya was officially declared independent on December 12, 1963.","The contract was declared void.","Martial law was immediately declared.","The communists had unilaterally declared a ceasefire.","We, the people of Indonesia, hereby declare Indonesia's independence.","The day was declared a public holiday."],"opposite":"","synonyms":""},{"def":"to state something clearly and definitely","examples":["+ speech ‘I'll do it!’ Tom declared.","declare that… He declared that he was in love with her.","declare something Few people dared to declare their opposition to the regime.","declare yourself + adj./noun She declared herself extremely hurt by his lack of support.","to declare war","The painting was declared to be a forgery.","He has already stated his intention to run for election.","During our meeting, he indicated his willingness to cooperate.","They haven’t formally announced their engagement yet.","Has our flight been announced yet?","‘I'm going to win!’ he declared confidently.","‘You're here,’ she declared simply.","Stravinsky famously declared that music expressed nothing.","She proudly declared that she had once been introduced to the Queen.","He declared his true feelings to her."],"opposite":"","synonyms":"declare"},{"def":"to say clearly and openly who you are or what you intend to do","examples":["He was the first gay player in a professional sports team to declare himself openly.","Only two candidates have declared themselves so far.","declare yourself to somebody Freemasons were required by law to declare themselves to the authorities."],"opposite":"","synonyms":""},{"def":"to tell the tax authorities how much money you have earned","examples":["All income must be declared."],"opposite":"","synonyms":""},{"def":"to tell customs officers (= at the border of a country) that you are carrying goods on which you should pay tax","examples":["Do you have anything to declare?"],"opposite":"","synonyms":""},{"def":"to decide to end your innings (= the period during which your team is batting) before all your players have batted","examples":["England declared at 224 for 4 (= 4 batsmen had scored 224 runs)."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["declare against","declare for"],"related":["declare for","declare against","declare for somebody/something","declare against somebody/something"]}]