[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dec/decli/decline__us_2.mp3","phonsUS":"/dɪˈklaɪn/","level":"B2","meanings":[{"def":"to become smaller, fewer, weaker, etc.","examples":["Support for the party continues to decline.","decline by something Sales of whole milk declined by 4 per cent.","decline in something The city declined in importance in the nineteenth century.","to decline in popularity/value/number","Jobs in manufacturing have steadily declined.","to decline sharply/significantly/dramatically","to decline rapidly/markedly/substantially","Her health began to decline.","Profits declined by 6 per cent this year.","The economy has declined sharply in recent years.","The market for these products is declining fast.","The number of full-time staff has declined from 300 to just 50.","This section of the market has slowly declined in importance.","Her health was declining rapidly."],"opposite":"","synonyms":""},{"def":"to refuse politely to accept or to do something","examples":["I offered to give them a lift but they declined.","decline something to decline an offer/invitation","We politely declined her invitation.","She declined a second glass of wine and called for a taxi.","decline to do something Their spokesman declined to comment on the allegations.","Patients of course have the right to decline treatment.","The minister declined to be interviewed.","I absolutely decline to discuss my dealings with him or anyone."],"opposite":"","synonyms":""},{"def":"if a noun, an adjective or a pronoun declines, it has different forms according to whether it is the subject or the object of a verb, whether it is in the singular or plural, etc. When you decline a noun, etc., you list these forms.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Decline and Fall","Decline and Fall of the Roman Empire"]},{"pos":"noun","level":"B2","meanings":[{"def":"a continuous decrease in the number, value, quality, etc. of something","examples":["decline in something There has been a 5 per cent decline in student numbers.","decline of something the decline of seabird populations","a sharp/steep/rapid decline","a steady/gradual decline","They have experienced decades of economic decline.","in decline Industry in Britain has been in decline since the 1970s.","Many of the city's magnificent buildings fell into decline.","The cloth trade went into gradual decline.","a steady decline in manufacturing","We have seen a sharp decline in educational standards over recent years.","a steep decline in sales","the moral decline of the nation","an industry in terminal decline","The increased gold price lead to the decline of his jewellery business.","This area has been on the decline for some years now.","We must halt this decline in health services.","These measures have failed to reverse the country's economic decline.","the decline and fall of a great civilization"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]