[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dec/decre/decrease__us_4_rr.mp3","phonsUS":"/dɪˈkriːs/","level":"B2","meanings":[{"def":"to become smaller in size, number, etc.; to make something smaller in size, number, etc.","examples":["Donations have decreased significantly over the past few years.","a decreasing population","decrease (from something) (to something) The number of new students decreased from 210 to 160 this year.","decrease by something The price of wheat has decreased by 5 per cent.","decrease in something This species of bird is decreasing in numbers every year.","to decrease in size/value","decrease with something Fertility decreases with age.","decrease something The drug did not significantly decrease the risk of heart attack.","People should decrease the amount of fat they eat.","to decrease the incidence/likelihood/rate of something","Average family size has decreased from five to three children.","Crime has decreased by 20 per cent.","The heart gradually decreases in size.","Spending has decreased slightly this year.","The dose was gradually decreased after eight weeks.","The number of quarrels among children decreases with age.","Symptoms include a dry mouth, decreased appetite, headache and tiredness."],"opposite":"increase","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dec/decre/decrease__us_3_rr.mp3","phonsUS":"/ˈdiːkriːs/","level":"B2","meanings":[{"def":"the process of reducing something; the amount that something is reduced by","examples":["Sales for May show a decrease compared with the same month last year.","decrease in something There has been some decrease in military spending this year.","a decrease in the number/level/rate of something","There has been a dramatic decrease in activity among our kids.","decrease of something (in something) There has been a decrease of nearly 6 per cent in the number of visitors to the museum.","decrease (from something) (to something) a decrease from 62% to just under half","on the decrease Marriage is still on the decrease (= decreasing).","Half the companies in the survey reported a decrease in sales.","It is not uncommon to experience a decrease in confidence after a divorce.","The new treatment led to a huge decrease in the number of deaths.","There has been a sharp decrease in pollution since the law was introduced.","This year's figures show a decrease of 30 per cent on last year."],"opposite":"increase","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]