[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/def/defen/defend__us_4.mp3","phonsUS":"/dɪˈfend/","level":"B2","meanings":[{"def":"to protect somebody/something from attack","examples":["defend somebody/something The role of the military is to defend the country.","Troops have been sent to defend the borders.","defend somebody/something against somebody/something The male birds defend their territory against other males.","defend somebody/something from somebody/something The cannons once defended the city from attack by sea.","defend yourself (from/against somebody/something) All our officers are trained to defend themselves against knife attacks.","defend against somebody/something It is impossible to defend against an all-out attack.","She successfully defended herself against an attack from someone larger and stronger.","The city was heavily defended against attack.","They attacked the left flank, which was only lightly defended.","The international community should step into defend the powerless."],"opposite":"","synonyms":""},{"def":"to protect something that you value and prevent it from being taken away","examples":["The organization works to defend human rights wherever they are threatened.","Freedom must always be defended.","The ruling class will always defend its own interests.","People must be vigilant in defending civil liberties regardless of external threats."],"opposite":"","synonyms":""},{"def":"to say or write something in support of somebody/something that has been criticized","examples":["They defended their decision to pull out of the event.","The minister vigorously defended the policy.","How can you defend such behaviour?","I realized I couldn't logically defend my position.","defend somebody/something against somebody/something The article seeks to defend him against charges of hypocrisy.","defend somebody/something from somebody/something Her colleagues united in defending her from further personal attacks.","defend yourself (from/against somebody/something) Politicians are skilled at defending themselves against their critics.","The company has strenuously defended its decision to reduce the workforce.","She was quick to defend her husband's actions.","She defended her department against accusations of incompetence.","I will strenuously defend your right to say what you think."],"opposite":"","synonyms":""},{"def":"to protect your own goal to stop your opponents from scoring","examples":["They were forced to defend for long periods.","defend something Moody and Moran defended their goal well."],"opposite":"","synonyms":""},{"def":"to take part in a competition that you won the last time and try to win it again","examples":["He is defending champion.","She will be defending her title at next month's championships.","The champion successfully defended his title against the American challenger.","(politics) He intends to defend his seat in the next election."],"opposite":"","synonyms":""},{"def":"to act as a lawyer for somebody who has been charged with a crime","examples":["defend (somebody) He has employed one of the UK's top lawyers to defend him.","Who's defending?","defend yourself Smith has announced that she will defend herself in the case."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]