[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/def/defec/defect__us_1_rr.mp3","phonsUS":"/ˈdiːfekt/","level":"C1","meanings":[{"def":"a fault in something or in the way it has been made that means that it is not perfect","examples":["a speech defect","a defect in the glass","Goods with slight defects are sold at half price.","The photograph shows slight defects due to age.","The book contains serious defects.","He has a congenital heart defect.","Congenital defects occurred in 30% of babies born in areas where the weapons were used.","The child had a mild heart defect.","There is evidence that air pollution can cause birth defects.","The drug is widely known to cause birth defects.","Over-breeding in pedigree dogs can cause major genetic defects in puppies.","This is a physical defect that cannot be cured.","The builders agreed to remedy the structural defects.","A structural defect meant that the bridge could not be opened in time for the Millennium celebrations.","The inspector found defects in the aircraft's construction.","a fundamental defect in the product","This product is no longer on sale because of a manufacturing defect.","major defects in the education system","a defect of her character","Many people argue that the present system of voting has some serious defects.","The manufacturer is responsible for any defects that may cause damage.","Vulnerable people are going short of money because of defects in the payment system."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/def/defec/defect__us_2.mp3","phonsUS":"/dɪˈfekt/","level":"","meanings":[{"def":"to leave a political party, country, etc. to join another that is considered to be an enemy","examples":["A number of writers and musicians defected from the Soviet Union to the West in the 1960s.","She defected from the party just days before the election."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]