[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/def/defen/defence__us_12.mp3","phonsUS":"/dɪˈfens/","level":"B2","meanings":[{"def":"the act of protecting somebody/something from attack, criticism, etc.","examples":["in defense of somebody/something soldiers who died in defense of their country","What points can be raised in defense of this argument?","in somebody's defense I have to say in her defense that she knew nothing about it beforehand.","When her brother was criticized she leapt to his defense.","leap/spring/jump/rush to the defense of somebody/something"],"opposite":"","synonyms":""},{"def":"something that provides protection against attack from enemies, the weather, illness, etc.","examples":["They are responsible for maintaining coastal flood defenses.","At this point the country had no effective air defenses.","defense against something The town walls were built as a defense against enemy attacks.","a new missile defense system (= for defense against missiles)","The body has natural defense mechanisms to protect it from disease."],"opposite":"","synonyms":""},{"def":"the organization of the people and systems that are used by a government to protect a country from attack","examples":["(US English) the Department of Defense","(British English) the Ministry of Defence","Issues of national defense are a matter for the government.","Further cuts in defense spending are being considered."],"opposite":"","synonyms":""},{"def":"something that is said or written in order to support something","examples":["a defense of Marxism"],"opposite":"","synonyms":""},{"def":"what is said in court to prove that a person did not commit a crime; the act of presenting this argument in court","examples":["Her defense was that she was somewhere completely different at the time of the crime.","He wanted to conduct his own defense.","The judge rejected her insanity defense."],"opposite":"","synonyms":""},{"def":"the lawyer or lawyers whose job is to prove in court that a person did not commit a crime","examples":["The defense requested more time to prepare their case.","the defense lawyer/counsel/attorney","a witness for the defense"],"opposite":"","synonyms":""},{"def":"the players who must prevent the other team from scoring; the position of these players on the sports field","examples":["Lattimore cut through the defense for a 52-yard touchdown.","on defense (North American English) She plays on defense.","in defence (British English) She plays in defence."],"opposite":"","synonyms":""},{"def":"a contest, game, etc. in which the previous winner or winners compete in order to try to win again","examples":["Osaka begins her defense of the US Open title."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Department of Defense","Strategic Defense Initiative","North American Aerospace Defense Command","civil defense","self-defense","defense mechanism","defense mechanisms","play defense"]}]