[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/def/defea/defeat__us_1.mp3","phonsUS":"/dɪˈfiːt/","level":"B2","meanings":[{"def":"to win against somebody in a war, competition, sports game, etc.","examples":["defeat somebody/something He defeated the champion in three sets.","to defeat a rival/an opponent","The goal is to defeat the enemy by whatever means possible.","a defeated army","Garibaldi defeated the Neapolitan army.","defeat somebody by something The government was defeated by 200 votes to 83.","Davis defeated Morris by eight points in the semi-final.","defeat somebody in something Our team was narrowly defeated in the final.","It was said that he could not be defeated in battle.","He said it was impossible to defeat the terrorists militarily.","The English were decisively defeated by the rebels in the battle that followed.","The senator was decisively defeated by his rivals.","She narrowly defeated the rival candidate in the leadership contest."],"opposite":"","synonyms":""},{"def":"to stop something from being successful","examples":["defeat something They are united in their determination to defeat global terrorism.","The proposed bill was decisively defeated in Parliament.","be defeated by something The motion was defeated by 19 votes.","Writing down your password so you remember it defeats the purpose of having a password.","Staying late at the office to discuss shorter working hours rather defeats the object of the exercise!"],"opposite":"","synonyms":""},{"def":"if something defeats you, you cannot understand it","examples":["The instruction manual completely defeated me.","Question 6 defeated us."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["the jaws of death, defeat, etc.","snatch victory from the jaws of defeat"]},{"pos":"noun","level":"B2","meanings":[{"def":"failure to win or to be successful","examples":["The party faces defeat in the election.","They suffered a narrow defeat in the final.","a heavy/humiliating/crushing defeat","The world champion has only had two defeats in 20 fights.","They finally had to admit defeat (= stop trying to be successful).","to concede/accept defeat","defeat by somebody their defeat by the Brazilians","defeat against somebody last week's defeat against Manchester United","a punishing defeat at the hands of Iceland in the World Cup","in defeat He was gracious in defeat, acknowledging his opponent's greater skill.","a series of small victories and defeats","A skilful politician can always reverse any defeats.","The prime minister conceded defeat and resigned.","The battle ended in a humiliating defeat.","The team suffered defeat at the hands of their oldest rivals.","Their party suffered a heavy defeat in the election.","The team went down to their fifth consecutive defeat.","They lost 4–3 in their second narrow defeat of the week.","They turned a military defeat into a media victory.","We just need to avoid defeat in our last two games."],"opposite":"","synonyms":""},{"def":"the act of winning a victory over somebody/something","examples":["The army inflicted a heavy defeat on rebel forces.","the defeat of fascism","They played a key role in Wellington's defeat of Napoleon at Waterloo.","He almost pulled off a shock defeat of the reigning champion."],"opposite":"","synonyms":""},{"def":"to win something even though it seemed up until the last moment that you would lose","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"snatch victory from the jaws of defeat","def":"to win something even though it seemed up until the last moment that you would lose","examples":[]}],"phrasal":[],"related":[]}]