[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/def/defin/define__us_2.mp3","phonsUS":"/dɪˈfaɪn/","level":"B1","meanings":[{"def":"to say or explain what the meaning of a word or phrase is","examples":["define something The term ‘mental illness’ is difficult to define.","define something as something Life imprisonment is defined as 60 years under state law.","It is important to clarify what is meant by climate change.","Climate change can/may be defined as ‘the long-term fluctuations in temperature, precipitation, wind and other aspects of the earth’s climate’.","A generally accepted definition of global warming is the gradual increase in the overall temperature of the earth’s atmosphere due to the greenhouse effect.","The greenhouse effect is defined by the author as the process by which heat from the sun is trapped in the earth’s atmosphere, causing the temperature of the earth to rise.","The author uses the term climate change to refer to any significant change in measures of climate lasting for an extended period.","The term ‘carbon footprint’ refers to the amount of carbon dioxide released into the atmosphere as a result of the activities of an individual or organization.","Scientists suggest that increased carbon dioxide in the atmosphere will result in an increase in global temperatures, and the term ‘global warming’ is used to describe this phenomenon.","Thread count is defined as the number of threads in one square inch of fabric.","Marriage is defined broadly enough in everyday English to cover same-sex marriages as well as the different-sex kind."],"opposite":"","synonyms":""},{"def":"to describe or show the nature or range of somebody/something","examples":["define something The goals of the project are clearly defined.","At that time women's roles were quite narrowly defined.","to be broadly/loosely defined","The difficulty of a problem was defined in terms of how long it took to complete.","define what, how, etc… It is difficult to define what makes him so popular.","define yourself (as something) He defines himself as an independent.","We have never defined ourselves in our own right.","Social values are not easy to define.","The characters and story are well defined.","The northern boundary of the US was defined through negotiation with Great Britain.","We have chosen to define the scope of our study quite broadly.","There may be problems if responsibilities are not adequately defined.","This type of lymphoma is defined by the presence of specific malignant cells.","the culturally defined role of women","The horizontal and vertical angles of view define the limits of what is seen in the painting.","The Institute defines itself as the agency supporting basic biomedical research.","A ghost story may be broadly defined as a story concerned with the power of the dead to return and confront the living."],"opposite":"","synonyms":""},{"def":"to make or establish the essential character or somebody/something","examples":["define somebody/something For some, the football club defines their identity.","to define the nature/character of somebody/something","define yourself The novel told the story of a preacher-poet, who defines himself through his art."],"opposite":"","synonyms":""},{"def":"to show clearly a line, shape or edge","examples":["The mountain was sharply defined against the sky."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]