[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/def/defin/definition__us_1.mp3","phonsUS":"/ˌdefɪˈnɪʃn/","level":"B1","meanings":[{"def":"an explanation of the meaning of a word or phrase, especially in a dictionary","examples":["The dictionary provides clear, simple definitions.","definition of something the dictionary definition of this term","a precise/strict definition of a word","We need a good working definition of ‘pollution’.","It is important to clarify what is meant by climate change.","Climate change can/may be defined as ‘the long-term fluctuations in temperature, precipitation, wind and other aspects of the earth’s climate’.","A generally accepted definition of global warming is the gradual increase in the overall temperature of the earth’s atmosphere due to the greenhouse effect.","The greenhouse effect is defined by the author as the process by which heat from the sun is trapped in the earth’s atmosphere, causing the temperature of the earth to rise.","The author uses the term climate change to refer to any significant change in measures of climate lasting for an extended period.","The term ‘carbon footprint’ refers to the amount of carbon dioxide released into the atmosphere as a result of the activities of an individual or organization.","Scientists suggest that increased carbon dioxide in the atmosphere will result in an increase in global temperatures, and the term ‘global warming’ is used to describe this phenomenon.","According to a strict definition of ‘assault’, she was not assaulted.","The author provides a clear definition of cultural awareness.","The firm falls within the statutory definition of a ‘small company’.","The mathematical definition of an even number is one that is exactly divisible by 2.","Under the broader definition of ‘poverty’, thousands more people would be included."],"opposite":"","synonyms":""},{"def":"what an idea means","examples":["What's your definition of happiness?","a broad/narrow definition of the concept","There is no agreed definition of what a comprehensive school should be.","They have adopted a very narrow definition of success.","She refused to accept the definition of woman as man's subordinate.","He has expanded the definition of sculpture.","This unusual building barely fits the standard definition of a house.","There is no agreed definition of what is meant by a ‘young person’ in this context."],"opposite":"","synonyms":""},{"def":"the act of saying what a word or an idea means","examples":["The term ‘partner’ requires careful definition.","by definition Neighbours by definition live close by (= this is what being a neighbour means)."],"opposite":"","synonyms":""},{"def":"the quality of being clear and easy to see; the ability of a device to give clear images","examples":["The clarity and definition of the images are excellent.","The definition of this TV is very good."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["high-definition","high-definition multimedia interface"]}]