[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/deg/degre/degree__us_2.mp3","phonsUS":"/dɪˈɡriː/","level":"A2","meanings":[{"def":"a unit for measuring temperature","examples":["at… degrees Water freezes at 32 degrees Fahrenheit (32°F) or zero/nought degrees Celsius (0°C).","above/below… degrees Temperatures are expected to drop below 2 degrees.","Last weekend temperatures reached 40 degrees.","Water boils at 100 degrees centigrade.","Temperatures inside the burning building are estimated to have reached 600 degrees centigrade."],"opposite":"","synonyms":""},{"def":"a unit for measuring angles","examples":["an angle of ninety degrees (90°)","I turned the wheel 90 degrees,","Place the shelf at a 90 degree angle to the wall.","If you study the sky through 360 degrees you will see a whole range of colours.","The camera turned through 180 degrees.","The car had spun through 180 degrees on impact."],"opposite":"","synonyms":""},{"def":"the amount or level of something","examples":["degree of something Her job demands a high degree of skill.","with a degree of something The story has been staged several times before, with varying degrees of success.","to a degree I agree with you to a certain degree.","The reaction to his decision has been, to some degree, predictable.","These criticisms are, to a degree (= to some extent), well founded.","To what degree can parents be held responsible for a child's behaviour?","Most pop music is influenced, to a greater or lesser degree, by the blues.","He would try anything to make her even the smallest degree happier.","His arguments are simplistic to an extreme degree.","I felt excitement and sadness in equal degree as I waved goodbye to my colleagues.","It was possible to date these remains with a fair degree of accuracy.","Psychologists examined her to assess the degree of her illness.","She allowed us a considerable degree of freedom.","The book fails to answer the question with any acceptable degree of certainty.","The boss sometimes follows her instincts to a dangerous degree.","The tax changes will especially hit those on high incomes and, to a lesser degree, small businesses.","We were all disappointed to a greater or lesser degree.","There is a degree of risk in any sport.","These products don't get the same degree of testing as officially approved medications.","The party leaders were all found to be corrupt in varying degrees.","They work hard, but with varying degrees of success.","We all tried to find out about the bus service, with varying degrees of success.","employees of various degrees of ability","Today we rely on computer technology to an unprecedented degree.","the utmost degree of freedom"],"opposite":"","synonyms":""},{"def":"the qualification obtained by students who successfully complete a university or college course","examples":["My brother has a master's degree from Harvard.","degree in something She's pursuing a degree in biochemistry.","a four-year degree course","an undergraduate/graduate/doctoral degree","a law/medical degree","Candidates must have at least an upper second class honours degree.","Candidates must hold a professional degree in architecture.","She earned a joint degree in Spanish and Psychology.","people educated to degree level or beyond","institutions that grant doctoral degrees","The University conferred on him the honorary degree of Doctor of Laws.","a degree-level course"],"opposite":"","synonyms":""},{"def":"a university or college course, normally lasting three years or more","examples":["I'm hoping to do a chemistry degree.","He took a degree in law then joined a law firm."],"opposite":"","synonyms":""},{"def":"a level in a scale of how serious something is","examples":["murder in the first degree (= of the most serious kind)","first-degree murder","third-degree (= very serious) burns"],"opposite":"","synonyms":""},{"def":"slowly and gradually","examples":["By degrees their friendship grew into love.","By slow degrees, the company's turnover dwindled to nothing."],"opposite":"","synonyms":""},{"def":"extremely; to an extreme degree","examples":["The children tested her patience to the nth degree."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"by degrees","def":"slowly and gradually","examples":["By degrees their friendship grew into love.","By slow degrees, the company's turnover dwindled to nothing."]},{"idiom":"to the nth degree","def":"extremely; to an extreme degree","examples":["The children tested her patience to the nth degree."]}],"phrasal":[],"related":["360-degree","first degree","first-degree","higher degree","joint degree","second-degree","third degree","third-degree","bachelor's degree","master’s degree","Associate's degree","360-degree feedback","360-degree appraisal","give somebody the third degree"]}]