[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/del/delay/delay__us_2.mp3","phonsUS":"/dɪˈleɪ/","level":"B2","meanings":[{"def":"a period of time when somebody/something has to wait because of a problem that makes something slow or late","examples":["Commuters will face long delays on the roads today.","to experience/suffer delays","to avoid/minimize further delays","Increased congestion and traffic delays are expected.","a delay of two hours/a two-hour delay","delay in something The strike has led to some delays in train services.","delay in doing something We apologize for the delay in answering your letter.","delay to something These issues have caused serious delays to the project.","Flights to New York may be subject to delay.","After a series of lengthy delays, the case finally came to court.","I apologize for the delay in replying to you.","Passengers complain about lack of information when travel delays occur.","Passengers have experienced long delays.","Please address your letters properly so as to reduce delays.","The building project has been plagued by bureaucratic delays.","Undue delays have been caused by people not doing their jobs properly.","delays in getting to the airport","further delays to the plan","There is a five-minute time delay on the bank's safe.","Travel delays and cancellations are to be expected."],"opposite":"","synonyms":""},{"def":"failure to do something quickly or at the right time; the act of delaying","examples":["There's no time for delay.","without delay Report it to the police without delay (= immediately)."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"B2","meanings":[{"def":"to make somebody/something late or force them to do something more slowly","examples":["My flight was delayed.","Thousands of commuters were delayed for over an hour.","The government is accused of using delaying tactics (= deliberately doing something to delay a process, decision, etc.).","What could have delayed him?","Mellanby's arrival was seriously delayed by a late train.","The train had been unavoidably delayed after a small avalanche blocked the line."],"opposite":"","synonyms":""},{"def":"to not do something until a later time or to make something happen at a later time","examples":["Don't delay—call us today!","We can't delay much longer.","delay something Heavy hail showers delayed the start of the race.","the delay the launch/release/publication of something","She's suffering a delayed reaction (= a reaction that did not happen immediately) to the shock.","delay something until… The judge will delay his verdict until he receives medical reports on the offender.","delay doing something He delayed telling her the news, waiting for the right moment.","These drugs can significantly delay the onset of the disease.","The conservative coalition could delay further reforms or block them altogether.","These arguments will inevitably delay the start of construction."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]