[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/del/deliv/delivery__us_1_rr.mp3","phonsUS":"/dɪˈlɪvəri/","level":"B2","meanings":[{"def":"the act of taking goods, letters, etc. to the people they have been sent to","examples":["Allow 28 days for delivery.","We offer free delivery on orders over $200.","The service guarantees next day delivery.","on delivery Please pay for goods on delivery (= when you receive them).","(formal) When can you take delivery of (= be available to receive) the car?","A delivery van was waiting in the street outside.","Remember to cancel mail delivery when you go on vacation.","Ensure all material is properly packed and sent by recorded delivery.","Order by 30 November to ensure delivery by Christmas.","We offer free home delivery.","We guarantee delivery before 9 a.m. the next day.","guaranteed express delivery to over 170 countries","The government has now taken delivery of the new fighter planes.","She had made a delivery to the address earlier that day.","The shop receives only one delivery of books per week.","At the moment there are two deliveries a day.","We have regular deliveries of bread and milk to the cottage.","We are awaiting delivery of some new office furniture.","We do all our deliveries in the mornings.","completed orders for delivery","He was employed at the local grocery store as a delivery boy.","Are there any delivery charges?","The cost of postal delivery to rural houses is three times as much.","Getting delivery trucks to the site was difficult."],"opposite":"","synonyms":""},{"def":"the act of making a service or information available to people","examples":["the delivery of public services","We have invested to improve service delivery.","Digital content delivery, especially music and video, is big business.","an electronic message delivery system","New trends in healthcare delivery pose a significant challenge to hospitals throughout the country.","We need more efficient delivery of humanitarian aid."],"opposite":"","synonyms":""},{"def":"the process of giving birth to a baby","examples":["an easy/a difficult delivery","a delivery room/ward (= in a hospital, etc.)","a vaginal/caesarean delivery","She had a very easy delivery with her second child.","The figures show an increase in forceps deliveries."],"opposite":"","synonyms":""},{"def":"the way in which somebody speaks, sings a song, etc. in public","examples":["The beautiful poetry was ruined by her poor delivery."],"opposite":"","synonyms":""},{"def":"a ball that is thrown, especially in cricket or baseball","examples":["a fast delivery"],"opposite":"","synonyms":""},{"def":"a system of paying for goods when they are delivered","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"cash on delivery","def":"a system of paying for goods when they are delivered","examples":[]}],"phrasal":[],"related":["delivery man","general delivery","recorded delivery","special delivery","delivery men","breech delivery","cash on delivery","collect on delivery"]}]