[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/del/deliv/deliver__us_2.mp3","phonsUS":"/dɪˈlɪvər/","level":"B1","meanings":[{"def":"to take goods, letters, etc. to the person or people they have been sent to","examples":["deliver something I get my food delivered from the supermarket to save time.","deliver something to somebody/something Leaflets have been delivered to every household.","deliver (to somebody/something) We promise to deliver within 48 hours.","We deliver to our stores seven days a week.","The company will deliver free of charge.","The letter was delivered to his office.","The package had been delivered by hand.","You can either collect the goods or have them delivered."],"opposite":"","synonyms":""},{"def":"to give or send information or ideas to somebody","examples":["deliver something Let me deliver the good news first.","The video delivers a clear message about road safety.","Essentially, Web designers must deliver content simply and effectively.","deliver something to somebody/something Online training sessions are delivered directly to your desktop.","deliver something via something Our courses are delivered via the internet."],"opposite":"","synonyms":""},{"def":"to give a speech, talk, performance, etc. or to make an official statement","examples":["She will deliver a major speech on foreign policy tomorrow.","to deliver an address/a lecture/a sermon","The cast delivered the performances of a lifetime.","The jury finally delivered its verdict.","She is due to deliver a lecture on genetic engineering.","He delivered his lines confidently.","The Court delivered its judgement earlier this month."],"opposite":"","synonyms":""},{"def":"to do what you promised to do or what you are expected to do; to produce or provide what people expect you to","examples":["He has promised to finish the job by June and I am sure he will deliver.","deliver on something She always delivers on her promises.","deliver something If you can't deliver improved sales figures, you're fired.","The team delivered a stunning victory last night.","Successive administrations have failed to deliver adequate funding for education.","the failure of successive governments to deliver economic growth","deliver something to somebody There have been major breakdowns in delivering services to elderly residents.","They said they'll do it, but do you really think they will be able to deliver?","products that deliver on customer expectations","Our aim is deliver high quality services everywhere and at all times.","These changes will deliver real benefits for our customers.","a company which consistently delivers value in its relationships with customers and consumers"],"opposite":"","synonyms":""},{"def":"to take somebody somewhere; to give somebody into somebody else's care or control","examples":["deliver somebody She delivered the kids on time at their father's house.","deliver somebody to somebody/something The taxi delivered us to our hotel.","deliver somebody (up/over) (to somebody/something) They delivered their prisoner over to the invading army."],"opposite":"","synonyms":""},{"def":"to help a woman to give birth to a baby","examples":["The baby was delivered by Caesarean section.","The baby was delivered safely on Tuesday night."],"opposite":"","synonyms":""},{"def":"to give birth to a baby","examples":["deliver something The number of women delivering their babies in hospital increased.","be delivered of something (formal) She was delivered of a healthy boy."],"opposite":"","synonyms":""},{"def":"to throw or aim something","examples":["He delivered the blow (= hit somebody hard) with all his force."],"opposite":"","synonyms":""},{"def":"to rescue somebody from something bad","examples":["Deliver us from evil."],"opposite":"","synonyms":""},{"def":"to do what you have promised to do or what people expect or want you to do","examples":["We expected great things of the England team, but on the day they simply failed to deliver the goods."],"opposite":"","synonyms":""},{"def":"definite, because all the legal documents have been signed","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"deliver the goods | come up with the goods","def":"to do what you have promised to do or what people expect or want you to do","examples":["We expected great things of the England team, but on the day they simply failed to deliver the goods."]},{"idiom":"signed and sealed | signed, sealed and delivered","def":"definite, because all the legal documents have been signed","examples":[]}],"phrasal":[],"related":[]}]