[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dem/deman/demand__us_2.mp3","phonsUS":"/dɪˈmænd/","level":"B2","meanings":[{"def":"a very strong request for something; something that somebody needs","examples":["demand for something a demand for higher pay","demand that… demands that the law on gun ownership should be changed","A federal judge rejected their demands.","The management had no intention of meeting union demands.","A ransom demand has been made for the kidnapped racehorse.","Campaigners have stepped up their demands for immediate government action.","Demands have been made for the immediate distribution of food to the refugees.","I think your demand for a higher salary is perfectly reasonable.","My government cannot give in to the demands of an illegal organization.","The reporter refused their demand that he reveal his sources.","There have been new demands for the government to take action to reduce crime.","demands from the opposition for a recount of the votes","Every now and then there are demands that the law on gun ownership should be changed.","Our firm is constantly striving to satisfy customers' demands.","Their demand for higher pay was ignored."],"opposite":"","synonyms":""},{"def":"things that somebody/something makes you do, especially things that are difficult, make you tired, worried, etc.","examples":["Juggling the demands of work and family is never easy.","She shouldn't always give in to his demands.","demands on somebody As a director he makes huge demands on his actors.","Flying makes enormous demands on pilots.","the day-to-day demands of the job","We must prepare children to respond to the demands of work.","coping with the conflicting demands of work and family life","The emotional demands of the job can be overwhelming.","Teacher training has to evolve to meet the changing demands of the profession.","How do they cope with the conflicting demands of work and family life?","I think the demands of this job are excessive.","Juggling the daily demands of career and family is rewarding, but never easy.","Life is hard for nurses on children's wards, where the emotional demands can be overwhelming.","My elderly parents make a lot of demands on me.","My work seems to make more and more demands on my time.","The person who cannot say ‘no’ to others' requests is likely to be overwhelmed by external demands.","the need for scientific research freed from the immediate demands of industry"],"opposite":"","synonyms":""},{"def":"the desire or need of customers for goods or services that they want to buy or use","examples":["Demand is exceeding supply.","It is becoming more difficult for us to meet demand.","demand for something/somebody Consumer demand for organic foods continues to increase rapidly.","We are struggling to satisfy the demand for the product.","We are seeing an increased demand for housing in the area.","increasing/growing/rising demand","to stimulate/boost/increase demand","a high level of demand","As demand slows, the need to export will return.","Demand for personal computers has risen sharply.","Demand for the product is buoyant.","In the housing market, demand is outstripping supply.","It can be difficult to forecast demand in the construction industry.","It is the job of the marketing manager to create demand for the new product.","Low interest rates are fuelling demand for credit.","Supply normally exceeds demand for the bulk of consumer goods.","The factories are staying open all weekend to try to meet the consumer demand for this product.","The slowdown in domestic demand was offset by an increase in exports.","There's always a great demand for our soups in winter.","We can estimate that total market demand for electrical goods will rise by 8%.","policies aimed at managing demand","the demand from consumers","the law of supply and demand","the potential demand among children","An ageing population is placing an increasing demand on health services.","The scheme aims to provide bed space for tourism in times of high demand."],"opposite":"","synonyms":""},{"def":"because a lot of people have asked for something","examples":["By popular demand, the play will run for another week."],"opposite":"","synonyms":""},{"def":"wanted by a lot of people","examples":["Good secretaries are always in demand.","She is in constant demand to make public appearances and give interviews.","These old machines are still in demand."],"opposite":"","synonyms":""},{"def":"done or happening whenever somebody asks","examples":["Feed the baby on demand.","The service allows you to watch video on demand.","Campaigners insist that abortion should be available on demand."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"by popular demand","def":"because a lot of people have asked for something","examples":["By popular demand, the play will run for another week."]},{"idiom":"in demand","def":"wanted by a lot of people","examples":["Good secretaries are always in demand.","She is in constant demand to make public appearances and give interviews.","These old machines are still in demand."]},{"idiom":"on demand","def":"done or happening whenever somebody asks","examples":["Feed the baby on demand.","The service allows you to watch video on demand.","Campaigners insist that abortion should be available on demand."]}],"phrasal":[],"related":["on-demand","demand draft","print on demand","supply and demand","demand drafts"]},{"pos":"verb","level":"B2","meanings":[{"def":"to make a very strong request for something","examples":["demand something They are demanding the release of all political prisoners.","You should demand an apology in writing.","Protesters demanded the resignation of the prime minister.","demand that… The UN has demanded that all troops be withdrawn.","(British English also) They are demanding that all troops should be withdrawn.","The judge demanded that we turn off our phones.","demand to do something I demand to see the manager.","demand something of somebody We demand a lot of our teachers.","demand something from somebody He had demanded money from her.","She demanded an immediate explanation.","All candidates will be required to take a short test.","I expect to be paid promptly for the work.","I didn’t want to go but he insisted.","We insist on the highest standards at all times.","You’re asking too much of him.","‘Where are you going?’ she asked.","She asked the students their names.","Can I ask a question?","I called the station to enquire about train times.","‘And where have you been?’ he demanded angrily.","They failed to provide the information demanded of them.","They demanded to see the ambassador.","They're demanding a better deal for themselves and their families.","The group demands a high level of loyalty from its members.","He is also a cold-hearted killer when Queen and Country demand it of him."],"opposite":"","synonyms":"demand"},{"def":"to ask a question in an angry or aggressive way","examples":["‘Who the hell are you?’ he demanded angrily.","‘Where are the keys?’ she demanded angrily.","‘And where have you been?’ he demanded angrily.","‘What's your name?’ she demanded of the girl."],"opposite":"","synonyms":""},{"def":"to want or need goods or services","examples":["Today's consumers are demanding a greater variety of produce.","Our customers demand quality and reliability most of all."],"opposite":"","synonyms":""},{"def":"to need something in order to be successful at something","examples":["demand something This sport demands both speed and strength.","This is music that demands great technical skill.","She can be a very tough negotiator when the situation demands it.","be demanded of somebody High personal standards are demanded of all applicants."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]