[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dem/demon/demonstrate__us_1.mp3","phonsUS":"/ˈdemənstreɪt/","level":"B2","meanings":[{"def":"to show something clearly by giving proof or evidence","examples":["demonstrate that… New research convincingly demonstrates that age-related memory loss is not inevitable.","demonstrate something These paintings demonstrate his extraordinary ability as a portrait painter.","The award demonstrated the importance that local people place on road safety.","This new anthology amply demonstrates the range and vitality of modern Scottish poetry.","demonstrate how, what, etc… This study clearly demonstrates how fishing can affect an ecosystem.","demonstrate something to somebody Let me demonstrate to you some of the difficulties we are facing.","demonstrate somebody/something to be something The theories were demonstrated to be false.","it is demonstrated that… It has been demonstrated that this drug is effective.","There is clear evidence that TV advertising influences what children buy.","It is clear from numerous studies that TV advertising influences what children buy.","Recent research demonstrates that TV advertising influences children’s spending habits.","Many parents think that TV advertising influences their children. This view is supported by the findings of a recent study, which show a clear link between television advertisements and children’s spending habits.","The findings also reveal that most children are unaware of the persuasive purpose of advertising.","There is little evidence that children understand the persuasive intent of advertising.","The results contradict claims that advertising is unrelated to children’s spending habits.","Manufacturers argue that it is difficult to prove that advertising alone influences what children buy.","Our study demonstrates beyond doubt that the play was written by Shakespeare.","The study demonstrates beyond doubt the effectiveness of the new drug.","This tragedy graphically demonstrates the dangers of extreme sports.","The president must demonstrate to the country that he is really in control of his government."],"opposite":"","synonyms":""},{"def":"to show by your actions that you have a particular quality, feeling or opinion","examples":["The team demonstrated breathtaking skills.","We want to demonstrate our commitment to human rights.","Students must demonstrate a willingness to work with others."],"opposite":"","synonyms":""},{"def":"to show and explain how something works or how to do something","examples":["demonstrate something Her job involves demonstrating new educational software.","The gallery's experts demonstrated some conservation techniques.","demonstrate something to somebody The system was demonstrated to officials from 17 countries.","demonstrate (to somebody) how, what, etc… Let me demonstrate to you how it works."],"opposite":"","synonyms":""},{"def":"to take part in a public meeting or march (= an organized walk by many people), usually as a protest or to show support for something","examples":["Hundreds of protesters demonstrated outside the court.","demonstrate against something students demonstrating against the war","demonstrate for something Their objective was to demonstrate peacefully for civil rights.","They are demonstrating in support of free higher education."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]