[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dem/demon/demonstration__us_1.mp3","phonsUS":"/ˌdemənˈstreɪʃn/","level":"B2","meanings":[{"def":"a public meeting or a march (= an organized walk by many people) at which people show that they are protesting against or supporting somebody/something","examples":["to take part in/go on a demonstration","to hold/stage a demonstration","mass demonstrations in support of the exiled leader","anti-government demonstrations","a peaceful/violent demonstration","I'll give a quick demonstration of some first-aid techniques.","Police in riot gear dispersed the demonstration.","Taxi drivers staged a demonstration against the new law.","The demonstration was called off at the last minute.","The government does not wish to provoke further demonstrations.","The president's decision provoked public demonstrations.","The strike was a dramatic demonstration of the power of the workforce.","The visiting president was greeted by hostile demonstrations.","Thousands gathered for a peaceful demonstration.","a protest demonstration against the war","demonstrations calling for an end to sanctions","demonstrations in protest at the arrests","demonstrations in protest of the administration","mass demonstrations against cuts in the health service","physical demonstrations of affection","police intervention at demonstrations","student demonstrations in favour of a multi-party system","As a student, she had taken part in many demonstrations.","Protesters go on demonstrations, armed with flowers to give to the police.","She was given to quite embarrassing public demonstrations of emotion.","The election results gave ample demonstration of collapsing support for the Communist Party.","The performance was a remarkable demonstration of his abilities.","There were mass demonstrations in support of the exiled leader.","They are holding a peaceful demonstration in Central Park.","This is a clear demonstration of how something that seems simple can turn out to be very complicated.","We bought the demonstration model at half price.","We were given a brief demonstration of the computer's functions."],"opposite":"","synonyms":""},{"def":"an act of showing or explaining how something works or is done","examples":["We were given a brief demonstration of the computer's functions.","a practical demonstration","a demonstration model (= a model used to show how something works)","Sandra and Nigel provided a demonstration of salsa dance steps."],"opposite":"","synonyms":""},{"def":"an act of giving proof or evidence for something","examples":["a demonstration of the connection between the two sets of figures","a demonstration of how something that seems simple can turn out to be very complicated"],"opposite":"","synonyms":""},{"def":"an act of showing a feeling or an opinion","examples":["a public demonstration of affection","a demonstration of support for the reforms"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]