[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/den/deny_/deny__us_1.mp3","phonsUS":"/dɪˈnaɪ/","level":"B2","meanings":[{"def":"to say that something is not true","examples":["deny something to deny an allegation/a charge/an accusation","He has denied any involvement in the incident.","The company strongly denies wrongdoing.","to vehemently/strenuously/categorically deny something","A spokesperson refused to either confirm or deny the reports.","deny (that)… She denied that there had been a cover-up.","It can't be denied that we need to devote more resources to this problem.","There's no denying the fact that quicker action could have saved them.","deny doing something He denies knowing anything about the plot.","He has categorically denied being involved in the fraud.","He has consistently denied murdering his estranged wife.","There is no denying the fact that she is an excellent scholar.","I know it was you I saw, so there's no use trying to deny it.","If anyone accuses me I shall simply deny it.","No one would deny that there is a very great need for change.","You can't deny that it seems a very attractive idea.","He denied accusations of corruption and mismanagement.","The company in March denied claims made in the lawsuit."],"opposite":"","synonyms":""},{"def":"to refuse to admit or accept something","examples":["She denied all knowledge of the incident.","The department denies responsibility for what occurred.","an anti-environmentalist campaign group that denies climate change","No physicist would deny the existence of gravity.","Denying the Holocaust is a crime in Germany.","Reality cannot be denied."],"opposite":"","synonyms":""},{"def":"to refuse to allow somebody to have something that they want or ask for","examples":["deny somebody something They were denied access to the information.","deny something to somebody Access to the information was denied to them.","You cannot deny this opportunity to me.","They were cruelly denied victory by an injury-time strike from Hegerberg.","Children could be compelled to work on the farm, effectively denying them schooling.","The country's government systematically denies its citizens basic rights to free expression."],"opposite":"","synonyms":""},{"def":"to refuse to let yourself have something that you would like to have, especially for moral or religious reasons","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]