[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dep/depar/departure__us_1.mp3","phonsUS":"/dɪˈpɑːrtʃər/","level":"B1","meanings":[{"def":"an act of leaving a place","examples":["His sudden departure threw the office into chaos.","rumours of her imminent/impending departure","departure from… They had received no news of him since his departure from the island.","departure for… The day of their departure for London was growing closer.","departure to… She postponed her departure to Scotland.","before departure Flights should be confirmed 48 hours before departure.","tracking the arrival and departure dates of migrating birds","Atocha station was the departure point for our tour.","He made a hasty departure.","Her disagreement with the MD probably hastened her departure.","Our boss sent out an email announcing her departure.","The guard blew his whistle to warn of the train's imminent departure.","The last check-in time is 45 minutes before flight departure.","You should receive your flight tickets at least a week prior to departure.","Departure for London will be at 18.45.","Heavy snow delayed our departure for several days.","Her departure from the island went almost unnoticed.","His departure leaves the board without a leader.","I made preparations for a speedy departure.","Please state your flight number and date of departure.","She had made arrangements for their immediate departure for Canada."],"opposite":"arrival","synonyms":""},{"def":"a plane, train, etc. leaving a place at a particular time","examples":["arrivals and departures","All departures are from Manchester.","We sat in the departure lounge waiting for our flight to be called.","the departure time/gate","the departures board"],"opposite":"arrival","synonyms":""},{"def":"the part of an airport where you go before catching a plane","examples":["There were long delays and queues in departures."],"opposite":"","synonyms":""},{"def":"an action that is different from what is usual or expected","examples":["Their latest single represents a new departure for the band.","departure from something It was a radical departure from tradition.","This document marks a radical departure from earlier recommendations.","This project represents a big departure for me."],"opposite":"","synonyms":""},{"def":"a place where a journey starts","examples":[],"opposite":"","synonyms":""},{"def":"an idea, a theory or an event that is used to start a discussion, an activity, etc.","examples":["The author takes Freud's dream theories as the point of departure for his essay."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a point of departure","def":"a place where a journey starts","examples":["The author takes Freud's dream theories as the point of departure for his essay."]}],"phrasal":[],"related":["estimated time of departure"]}]