[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dep/depen/dependent__us_1.mp3","phonsUS":"/dɪˈpendənt/","level":"B2","meanings":[{"def":"needing somebody/something in order to survive or be successful","examples":["a woman with several dependent children","dependent on/upon somebody/something You can't be dependent on your parents all your life.","dependent on/upon somebody/something for something The festival is heavily dependent on sponsorship for its success.","74% of people in the survey were at least partially dependent on their cars.","Jane had never met anyone so utterly dependent.","Many of the patients are closely dependent on staff for day-to-day emotional support.","Modern science is critically dependent on high-performance computing.","Small companies are dependent upon the local economy.","The country is heavily dependent on oil and gas imports.","The land is dry and wholly dependent on irrigation.","The various organs of the body do not function in isolation but are mutually dependent."],"opposite":"","synonyms":""},{"def":"addicted to something (= unable to stop taking or using it)","examples":["to be dependent on drugs"],"opposite":"","synonyms":""},{"def":"affected or decided by something","examples":["A child's development is dependent on many factors.","The price is dependent on how many extras you choose.","Your access to a good education is largely dependent on where you live.","The amount of benefit you receive is entirely dependent on the amount you have paid in."],"opposite":"","synonyms":""},{"def":"secondary to another clause, phrase or word","examples":["The word ‘because’ forces the clause to be dependent on some other main clause."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["dependent clause","dependent territory","dependent variable","dependent variables"]},{"pos":"noun","level":"","meanings":[{"def":"a person, especially a child, who depends on another person for a home, food, money, etc.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]