[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dep/depos/deposit__us_1.mp3","phonsUS":"/dɪˈpɑːzɪt/","level":"B2","meanings":[{"def":"a sum of money that is given as the first part of a larger payment","examples":["They normally ask you to pay $100 (as a) deposit.","All deposits are non-refundable.","deposit on something (British English) We've put down a 5% deposit on the house.","ten monthly payments of $50","payment in advance","an insurance premium","a premium for express delivery","You can increase your monthly contributions to the pension plan.","a subscription to Netflix","the repayments on the loan","We've put down a 5 per cent deposit on the house.","We paid for the car by/​in instalments.","I had to leave a €50 deposit on the bike.","We've put down the deposit on our new car.","The shop said it would reserve the rug for him if he paid £20 as a deposit.","All deposits for holiday cottages are refundable."],"opposite":"","synonyms":"payment"},{"def":"a sum of money that is paid by somebody when they rent something and that is returned to them if they do not lose or damage the thing they are renting","examples":["to pay a deposit","They'll probably ask you to leave a deposit.","The car costs $50 per day in rental, plus a $200 deposit which you will get back at the end of the week.","You'll get back your deposit once we've checked the bikes are all right.","If furniture is damaged, you will forfeit your deposit.","You have to pay a deposit of $1 200 as well as two months' rent."],"opposite":"","synonyms":""},{"def":"a sum of money that is paid into a bank account","examples":["Deposits can be made at any branch.","Bank deposits have increased by 2.3%.","She made a deposit of £60 into her account."],"opposite":"withdrawal","synonyms":""},{"def":"(in the British political system) the amount of money that a candidate in an election to Parliament has to pay, and that is returned if he/she gets enough votes","examples":["All the other candidates lost their deposits."],"opposite":"","synonyms":""},{"def":"a layer of a substance that has formed naturally underground","examples":["mineral/gold/coal deposits","The region has many deposits of valuable oil.","an area with large mineral deposits"],"opposite":"","synonyms":""},{"def":"a layer of a substance that has been left somewhere, especially by a river, flood, etc., or is found at the bottom of a liquid","examples":["The rain left a deposit of mud on the windows.","fatty deposits in the arteries of the heart","glacial deposits","The floods left a thick deposit of mud over the fields."],"opposite":"","synonyms":""},{"def":"placed in a deposit account","examples":["With interest rates so low, there is little point in having cash on deposit."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"on deposit","def":"placed in a deposit account","examples":["With interest rates so low, there is little point in having cash on deposit."]}],"phrasal":[],"related":["deposit account","direct deposit","security deposit","safe deposit box","safety deposit box","Federal Deposit Insurance Corporation","deposit accounts"]},{"pos":"verb","level":"C1","meanings":[{"def":"to put money into a bank account","examples":["Millions were deposited in Swiss bank accounts.","You can withdraw and deposit money in any of our branches."],"opposite":"","synonyms":""},{"def":"to pay a sum of money as the first part of a larger payment; to pay a sum of money that you will get back if you return in good condition something that you have rented","examples":[],"opposite":"","synonyms":""},{"def":"to put or lay somebody/something down in a particular place","examples":["She deposited a pile of books on my desk.","(informal) I was whisked off in a taxi and deposited outside the hotel."],"opposite":"","synonyms":""},{"def":"to leave a layer of something on the surface of something, especially gradually and over a period of time","examples":["Sand was deposited which hardened into sandstone."],"opposite":"","synonyms":""},{"def":"to put something valuable or important in a place where it will be safe","examples":["Guests may deposit their valuables in the hotel safe."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]