[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dep/depre/depression__us_1.mp3","phonsUS":"/dɪˈpreʃn/","level":"B2","meanings":[{"def":"a medical condition in which a person feels very sad and anxious and often has physical symptoms such as being unable to sleep, etc.","examples":["She was diagnosed as having clinical depression.","She suffered from severe depression after losing her job.","Bereavement can often lead to depression.","Depression affects a surprising number of people.","He may have killed himself in depression.","He was in a state of acute depression.","He's been off work for months with depression.","Her depression has lifted now.","His wife had left him and he was being treated for depression.","She had been receiving medical treatment for depression.","She was gradually coming out of her depression.","The actor says he suffers frequent bouts of depression.","The onset of depression often follows a traumatic event.","a new drug used to treat depression"],"opposite":"","synonyms":""},{"def":"the state of feeling very sad and without hope","examples":["There was a feeling of gloom and depression in the office when the news of the job cuts was announced.","These results should not be a cause for depression.","Her mood swung from the depths of depression to coping well.","It is easy to slip into a mood of depression.","moments of deep depression","She fell into a black depression and refused to leave her room.","I was in the depths of depression after receiving my exam results.","In a fit of depression, she threw away all her books."],"opposite":"","synonyms":""},{"def":"a period when there is little economic activity and many people are poor or without jobs","examples":["The country was in the grip of (an) economic depression.","the great Depression of the 1930s","He grew up during the Great Depression of the 1930s.","Many people lost their jobs in the great depression of the 1930s.","The country is experiencing a severe economic depression.","periods of severe economic depression","The housing market has gone into depression.","The depression seems to be deepening."],"opposite":"","synonyms":""},{"def":"a part of a surface that is lower than the parts around it","examples":["Rainwater collects in shallow depressions on the ground.","From the air, the photos show a shallow depression on the planet's surface."],"opposite":"","synonyms":""},{"def":"a weather condition in which the pressure of the air becomes lower, often causing rain","examples":["an atmospheric depression moving east from the Atlantic"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Depression","manic depression","postnatal depression","Great Depression","post-partum depression","postpartum depression"]}]