[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/des/descr/describe__us_1.mp3","phonsUS":"/dɪˈskraɪb/","level":"A1","meanings":[{"def":"to say what somebody/something is like","examples":["describe somebody/something The next section describes our findings in detail.","to describe a method/process/situation","describe somebody/something to somebody Can you describe him to me?","describe somebody/something for somebody They described for us exactly what happened.","describe somebody/something as something The man was described as tall and dark, and aged about 20.","describe yourself as something She describes herself as an artist.","describe how, what, etc… Describe how you did it.","Words cannot describe what I felt at that moment.","describe doing something Witnesses described seeing strange lights in the sky.","The picture shows a family gathered around a kitchen table.","This is a picture/​photo of a busy city street.","In the foreground/​background, we can see a group of protesters.","In the bottom right-hand corner/​top left-hand corner, there's a child sitting alone.","On the left/​On the right/​In the middle, someone is standing with a bottle in his hand.","In the cartoon, we can see two people looking at a newspaper headline.","The cartoonist has drawn the man to represent a typical businessman.","The area I grew up in is described as semi-rural.","He described briefly what happened.","He goes on to describe very vividly how Caesar was stabbed to death.","He goes on to describe vividly how Lincoln was assassinated.","Observers have described the situation in the country as ‘serious’.","The shirt was variously described as ‘pink’, ‘salmon’ and ‘rose’.","Their daily lives are described in detail.","This process is fully described in section three of the book.","Words cannot describe our feelings at that moment.","Jim was described by his colleagues as ‘unusual’.","The current political situation in Vietnam is described in chapter 8.","Production data were collected and analysed by methods previously described for Trial 1."],"opposite":"","synonyms":""},{"def":"to make a movement that has a particular shape; to form a particular shape","examples":["The shark described a circle around the shoal of fish.","The road describes a long loop around the town."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]