[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/des/descr/description__us_1.mp3","phonsUS":"/dɪˈskrɪpʃn/","level":"A1","meanings":[{"def":"a piece of writing or speech that says what somebody/something is like; the act of writing or saying in words what somebody/something is like","examples":["Follow the link below for a more detailed description.","description of somebody/something a brief description of the software","The name means ‘no trees’ and it is an accurate description of the island.","Police have issued a description of the gunman.","This is a film that defies description (= is difficult or impossible to describe).","the novelist’s powers of description","beyond description a personal pain that goes beyond description (= is too great to express in words)","A report is generally an objective description rather than a statement of opinion.","She gave us a lurid description of the birth.","She was able to provide a description of the intruder.","The catalogue gives a full description of each product.","a vivid description of life in Ancient Rome","‘Scared stiff’ is an apt description of how I felt at that moment."],"opposite":"","synonyms":""},{"def":"of some, etc. type","examples":["In the bay were boats of every description.","There were flying machines of all descriptions whizzing about.","Their money came from trade of some description.","The trunk was full of medals, coins and things of that description."],"opposite":"","synonyms":""},{"def":"to be like a particular person or thing","examples":["A child answering the description of the missing boy was found safe and well in London yesterday.","We're all looking for quick, healthy meals, and pasta fits this description.","A man fitting your description was seen entering the building.","I realized to my horror that the description of the killer could fit me.","Police have arrested two men matching the descriptions of the robbers."],"opposite":"","synonyms":""},{"def":"to be too extreme, horrible, etc. to believe/describe","examples":["It beggars belief how things could have got this bad."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"answer/fit/match a description (of somebody/something)","def":"to be like a particular person or thing","examples":["A child answering the description of the missing boy was found safe and well in London yesterday.","We're all looking for quick, healthy meals, and pasta fits this description.","A man fitting your description was seen entering the building.","I realized to my horror that the description of the killer could fit me.","Police have arrested two men matching the descriptions of the robbers."]},{"idiom":"beggar belief/description","def":"to be too extreme, horrible, etc. to believe/describe","examples":["It beggars belief how things could have got this bad."]}],"phrasal":[],"related":["job description","beggar belief/description","a blow-by-blow account, description, etc. (of something)","answer/fit/match a description (of somebody/something)"]}]