[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/des/desig/design__us_3.mp3","phonsUS":"/dɪˈzaɪn/","level":"A1","meanings":[{"def":"the general arrangement of the different parts of something that is made, such as a building, book, machine, etc.","examples":["The basic design of the car is very similar to that of earlier models.","special new design features","The system has a fundamental design flaw.","The steel frame is left visible and is part of the overall design concept.","The magazine will appear in a new design from next month.","The machine's unique design prevents it from overheating.","He's come up with a really good design for a solar-powered car.","Making the building accessible for disabled people was another major design challenge.","One of our main design goals was to make the product easy to use.","The architect put forward two alternative design concepts for the new library.","The chair she had sketched was far bigger than stipulated in the design brief.","The clever design allows natural light to flood into the room.","The latest model incorporates some novel design features.","The machine is quite simple in design.","The new label design provides nutrition facts.","The other houses are built to a more conventional design.","The overall design of the workspace is critical.","Their new car is still at the design stage.","We followed the traditional design.","a car with a sleek modern design","elements that are being included in the next design phase","I made this one to my very own design.","It's a simple design that hasn't changed for centuries.","Our house was built to a traditional design.","The design for the new model is top secret.","There was a basic design fault in the new computer.","What new design features does the TV have?","a design flaw in a software program"],"opposite":"","synonyms":""},{"def":"the art or process of deciding how something will look, work, etc. by drawing plans, making computer models, etc.","examples":["the design and development of new products","I'm doing a course in art and design.","web/set/product design","a specialist in computer-aided design","a design studio","The new CAD program really speeds up the design process.","The company won an international design competition for the concert hall.","Digital design tools are essential.","trendy boutique hotels with avant-garde design themes","The car wouldn't win any design awards, but it's very reliable.","Strict design standards ensure that new buildings are compatible with existing architecture.","a vehicle of revolutionary design","He set up his own software design company.","She's done some design work for us in the past."],"opposite":"","synonyms":""},{"def":"a drawing or plan from which something may be made","examples":["He has created some new and original designs.","design for something designs for aircraft","They have produced a design for the construction of a new bank building.","The original designs were stolen.","Last week the architect unveiled his design for a museum on Prague's waterfront.","the architect's designs for the cathedral","The office designs incorporate quiet rooms where employees can take a break.","There are several laws protecting the ownership of industrial designs.","We can show you several different designs for your new kitchen."],"opposite":"","synonyms":""},{"def":"an arrangement of lines and shapes as a decoration","examples":["floral/abstract/geometric designs","The tiles come in a huge range of colours and designs.","The building has intricate geometric designs on several of the walls."],"opposite":"","synonyms":""},{"def":"a plan or an intention","examples":["It happened—whether by accident or design—that the two of them were left alone after all the others had gone.","It is all part of his grand design.","Had it happened by accident or by design?","His grand design was to connect up every academic institution in the world.","I suspected that he had some sinister designs.","It is all part of his grand design for government."],"opposite":"","synonyms":""},{"def":"to want to start a sexual relationship with somebody","examples":["He was quite aware of her marital designs on him."],"opposite":"","synonyms":""},{"def":"to be planning to get something for yourself, often in a way that other people do not approve of","examples":["Rumours spread that the Duke had designs on the crown (= wanted to make himself king)."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"have designs on somebody","def":"to want to start a sexual relationship with somebody","examples":["He was quite aware of her marital designs on him."]},{"idiom":"have designs on something","def":"to be planning to get something for yourself, often in a way that other people do not approve of","examples":["Rumours spread that the Duke had designs on the crown (= wanted to make himself king)."]}],"phrasal":[],"related":["interior design","intelligent design","Design Council","computer-aided design, computer-aided manufacture"]},{"pos":"verb","level":"A1","meanings":[{"def":"to decide how something will look, work, etc., by drawing plans, making computer models, etc.","examples":["design something He designed and built his own house.","to design a building/product/website","a well designed kitchen","The blocks were specially designed and manufactured in Italy.","design something for somebody/something They asked me to design a poster for the campaign.","design somebody something Could you design us a poster?","She has designed costumes for film and television.","The building was designed by a fashionable architect.","The students have designed some beautiful and innovative products.","The website was poorly designed."],"opposite":"","synonyms":""},{"def":"to think of and plan a system, a way of doing something, etc., usually for a particular purpose or use","examples":["design something We need to design a comprehensive professional development programme.","be designed for something The method is specifically designed for use in small groups.","The museum is Missouri's first museum designed specifically for contemporary art.","be designed as something This course is primarily designed as an introduction to the subject.","be designed to do something The system is designed to alert drivers to traffic jams ahead.","Many new performance halls are designed primarily for music.","The instruments are designed for use in very cold conditions.","The trail was originally designed to give our staff a quiet place to walk.","These shelves have been designed very cleverly to fit into corners.","This is a network product designed to give access to large document libraries.","a service designed exclusively for women","the first yogurt designed especially for babies and toddlers","It is easy enough to design systems that work well when everything is going well.","They run specially designed courses for managers.","We need to design a new syllabus for the third year.","The programme is designed to help people who have been out of work for a long time."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]