[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/des/desir/desire__us_1.mp3","phonsUS":"/dɪˈzaɪər/","level":"B2","meanings":[{"def":"a strong wish to have or do something","examples":["He now had enough money to satisfy all his desires.","desire for something a strong desire for power/revenge","desire to do something She has a burning desire to be an artist.","(formal) I have no desire (= I do not want) to discuss the matter further.","He has expressed a desire to see you.","(formal) desire that… his father's desire that he become a lawyer","He is filled with conflicting desires.","He suppressed the desire to run from the room.","His actions reflect his desire to fit in.","His childhood had created a desire for stability in his life.","Horses need to satisfy their desire for space and freedom.","I suddenly felt an overwhelming desire to laugh","Most children have an insatiable desire for knowledge.","She confessed a secret desire to be famous.","The chairman expressed his desire to expand the company.","The human desire for answers is very great.","The search for a better life is one of the most basic desires of human beings.","There's a growing desire among consumers for more organic products.","They were motivated by a deep desire for money and fame.","This was all Liam needed to fuel his desire for revenge.","a long-lasting relationship based on our mutual desire for peace","She felt an overwhelming desire to return home."],"opposite":"","synonyms":""},{"def":"a strong wish to have sex with somebody","examples":["sexual desire","desire for somebody She felt a surge of love and desire for him."],"opposite":"","synonyms":""},{"def":"a person or thing that is wished for","examples":["When she agreed to marry him, he felt he had achieved his heart's desire."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Streetcar Named Desire"]},{"pos":"verb","level":"B2","meanings":[{"def":"to want something; to wish for something","examples":["desire something We all desire health and happiness.","The house had everything you could desire.","The dessert can be topped with cream, if desired (= if you like).","The medicine did not achieve the desired effect.","desire to do something Fewer people desire to live in the north of the country.","desire somebody to do something She desired him to leave her alone.","A home of her own was something she had always very much desired.","Most countries sincerely desired peace.","We all need and desire to find our place in society."],"opposite":"","synonyms":""},{"def":"to be sexually attracted to somebody","examples":["He still desired her."],"opposite":"","synonyms":""},{"def":"to be bad or unacceptable","examples":["The service in the restaurant left a lot to be desired."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"leave a lot, much, something, etc. to be desired","def":"to be bad or unacceptable","examples":["The service in the restaurant left a lot to be desired."]}],"phrasal":[],"related":[]}]