[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/des/despe/desperate__us_2_rr.mp3","phonsUS":"/ˈdespərət/","level":"B2","meanings":[{"def":"feeling or showing that you have little hope and are ready to do anything without worrying about danger to yourself or others","examples":["The prisoners grew increasingly desperate.","Stores are getting desperate after two years of poor sales.","Somewhere out there was a desperate man, cold, hungry, hunted.","I heard sounds of a desperate struggle in the next room.","I was starting to get desperate.","She felt utterly desperate.","The sudden loss of his money had made him desperate."],"opposite":"","synonyms":""},{"def":"giving little hope of success; tried when everything else has failed","examples":["He made a desperate bid for freedom.","She clung to the edge in a desperate attempt to save herself.","His increasing financial difficulties forced him to take desperate measures.","Doctors were fighting a desperate battle to save the little girl's life.","a desperate search for a way out","Jake held up his hands in a desperate plea for calm.","Kaleil's final, desperate efforts to save the business come to naught."],"opposite":"","synonyms":""},{"def":"needing or wanting something very much","examples":["desperate for something He was so desperate for a job he would have done anything.","(informal) I'm desperate for a coffee.","to be desperate for money/help/cash/attention","desperate to do something I was absolutely desperate to see her.","She was desperate to escape small town life."],"opposite":"","synonyms":""},{"def":"extremely serious or dangerous","examples":["The children are in desperate need of love and attention.","They face a desperate shortage of clean water.","His financial situation was desperate.","He had died in desperate poverty.","American farmers are in desperate straits today."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Desperate Dan","Desperate Housewives"]}]