[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/det/deter/determine__us_1.mp3","phonsUS":"/dɪˈtɜːrmɪn/","level":"B1","meanings":[{"def":"to discover the facts about something; to calculate something exactly","examples":["determine something An inquiry was set up to determine the cause of the accident.","Try to determine the extent of the problem.","determine what, whether, etc… We set out to determine exactly what happened that night.","It is difficult to determine when drama first appeared in India.","it is determined that… It was determined that she had died of natural causes.","Computer models help to determine whether a particular area is likely to flood.","It is difficult to determine the exact cause of the illness.","It should be possible to determine the level of interest.","We need a detailed investigation to determine exactly why these cancers are occurring."],"opposite":"","synonyms":""},{"def":"to make something happen in a particular way or be of a particular type","examples":["determine something Rural voters in key states will determine the outcome of the election.","Upbringing plays an important part in determining a person's character.","Age and experience will be determining factors in our choice of candidate.","determine where, whether, etc… The physical capabilities of a plant determine where it can and cannot live.","Reproductive success is directly determined by attractiveness to the female.","He suggested that alcoholism may be genetically determined.","Female employment was determined by economic and social factors.","the debate about whether such attitudes are biologically or culturally determined","Their responses to these questions could determine the level, quality and variety of care they received.","The success of these plans will be determined largely by the number of members who take part."],"opposite":"","synonyms":""},{"def":"to officially decide and/or arrange something","examples":["determine something A date for the meeting has yet to be determined.","determine (that)… The court determined (that) the defendant should pay the legal costs.","It is not for the police to determine what information should be disclosed.","a decision which would ultimately determine the fate of the project"],"opposite":"","synonyms":""},{"def":"to decide definitely to do something","examples":["determine to do something They determined to start early.","determine on something The government determined on a change of policy.","determine (that)… From that moment, I determined that it should not happen again.","As she walked home, she determined to speak to her boss the next day.","At seven years old I determined to be a great footballer."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]