[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dev/devic/device__us_1.mp3","phonsUS":"/dɪˈvaɪs/","level":"A2","meanings":[{"def":"an object or a piece of equipment that has been designed to do a particular job","examples":["a tracking/recording/listening device","The new devices will be installed at US airports.","electrical labour-saving devices around the home","This device allows deaf people to communicate by typing messages instead of speaking.","All new cars are now fitted with these safety devices.","He measured the room using an ingenious electronic device.","Police found several bugging devices in the room.","a useful device for checking electrical circuits","The device consists of a large wheel mounted on a metal post.","The device uses a transmitter that connects to your computer.","The device worked exactly as I'd hoped.","a device to measure blood pressure","a tiny device designed to trace telephone calls","The twentieth century saw the introduction of labour-saving devices around the home.","This device enables pilots to navigate with pinpoint accuracy."],"opposite":"","synonyms":""},{"def":"a piece of computer equipment, especially a small one such as a smartphone","examples":["You can store thousands of photos on your device.","a portable/wireless device","The waiter takes orders on a hand-held device.","Now connect the device to your computer.","The technology allows software systems to interact with wireless devices.","The computer is sold with a printer / scanner and a backup storage device.","You can edit your profile using any web-enabled device.","A unique hardware identifier is given to each device in the network.","All Bluetooth devices automatically detect one another's presence."],"opposite":"","synonyms":""},{"def":"a bomb or weapon that will explode","examples":["A powerful device exploded outside the station.","It was the world's first atomic device.","Two bombers detonated their devices in the busy shopping centre.","The device failed to detonate.","improvised explosive devices","A package containing an incendiary device was found on Tuesday night.","An incendiary device exploded in the store, setting fire to furniture."],"opposite":"","synonyms":""},{"def":"a method of doing something that produces a particular result or effect","examples":["Targeted advertising on social media is very successful as a marketing device.","We use a range of devices for testing children's numerical ability.","This was originally intended as a device for making sure taxes were paid on time.","Direct mailing is extremely successful as a marketing device.","They employ several successful management devices.","Aid workers have to use whatever devices are available for making sure help gets to those most in need."],"opposite":"","synonyms":""},{"def":"a plan or trick that is used to get something that somebody wants","examples":["The report was a device used to hide rather than reveal problems.","This device can be seem as somewhat dishonest."],"opposite":"","synonyms":""},{"def":"a form of words that is intended to produce a particular effect in speech or writing","examples":["a rhetorical device","Metaphor and symbol are literary devices."],"opposite":"","synonyms":""},{"def":"to leave somebody alone to do as they wish, and not tell them what to do","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"leave somebody to their own devices","def":"to leave somebody alone to do as they wish, and not tell them what to do","examples":[]}],"phrasal":[],"related":["mobile device","pointing device","intrauterine device","bring your own device"]}]