[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/die/diet_/diet__us_1.mp3","phonsUS":"/ˈdaɪət/","level":"A1","meanings":[{"def":"the food and drink that you eat and drink regularly","examples":["to eat a healthy, balanced diet","I loved the Japanese diet of rice, vegetables and fish.","a vegetarian/vegan diet","The traditional Mediterranean diet is fairly high in fat.","to receive advice on diet","It is important to eat a balanced diet.","People can fight infection more easily if they have an adequate diet.","She was told to change her diet and quit smoking.","The animal's diet consists mainly of grasses.","These animals live on a mainly vegetarian diet.","They had to survive on a diet of insects and berries.","They were fed on a diet of rice and vegetables.","a diet rich in vitamins and minerals","the amount of fat in your diet","For general advice on diet, see pages 26–27."],"opposite":"","synonyms":""},{"def":"a limited variety or amount of food that you eat for medical reasons or because you want to lose weight; a time when you only eat this limited variety or amount","examples":["He followed a strict low-fat diet.","on a diet I decided to go on a diet (= to lose weight) before my holiday.","She is trying to lose weight through diet and exercise.","diet drinks (= with fewer calories than normal)","Lose pounds with our new diet plan!","Magazines are always full of fashionable new diets.","Crash diets are not the best way to lose weight.","I have to stick to a low-fat diet.","I'd love a dessert, but I'm on a diet.","If you follow this diet, you're bound to lose weight.","They're on a special high-protein diet."],"opposite":"","synonyms":""},{"def":"a large amount of a limited range of activities","examples":["Children today are brought up on a diet of video games and TV on demand."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Hay diet","staple diet","Atkins Diet™","South Beach Diet"]},{"pos":"verb","level":"","meanings":[{"def":"to eat less food or only food of a particular type in order to lose weight","examples":["She's always dieting but she never seems to lose any weight."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]