[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dif/diffe/differ__us_1.mp3","phonsUS":"/ˈdɪfər/","level":"B2","meanings":[{"def":"to be different from somebody/something","examples":["They hold differing views.","A differs from B French differs from English in this respect.","A and B differ (from each other) French and English differ in this respect.","differ between A and B Ideas on childcare may differ considerably between the parents.","This survey highlights a number of differences in the way that teenage boys and girls in the UK spend their free time.","One of the main differences between the girls and the boys who took part in the research was the way in which they use the internet.","Unlike the girls, who use the internet mainly to keep in touch with friends, the boys questioned in this survey tend to use the internet for playing computer games.","The girls differ from the boys in that they tend to spend more time keeping in touch with friends on the phone or on social networking websites.","Compared to the boys, the girls spend much more time chatting to friends on the phone.","On average the girls spend four hours a week chatting to friends on the phone. In contrast, very few of the boys spend more than five minutes a day talking to their friends in this way.","The boys prefer competitive sports and computer games, whereas/while the girls seem to enjoy more cooperative activities, such as shopping with friends.","When the girls go shopping, they mainly buy clothes and cosmetics. The boys, on the other hand, tend to purchase computer games or gadgets.","His ideas differ little from those of his father.","Opinions differ widely on this issue.","Social organization differs significantly between the different groups.","The models differ in size and shape.","The rates of violent crime differed greatly among the four cities.","The two approaches differ markedly"],"opposite":"","synonyms":""},{"def":"to disagree with somebody","examples":["differ (with somebody) (about/on/over something) I have to differ with you on that.","differ (as to something) Medical opinion differs as to how to treat the disease.","It didn't seem right that I should differ with him.","The two parties differ on all the major issues.","The two sides still differ over details of the plan."],"opposite":"","synonyms":""},{"def":"if two people agree to differ/disagree, they accept that they have different opinions about something, but they decide not to discuss it any longer","examples":["We must just agree to differ on this.","In the end we agreed to disagree.","I think you're wrong. Let's just agree to differ."],"opposite":"","synonyms":""},{"def":"used to say politely that you do not agree with something that has just been said","examples":["‘At least she is good at her job.’ ‘Oh, I beg to differ.’"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"agree to differ/disagree","def":"if two people agree to differ/disagree, they accept that they have different opinions about something, but they decide not to discuss it any longer","examples":["We must just agree to differ on this.","In the end we agreed to disagree.","I think you're wrong. Let's just agree to differ."]},{"idiom":"I beg to differ","def":"used to say politely that you do not agree with something that has just been said","examples":["‘At least she is good at her job.’ ‘Oh, I beg to differ.’"]}],"phrasal":[],"related":["I beg to differ","agree to differ/disagree"]}]