[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dif/diffi/difficult__us_2_rr.mp3","phonsUS":"/ˈdɪfɪkəlt/","level":"A1","meanings":[{"def":"not easy; needing effort or skill to do or to understand","examples":["The competition judges were given a very difficult task.","a difficult decision/question","difficult for somebody Asking for help is extremely difficult for some people.","it is difficult to do something It's really difficult to read your writing.","something is difficult to do Your writing is really difficult to read.","It is difficult to imagine a woman in the 1950s behaving like this.","She finds it very difficult to get up early.","it is difficult for somebody to do something It's difficult for them to get here much before seven.","It has become increasingly difficult for young people to buy a house.","The exam questions were quite difficult.","It is difficult for young people to find jobs around here.","I always found languages quite hard at school.","It was one of the hardest things I ever did.","It is a technically demanding piece of music to play.","This shouldn’t be too taxing for you.","It is getting more and more difficult to find a job.","The fog made driving very difficult.","He finds French pronunciation quite difficult.","Finding an acceptable solution proved more difficult.","I was given the difficult task of informing the girl's parents of her disappearance.","Senior lawyers handle the most difficult cases.","She is confronted with a difficult choice.","The design of the building posed some difficult challenges.","The exam questions were particularly difficult.","We didn't realize how difficult it was going to be.","The application process is notoriously difficult.","It is difficult to understand who this book is aimed at."],"opposite":"","synonyms":"difficult"},{"def":"full of problems; causing a lot of trouble","examples":["I found myself in a difficult situation.","difficult conditions/circumstances","I'd had a difficult time and needed a break.","a difficult year/month","My boss is making life very difficult for me.","13 is a difficult age.","They had to set up camp in extremely difficult conditions.","His presence there put me in a very difficult position.","The next few months were quite difficult.","These are difficult and painful memories.","Her childhood was incredibly difficult.","Change is difficult for everyone.","Her disability made taking care of the home and raising a family doubly difficult.","What's the most difficult personal situation you've ever been in?","There was a great deal of difficult terrain to be covered."],"opposite":"","synonyms":""},{"def":"not easy to please; not helpful","examples":["a difficult child/customer/boss","Don't pay any attention to her—she's just being difficult.","The singer has a difficult reputation.","Roger was always a difficult child.","We have training in how to deal with difficult customers.","In every workplace there's always someone you find difficult.","Stop being so difficult."],"opposite":"","synonyms":""},{"def":"to have difficulty doing something","examples":["You'll have a job convincing them that you're right.","He had a hard job to make himself heard.","He'll have a tough job getting the team into shape in time.","It's very dark out there, you'll have a job to see anything."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"have a (hard/difficult) job doing/to do something","def":"to have difficulty doing something","examples":["You'll have a job convincing them that you're right.","He had a hard job to make himself heard.","He'll have a tough job getting the team into shape in time.","It's very dark out there, you'll have a job to see anything."]}],"phrasal":[],"related":["make life difficult (for somebody)","tread a difficult, dangerous, solitary, etc. path"]}]