[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dif/diffi/difficulty__us_2_rr.mp3","phonsUS":"/ˈdɪfɪkəlti/","level":"B1","meanings":[{"def":"a problem; a thing or situation that causes problems","examples":["the difficulties of English syntax","a patient with breathing difficulties","They encountered numerous difficulties while making the film.","She had been experiencing technical difficulties.","I think we've managed to overcome most of the practical difficulties.","I know the kinds of difficulties faced by parents and teachers.","difficulties with something We've run into difficulties with the new project.","difficulty with something I'm having difficulty with the engine.","in difficulties He was often in financial difficulties.","in difficulty He got into difficulty while swimming and had to be rescued.","It was a time fraught with difficulties and frustration.","Anyone experiencing difficulty with radio reception should call us on the new helpline.","Despite all the difficulties, he still remains optimistic.","Difficulties arise when people fail to consult their colleagues.","English spelling presents special difficulties for foreign learners.","Let me know if you have any difficulties.","Life in the city was not without its difficulties.","Please report any difficulties to the help desk.","She is always making difficulties for herself.","Some companies are already in difficulty.","Some companies are getting into difficulty.","The difficulty lies in identifying the precise nature of the problem.","The plan has run into serious difficulties.","The situation was fraught with difficulty.","We could see that the swimmer was in difficulties.","Will it cause any difficulties if I go early?","The drug is used to treat breathing difficulties caused by asthma.","There are technical difficulties involved in filming on location.","Commuters face the daily difficulty of getting to work on time.","the difficulties inherent in treating overdose patients","The project has been fraught with difficulties from the start."],"opposite":"","synonyms":""},{"def":"the state or quality of being hard to do or to understand; the effort that something involves","examples":["difficulty (in) doing something I had considerable difficulty (in) persuading her to leave.","I had no difficulty (in) making myself understood.","with difficulty He spoke slowly and with great difficulty.","The changes were made with surprisingly little difficulty.","without difficulty We found the house without difficulty.","difficulty of doing something They discussed the difficulty of studying abroad.","I had little difficulty in persuading the others to come.","She had difficulty in starting her car.","He has a great deal of difficulty concentrating on schoolwork.","We crossed the border without any difficulty.","We had enormous difficulty in getting hold of the right equipment.","the difficulty of finding affordable accommodation","We were delayed owing to the difficulty of the conditions.","They succeeded despite the difficulty of the task."],"opposite":"","synonyms":""},{"def":"how hard something is","examples":["Both roles had a high degree of difficulty.","The games have varying levels of difficulty.","questions of increasing difficulty","The walks in the book vary in difficulty.","You can choose the level of difficulty at the start of the game.","This increases the difficulty of the shot.","The number of points scored depends on the difficulty of the item."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]