[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dig/digit/digital__us_3.mp3","phonsUS":"/ˈdɪdʒɪtl/","level":"A2","meanings":[{"def":"using a system of receiving and sending information as a series of the numbers one and zero, showing that an electronic signal is there or is not there","examples":["a digital camera","digital media/content/platforms","These figures include digital downloads in addition to retail sales.","He quickly realized that all film and video production would go digital.","The system is fully digital, with no analogue components.","digital terrestrial and digital satellite broadcasting","We are moving our CCTV to a fully digital network.","They transferred the 35mm footage to digital video.","With digital photography, images of construction sites can be transmitted via the internet to architects and engineers.","Communication evolved from verbal exchanges to paper drawings to digital media.","high-resolution digital images","The sketches were scanned and converted into digital format.","The project is the internet's oldest digital library, offering over 13 000 e-texts for free download."],"opposite":"","synonyms":""},{"def":"connected with the use of computer technology, especially the internet","examples":["communication in the digital age","Digital technology continues to evolve rapidly.","Advertisers are putting more and more money into digital marketing.","We live in a digital age where everything can be downloaded.","The world's wealthiest nations promised to support government efforts to bridge the digital divide.","The media establishment is still having trouble coming to terms with the digital revolution.","Students in poorer areas lack access to the digital world.","New digital technologies have unfortunately created new avenues to fraud and copyright infringement."],"opposite":"","synonyms":""},{"def":"showing information by using figures, rather than with hands that point to numbers","examples":["a digital clock/watch","The instrument panel has an easy-to-read digital display.","The digital alarm clock by my bed said 5:25.","The runs were timed to the nearest second using a digital stopwatch."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["digital art","digital audiotape","digital divide","digital footprint","digital immigrant","digital native","digital recording","digital signature","digital certificate","digital disruption","digital publishing","digital television","Department for Digital, Culture, Media and Sport","digital arts","digital divides","digital natives","digital immigrants","digital signatures"]},{"pos":"noun","level":"","meanings":[{"def":"digital technology","examples":["The world of digital is forever changing.","the company's global spend on digital"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]