[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dig/digni/dignity__us_1.mp3","phonsUS":"/ˈdɪɡnəti/","level":"C1","meanings":[{"def":"a calm and serious manner that deserves respect","examples":["She accepted the criticism with quiet dignity.","He brings a quiet dignity to the role.","His aristocratic voice gives him an air of dignity and power."],"opposite":"","synonyms":""},{"def":"the fact of being given honour and respect by people","examples":["the dignity of work","The terminally ill should be allowed to die with dignity.","We felt that the way she was treated was lacking in dignity.","Slavery destroys human dignity.","Keeping prisoners in such dreadful conditions strips them of all dignity.","The awful thing about old age is losing your dignity."],"opposite":"","synonyms":""},{"def":"a sense of your own importance and value","examples":["It's difficult to preserve your dignity when you have no job and no home.","She had a strong sense of dignity.","These people have enormous dignity.","Money means independence and personal dignity.","We all want to maintain our dignity in old age.","He needed a way to retreat with his dignity intact.","With as much dignity as he could muster, he left the room.","He hoped that he could change his mind without loss of dignity."],"opposite":"","synonyms":""},{"def":"below what you see as your own importance or worth","examples":["He clearly regarded manual work as beneath his dignity."],"opposite":"","synonyms":""},{"def":"to demand to be treated with the respect that you think that you deserve","examples":["Our teacher never stands on her dignity with us, but treats us all as friends and colleagues.","She was never one to stand on her dignity."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"beneath your dignity","def":"below what you see as your own importance or worth","examples":["He clearly regarded manual work as beneath his dignity."]},{"idiom":"stand on your dignity","def":"to demand to be treated with the respect that you think that you deserve","examples":["Our teacher never stands on her dignity with us, but treats us all as friends and colleagues.","She was never one to stand on her dignity."]}],"phrasal":[],"related":["Dignity in Dying"]}]