[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dir/direc/director__us_1_rr.mp3","phonsUS":"/dəˈrektər/","level":"A2","meanings":[{"def":"one of a group of senior managers who run a company","examples":["a non-executive director","He's on the board of directors.","Corporate governance means the relationship between shareholders, directors and managers.","He is executive director of the American Football Coaches Association.","‘It's been a great success,’ said managing director Chris Tomlinson.","Three executive directors were appointed to relieve the CEO of some day-to-day responsibilities.","She is a director at the Centre/​Center for Consumer Research.","Pension rules are different if you are self-employed or a company director.","Employees and directors have been offered stock options."],"opposite":"","synonyms":""},{"def":"a person in charge of a film or play who tells the actors and staff what to do","examples":["a famous film director","He remained active in the theatre as a playwright and director.","the writer and director of the movie ‘Wind River’","Are there any actors or directors you would particularly like to work with?","There was an opportunity to meet the cast and director backstage.","She wrote the screenplay and wanted Evans as director."],"opposite":"","synonyms":""},{"def":"a person who is in charge of a particular activity or department in a company, a college, etc.","examples":["She was artistic director of the city's photography festival.","He was musical director at the National Theatre.","the deputy/assistant/associate director","the finance/marketing/technical director","director of something the director of marketing/operations/communications","He is assistant director of market research for IDFA.","She recently served as director of the Longwood Arts Project in the Bronx.","the company's regional director in North America","an eminent museum director and curator","The chocolate company's director of marketing made a statement.","the company's personnel director","Alan Watt, senior director of marketing and strategy","Dianne is deputy director of public affairs for USDA Rural Development.","He became associate director of California Ballet in 1983.","In the report, director of education Keith Nelson says more needs to be done.","Fred Madison, technology program director for the Industrial and Technology Assistance Corp","He was athletic director of Mills College.","I got a call from the casting director asking me to do a part.","Milberg is the station manager and program director at WDAM Radio.","Ms Hidden has replaced her as acting director.","She is the founding director of graduate programs.","The bank's regional director for Wales called an urgent meeting."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["art director","artistic director","director general","funeral director","managing director","musical director","executive director","Director of Public Prosecutions","in the director's chair"]}]