[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dir/direc/direct__us_1_rr.mp3","phonsUS":"/dəˈrekt/","level":"A2","meanings":[{"def":"going in the straightest line between two places without stopping or changing direction","examples":["the most direct route","This door allows direct access from the kitchen to the garage.","a direct flight (= a flight that does not stop)","There's a direct train to Leeds (= it may stop at other stations but you do not have to change trains).","a direct hit (= a hit that is accurate and does not touch something else first)","Isn't there a more direct route?","The direct way to the river would be through the park.","The most direct path to the summit is very steep and difficult.","There was an overnight stopover in Singapore, then a direct flight to Sydney.","Why is there is no direct bus from London Bridge to King's Cross?","There's a direct train connecting the airport and the city.","Although the city did not suffer a direct hit from the storm, there was extensive damage.","The bombers scored direct hits on two supply ships."],"opposite":"indirect","synonyms":""},{"def":"happening or done without involving other people, actions, etc. in between","examples":["She has been in direct contact with the prime minister.","Clinical depression is thought to have a direct link to brain chemistry.","There is a direct connection between these two phenomena.","He died as a direct result of his employer's actions.","a direct effect/consequence","Many farmers are developing direct access to consumers.","He was cleared of any direct involvement in the case.","Participation in sport brings many benefits, both direct and indirect.","You only get the disease through direct contact with contaminated blood.","The two formats are so different, it's difficult to make a direct comparison.","the direct involvement of the artist at every stage of the production","These studies show the direct effects of climate change.","Her father died as a direct consequence of these laws.","The storms will have a direct impact on tourism in the region.","Direct talks between the two sides began for the first time.","She has direct responsibility for all new trainees.","We are looking for somebody with direct experience of this type of work.","The patient had suffered a direct blow to the head."],"opposite":"indirect","synonyms":""},{"def":"with nothing between something and the source of the heat or light","examples":["The plant should not be placed in direct sunlight.","Grilling involves subjecting the food to direct heat.","Blinds shade the south-facing room from direct sunlight.","Protect your child from direct sunlight by using a sunscreen.","Place the seed tray somewhere with diffuse light, not direct light, such as a north window.","Melt the lard in a pan over direct heat.","Inside a round house you get a nice, even spread of warmth from one simple direct heat source."],"opposite":"","synonyms":""},{"def":"saying exactly what you mean in a way that nobody can pretend not to understand","examples":["I asked him a direct question: ‘Did you do it?’","He would not give a direct answer.","Her response is refreshingly direct.","Their message is simple and direct: obesity kills.","You'll have to get used to his direct manner.","I prefer a more direct approach.","Thank you for being so honest with me.","To be frank with you, I think your son has little chance of passing the exam.","You’ll have to get used to his direct manner.","He was quite open about his reasons for leaving.","She was outspoken in her criticism of the plan.","I don’t think you’re being straight with me.","She has a reputation for blunt speaking.","a(n) honest/​frank admission of guilt.","I’m a very open person.","I need a direct answer to a direct question.","a refreshingly direct discussion of the agency's priorities","His criticism was unusually direct.","Her manner can be rather direct.","She has a very direct way of speaking.","The songs are vivid and emotionally direct.","his disconcertingly direct gaze"],"opposite":"indirect","synonyms":"honest"},{"def":"clearly showing something","examples":["There is no direct evidence for the beneficial effects of these herbs.","This information has a direct bearing on (= is closely connected with) the case.","There was no direct proof of his personal involvement.","Although there is no direct evidence, retailers and pasta manufacturers believe that consumers prefer ‘Italian’ brand names."],"opposite":"indirect","synonyms":""},{"def":"exact","examples":["That's the direct opposite of what you told me yesterday.","a direct quote (= one using a person’s exact words)"],"opposite":"","synonyms":""},{"def":"related through parents and children rather than brothers, sisters, aunts, etc.","examples":["a direct descendant of the country’s first president","With his death, the direct male line of the House of Capet came to an end."],"opposite":"indirect","synonyms":""}],"idioms":[],"phrasal":[],"related":["direct cost","direct mail","direct rule","direct tax","direct access","direct action","direct debit","direct object","direct speech","direct current","direct deposit","direct dialling","direct investment","direct marketing","direct message","direct taxation","direct method","foreign direct investment"]},{"pos":"verb","level":"B1","meanings":[{"def":"to control or be in charge of somebody/something","examples":["He was asked to take command and direct operations.","A police officer was directing traffic.","How much should the teacher guide and direct the students?","A new manager has been appointed to direct the project.","The campaign was carefully directed from party central office.","The project managers direct the day-to-day operations of the project.","Does a business have the right to direct and control how workers do the tasks for which they are hired?","Hubert directs the activities of his laboratory assistants.","Not all classroom activities need to be directed by the teacher.","These attacks were planned and directed by criminal groups."],"opposite":"","synonyms":""},{"def":"to be in charge of actors in a play or film, or musicians in a band, orchestra, etc.","examples":["She prefers to act rather than direct.","direct somebody/something He directed the school play.","The film was written and directed by Sofia Coppola.","She now directs a large choir.","He directs with flair and sensitivity.","She wrote a play and asked her friend to direct.","The movie is expertly directed and beautifully photographed.","Who directed the original theatre production?","He directed two episodes of TV drama ‘The Sopranos’.","He is a famed cellist and conductor who, for many years, directed the National Symphony Orchestra in Washington, D.C.","She directs the baroque orchestra at London's Royal Academy of Music."],"opposite":"","synonyms":""},{"def":"to aim something at a particular goal or person, or in a particular direction","examples":["direct something to something/somebody He directed his attention to the next task.","direct something towards/toward something/somebody All our efforts should be directed towards helping those who need it.","direct something at something/somebody Her criticism was directed at her own superiors.","She directs her gaze straight at the viewer.","The book is directed at younger readers.","direct something against something/somebody Most of his anger was directed against himself.","direct something + adv./prep. He directed the light straight in her face.","The machine directs a powerful beam at the affected part of the body.","His anger was mostly directed towards Peter.","Tax cuts have been directed primarily at the better-off.","The attacks were directed solely at military targets.","The machine directs light onto a special film.","This merely directs attention away from the real issues.","We should be directing our energies towards understanding each other.","violence directed specifically at ethnic minorities","criticism clearly directed at the Labour Party","The criticisms were clearly directed at the President.","I'm tired of the negativity directed against people on our own side.","Hackers mounted co-ordinated attacks against several websites."],"opposite":"","synonyms":""},{"def":"to tell or show somebody how to get to somewhere or where to go","examples":["direct somebody It's not far—I'll direct you.","direct somebody to something Could you direct me to the station?","He was directed to a table beside the window.","direct somebody + adv./prep. The app directs you along the best cycle route to your destination.","It’s too far to walk—I’ll take you by car.","Firefighters led the survivors to safety.","The president arrived, escorted by twelve bodyguards.","My mother drove us to the airport.","The attendant showed us to our seats.","He always walked her home.","Have you walked the dog yet today?","She guided us through the busy streets.","We were guided around the museums.","She ushered her guests to their seats.","A young woman directed them to the station.","You find yourself in a maze with no map or compass to direct you.","a detour that directs you through narrow, dimly lit streets","I found myself being directed into a dark room.","She directed us back to our starting point.","He's a seasoned traveller and he'll direct you anywhere you want to go."],"opposite":"","synonyms":"take"},{"def":"to give an official order","examples":["direct somebody to do something The police officers had been directed to search the building.","direct that… The judge directed that the mother be given custody of the children.","(British English also) The judge directed that the mother should be given custody of the children.","The company was ordered to pay compensation to its former employee.","‘Come here at once!’ she ordered.","He was told to sit down and wait.","Don’t tell me what to do!","The letter instructed him to report to headquarters immediately.","The judge directed the jury to return a verdict of not guilty.","He commanded his men to retreat.","The judge directed the jury to return a verdict of not guilty.","The law will come into force next year, as directed by the federal government.","You should be prepared to carry out all reasonable duties as directed by the principal."],"opposite":"","synonyms":"order"},{"def":"to send a letter, etc. to a particular place or to a particular person","examples":["Direct any complaints to the Customer Services department.","I directed my question to the chairman.","Inquiries should be directed to Mark Davis."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adverb","level":"B1","meanings":[{"def":"without stopping or changing direction or vehicle","examples":["direct to something We flew direct to Hong Kong.","The 10.40 goes direct to Leeds.","You can now fly direct from Birmingham airport.","We have a new service coming from Frankfurt direct into Kerry airport.","The shipment was supposed to go direct from Tuzla to Baghdad.","If you plan to sail direct, these are potential stops if conditions get too rough."],"opposite":"","synonyms":""},{"def":"without involving other people, or without anyone or anything in between","examples":["I prefer to deal with him direct.","direct to somebody/something an online retailer selling direct to consumers","direct from somebody/something Customers can buy produce direct from the farmer.","direct into something The money is paid direct into your bank account.","Sign up and have our best articles delivered direct to your inbox.","thousands of movies streamed direct to your TV or device","You can order direct from our website.","Have fresh, locally grown fruit and vegetables delivered direct to your door.","She liked to paint direct from nature in the open air.","You can call me direct on this number.","Some of these costs are paid direct out of club funds.","You may be able to save money by booking direct with the hotel rather than through a travel agent.","He scored direct from a corner."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]