[{"pos":"adverb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dir/direc/directly__us_1_rr.mp3","phonsUS":"/dəˈrektli/","level":"B1","meanings":[{"def":"without stopping or changing direction","examples":["The path leads directly to the river.","He drove her directly to her hotel.","The airline flies directly to Stockholm.","You can get on a train and go directly to the ski resort.","Amy flew directly from Dublin to Malaga.","He was told to go directly to the office.","A shuttle bus service takes you directly to the park entrance."],"opposite":"","synonyms":""},{"def":"with nobody or nothing in between","examples":["She speaks directly to camera.","She looked directly at us.","We have not been directly affected by the cuts.","directly linked/connected","diseases directly related to smoking","The president was not directly involved.","He was not directly responsible for the accident.","products that are delivered directly to consumers","problems either directly or indirectly caused by human error","Your success in life is not directly proportional to the effort you make.","Music has been directly linked to the development of improved reasoning skills.","The two incidents are not directly linked.","The issues raised in the report relate directly to the ongoing work of the charity.","The book addresses these issues directly.","We can work either directly with you or with your website designer.","He deals directly with the CEO.","The actors speak directly to the audience.","The money is paid directly into your bank account.","They can only testify regarding facts they have directly observed.","How many road deaths are directly attributable to excess speed?","You can send the bill directly to me at this address.","The link takes you directly to the main webpage.","His family directly benefited from his crimes."],"opposite":"","synonyms":""},{"def":"exactly in a particular position","examples":["directly opposite/below/ahead","They remain directly opposed to these new plans."],"opposite":"","synonyms":""},{"def":"immediately","examples":["She left directly after the show."],"opposite":"","synonyms":""},{"def":"soon","examples":["Tell them I'll be there directly."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"conjunction","level":"","meanings":[{"def":"as soon as","examples":["I went home directly I had finished work."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]