[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dis/disas/disaster__us_4.mp3","phonsUS":"/dɪˈzæstər/","level":"A2","meanings":[{"def":"an unexpected event, such as a very bad accident, a flood or a fire, that kills a lot of people or causes a lot of damage","examples":["the world's worst humanitarian disaster","an environmental/ecological disaster","a rail/mining/tsunami disaster","in a disaster Thousands died in the disaster.","They provided more than $2.3 billion in disaster relief.","a disaster area/zone","It was taking years for disaster victims to settle and rebuild.","Given the threat of earthquake, we recognized the need for disaster recovery centres.","Europe's worst environmental disaster is unfolding at this very moment.","He called for a full investigation to help prevent future disasters.","In a disaster everyone needs to keep calm.","In the aftermath of the disaster people were too shocked to give a clear picture of what had happened.","It was a miracle any of the passengers or crew survived the disaster.","No government could have handled a disaster of this magnitude effectively.","Only rescue workers are allowed into the disaster area.","The area has been declared a disaster zone.","the need for a disaster management plan","The disaster relief operation will continue over the summer.","The majority of enterprises aren't spending very much on disaster recovery at all.","They had no real experience in disaster management.","This morning I signed a disaster declaration for the state.","We have a disaster plan in place before every mission.","Will we ever find out why the disaster occurred?","a Hollywood disaster movie","an organization which provides help for the victims of the disaster","attempts to find out what caused the disaster","communities affected by disasters","counties eligible for federal disaster assistance","fears of a nuclear disaster","finding out why the disaster occurred","providing help for the victims of the disaster","the biggest disaster in British mining history","the governor's disaster fund","the planning and implementation of disaster preparedness","the unfolding storm disaster in the South","Such environmental disasters will become increasingly frequent.","They were involved in the 2001 ferry disaster."],"opposite":"","synonyms":""},{"def":"a very bad situation that causes problems","examples":["Losing your job doesn't have to be such a disaster.","Disaster struck when the wheel came off.","Archie has to act quickly to avert disaster.","They could think of no way to avoid the impending disaster.","Many business partnerships end in disaster.","disaster for somebody The discovery of the disease among sheep spells financial disaster for farmers.","Letting her organize the party is a recipe for disaster (= something that is likely to go badly wrong).","Buying that house turned out to be a financial disaster.","The festival ended up being a financial disaster for the promoters.","Everyone had the feeling that disaster was imminent.","Everything was going fine. Then, without warning, disaster struck.","High-rise buildings proved a social disaster.","His prediction was not heeded, and disaster ensued.","In the last match of the series England were facing disaster.","Independent analysts in the market predicted disaster.","It become a financial disaster scenario.","It seemed that nothing could prevent the impending disaster.","It would spell certain economic disaster for our local community.","Just one mistake can mean disaster.","It's courting disaster to go into the mountains without proper weatherproof clothing.","One person's mistakes can bring disaster to someone else.","The drought spelled economic disaster for the country.","The festival ended up being a financial disaster for the promoters.","The show ended in disaster when the tent collapsed.","Their departure spells social disaster for the region.","There are many who have suffered personal disasters but managed to rebuild their lives.","We could all see that disaster loomed for the company.","a near disaster in the city centre","his firm belief that the whole world was heading for disaster","the greatest electoral disaster of the century","the unforeseen disaster that has just been thrust upon us","What can be done to ward off environmental disaster?","Although there was always the possibility of flooding, the Nile seldom brought disaster to Egypt.","A disaster recovery plan allows a business to continue as usual in the event of system failures."],"opposite":"","synonyms":""},{"def":"a complete failure","examples":["As a teacher, he's a disaster.","The play's first night was a total disaster.","a complete/total/absolute/unmitigated disaster","I am a walking disaster when it comes to paperwork.","I can already foresee the night turning into a total disaster.","The play was a complete disaster from beginning to end.","The shirt was a definite fashion disaster.","He was a competent accountant, but as a manager he's a disaster."],"opposite":"","synonyms":""},{"def":"a thing or person that is very likely to cause danger or a problem in the future because of the condition it is in or the way they behave","examples":["Any one of these nuclear plants may be a disaster waiting to happen."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"an accident/a disaster waiting to happen","def":"a thing or person that is very likely to cause danger or a problem in the future because of the condition it is in or the way they behave","examples":["Any one of these nuclear plants may be a disaster waiting to happen."]}],"phrasal":[],"related":["disaster area","natural disaster","disaster areas","an accident/a disaster waiting to happen"]}]