[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dis/disag/disagree__us_4.mp3","phonsUS":"/ˌdɪsəˈɡriː/","level":"A2","meanings":[{"def":"if two people disagree or one person disagrees with another about something, they have a different opinion about it","examples":["Even friends disagree sometimes.","No, I disagree. I don't think it would be the right thing to do.","disagree with somebody I must respectfully disagree with my colleague.","disagree on something Victoria and I obviously disagree on this issue.","disagree with somebody on something He disagreed with his parents on most things.","I'm afraid I disagree with you on that point.","disagree (with somebody) over something Experts disagree over whether the population will be a burden or a boon in the years ahead.","disagree (with somebody) about something Jack and Robert disagree about everything.","disagree with something I strongly disagree with this decision.","to disagree with a statement/view/conclusion/policy","Some people disagree with this argument.","disagree that… Few would disagree that students learn best when they are interested in the topic.","I’m sorry, I don’t agree/​I have to disagree with you there.","Well, actually, I’m not sure that that’s true.","I don’t think that is exactly right.","I wouldn’t agree that that's the best solution.","I have to say that I don’t find that argument very convincing.","I can’t go along with that idea.","I take/​see your point, but I don't think it would work in practice.","Actually, I think that would make the situation worse.","Actually, I'm not sure that’s the best plan.","I understand where you’re coming from, but I think we might want to take a different approach here.","I can see why you might feel that way, but I think we need to handle this differently.","He and I simply disagree.","I disagree strongly with this idea.","I disagree totally with this policy.","I feel uncomfortable publicly disagreeing with a colleague.","I flatly disagree with that policy.","I must respectfully disagree with her on this point.","I personally disagreed with several elements of the proposal.","It is difficult to disagree with the chairman on this point.","Ministers disagree over the scale of the changes.","The only time we sharply disagreed was over the children's education.","We disagree on this matter.","When I pointed out that it had been her idea in the first place, she could hardly disagree.","No, I disagree. I don't think it would be the right thing to do.","She disagreed that building more roads was the only way to handle traffic congestion."],"opposite":"","synonyms":""},{"def":"if statements or reports disagree, they give different information","examples":["The results of the two approaches disagree.","disagree on something The two reports disagree on the number of people who will be affected by this change.","disagree with something Clinical diagnoses have frequently been reported to disagree with autopsy results."],"opposite":"","synonyms":""},{"def":"if two people agree to differ/disagree, they accept that they have different opinions about something, but they decide not to discuss it any longer","examples":["We must just agree to differ on this.","In the end we agreed to disagree.","I think you're wrong. Let's just agree to differ."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"agree to differ/disagree","def":"if two people agree to differ/disagree, they accept that they have different opinions about something, but they decide not to discuss it any longer","examples":["We must just agree to differ on this.","In the end we agreed to disagree.","I think you're wrong. Let's just agree to differ."]}],"phrasal":["disagree with"],"related":["disagree with","disagree with somebody","disagree with (doing) something","agree to differ/disagree"]}]