[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dis/disap/disappointment__us_1.mp3","phonsUS":"/ˌdɪsəˈpɔɪntmənt/","level":"B2","meanings":[{"def":"the feeling of being sad because something has not happened or been as good, successful, etc. as you expected or hoped","examples":["Book early for the show to avoid disappointment.","To our great disappointment, it rained every day of the trip.","He found it difficult to hide his disappointment when she didn't arrive.","Campaigners have voiced disappointment over the government's decision.","Cross expressed disappointment about the damage.","Disappointment gripped her.","Ethan noticed the disappointment in Lisa's eyes.","Every failed attempt brings disappointment and discouragement.","He bit back his disappointment.","He couldn't help Anita overcome her disappointment.","He couldn't help the feelings of disappointment that filled him.","He expressed to me his disappointment with art in the 20th century.","He feigned disappointment. Secretly, he was mightily relieved.","He let his disappointment show.","He was aware of sharp disappointment and betrayal.","Her laugh covered her disappointment.","His initial disappointment at losing gave way to a new resolve.","His voice betrayed his disappointment.","I just can't face the disappointment of my family and friends.","I know you will share our disappointment at the lack of progress on this issue.","Paul couldn't hide his disappointment at not being asked to the party.","Riley blinked to hide his mild disappointment.","She couldn't quite conceal the deep disappointment she felt.","She must have seen the disappointment in my expression.","The problem must be rectified before disappointment sets in.","The scheme was doomed to disappointment.","Their expectations were doomed to disappointment.","To avoid disappointment, we recommend you book your holiday early.","To her disappointment, they didn't go through Oxford but skirted around it.","To their utter disappointment they found nothing.","You can imagine my disappointment at finding all the plants damaged by caterpillars.","his disappointment in his son"],"opposite":"","synonyms":""},{"def":"a person or thing that is disappointing","examples":["a bitter/major disappointment","That new restaurant was a big disappointment.","He's suffered a whole string of disappointments this week.","disappointment to somebody I always felt I was a disappointment to my father.","What a disappointment he had turned out to be!","This news has come as a disappointment to local business leaders.","The following year brought a major disappointment.","The film was a box-office disappointment.","The ending of the book is a real disappointment.","The cancellation of the tour was a great disappointment for the many fans of the band.","The Mandarin Bar is a complete disappointment.","She's had a lot of disappointments in the past.","Over the years they suffered one disappointment after another.","It was a big disappointment to us when she left.","I'm afraid I was a sad disappointment to my mother.","His second disappointment came last year when he failed to get selected for the first team.","Her past is marred by romantic disappointments.","Her 2004 season will be considered a disappointment.","He has proved a great disappointment to those hoping for change in the region.","A terrible disappointment awaited them."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]