[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dis/discr/discretion__us_1.mp3","phonsUS":"/dɪˈskreʃn/","level":"C1","meanings":[{"def":"the freedom or power to decide what should be done in a particular situation","examples":["I'll leave it up to you to use your discretion.","How much to tell terminally ill patients is left to the discretion of the doctor.","‘Do you want me to do the job myself or hire a photographer?’ ‘I'll leave it to your discretion.’","Judges should be given more discretion over sentencing.","She has considerable discretion as to how the money is spent.","The courts exercise discretion in the area of minor traffic violations.","The president used his executive discretion to pardon the two men.","The school governors have absolute discretion over which pupils they admit.","They give themselves complete discretion as to what information they will hand out.","They would like local authorities to be given greater discretion as to how the money is spent.","We have discretion about how much to charge."],"opposite":"","synonyms":""},{"def":"care in what you say or do, in order to keep something secret or to avoid causing difficulty for somebody or making them feel embarrassed; the quality of being discreet","examples":["This is confidential, but I know that I can rely on your discretion.","Jane is the soul of discretion (= you can trust her).","Use the utmost discretion when you talk to her.","to conduct enquiries with discretion.","to act with discretion","This case calls for the utmost discretion."],"opposite":"","synonyms":""},{"def":"according to what somebody decides or wishes to do","examples":["Bail is granted at the discretion of the court.","There is no service charge and tipping is at your discretion."],"opposite":"","synonyms":""},{"def":"you should avoid danger and not take unnecessary risks","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"at somebody’s discretion","def":"according to what somebody decides or wishes to do","examples":["Bail is granted at the discretion of the court.","There is no service charge and tipping is at your discretion."]},{"idiom":"discretion is the better part of valour","def":"you should avoid danger and not take unnecessary risks","examples":[]}],"phrasal":[],"related":["discretion is the better part of valour"]}]