[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dis/disci/discipline__us_1.mp3","phonsUS":"/ˈdɪsəplɪn/","level":"B2","meanings":[{"def":"the practice of training people to obey rules and orders and punishing them if they do not; the controlled behaviour or situation that is the result of this training","examples":["The school has a reputation for high standards of discipline.","Strict discipline is imposed on army recruits.","harsh/rigorous/rigid/iron discipline","She keeps good discipline in class.","to instill/enforce/impose/maintain discipline","Lack of discipline at home meant that many pupils found it difficult to settle in to the ordered environment of the school.","a serious breach of discipline","He quickly brought order and discipline to the regiment.","It's unfair to dismiss somebody for a single breach of discipline.","Modern schools lack discipline.","She believes children need discipline.","Students have to learn discipline.","The chancellor has stabilized the economy through strict fiscal discipline.","The new headmaster tightened discipline in the school.","The school was criticized for having very poor discipline.","The teacher was unable to maintain discipline.","They submitted to the discipline imposed by their leaders.","We need better discipline in our schools.","We need someone who is good at instilling discipline.","a breakdown of discipline in the classroom","strict military discipline","the discipline that the party exercises over its members"],"opposite":"indiscipline","synonyms":""},{"def":"a method of training your mind or body or of controlling your behaviour; an area of activity where this is necessary","examples":["Yoga is a good discipline for learning to relax."],"opposite":"","synonyms":""},{"def":"the ability to control your behaviour or the way you live, work, etc.","examples":["He'll never get anywhere working for himself—he's got no discipline.","Her determination and discipline were admirable.","It is good discipline to learn to delegate.","It takes great discipline to learn a musical instrument.","something to help you bring discipline to your decision-making process"],"opposite":"","synonyms":""},{"def":"an area of knowledge; a subject that people study or are taught, especially in a university","examples":["The new recruits were drawn from a range of academic disciplines.","Scholars from various disciplines have been working on these problems.","Applications are welcome from candidates with a degree in a mathematics or other relevant discipline.","social work and its related disciplines","experts in multiple disciplines","academics from diverse academic disciplines","When did sociology emerge as a distinct discipline?","They established psychology as an academic discipline.","The university offers a wide range of disciplines.","There is a lack of communication across disciplines.","Students are to be tested on the three core disciplines: mathematics, English and science.","Within a discipline there may be more than one school of thought."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["self-discipline"]},{"pos":"verb","level":"","meanings":[{"def":"to punish somebody for something they have done","examples":["The officers were disciplined for using racist language.","Several players had to be disciplined for violent behaviour.","A spokesman confirmed that Lewis will be disciplined by the club for his outburst.","Should unions discipline members who take unofficial action?"],"opposite":"","synonyms":""},{"def":"to train somebody, especially a child, to obey particular rules and control the way they behave","examples":["a guide to the best ways of disciplining your child"],"opposite":"","synonyms":""},{"def":"to control the way you behave and make yourself do things that you believe you should do","examples":["discipline yourself Dieting is a matter of disciplining yourself.","discipline yourself to do something He disciplined himself to exercise at least three times a week."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]