[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dis/disco/discover__us_1.mp3","phonsUS":"/dɪˈskʌvər/","level":"A2","meanings":[{"def":"to be the first person to become aware that a particular place or thing exists","examples":["Cook is credited with discovering Hawaii.","Scientists around the world are working to discover a cure for AIDS.","a newly discovered snake species","They first discovered this protein about five years ago.","She recently discovered two fungi that were new to science.","Researchers are hoping to discover new way to purify water.","He claims to have discovered a direct correlation between the nuclear tests and earthquakes.","He is credited with having discovered the first recipe for gin back in the 1600s."],"opposite":"","synonyms":""},{"def":"to find somebody/something that was hidden or that you did not expect to find","examples":["discover somebody/something Police discovered a large stash of drugs while searching the house.","We discovered this beach while we were sailing around the island.","His body was discovered in the lake near his house.","discover somebody/something doing something He was discovered hiding in a shed.","discover somebody/something + adj. She was discovered dead at her home in Leeds.","The leak was first discovered last month.","The relics were discovered in a lead box in the ruins of an abbey."],"opposite":"","synonyms":""},{"def":"to find out about something; to find some information about something","examples":["discover something She was determined to discover the truth about her neighbours.","to discover a secret","I've just discovered hang-gliding!","Discover the joys of yoga!","discover (that)… It was a shock to discover (that) he couldn’t read.","discover why, how, etc… We never did discover why she gave up her job.","it is discovered that… It was later discovered that the diaries were a fraud.","somebody/something is discovered to be/have… He was later discovered to be seriously ill.","She subsequently discovered that he'd been having an affair for several months.","But how had he discovered her whereabouts?","recently discovered evidence","We soon discovered we'd been mistaken.","We are trying to discover the truth about his disappearance.","She was surprised to discover he was perfectly capable around the house.","It would be fascinating to discover more about the town's history.","It was a terrible shock to discover the full extent of the problem."],"opposite":"","synonyms":""},{"def":"to be the first person to realize that somebody is very good at singing, acting, etc. and help them to become successful and famous","examples":["be discovered The singer was discovered while still at school.","There's great talent out there just waiting to be discovered."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]