[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dis/disco/discount__us_1_rr.mp3","phonsUS":"/ˈdɪskaʊnt/","level":"B1","meanings":[{"def":"an amount of money that is taken off the usual cost of something","examples":["to get/offer a discount","a 10, 20, 50, etc. per cent discount","Spend over £50 and receive a 15 per cent discount.","Do you qualify for a student discount?","discount for somebody Do you give any discount for students?","If you pay cash you may be able to negotiate a discount.","discount on something They're offering a 10% discount on all sofas this month.","discount off something You can get a substantial discount off your car insurance.","at a discount They were selling everything at a discount (= at reduced prices).","discount to something a chance to buy new shares at a discount to the current trading price","We offer special discount rates for families.","a discount voucher/coupon/card","a discount store/retailer (= one that regularly sells goods at reduced prices)","a discount airline/carrier (= an airline that sells cheap tickets)","Customers are allowed a discount on orders over £500.","We offer discounts to educational institutions.","How would you like a 20 per cent discount off your grocery bill?","A lot of venues and gallleries offer student discounts.","If you collect ten bonus points, you will be entitled to a discount.","It is important to negotiate a good discount and obtain books on approval.","Members are given a discount card which entitles them to 20 per cent off.","There is a special discount for employees.","They offer a trade discount to builders.","They only give you a discount if you buy more than a certain amount.","Tickets are available to members at a discount.","We offer a 5 per cent cash discount for prompt payment.","a discount of 30 per cent","a prescription drug discount card","The store manager gave us a 10 per cent discount on the drum set.","Get a 20 per cent discount voucher off your next visit.","the recent growth of discount brokers and online trading"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["discount rate","discount store","discount rates","no-claim(s) discount"]},{"pos":"verb","level":"B2","meanings":[{"def":"to take an amount of money off the usual cost of something; to sell something at a discount","examples":["be discounted by something Most of our stock has been discounted by up to 40 per cent.","discounted rates/fares","Students can get discounted tickets.","Aer Lingus is offering heavily discounted prices on flights to the US this month.","discount something The newspaper will discount its cover price this week.","We're offering discounted prices throughout March.","It's a mistake to heavily discount the price per item when bidding for a job.","Some of last season's stock is still available at hugely discounted prices.","The discounted fares can be up to 70 per cent less than the airlines' published prices.","New regulations reduced the airlines' capacity to discount fares.","The magazine's first issue was sold at the heavily discounted price of £3.00.","You can find discounted flights on the internet."],"opposite":"","synonyms":""},{"def":"to think or say that something is not important or not true","examples":["discount something We cannot discount the possibility of further strikes.","discount something as something The news reports were being discounted as propaganda.","Buckingham Palace discounted fears for the Queen's health.","This theory has now been largely discounted."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]