[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dis/discr/discrimination__us_1.mp3","phonsUS":"/dɪˌskrɪmɪˈneɪʃn/","level":"C1","meanings":[{"def":"the practice of treating somebody or a particular group in society less fairly than others","examples":["age/racial/gender/sex discrimination (= because of somebody’s age, race or sex)","discrimination against somebody discrimination against the elderly","discrimination in favour of somebody discrimination in favour of the young","discrimination by somebody They alleged discrimination by the authorities.","discrimination on the basis of something to prohibit/outlaw/ban discrimination on the basis of race, gender or sexual orientation","discrimination on the grounds of something legislation to ban discrimination on the grounds of age","They examined racial discrimination in the workplace.","Levels of discrimination against recent immigrants are high.","Many disabled people face discrimination at work.","Overt sex or race discrimination is illegal.","Racist remarks by an employer to an employee can amount to unlawful discrimination.","The charity is campaigning to end mental health discrimination.","The discrimination occurred at the shortlisting stage, not the interviews.","The law now prohibits racial and ethnic discrimination.","There is widespread discrimination against travelling communities.","discrimination based on sexuality","evidence of discrimination against black workers","law suits alleging discrimination","the federal government's employment discrimination laws","Jews suffered many forms of discrimination in medieval Europe.","Most minority groups in this country have experienced some form of race discrimination.","Our policy forbids discrimination on the grounds of a person's race, sex or sexuality.","There are plans to introduce a new law dealing with religious discrimination.","This is blatant discrimination against people with disabilities.","With the current job situation, age discrimination in employment is becoming more common.","Yesterday the club was cleared of racial discrimination against one of its members.","Members of the LGBTQ community are alleging discrimination because of their sexual orientation."],"opposite":"","synonyms":""},{"def":"the ability to judge what is good, true, etc.","examples":["He showed great discrimination in his choice of friends.","You need to use your discrimination when assessing the various approaches on offer.","The president has been criticized for his lack of discrimination in his choice of political allies.","She showed great discrimination in rejecting the poor quality teas."],"opposite":"","synonyms":""},{"def":"the ability to recognize a difference between one thing and another; a difference that is recognized","examples":["to learn discrimination between right and wrong","Young children find it difficult to make fine discriminations.","It takes a lot of experience to make such fine discriminations."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["positive discrimination","reverse discrimination","Sex Discrimination Act"]}]