[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dis/discu/discuss__us_1.mp3","phonsUS":"/dɪˈskʌs/","level":"A1","meanings":[{"def":"to talk about something with somebody, especially in order to decide something","examples":["discuss something with somebody Have you discussed the problem with anyone?","discuss something I'm not prepared to discuss this on the phone.","to discuss the issue/matter/topic","to discuss a plan/proposal","They met to discuss the possibility of working together.","discuss when, what, etc… We need to discuss when we should go.","discuss doing something We briefly discussed buying a second car.","discuss somebody/something doing something They discussed the whole family possibly travelling together.","We talked on the phone for over an hour.","Have you discussed the problem with anyone?","I’ve spoken to the manager about it.","‘Can I speak to Susan?’ ‘Speaking.’ (= at the beginning of a phone conversation)","We only communicate by email.","Dolphins use sound to communicate with each other.","Politicians will be debating the bill later this week.","You shouldn’t have done it without consulting me.","We need to discuss the situation at home.","He refused to discuss it with me.","Ralph called a meeting to discuss how they should respond to the offer.","I'd like to discuss this matter with you later.","I wouldn't accept the job without discussing it with my family first.","If we can get around the table to discuss the issue, maybe we can sort it out without the necessity for further court action.","We can discuss the details later.","An online forum can be used to post information, exchange ideas and discuss problems.","Major planning applications are discussed by the committee each month.","Some students don't feel comfortable discussing these issues in front of their peers.","She met with her coach to discuss her getting back into training.","The panel discussed all the shortlisted entries.","We will send you an invoice as discussed."],"opposite":"","synonyms":"talk"},{"def":"to write or talk about something in detail, showing the different ideas and opinions about it","examples":["discuss something This topic will be discussed at greater length in the next chapter.","The author discusses the economic impact of these changes.","discuss what, how, etc… The article discusses how teachers can use technology in their classrooms.","The novel's main theme is ‘You reap what you sow’. Discuss. (= in an essay question)","The book is about homeless people in the cities.","The report deals with the issue of homelessness in London.","The writer discusses the problems faced by homeless people.","The article presents an overview of the issues surrounding homelessness.","The novel explores the theme of friendship among homeless people.","The first chapter examines the relationship between homelessness and drug addiction.","The paper considers the question of why so many young people become homeless.","These ideas will be examined in more detail in Chapter 10.","The job involves gathering and analysing data.","He tried to analyse his feelings.","The government will review the situation later in the year.","We will study the report carefully before making a decision.","This topic will be discussed at greater length in the next chapter.","Pupils should be encouraged to discuss critically the information they are given.","The proposals have been widely discussed in the media.","This problem has never been discussed openly before.","She discusses this in detail in her paper.","The painting is discussed in more detail below.","We've debated and discussed terrorism, war and politics.","to convene a conference to discuss the country's political future","The panel will discuss the state of contemporary art."],"opposite":"","synonyms":"examine"}],"idioms":[],"phrasal":[],"related":[]}]