[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dis/disch/discharge__us_1_rr.mp3","phonsUS":"/dɪsˈtʃɑːrdʒ/","level":"C1","meanings":[{"def":"to give somebody official permission to leave the police or the armed forces; to make somebody leave the police or the armed forces","examples":["be discharged from something He was discharged from the army following his injury.","She was discharged from the police force for bad conduct.","He was found guilty and dishonourably discharged from the army."],"opposite":"","synonyms":""},{"def":"to allow somebody to leave hospital because they are well enough to leave","examples":["be discharged (from something) Patients were being discharged from the hospital too early.","All the people involved in the accident have now been discharged from hospital.","discharge somebody/yourself (from something) She had discharged herself against medical advice."],"opposite":"","synonyms":""},{"def":"to allow somebody to leave prison or court","examples":["be discharged He was conditionally discharged after admitting the theft.","She was formally discharged by the court."],"opposite":"","synonyms":""},{"def":"to allow a member of a jury to stop serving in a court case","examples":["If the jury cannot agree, it should be discharged.","The judge took the unusual step of discharging the entire jury halfway through the trial."],"opposite":"","synonyms":""},{"def":"when a gas or a liquid discharges or is discharged, or somebody discharges it, it flows somewhere","examples":["discharge (into something) The river is diverted through the power station before discharging into the sea.","discharge something (from something) (into something) The factory was fined for discharging chemicals into the river.","Raw sewage was discharged from the treatment plant directly into the river."],"opposite":"","synonyms":""},{"def":"if part of the body discharges something, a liquid such as pus comes out of it","examples":["The wound started discharging pus."],"opposite":"","synonyms":""},{"def":"to release force or power","examples":["Lightning is caused by clouds discharging electricity."],"opposite":"","synonyms":""},{"def":"to do everything that is necessary to perform and complete a particular duty","examples":["to discharge your duties/responsibilities/obligations","to discharge a debt (= to pay it)","I will faithfully discharge my duties.","His widow was unable to discharge the debt.","My condition renders me unable to discharge my duties.","He could not properly discharge his duties."],"opposite":"","synonyms":""},{"def":"to fire a gun, etc.; (of a gun, etc.) to be fired","examples":["The police officer accidentally discharged a firearm while unloading it.","They gave a cheer and charged, discharging a volley of arrows as they came.","He knocked her hand down and the gun discharged into the floor."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["conditional discharge"]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dis/disch/discharge__us_2.mp3","phonsUS":"/ˈdɪstʃɑːrdʒ/","level":"","meanings":[{"def":"the action of releasing a substance such as a liquid or gas; a substance that comes out from inside somewhere","examples":["a ban on the discharge of toxic waste","nasal/vaginal discharge (= from the nose/ vagina)","discharge from something a thick discharge from the nose"],"opposite":"","synonyms":""},{"def":"the release of electricity from a charged object; a flow of electricity through air or other gas","examples":["thunder and lightning caused by electrical discharges"],"opposite":"","synonyms":""},{"def":"the act of officially allowing somebody, or of telling somebody, to leave the police or the army","examples":["The illness resulted in his discharge from the army.","His quick discharge came as a surprise to everyone."],"opposite":"","synonyms":""},{"def":"the act of allowing somebody to leave hospital because they are well enough to leave","examples":["Referrals can be discussed before discharge from hospital."],"opposite":"","synonyms":""},{"def":"the act of allowing somebody to leave prison or court","examples":["He was given an absolute discharge but banned from driving for twelve months."],"opposite":"","synonyms":""},{"def":"the act of performing a task or a duty or of paying money that is owed","examples":["the discharge of debts/obligations","Arrangements have been made for the discharge of mortgage payments."],"opposite":"","synonyms":""},{"def":"the action of firing a gun, etc.","examples":["an accidental discharge from a dropped gun"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]