[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dis/disea/disease__us_1.mp3","phonsUS":"/dɪˈziːz/","level":"A2","meanings":[{"def":"an illness affecting humans, animals or plants, often caused by infection","examples":["heart/lung/liver disease","In 19th century England, infectious diseases were the principal cause of death.","chronic diseases such as obesity and diabetes","health measures to prevent the spread of disease","Smoking increases the risk of heart disease.","It is not known what causes the disease.","He suffers from a rare blood disease.","Sailors who ate no fresh food contracted the disease.","It's better to prevent disease by ensuring a clean water supply.","to treat/cure a disease","to spread/transmit a disease","Cattle had to be slaughtered after an outbreak of the disease.","patients with coronary heart disease","cardiovascular/pulmonary/respiratory disease","He suffers from a rare blood disease.","She died after a long illness.","a rare disorder of the liver.","a throat infection","a heart condition","childhood ailments","a nasty flu bug","Children are still dying in their millions from preventable diseases.","Humans can contract the disease, which is treatable with antibiotics.","the problem of controlling pests and disease with organic gardening methods","Gene therapy was first pursued in an attempt to cure genetic diseases.","We face the challenge of finding new ways to treat diseases.","Quarantine is important for animal disease prevention.","Drugs can slow down the progression of the disease, but not cure it altogether.","He has a serious lung disease.","He suffered from coronary heart disease","She got a rare liver disease when she was only twenty.","Lupus is an autoimmune disease.","Such unhygienic practices spread disease.","Sufferers from Alzheimer's disease may not be able to cope at home.","The disease has been eradicated from the world.","The disease has killed 500 people so far this year.","The disease is transmitted by mosquitoes.","The government must take action to fight this deadly disease.","the difficulty of diagnosing and treating these diseases","They want to stop the disease from spreading.","Tobacco lowers the body's resistance to disease.","You can't catch the disease just from physical contact.","a disease caused by a vitamin deficiency","a disease of the digestive system","childhood diseases such as mumps and chicken pox","fears of a new killer disease","fears of an outbreak of Legionnaire's disease","new drugs which help to control the disease","the number of people with this disease","the overall incidence of disease in the world","the risk of coronary heart disease","the ticks that carry the disease","The problem was finally diagnosed as heart disease.","This is an extremely infectious disease.","protection against sexually transmitted diseases"],"opposite":"","synonyms":"disease"},{"def":"something that is very wrong with people’s attitudes, way of life or with society","examples":["Greed is a disease of modern society."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Lyme disease","celiac disease","coeliac disease","Crohn’s disease","Marburg disease","venereal disease","mad cow disease","Parkinson’s disease","Dutch elm disease","legionnaires’ disease","brittle bone disease","English disease","Lou Gehrig's disease","motor neurone disease","Creutzfeldt-Jakob disease","foot-and-mouth disease","hoof-and-mouth disease","sexually transmitted disease","Centers for Disease Control and Prevention"]}]