[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dis/disli/dislike__us_1.mp3","phonsUS":"/dɪsˈlaɪk/","level":"B1","meanings":[{"def":"to not like somebody/something","examples":["dislike somebody/something Why do you dislike him so much?","She disliked her boss intensely.","There are very few foods that I actively dislike.","dislike doing something I dislike being away from my family.","Much as she disliked going to funerals (= although she did not like it at all), she knew she had to be there.","dislike somebody/something doing something He disliked her staying away from home.","dislike it when… He disliked it when she behaved badly in front of his mother.","dislike something about somebody/something What did you dislike about the movie?","I can’t stand his brother.","She couldn’t stand being kept waiting.","He despised himself for being so cowardly.","I can’t bear having cats in the house.","They loathe each other.","They absolutely detest each other.","The new teacher was widely disliked.","The new regime is universally disliked.","If anyone really dislikes this colour, please tell me.","He was disliked by most of his contemporaries.","Though he seemed charming, the girl instinctively disliked him.","Not only would she rather not go swimming, she actively dislikes it.","He simply disliked working with committees and avoided it whenever possible.","Most people dislike going to the dentist.","Much as she disliked asking for help, she knew she had to.","He disliked it when she phoned him so late at night."],"opposite":"like","synonyms":"hate"}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"B1","meanings":[{"def":"a feeling of not liking somebody/something","examples":["dislike of somebody/something He did not try to hide his dislike of his boss.","dislike for somebody/something They could barely conceal their dislike for each other.","dislike to somebody/something She took an instant dislike to the house and the neighbourhood.","My father has a great dislike of long hair on boys.","Several committee members expressed their intense dislike of the chairman.","their dislike of central government","Her husband developed a strong dislike for the dog.","She had a deep dislike for Robert's wife.","I took an instant dislike to my new colleague.","He glanced at her with cold dislike.","In spite of their mutual dislike and hostility, they often worked together.","She felt dislike rather than sympathy as he told his story.","She threw him a look of active dislike.","Sonia stared at me with dislike and distrust."],"opposite":"","synonyms":""},{"def":"a thing that you do not like","examples":["I've told you all my likes and dislikes."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]