[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dis/dismi/dismiss__us_3.mp3","phonsUS":"/dɪsˈmɪs/","level":"B2","meanings":[{"def":"to decide that somebody/something is not important and not worth thinking or talking about","examples":["dismiss somebody/something to dismiss a suggestion/a claim/an idea","The criticisms were summarily dismissed by the government.","Rob is quick to dismiss the notion that his trip was horrific.","I think we can safely dismiss their objections.","dismiss somebody/something as something He dismissed the opinion polls as worthless.","His supporters dismissed the allegations as politically motivated.","Vegans are no longer dismissed as cranks.","The suggestion should not be dismissed out of hand (= without thinking about it).","Former members of the band have dismissed talk of a comeback.","It is no longer possible to dismiss the link between climate change and carbon emissions.","She contemptuously dismissed their complaints.","The minister has dismissed all the allegations against him.","His plan was dismissed outright by his friends.","It is easy to dismiss him as nothing more than an old fool.","She dismissed their arguments as irrelevant.","Such reports are routinely dismissed as hysteria.","He dismissed her suggestion out of hand.","Many critics will casually dismiss these claims."],"opposite":"","synonyms":""},{"def":"to put thoughts or feelings out of your mind","examples":["dismiss something Dismissing her fears, she climbed higher.","dismiss somebody/something from something He dismissed her from his mind.","She could not dismiss the possibility of his guilt.","It was not easy to dismiss the matter from his thoughts.","She tried to dismiss the idea from her mind."],"opposite":"","synonyms":""},{"def":"to officially remove somebody from their job","examples":["She claims she was unfairly dismissed from her post.","The court ruled that Ms Hill had been unfairly dismissed.","He was summarily dismissed from his job."],"opposite":"","synonyms":""},{"def":"to send somebody away or allow them to leave","examples":["At 12 o'clock the class was dismissed."],"opposite":"","synonyms":""},{"def":"to say that a trial or legal case should not continue, usually because there is not enough evidence","examples":["The judge dismissed the case for lack of evidence.","to dismiss an appeal/application","The court dismissed all the charges against her.","Judges have to state their reasons for dismissing a case.","‘Case dismissed!’","The case was dismissed."],"opposite":"","synonyms":""},{"def":"to end the innings of a player or team","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]