[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dis/disor/disorder__us_1.mp3","phonsUS":"/dɪsˈɔːrdər/","level":"B2","meanings":[{"def":"an illness that causes a part of the body to stop functioning correctly","examples":["a blood/bowel disorder","eating disorders","He was suffering from some form of psychiatric disorder.","This is a rare disorder of the liver.","Most people with acute mental disorder can be treated at home.","He suffers from a rare blood disease.","She died after a long illness.","a rare disorder of the liver.","a throat infection","a heart condition","childhood ailments","a nasty flu bug","Consumption of fatty acids may help prevent the disorder.","Her doctor diagnosed a thyroid disorder.","She suffers from a rare blood disorder.","Some people develop psychological disorders as a result of trauma.","disorders affecting the very old, such as senile dementia","disorders of the digestive system","the argument that thin models in magazines cause eating disorders","She's got some kind of bowel disorder.","a/​an psychiatric/​personality/​mental/​depressive/​eating disorder"],"opposite":"","synonyms":"disease"},{"def":"an untidy state; a lack of order or organization","examples":["The room was in a state of disorder.","in (…) disorder His financial affairs were in complete disorder.","Everyone began shouting at once and the meeting broke up in disorder.","The country was thrown into disorder by the strikes.","He died suddenly, leaving his financial affairs in complete disorder.","He loves tidying up, making order out of disorder.","The gang of men scattered in disorder.","The world's currency markets were thrown into disorder.","the wild disorder of her red hair"],"opposite":"order","synonyms":""},{"def":"violent behaviour of large groups of people","examples":["an outbreak of rioting and public disorder","Twenty people were arrested after a night of civil disorder.","The initiative aims to tackle alcohol-related disorder in towns.","The police will not tolerate disorder of any kind on our streets.","There have been outbreaks of serious public disorder.","Troops were sent in to quell the disorder.","new restrictions aimed at preventing social disorder","problems of youth disorder in our cities","the pressures on police caused by drink-related disorder","The food crisis led to outbreaks of rioting and public disorder."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["bipolar disorder","eating disorder","personality disorder","attention deficit disorder","autism spectrum disorder","body dysmorphic disorder","seasonal affective disorder","split personality disorder","borderline personality disorder","multiple personality disorder","obsessive compulsive disorder","post-traumatic stress disorder","bipolar affective disorder","multiple-personality disorder","split-personality disorder","attention deficit hyperactivity disorder"]}]