[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dis/displ/display__us_2.mp3","phonsUS":"/dɪˈspleɪ/","level":"B2","meanings":[{"def":"to put something in a place where people can see it easily; to show something to people","examples":["display something The exhibition gives local artists an opportunity to display their work.","His football trophies were prominently displayed in the kitchen.","She displayed her bruises for all to see.","display something to somebody She proudly displayed her certificate to her parents.","A notice will be displayed in the hotel lobby.","traders displaying their wares in the street market","He dearly loved to display his knowledge."],"opposite":"","synonyms":""},{"def":"to show a quality, feeling, skill or type of behaviour; to show signs of something","examples":["I have rarely seen her display any sign of emotion.","He displays amazing skill with a golf club.","The supporting cast displays real acting talent.","These statistics display a definite trend.","Many animals in stressful conditions display this behaviour.","From 1811 until his death in 1820, George III displayed symptoms of insanity.","He displayed remarkable courage.","displaying a lack of understanding","displaying the symptoms of nervous exhaustion","Every so often he would display a vein of sharp humour.","A group of artists will be displaying their skills to the students."],"opposite":"","synonyms":""},{"def":"to show information","examples":["Giant screens displayed images of cheering crowds.","ways of displaying information on screen","The screen will display the username in the top right-hand corner.","This column displays the title of the mail message."],"opposite":"","synonyms":""},{"def":"to show a special pattern of behaviour that is intended to attract a female bird or animal","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["display bin","display case","pay and display","head-mounted display","liquid crystal display","visual display unit","display cases","display cabinet","visual display units","video display terminal","on display"]},{"pos":"noun","level":"B2","meanings":[{"def":"an arrangement of things in a public place to inform or entertain people or advertise something for sale","examples":["a beautiful floral display","The window display changes once a month.","display of something a display of photographs","The medals can be seen in a display cabinet on the first floor.","a display window/stand/board","An audio-visual display gives visitors an idea of what life was like aboard a sailing ship.","The display illustrates the traditional industries of the town.","The display includes examples of her work in progress.","The museum has a fine display of old medical instruments.","The show featured a display of some of Mack's costume designs.","The spacious lobby also functions as a display area.","There was a prominent display of her photographs in the living room.","We plan to mount a display of the children's work in the lobby area.","a display of Roman coins","a glass-fronted display cabinet","the display windows of a department store"],"opposite":"","synonyms":""},{"def":"an act of performing a skill or of showing something happening, in order to entertain","examples":["They put on a spectacular firework display.","The team produced an impressive display.","display of something We watched a stunning display of aerobatics.","They gave a dazzling display of football and deserved their victory.","a magnificent display of goalkeeping","Most of the local people attended the firework display.","the RAF Falcon parachute display team","an aerobatic display team","a virtuoso display of guitar playing","a flamboyant display of footballing skills","They gave a virtuoso display of disco dancing.","The sun set in a pyrotechnic display that burned up the whole sky.","The crowd was treated to an impressive display of power tennis.","People waited for hours to see the display.","Hundreds of people experienced the dramatic aerial display.","The male performs a magnificent courtship display."],"opposite":"","synonyms":""},{"def":"an occasion when you show a particular quality, feeling or ability by the way that you behave","examples":["a display of affection/emotion/skill","an ostentatious display of wealth","an impressive display of strength and courage","My family has never gone in for open displays of affection.","an open display of affection for her husband","There may be specific events which trigger aggressive displays in your dog.","Despite his outward display of friendliness, I sensed he was concealing something.","He made an elaborate display of surprise.","I witnessed a rare display of affection between them.","Members of the community closed ranks in an impressive display of unity.","She slammed the door behind her in a display of ill-temper."],"opposite":"","synonyms":""},{"def":"the words, pictures, etc. shown on a computer screen; the process of showing words, pictures, etc. on a computer screen","examples":["a high resolution colour display","the processing and display of high volumes of information","The LCD display shows the time in hours and minutes.","a visual display unit","display screen equipment"],"opposite":"","synonyms":""},{"def":"an electronic device for presenting words, pictures, etc.","examples":["The colour display now costs £400."],"opposite":"","synonyms":""},{"def":"a special pattern of behaviour by male birds and animals of some species that is intended to attract a female bird or animal","examples":["Males perform courtship displays to attract mates."],"opposite":"","synonyms":""},{"def":"put in a place where people can look at it","examples":["Designs for the new sports hall are on display in the library.","to put something on temporary/permanent display","Examples of her work will go on permanent display in the new museum.","On display are earrings, necklaces and bracelets made from jade, amber and amethyst.","The birds were put on display at the zoological society.","The jewels are normally kept on static display in the museum."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"on display","def":"put in a place where people can look at it","examples":["Designs for the new sports hall are on display in the library.","to put something on temporary/permanent display","Examples of her work will go on permanent display in the new museum.","On display are earrings, necklaces and bracelets made from jade, amber and amethyst.","The birds were put on display at the zoological society.","The jewels are normally kept on static display in the museum."]}],"phrasal":[],"related":[]}]