[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dis/dispu/dispute__us_3.mp3","phonsUS":"/dɪˈspjuːt/","level":"C1","meanings":[{"def":"an argument between two people, groups or countries; discussion about a subject on which people disagree","examples":["industrial/pay disputes","dispute between A and B a dispute between the two countries about the border","dispute over/about something the latest dispute over fishing rights","in dispute with somebody/something The union is in dispute with management over working hours.","in/under dispute The cause of the accident was still in dispute (= being argued about).","These are not the issues under dispute.","beyond dispute The matter was settled beyond dispute by the court judgment (= it could no longer be argued about).","open to dispute His theories are open to dispute (= can be disagreed with).","He proposed a negotiated settlement of the outstanding disputes between the two countries.","The incident sparked off a major dispute between the two countries.","The purpose of industrial tribunals is to adjudicate disputes between employers and employees.","There were lengthy internal disputes between the two wings of the party.","a jurisdictional dispute between the Army and the CIA","a long-standing dispute between the families over ownership of the land.","to minimize the scope for dispute over the meaning of the terms employed","There is considerable dispute over the precise definition of ‘social class’ as a term.","The actual sum of compensation due is still in dispute.","The employees have been in dispute with management for three weeks.","They became embroiled in a dispute with their competitors.","No one could remember exactly how the dispute had arisen.","Police have difficulties in dealing with domestic disputes.","The exact relationship between the two languages is a matter of dispute among scholars.","The simmering dispute erupted in public when the two men came to blows at the party conference.","There is no dispute as to the facts.","disputes concerning environmental protection","one of the many factors that led to the dispute","His job is to settle pay disputes."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"C1","meanings":[{"def":"to question whether something is true or legally or officially acceptable","examples":["dispute something These figures have been disputed.","to dispute a decision/claim","The family wanted to dispute the will.","dispute that… No one is disputing that there is a problem.","dispute whether, how, etc… | it is disputed whether, how, etc… It is disputed whether the law applies in this case.","No one can dispute the fact that men still hold the majority of public offices.","The minister disputed the claim that the funding was insufficient.","The players disputed the referee's decision."],"opposite":"","synonyms":""},{"def":"to argue or disagree strongly with somebody about something, especially about who owns something","examples":["dispute something (with somebody) I tried to dispute the bill with the waiter.","The United Nations recognizes the area as a disputed territory.","The issue remains hotly disputed.","dispute with somebody He taught and disputed with local poets.","The effectiveness of this treatment is still hotly disputed.","The ownership of this land has been disputed for centuries."],"opposite":"","synonyms":""},{"def":"to fight to get control of something or to win something","examples":["On the last lap three runners were disputing the lead."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]