[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dis/distr/distribute__us_1_rr.mp3","phonsUS":"/dɪˈstrɪbjuːt/","level":"B2","meanings":[{"def":"to give things to a large number of people; to share something between a number of people","examples":["distribute something The leaflets have been widely distributed.","The newspaper is distributed free.","to distribute fliers/pamphlets/questionnaires","Viruses are often distributed via email.","distribute something to somebody/something The organization distributed food to the earthquake victims.","distribute something among somebody/something The money was distributed among schools in the area.","distribute something between somebody/something The proceeds will be distributed between local charities.","Copies of the book were distributed free to each school in the district.","We distributed the money equally among the team members.","distributing aid to people in need"],"opposite":"","synonyms":""},{"def":"to send goods to shops and businesses so that they can be sold","examples":["Who distributes our products in the UK?","Their trademark jeans enjoyed immediate success and were soon distributed worldwide.","nationally distributed brands of fruit juice","‘Plastika’ distributes our products in the UK.","The cheese is imported and distributed exclusively by Norland Inc.","Hood distributes dairy products throughout the United States."],"opposite":"","synonyms":""},{"def":"to spread something, or different parts of something, over an area","examples":["be distributed + adv./prep. Make sure your weight is evenly distributed.","Cases of the disease are widely distributed through Europe.","Generous workspaces must be well distributed throughout the library.","Smokers were randomly distributed in the sample interviewed.","The plant is globally distributed.","The trend is broadly distributed and not just a big-city phenomenon.","There are over 35 000 species of orchid distributed throughout the world.","Wealth is not evenly distributed between age groups."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]