[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dis/dista/distance__us_2.mp3","phonsUS":"/ˈdɪstəns/","level":"A2","meanings":[{"def":"the amount of space between two places or things","examples":["a short/long distance","Paul has to drive very long distances as part of his job.","a distance of something to travel/cover a distance of 200 kilometres","distance to something She walked the short distance to her apartment.","distance from something Once she was a safe distance from the shop, Gina stopped.","distance of A from B the distance of the earth from the sun","distance from A to B What’s the distance from New York City to Boston?","distance between A and B What’s the distance between New York City and Boston?","over a distance (of something) The wind carries pollen over considerable distances.","within… distance (of something) The beach is within walking distance of my house (= you can walk there easily).","The house is within easy commuting distance of town.","In the US, distance is measured in miles.","distance away Our parents live some distance away (= quite far away).","a distance (= long-distance) runner/swimmer","I kept a comfortable distance behind the van.","Allow for greater braking distances when pulling a loaded trailer.","He moved a short distance up the valley.","He was gradually closing the distance between himself and the other runners.","It is very difficult to judge distances in the desert.","It's quite a good distance to the nearest town.","She sprinted the entire distance.","The arch spans a distance of 285 feet.","The bars are within walking distance.","The house is a short distance away from the bus station.","The leaders in the race were a considerable distance ahead.","The people travel vast distances to find food.","The sound can be heard over a distance of more than five miles.","The spacecraft has the ability to traverse great distances.","The town is a considerable distance from the coast.","The young birds were soon flying distances of 200 feet or more.","a champion distance swimmer","a long-distance runner","children living within a certain distance of the school","the average distance covered during pursuits by cheetahs","the distance from our house to the school","to have good distance vision"],"opposite":"","synonyms":""},{"def":"being far away in space or in time","examples":["Distance is no problem on the internet.","They don't see their family because of geographical distance.","distance between A and B The car put physical distance between people and their places of work.","No time or distance can limit this type of friendship.","The sheer distance of these objects from Earth makes it impossible for us to study them closely.","Because of geographical distance, Britain had not been as Romanized as Gaul or Spain."],"opposite":"","synonyms":""},{"def":"a point that is a particular amount of space away from something else","examples":["from a distance You'll never get the ball in from that distance.","The cat sat and watched us from a safe distance.","from a distance Visitors can only view the painting from a distance of three metres.","at a distance She followed them at a discreet distance.","at a distance of something A digital camera was positioned at a distance of 1.5 metres from the subject."],"opposite":"","synonyms":""},{"def":"a difference or lack of a connection between two things","examples":["distance between A and B The distance between fashion and art remains as great as ever.","The government is keen to put some distance between itself and these events (= show that there is no connection between them).","distance from something Sociologists must maintain critical distance from the ideas of society at any particular time.","(British English) Eddie is, by some distance (= by a great amount), the funniest character in the show."],"opposite":"","synonyms":""},{"def":"a situation in which there is a lack of friendly feelings or of a close relationship between two people or groups of people","examples":["The coldness and distance in her voice took me by surprise.","distance between A and B There was a growing distance between the two sides of the family.","He worried about the increasing distance between his children and himself.","distance from somebody/something He felt a sense of distance from the others."],"opposite":"","synonyms":""},{"def":"from a place or time that is not near; from far away","examples":["She had loved him at a distance for years.","At a distance it is difficult to make out the detail on the building.","We admired the palace from a distance."],"opposite":"","synonyms":""},{"def":"to continue playing in a competition or sports contest until the end","examples":["Nobody thought he would last 15 rounds, but he went the full distance."],"opposite":"","synonyms":""},{"def":"far away but still able to be seen or heard","examples":["We saw lights in the distance.","Alice stood staring into the distance.","Five miles of sand stretched away into the distance.","I could just see the hills in the far distance.","In the distance was a small town.","The moors stretched away into the blue distance.","The road stretches off into the distance."],"opposite":"","synonyms":""},{"def":"to refuse to be friendly with somebody; to not let somebody be friendly towards you","examples":["The manager prefers to keep employees at a distance."],"opposite":"","synonyms":""},{"def":"to make sure you are not too near somebody/something","examples":[],"opposite":"","synonyms":""},{"def":"to avoid getting too friendly or involved with a person, group, etc.","examples":["She was warned to keep her distance from Charles if she didn't want to get hurt."],"opposite":"","synonyms":""},{"def":"very close","examples":["We came within touching distance of winning the cup.","We live within spitting distance of the bus station."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"at/from a distance","def":"from a place or time that is not near; from far away","examples":["She had loved him at a distance for years.","At a distance it is difficult to make out the detail on the building.","We admired the palace from a distance."]},{"idiom":"go the (full) distance","def":"to continue playing in a competition or sports contest until the end","examples":["Nobody thought he would last 15 rounds, but he went the full distance."]},{"idiom":"in/into the distance","def":"far away but still able to be seen or heard","examples":["We saw lights in the distance.","Alice stood staring into the distance.","Five miles of sand stretched away into the distance.","I could just see the hills in the far distance.","In the distance was a small town.","The moors stretched away into the blue distance.","The road stretches off into the distance."]},{"idiom":"keep somebody at a distance","def":"to refuse to be friendly with somebody; to not let somebody be friendly towards you","examples":["The manager prefers to keep employees at a distance."]},{"idiom":"keep your distance (from somebody/something)","def":"to make sure you are not too near somebody/something","examples":["She was warned to keep her distance from Charles if she didn't want to get hurt."]},{"idiom":"within touching distance (of something)","def":"very close","examples":["We came within touching distance of winning the cup.","We live within spitting distance of the bus station."]}],"phrasal":[],"related":["long distance","long-distance","distance learning","middle-distance","social distance","distance education","long-distance footpath","middle distance","long-distance path","within touching distance","within shouting distance (of something)","within spitting distance (of something)","within striking distance (of something)"]},{"pos":"verb","level":"","meanings":[{"def":"to become less involved or connected with somebody/something","examples":["distance yourself from somebody/something When he retired, he tried to distance himself from politics.","The company has tried to distance itself from the remarks made by some of its employees.","distance yourself It's not always easy for nurses to distance themselves emotionally."],"opposite":"","synonyms":""},{"def":"to make somebody/something less involved or connected with somebody/something","examples":["Her mother wished to distance her from the rough village children.","These narrative techniques actually distance the reader from the story."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]