[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dis/disti/distinction__us_1.mp3","phonsUS":"/dɪˈstɪŋkʃn/","level":"C1","meanings":[{"def":"a clear difference or contrast especially between people or things that are similar or related","examples":["distinctions between traditional and modern societies","Philosophers did not use to make a distinction between arts and science.","We need to draw a distinction between the two events.","Cultural distinctions lie at the heart of these issues.","Is there always an absolute distinction between right and wrong?","It was a subtle distinction but a very important one.","No legal distinction existed between cities and other corporations.","She draws an important distinction between the different kinds of illness.","The distinction between amateur and professional players is being blurred.","We can see a sharp distinction between ambition and greed.","a society without distinctions of class and privilege","making invidious distinctions between the ‘deserving’ and the ‘undeserving’ poor","the conventional distinction between pure and applied science","She tends to blur the distinctions between family and friends.","We need to draw a distinction between democratic socialism and social democracy."],"opposite":"","synonyms":""},{"def":"the act of separating people or things into different groups","examples":["distinction (between A and B) The new law makes no distinction between adults and children (= treats them equally).","without distinction All groups are entitled to this money without distinction."],"opposite":"","synonyms":""},{"def":"the quality of being something that is special","examples":["She had the distinction of being the first woman to fly the Atlantic.","Fennel leaves add distinction to any dish.","Though they fought with distinction, they suffered heavy casualties.","New York does not have the nation's oldest subway system; that distinction belongs to Boston.","Wearing the county tie was a mark of modest social distinction."],"opposite":"","synonyms":""},{"def":"the quality of being excellent or important","examples":["a writer of distinction","She is a historian of great distinction.","She achieved distinction in several fields of scholarship.","The cast performed with some distinction.","Election to the NAE is an indication of professional distinction.","He served with distinction in the First World War."],"opposite":"","synonyms":""},{"def":"a special mark or award that is given to somebody, especially a student, for excellent work","examples":["Naomi got a distinction in maths.","with distinction He graduated with distinction."],"opposite":"","synonyms":""},{"def":"a point that somebody wants to suggest is a difference when in fact it is not different at all","examples":["His government did not brand them terrorists, but rather ‘an entity that supports terrorism’. That may prove to be a distinction without a difference."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a distinction without a difference","def":"a point that somebody wants to suggest is a difference when in fact it is not different at all","examples":["His government did not brand them terrorists, but rather ‘an entity that supports terrorism’. That may prove to be a distinction without a difference."]}],"phrasal":[],"related":["a distinction without a difference"]}]