[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dis/distr/district__us_1.mp3","phonsUS":"/ˈdɪstrɪkt/","level":"B2","meanings":[{"def":"an area of a country or town, especially one that has particular features","examples":["the City of London’s financial district","Every city has its central business district.","The house is in a historic district.","Milan's most fashionable shopping district","a poor district of the city","rural/urban districts","The apartment is approximately fifteen minutes from the downtown district.","The hotel is located within Beijing's business district.","Times Square is the entertainment district of New York.","a new railway station to help people commuting from outlying districts","efforts to create a single business district in downtown Beijing","the shacks in the poorest districts of the city","The financial district of London is usually referred to as ‘the City’.","The house was like all the others in this exclusive residential district."],"opposite":"","synonyms":""},{"def":"one of the areas that a country, town or state is divided into for purposes of organization, with official boundaries (= borders)","examples":["a tax/postal district","a village in the Darjeeling district","a district judge","the district health authority","Delivery is free within the London postal district.","a federal district court in New York","They redrew districts to make sure Republican candidates would win.","The hospital is only responsible for patients within its own district.","Redrawing district boundaries would change the election results.","It's a heavily Democratic district.","He represented his district in Congress.","He hasn't yet registered to vote in his home district.","He has been transferred to a hospital in a different health district.","Clinton barely won the district in 1996.","Fire crews from all the surrounding districts helped to fight the fires in the city.","The district includes much of the Ribault River.","Their district stretches nearly 150 miles, from the mountains to the sea.","The district council granted planning permission for ten new houses."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["district attorney","district council","district court","district heating","district nurse","postal district","school district","congressional district","Lake District","Peak District","red-light district","District of Columbia","central business district","district courts","district nurses","district attorneys","district councils"]}]