[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/div/divis/division__us_2.mp3","phonsUS":"/dɪˈvɪʒn/","level":"B2","meanings":[{"def":"the process or result of dividing into separate parts; the process or result of dividing something or sharing it out","examples":["The organism begins as a single cell and grows by cell division.","division of something We need to ensure a fair division of time and resources.","division (of something) between A and B the division of labour between the sexes","The living room is divided from a large terrace by glass walls so division between inside and outside is blurred.","division (of something) among somebody His will detailed his assets and gave instructions for their division among his children.","The fund is available for discretionary division among members.","division of something into something This division of the population into age groups is obviously convenient for marketing purposes.","division into something This is a distinction which cuts right across the familiar division into arts and sciences.","an unequal division of the cake","an unfair division of labour","In many traditional societies, the division of labour between the sexes is strict.","the division of the money between the members","You can make a rough division of his music into ‘light’ and ‘serious’.","the conventional division of language into grammar and vocabulary","In selling there is a broad division into direct and indirect methods."],"opposite":"","synonyms":""},{"def":"the process of dividing one number by another","examples":["the division sign (÷)","division by something division by three"],"opposite":"","synonyms":""},{"def":"a disagreement or difference in opinion, way of life, etc., especially between members of a society or an organization","examples":["We choose peace over hatred and division.","division (in something) (over something) There are deep divisions in the party over the war.","division within something the work of healing the divisions within society","division between A and B divisions between rich and poor","The party was weakened by division between various factions.","Her comments appeared to have deepened divisions between the two countries.","division among somebody/something He has tried to sow division among the people.","The prime minister's speech will attempt to heal divisions within his party.","What can we do about the tendency of social media algorithms to stoke division?","There are reports of serious divisions among senior party members.","There are sharp divisions within the party over the proposals.","division within the government","factional divisions within the party","faith and love which transcends every division and prejudice","hierarchical division between ‘workers’ and ‘management’","Divisions between rich and poor seem to grow ever wider.","We need to work together to heal the divisions within society."],"opposite":"","synonyms":""},{"def":"a large and important unit or section of an organization","examples":["the organized crime division of the Austrian police force","The company's sales division is going to be restructured.","the head of the crime division in West Yorkshire police","She works in the marketing division.","The company recently launched its publishing division.","the administrative divisions of the Roman Empire","The company sold its financial services division for £762m."],"opposite":"","synonyms":""},{"def":"part of a city, county, or country that is regarded as a separate area for administration purposes","examples":["Oldham is one of the police divisions of Greater Manchester.","Nagpur is the most eastern division in the state."],"opposite":"","synonyms":""},{"def":"a group of teams or competitors in a sports competition who compete against each other. Divisions may be organized by ability, geography or weight, depending on the sport.","examples":["the premier division","The club will finish second in Division One.","a first-division team","one of the most competitive weight divisions in judo","He's now playing football in the higher divisions.","The Ravens finished 10–6 and won the division.","The team have a three game division lead.","The team won its tenth consecutive division title.","They compete in the senior division of the chess league."],"opposite":"","synonyms":""},{"def":"a unit of an army, consisting of several brigades or regiments","examples":["the Guards Armoured Division","The commander of the fourth infantry division defied orders."],"opposite":"","synonyms":""},{"def":"a line that divides something","examples":["A hedge forms the division between their land and ours.","(figurative) Sometimes there is no simple division between good and evil."],"opposite":"","synonyms":""},{"def":"the act of separating members of the British parliament into groups to vote for or against something","examples":["The Bill was read without a division."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["division bell","Joy Division","long division","Chancery Division","division lobby","Family Division","Guards Division","Household Division","word division","division bells","division lobbies","Queen’s Bench Division"]}]