[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/div/divid/divide__us_2.mp3","phonsUS":"/dɪˈvaɪd/","level":"B1","meanings":[{"def":"to separate into parts; to make something separate into parts","examples":["The cells began to divide rapidly.","divide into something The questions divide into two categories: easy and hard.","divide up After lunch we divided up for group discussions.","divide something (into something) I divided the class into four groups.","Divide the dough into four pieces.","The book is divided into 11 sections.","divide something up (into something) A sentence can be divided up into meaningful segments.","Railway enthusiasts divide neatly into two groups.","We have divided the topics into three categories.","The study divided consumers into five groups.","Films tend to divide into two categories: ‘art-house’ and ‘commercial’.","The performance is divided into six parts.","The children divided into three teams.","The country is divided up into nine regions.","They were randomly divided into three groups.","This report is divided broadly into two parts.","First, divide the class into two groups.","The city was divided into four sectors.","Flimsy partitions divided up the gallery into claustrophobic rooms.","We decided to divide the space with screens."],"opposite":"","synonyms":""},{"def":"to separate something into parts and give a share to each of a number of different people, etc.","examples":["They could not agree on how to divide the land.","divide something up Jack divided up the rest of the cash.","divide something (up) between somebody We divided the work between us.","divide something (up) among somebody Profits were divided up among the staff.","The money was divided equally among his sons.","The story is about a father who divides his property among his sons.","Space is divided according to the needs of individual departments.","Most of the collection was divided among the city's museums.","They carefully divided up the cost of the vacations they took together.","The exhibition features the work of 60 artists, evenly divided between well-known and less-familiar figures."],"opposite":"","synonyms":""},{"def":"to use different parts of your time, energy, etc. for different activities, etc.","examples":["divide something As working parents we think carefully about how we divide our time.","divide something between A and B He divides his energies between politics and business.","They divided their time between London and Boston.","They divide their time between New York and their ranch in New Mexico.","Her mentor advised her to divide her efforts 80–20, with 80% going to research, and 20% to teaching.","The children of divorced parents may divide their loyalties between them.","He divides his year between the University of Houston and Florida State University."],"opposite":"","synonyms":""},{"def":"to separate into two or more parts that lead in different directions","examples":["Where the path divides, keep right.","divide into something The river divides into several channels.","Just past the bridge by a new forestry block, the paths divide.","There's a signpost where the road divides.","The nearest restaurant is located opposite, just before the road divides.","He overtook at the point where the road divides into two lanes.","Here the river divides into about four separate streams.","Streams divide and unite across the plain."],"opposite":"","synonyms":""},{"def":"to separate two people or things","examples":["Can it ever be right to divide a mother from her child?","The landowners were divided from the mass of poor peasants who lived in the surrounding area."],"opposite":"","synonyms":""},{"def":"to be the real or imaginary line or barrier that separates two people or things","examples":["divide something (off) A fence divides off the western side of the grounds.","divide A from B The English Channel divides England from France.","A low wall divides the patio from the rest of the garden.","Britain is divided from the rest of Europe by the English Channel.","the mountains which divide Europe from Asia"],"opposite":"","synonyms":""},{"def":"to find out how many times one number is contained in another","examples":["divide something by something 30 divided by 6 is 5 (= 30 ÷ 6 = 5).","divide by something It's easy to divide by ten.","The children are learning how to multiply and divide."],"opposite":"","synonyms":""},{"def":"to be able to be multiplied to give another number","examples":["5 divides into 30 6 times."],"opposite":"","synonyms":""},{"def":"to make people disagree","examples":["divide somebody/something to divide the nation/country","This issue has bitterly divided the community.","The building divides opinion (= some people like it and some do not).","be divided on/over something The party is deeply divided on this question.","to be evenly/sharply divided over the issue","The issue has divided the government.","The presidential elections divided the nation.","a country divided by war","The case divided the New York art world at the time.","a society that was divided along sectarian lines","an issue that threatens to divide society","I will not allow this to divide our family.","Scholarly opinion is evenly divided on whether the portrait is of a Hellenistic prince or a Roman general."],"opposite":"","synonyms":""},{"def":"to disagree","examples":["Communities frequently divided along religious lines."],"opposite":"","synonyms":""},{"def":"to keep control over people by making them disagree with and fight each other, therefore not giving them the chance to join together and oppose you","examples":["a policy of divide and rule"],"opposite":"","synonyms":""},{"def":"to divide something into two equal parts; to divide into two equal parts","examples":["The country was split down the middle over the strike (= half supported it, half did not).","Divide the cake down the middle.","It would seem the community has divided down the middle, with some favouring expansion and some dead set against it."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"divide and rule","def":"to keep control over people by making them disagree with and fight each other, therefore not giving them the chance to join together and oppose you","examples":["a policy of divide and rule"]},{"idiom":"split/divide (something) down the middle","def":"to divide something into two equal parts; to divide into two equal parts","examples":["The country was split down the middle over the strike (= half supported it, half did not).","Divide the cake down the middle.","It would seem the community has divided down the middle, with some favouring expansion and some dead set against it."]}],"phrasal":[],"related":["digital divide","Great Divide","Continental Divide","North-South Divide","bridge the gap/gulf/divide (between A and B)"]},{"pos":"noun","level":"B2","meanings":[{"def":"a difference between two groups of people or two things that separates them from each other","examples":["He offered advice on bridging cultural divides.","to straddle/cross a divide","The referendum revealed a deep urban-rural divide.","divide between A and B Will this deepen the divide between the country's rich and poor?","The leader's speech aimed to close the embarrassing divide in party ranks.","a style which straddles the divide between classic and modern","The show's appeal crosses the gender divide.","the sharp divides in society that help account for the rise of fascism","a divide separating those who have access to computers and those who don't","People continue to derive their identity from their church—which works well in some ways, but also reinforces sectarian divides.","There is a real generational divide in attitudes towards intellectual property and copyright.","The film's subject matter will be controversial on both sides of the ideological divide.","attempts to address the racial divide in this country","The danger is that the internet will simply widen the divide between the information rich and the information poor.","the digital divide between people with access to technology and those without"],"opposite":"","synonyms":""},{"def":"a line of high land that separates two systems of rivers","examples":[],"opposite":"","synonyms":""},{"def":"to reduce or get rid of the differences that exist between two things or groups of people","examples":["The new degree course aims to bridge the gulf between education and industry."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"bridge the gap/gulf/divide (between A and B)","def":"to reduce or get rid of the differences that exist between two things or groups of people","examples":["The new degree course aims to bridge the gulf between education and industry."]}],"phrasal":[],"related":[]}]