[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/doc/docum/document__us_1.mp3","phonsUS":"/ˈdɑːkjumənt/","level":"A2","meanings":[{"def":"an official paper, book or electronic file that gives information about something, or that can be used as evidence or proof of something","examples":["Please read and sign the attached document.","Please e-sign the document and email it back.","This is an important legal document.","The child is identified only by the initial ‘M’ in court documents.","Keep your passport and other travel documents in a secure place.","According to documents released yesterday, he was paid over £1 million last year.","to publish/produce a document","Copies of the relevant documents must be filed at court.","to table/submit a document","a leaked/forged document","a classified/confidential/secret document","a consultation/policy document","A document signed abroad is as legally binding as one signed at home.","This was the biggest leak of classified documents in American history.","She admitted filing false tax documents.","He plans to submit the document as legal evidence.","A draft budget document was tabled.","According to leaked cabinet documents, no compensation would be paid.","One of the documents leaked to the press was a memorandum written by the head of the security police.","Documents obtained by this newspaper purport to reveal that radioactive waste is being illegally dumped on the site.","Documents will be available at the news conference.","Existing paper documents could be scanned into a computer.","Go through the document checking for errors.","He has promised to post a formal offer document to shareholders by Monday.","He particularly criticized the terminology in the document.","He was trying to destroy documents that testified to his guilt.","He was unable to produce the document that he claimed would prove his case.","Her journal is an important document of 19th-century rural life.","I had to search through 4 000 documents to find the information I needed.","No other genuine document exists.","All parties must read and sign a written document.","Please sign the enclosed document and return it to me.","Supporting documents must be submitted to the supervisory authority.","The 1840 treaty is widely regarded as New Zealand's founding document.","The Department issued a consultation document.","The conference adopted a document on minority rights.","The document is dated 775.","The document is written in Chinese.","The document says they are against tax rebates.","The government has produced an important new policy document.","The original document has been lost or destroyed.","The relevant documents are enclosed for your information.","There is a disclaimer throughout the official documents.","There is little reason to doubt the authenticity of this document.","This statement must be understood in the context of the entire document.","a car's registration document","a consultative document issued by the Department of Trade and Industry","a document agreed with the District Council","a document calling for a ceasefire","a document concerning arbitration procedures in Cairo","a document entitled ‘Guidelines for Good Practice’","a document of 1999","a government document on education policy","a working document in the discussions for a final treaty","details of internal UN documents","documents aimed at stimulating discussion","documents covering various points of concern","documents dating back to the 1920s","documents leaked from the government to the press","one of the key documents in this case","A lawyer will have to draw up the document for you.","A top secret government document was leaked to the press.","Remember that this is a legally binding document.","Several important official documents are missing.","The committee presented a discussion document at yesterday's meeting.","The document was agreed by the committee.","The draft version of the document contained several errors.","They have produced a new policy document."],"opposite":"","synonyms":""},{"def":"a computer file that contains text that has a name that identifies it","examples":["Save the document before closing.","Click here to print your document.","a way to create and edit documents from a mobile device","an XML/a PDF document","Cut and paste is used to move text to a new place in the document.","This makes sharing documents, spreadsheets, and slideshows easy.","What happens if three people decide to edit the same document at the same time?","Encryption systems protect sensitive documents stored in the cloud.","Just upload your documents to the cloud.","Highlight a passage in the active document and click on the print icon.","I saved my work and opened a new document.","Scroll through the document using the scroll bar.","Scroll through the document using the slider bar on the right of the window.","Send and receive documents at the click of a button.","To create a new document, select New from the File menu.","to display documents on screen","a software tool for searching documents and retrieving information"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["document case","document cases"]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/doc/docum/document__us_2.mp3","phonsUS":"/ˈdɑːkjument/","level":"B2","meanings":[{"def":"to record something in the form of a written document, photograph, film, etc.","examples":["Urban life in the nineteenth century is well documented.","videos claiming to document animal abuse","The results are documented in Chapter 3.","Mobile phones have been used as a tool to document the violation of human rights.","Students are encouraged to document their experiences.","His exploits have been well documented by the national press.","The 790s are one of the best documented decades in Anglo-Saxon history.","The film extensively documented the effects of the atomic bomb on human bodies.","He documented numerous cases in which the disease was spread from animals to humans.","Examples of business failures are amply documented in this report.","The archive documents the history of women in architecture.","The early part of his life is for the most part poorly documented."],"opposite":"","synonyms":""},{"def":"to support or accompany something with documents","examples":["This is a meticulously documented biography.","a clearly documented case of fraud","This is a basic hardware / software configuration which is well documented so should be easy to use.","This is all documented in the help files.","They document their findings with photos and video.","Unfortunately, there are no empirical data to document the impacts of these measures.","They provide specimen data to document their assertions.","The book is thoroughly documented, with citations from critics, artists, and political and literary figures.","The apportioning of responsibilities and costs should be clearly documented in the initial agreement."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]