[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dom/domes/domestic__us_2.mp3","phonsUS":"/dəˈmestɪk/","level":"B2","meanings":[{"def":"of or inside a particular country; not foreign or international","examples":["domestic affairs/politics","Output consists of both exports and sales on the domestic market.","The US is unable to meet its domestic demand for steel in any given year.","English domestic law","He was a chief White House adviser on domestic policy.","The election campaign has been focused mainly on domestic issues.","domestic flights (= to and from places within a country)","Even passengers on domestic flights may be required to carry ID.","the current robustness of China's domestic economy","On the domestic front, the prime minister's main concern was the economy.","The company has made losses in both its domestic and international operations.","The midfielder has played in two domestic cup games plus a European Cup match."],"opposite":"foreign","synonyms":""},{"def":"used in the home; connected with the home or family","examples":["domestic appliances","the growing problem of domestic violence (= violence between members of the same family)","a shocking tale of domestic abuse","The vast majority of paid and unpaid domestic workers are women.","domestic chores","domestic service (= the work of a servant in a large house)"],"opposite":"","synonyms":""},{"def":"kept on farms or as pets; not wild","examples":["horses and other domestic animals","Most domestic cats hate getting wet."],"opposite":"","synonyms":""},{"def":"liking home life; enjoying or good at cooking, cleaning the house, etc.","examples":["I'm not a very domestic sort of person."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["domestic partner","domestic science","gross domestic product","domestic help","domestic worker","domestic partners","domestic sciences","gross domestic products"]},{"pos":"noun","level":"","meanings":[{"def":"a servant who works in somebody’s house, doing the cleaning and other jobs","examples":[],"opposite":"","synonyms":""},{"def":"a fight between two members of the same family","examples":["The police were called to sort out a domestic."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]