[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dou/doubt/doubt__us_1.mp3","phonsUS":"/daʊt/","level":"B1","meanings":[{"def":"a feeling of being uncertain about something or not believing something","examples":["a feeling of doubt and uncertainty","New evidence has cast doubt on the guilt of the man jailed for the crime.","He was starting to have some serious doubts.","to have lingering/grave/nagging doubts","doubt about something The article raised doubts about how effective the new drug really was.","There is some doubt about the best way to do it.","doubt (that)… There is no doubt at all that we did the right thing.","There's little doubt in my mind that he's going to go right to the top.","doubt as to something She leaves no doubt as to her own view of Picasso's work.","doubt as to who, what, etc… If you are in any doubt as to whether you should be doing these exercises, consult your doctor.","doubt over something Medical experts have expressed doubt over how the scientist died.","She knew without a shadow of a doubt that he was lying to her.","It is vital that more is done to prevent the illegal trade in wild animals.","(Compare: We have to do more to stop people trading wild animals illegally.)","It is clear that more needs to be done to protect biodiversity.","(Compare: We clearly need to do more to protect biodiversity.)","It is unfortunate that the practice of keeping monkeys as pets still continues.","(Compare: It’s absolutely terrible that people still keep monkeys as pets.)","It is difficult for many people to understand the reasons why certain individuals choose to hunt animals for sport.","(Compare: I can’t understand why anyone would want to kill animals for fun.)","Unfortunately, it would seem that not enough is being done to support tiger conservation.","(Compare: Governments aren’t doing enough to help tiger conservation.)","There is no doubt that the greatest threat to polar bears comes from global warming.","(Compare: I believe that the greatest threat…)","Whether he will continue to be successful in future is open to doubt.","Doubts have arisen over the viability of the schedule.","From the start, doubts surrounded her claim to be the missing heiress.","He made clear his own private doubts about it.","She still felt the same niggling doubt: was he really telling the truth?","I had been aware of a nagging doubt growing in my mind.","Some committee members still had doubts about the plans.","The announcement dispelled any doubts as to the prince's intentions.","There is little doubt the documents are fake.","There is no doubt in my mind that this man is Tom.","Some managers have expressed doubts about the wisdom of such a move.","We live in an age of doubt and uncertainty."],"opposite":"","synonyms":""},{"def":"to be uncertain","examples":["The success of the system is not in doubt.","The arrangements for the event still seemed to be in doubt."],"opposite":"","synonyms":""},{"def":"in a way that shows that something is completely certain","examples":["The research showed beyond doubt that smoking contributes to heart disease.","(law) The prosecution was able to establish beyond reasonable doubt that the woman had been lying.","The evidence proves beyond doubt that he is innocent."],"opposite":"","synonyms":""},{"def":"to accept that somebody has told the truth or behaved well because you cannot prove that they have not","examples":["She may have been lying, but I felt I had to give her the benefit of the doubt."],"opposite":"","synonyms":""},{"def":"to have reasons why you are not certain about whether something is good or whether something good will happen","examples":["I've had my doubts about his work since he joined the firm.","It may be all right. Personally, I have my doubts.","They say they'll be here on time, but I have my doubts about that."],"opposite":"","synonyms":""},{"def":"used to give advice to somebody who cannot decide what to do","examples":["If in doubt, wear black.","If in doubt, consult your doctor."],"opposite":"","synonyms":""},{"def":"used when you are saying that something is likely","examples":["No doubt she'll call us when she gets there."],"opposite":"","synonyms":""},{"def":"used when you are saying that something is certainly true","examples":["He's made some great movies. There's no doubt about it."],"opposite":"","synonyms":""},{"def":"to make something uncertain","examples":["The proposed development has been thrown into doubt by the decision."],"opposite":"","synonyms":""},{"def":"used when you are giving your opinion and emphasizing the point that you are making","examples":["This meeting has been, without doubt, one of the most useful we have had so far.","Without the slightest doubt this is a remarkable exhibition.","She is without a doubt the best player I know."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be in doubt","def":"to be uncertain","examples":["The success of the system is not in doubt.","The arrangements for the event still seemed to be in doubt."]},{"idiom":"beyond (any) doubt","def":"in a way that shows that something is completely certain","examples":["The research showed beyond doubt that smoking contributes to heart disease.","(law) The prosecution was able to establish beyond reasonable doubt that the woman had been lying.","The evidence proves beyond doubt that he is innocent."]},{"idiom":"give somebody the benefit of the doubt","def":"to accept that somebody has told the truth or behaved well because you cannot prove that they have not","examples":["She may have been lying, but I felt I had to give her the benefit of the doubt."]},{"idiom":"have your doubts (about something)","def":"to have reasons why you are not certain about whether something is good or whether something good will happen","examples":["I've had my doubts about his work since he joined the firm.","It may be all right. Personally, I have my doubts.","They say they'll be here on time, but I have my doubts about that."]},{"idiom":"if in doubt","def":"used to give advice to somebody who cannot decide what to do","examples":["If in doubt, wear black.","If in doubt, consult your doctor."]},{"idiom":"no doubt","def":"used when you are saying that something is likely","examples":["No doubt she'll call us when she gets there.","He's made some great movies. There's no doubt about it."]},{"idiom":"put/throw something into doubt","def":"to make something uncertain","examples":["The proposed development has been thrown into doubt by the decision."]},{"idiom":"without/beyond (a) doubt","def":"used when you are giving your opinion and emphasizing the point that you are making","examples":["This meeting has been, without doubt, one of the most useful we have had so far.","Without the slightest doubt this is a remarkable exhibition.","She is without a doubt the best player I know."]}],"phrasal":[],"related":["self-doubt","without/beyond (a) doubt","give somebody the benefit of the doubt"]},{"pos":"verb","level":"B1","meanings":[{"def":"to feel uncertain about something; to feel that something is not true, will probably not happen, etc.","examples":["doubt something There seems no reason to doubt her story.","to doubt the sincerity/wisdom/existence of something","‘Do you think England will win?’—‘I doubt it.’","doubt (that)… I never doubted (that) she would come.","She seriously doubted he would still be waiting for her.","doubt whether, if, etc… I doubt whether the new one will be any better.","I didn't doubt for a second that she was telling the truth.","Lee privately doubted the truth of this statement."],"opposite":"","synonyms":""},{"def":"to not trust somebody/something; to not believe somebody","examples":["I had no reason to doubt him."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]