[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dra/draft/draft__us_1.mp3","phonsUS":"/dræft/","level":"B2","meanings":[{"def":"a rough written version of something that is not yet in its final form","examples":["This is only the first draft of my speech.","I've made a rough draft of the letter.","The final published version differs from earlier drafts in many key details.","the final draft (= the final version)","a draft report/plan/bill/resolution","a draft document/proposal","the draft constitution/legislation/agreement","The legislation is still in draft form.","I sent an early draft to an agent.","She produced an initial draft of her plans.","The preliminary draft of the agreement has been approved.","The students were invited to submit drafts for feedback.","Is this the final draft?","The original drafts for the new building are with the architects.","There is a rough draft of how the park should be laid out."],"opposite":"","synonyms":""},{"def":"a written order to a bank to pay money to somebody","examples":["Payment must be made by bank draft drawn on a UK bank."],"opposite":"","synonyms":""},{"def":"the practice of ordering people by law to join the armed forces","examples":[],"opposite":"","synonyms":""},{"def":"a system in which professional teams in some sports choose players each year from among college students","examples":["He was the fourth player chosen in the 2017 draft, but the first of his class to reach the major leagues."],"opposite":"","synonyms":""},{"def":"a flow of cool air in a room or other small space","examples":["Can you shut the door? There's a draft in here."],"opposite":"","synonyms":""},{"def":"one continuous action of swallowing liquid (= making it go down your throat); the amount swallowed","examples":["He took a deep draft of his beer."],"opposite":"","synonyms":""},{"def":"medicine in a liquid form","examples":["a sleeping draft (= one that makes you sleep)"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["bank draft","draft board","draft card","draft pick","demand draft","draft dodger","the draft","draft cards","draft picks","draft beer","draft boards","draft dodgers","banker’s draft","draft excluder","draft excluders"]},{"pos":"verb","level":"B2","meanings":[{"def":"to write the first rough version of something such as a letter, speech, book or law","examples":["I'll draft a letter for you.","The military began drafting a new constitution.","Members of Parliament are busy drafting new legislation.","to draft a bill/law/plan","Some of the clauses in the contract had been very poorly drafted.","The bill as originally drafted would have made the tobacco companies a lot more vulnerable to lawsuits.","hastily drafted pieces of legislation","They have already drafted a contract and started preparing to work together."],"opposite":"","synonyms":""},{"def":"to choose people and send them somewhere for a special task","examples":["Extra police are being drafted in to control the crowds."],"opposite":"","synonyms":""},{"def":"to order somebody by law to join the armed forces","examples":["be drafted (into something) They were drafted into the army."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adjective","level":"","meanings":[{"def":"served from a large container (= a barrel) rather than in a bottle","examples":["draft beer"],"opposite":"","synonyms":""},{"def":"used for pulling heavy loads","examples":["a draft horse"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]