[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dra/drain/drain__us_1.mp3","phonsUS":"/dreɪn/","level":"C1","meanings":[{"def":"to make something empty or dry by removing the liquid from it; to become empty or dry in this way","examples":["Drain and rinse the pasta.","The marshes have been drained.","You will need to drain the central heating system before you replace the radiator.","The swimming pool drains very slowly.","Leave the dishes to drain.","You will need to turn off the water and drain the tank.","well-drained soil","Remove the artichokes, drain thoroughly and allow to cool."],"opposite":"","synonyms":""},{"def":"to make liquid flow away from something; to flow away","examples":["drain something (from/out of something) We had to drain the oil out of the engine.","drain something away/off Drain off the excess fat from the meat.","drain away/off She pulled out the plug and the water drained away.","(figurative) My anger slowly drained away.","drain into something The river drains into a lake.","drain from/out of something All the colour drained from his face when I told him the news.","drain of something His face drained of colour.","Then the water drains out, leaving a film of wet mud.","The surgeon drains out any excess fluid.","The blood drains out of the body.","(figurative) I felt the courage draining out of me.","(figurative) The country's coal reserves are being drained away."],"opposite":"","synonyms":""},{"def":"to empty a cup or glass by drinking everything in it","examples":["In one gulp, he drained the glass.","She quickly drained the last of her drink."],"opposite":"","synonyms":""},{"def":"to make somebody/something weaker, poorer, etc. by using up their/its strength, money, etc.","examples":["drain somebody/something My mother's hospital expenses were slowly draining my income.","an exhausting and draining experience","drain somebody/something of something I felt drained of energy.","The experience left her emotionally drained.","His voice was utterly drained of emotion."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["brain drain","(go) down the drain","laugh like a drain"]},{"pos":"noun","level":"","meanings":[{"def":"a pipe that carries away dirty water or other liquid waste","examples":["We had to call in a plumber to unblock the drain.","The drains (= the system of pipes) date from the beginning of the century.","They were busy laying the drains for the new houses.","a bottle of drain cleaner","The drains date from the beginning of the last century."],"opposite":"","synonyms":""},{"def":"a frame of metal bars over the opening to a drain in the ground","examples":[],"opposite":"","synonyms":""},{"def":"a hole in a bath, sink, etc. where the water flows away and into which a plug fits","examples":[],"opposite":"","synonyms":""},{"def":"a thing that uses a lot of the time, money, etc. that could be used for something else","examples":["Military spending is a huge drain on the country's resources."],"opposite":"","synonyms":""},{"def":"the fact of resources, people, etc. being lost or wasted","examples":["the drain of talented staff to the United States"],"opposite":"","synonyms":""},{"def":"(to be) wasted; (to get) very much worse","examples":["It's just money down the drain, you know.","Safety standards have gone down the drain."],"opposite":"","synonyms":""},{"def":"to laugh very loudly","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"(go) down the drain","def":"(to be) wasted; (to get) very much worse","examples":["It's just money down the drain, you know.","Safety standards have gone down the drain."]},{"idiom":"laugh like a drain","def":"to laugh very loudly","examples":[]}],"phrasal":[],"related":[]}]