[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dra/drama/dramatic__us_2.mp3","phonsUS":"/drəˈmætɪk/","level":"B2","meanings":[{"def":"sudden, very great and often surprising","examples":["a dramatic increase/change/improvement/shift","There has been a dramatic rise in reported crime.","a dramatic decline/drop/fall/reducution in value","The announcement had a dramatic effect on house prices.","Climate change will have a dramatic impact on the health of the planet.","I need to see a dramatic improvement in your work.","There was a dramatic fall in population."],"opposite":"","synonyms":""},{"def":"exciting and impressive","examples":["a dramatic victory","They watched dramatic pictures of the police raid on TV.","This scene lacked the dramatic impact that it should have had.","set against the dramatic backcloth of Mont Blanc","This is one of the most exciting developments in biology in recent years.","They watched dramatic pictures of the police raid on TV.","the heady days of youth","Don’t miss next week’s thrilling episode!","My first parachute jump was an exhilarating experience.","There is superb dramatic tension in the silences.","the dramatic rescue of nine trapped coal miners","There were dramatic scenes in the capital's central square."],"opposite":"","synonyms":"exciting"},{"def":"connected with the theatre or plays","examples":["a local dramatic society","Students will study various plays and dramatic texts.","a dramatic monologue","She went on to study dramatic arts at Columbia University."],"opposite":"","synonyms":""},{"def":"exaggerated in order to create a special effect and attract people’s attention","examples":["He flung out his arms in a dramatic gesture.","Don't be so dramatic!","dramatic about something Must you be so dramatic about everything?","I don't want to sound overly dramatic, but it changed my life.","I heard her yawn into the phone, in a dramatic fashion like everything she did."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["dramatic irony","dramatic monologue","American Academy of Dramatic Arts","Royal Academy of Dramatic Art","dramatic monologues","London Academy of Music and Dramatic Art","to good, great, dramatic, etc. effect"]}]