[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dra/drama/drama__us_1.mp3","phonsUS":"/ˈdrɑːmə/","level":"A2","meanings":[{"def":"a play for the theatre, television or radio","examples":["a costume/period/courtroom/crime drama","a powerful television drama about city life","a drama series set in an American dance academy","It is a lavish costume drama set in the early twentieth century.","The story easily fits into the standard mould of a courtroom drama.","a gritty police drama","Millions follow this hospital drama twice a week.","The movie is a heart-warming family drama.","She stars in a new one-hour drama about a woman judge.","a hard-hitting drama about a teenage pregnancy"],"opposite":"","synonyms":""},{"def":"plays considered as a form of literature","examples":["classical/modern drama","a drama critic","a drama school/group","a drama student/teacher","I studied English and Drama at college.","It is a first-class piece of costume drama.","Television drama is a powerful cultural medium.","It is very difficult to write good drama.","He's a drama major at Howard University."],"opposite":"","synonyms":""},{"def":"an exciting event","examples":["A powerful human drama was unfolding before our eyes.","a collection of people watching the drama unfold outside the nightclub","The actor was involved in a real-life drama when he was held up at gunpoint last night."],"opposite":"","synonyms":""},{"def":"the fact of being exciting","examples":["You couldn't help being thrilled by the drama of the situation.","The argument added a touch of drama to an otherwise dull day.","The afternoon was full of drama and excitement.","Art should deal with the human drama and tragedy of everyday life.","The media loved all the drama surrounding their divorce.","The arrival of the police heightened the drama further."],"opposite":"","synonyms":""},{"def":"to make a small problem or event seem more important or serious than it really is","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"make a drama out of something","def":"to make a small problem or event seem more important or serious than it really is","examples":[]}],"phrasal":[],"related":["drama queen","costume drama","Central School of Speech and Drama","New York Drama Critics Circle Award","drama queens"]}]