[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dra/drawi/drawing__us_1.mp3","phonsUS":"/ˈdrɔːɪŋ/","level":"A2","meanings":[{"def":"a picture made using a pencil or pen rather than paint","examples":["a pencil/pen-and-ink/charcoal drawing","drawing of somebody/something a drawing of a yacht","detailed drawings of local plants and animals","The original architectural drawings of the building had been lost.","He did a drawing of the old farmhouse.","The children were asked to make a drawing of a dinosaur.","drawing by somebody a drawing by Paul Klee","The children were drawing pictures of their pets.","a collection of paintings by American artists","a pencil/​charcoal drawing","Vermeer’s ‘Portrait of the artist in his studio’","a self-portrait (= a painting that you do of yourself)","a Renoir print","I usually do a few very rough sketches before I start on a painting.","a collection of children’s drawings","The bridge looked quite different from the architect's original drawings.","The door opened onto a courtyard, as shown in the drawing.","The drawing shows the Market Square.","a scale drawing of a jet","a working drawing of the proposed power station"],"opposite":"","synonyms":"picture"},{"def":"the art or skill of making pictures, plans, etc. using a pen or pencil","examples":["I'm not very good at drawing.","She teaches drawing at the women's prison in Philadelphia."],"opposite":"","synonyms":""},{"def":"the act of choosing something, for example the winner of a prize or the teams who play each other in a competition, usually by taking pieces of paper, etc. out of a container without being able to see what is written on them","examples":[],"opposite":"","synonyms":""},{"def":"a competition in which the winners are chosen in a drawing","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["drawing pin","drawing board","drawing card","drawing power","drawing room","life drawing","line drawing","technical drawing","drawing cards","drawing pins","drawing rooms","drawing boards","on the drawing board","(go) back to the drawing board"]}]