[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dre/dream/dream__us_1.mp3","phonsUS":"/driːm/","level":"A2","meanings":[{"def":"a series of images, events and feelings that happen in your mind while you are asleep","examples":["I had a really weird dream last night.","I thought someone came into the bedroom, but it was just a dream.","‘Goodnight. Sweet dreams.’","Don't think about it. You'll only give yourself bad dreams.","dream about somebody/something a vivid dream about my old school.","dream about doing something a recurrent dream about being late for an exam","dream that… I had a dream that we were getting married at the airport.","in a/somebody's dream His dead mother appeared to him in a dream.","Images of the crash still haunted his dreams years later.","I was awoken from my dream by a knock at the door.","She opened her eyes and the dream faded.","She is plagued by strange dreams.","I hope my dream about prison won't come true!","In her dream, she was on board a ship heading for America.","I hardly ever remember my dreams.","She fell asleep and dreamed strange dreams.","His waking dream was rudely interrupted by the telephone.","I had a very disturbing dream last night.","He had a prophetic dream about a train crash the night before the disaster."],"opposite":"","synonyms":""},{"def":"a wish to have or be something, especially one that seems difficult to achieve","examples":["Her lifelong dream was to be a famous writer.","He wanted to be rich but it was an impossible dream.","a chance to fulfil a childhood dream","to realize/achieve a dream","If I win, it will be a dream come true.","It was the end of all my hopes and dreams.","dream for somebody/something The chance to study in Australia had always been a dream for her.","The conversation turns to his dreams for the future.","dream of doing something He left his job to pursue his dream of opening a restaurant.","dream of something The film is an exploration of a young boy's dream of a better life.","dream that… He had a dream that one day his people would be free.","of somebody's dreams I've finally found the man of my dreams.","Being a TV presenter would be my dream job.","She tried to turn her dream of running her own business into reality.","She confided in him all her hopes and dreams.","their dream of a fairer world","The victory keeps San Marino's dream of a World Cup place alive.","The injury shattered her dream of running in the Olympics.","She had this romantic dream of living in a windmill.","He never abandoned his dream of finding his real mother.","the great utopian dream that they have cherished for so long","They achieved a success beyond their wildest dreams.","Their dream turned into a nightmare as the cruise ship began to sink.","His plans to travel the world now seemed like a distant dream.","Her biggest dream was to become a singer.","After Betty retired, she and her husband designed and built their dream house.","the house of her dreams","What would be your dream job?"],"opposite":"","synonyms":""},{"def":"a state of mind or a situation in which things do not seem real or part of normal life","examples":["in a dream She walked around in a dream all day.","She found herself standing in front of the crowded hall and making her speech, as if in a dream.","As if slowly emerging from a dream, she raised her head."],"opposite":"","synonyms":""},{"def":"a beautiful or wonderful person or thing","examples":["That meal was an absolute dream."],"opposite":"","synonyms":""},{"def":"far more, better, etc. than you could ever have imagined or hoped for","examples":[],"opposite":"","synonyms":""},{"def":"to work very well","examples":["My new car goes like a dream."],"opposite":"","synonyms":""},{"def":"to happen without problems, in the way that you had planned","examples":["The wedding celebrations went like a dream."],"opposite":"","synonyms":""},{"def":"used to tell somebody that something they are hoping for is not likely to happen","examples":["‘I'll be a manager before I'm 30.’ ‘In your dreams.’"],"opposite":"","synonyms":""},{"def":"so unpleasant that you cannot believe it is true","examples":["In broad daylight the events of the night before seemed like a bad dream."],"opposite":"","synonyms":""},{"def":"to have a way of life that seems perfect","examples":["With her own TV show and a flat in Paris, she is living the dream."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"beyond somebody’s wildest dreams","def":"far more, better, etc. than you could ever have imagined or hoped for","examples":[]},{"idiom":"go/work like a dream","def":"to work very well","examples":["My new car goes like a dream.","The wedding celebrations went like a dream."]},{"idiom":"in your dreams","def":"used to tell somebody that something they are hoping for is not likely to happen","examples":["‘I'll be a manager before I'm 30.’ ‘In your dreams.’"]},{"idiom":"like a bad dream","def":"so unpleasant that you cannot believe it is true","examples":["In broad daylight the events of the night before seemed like a bad dream."]},{"idiom":"live the dream","def":"to have a way of life that seems perfect","examples":["With her own TV show and a flat in Paris, she is living the dream."]}],"phrasal":[],"related":["dream on","dream up","wet dream","dream away","dream team","pipe dream","dream ticket","American dream","Dream of Gerontius","Midsummer Night's Dream","dream teams","dream tickets","dream something away","dream something"]},{"pos":"verb","level":"A2","meanings":[{"def":"to experience a series of images, events and feelings in your mind while you are asleep","examples":["Did I talk in my sleep? I must have been dreaming.","dream about somebody/something I dreamed about you last night.","dream of somebody/something I keep dreaming of my old school.","dream something Did it really happen or did I just dream it?","dream (that)… I dreamt (that) I got the job."],"opposite":"","synonyms":""},{"def":"to imagine and think about something that you would like to happen","examples":["It might never happen, but I can dream can't I?","dream of/about something It was the kind of trip most of us only dream about.","dream of/about doing something She dreams of running her own business.","I wouldn't dream of going without you (= I would never go without you).","dream (that)… I never dreamt (that) I’d actually get the job.","dream something Who'd have dreamt it? They're getting married.","As a child she always dreamed of working with animals.","People have long dreamed of an egalitarian society.","I always dreamed that one day I'd be famous.","The people still dreamed about peace returning to their country."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["dream away","dream on","dream up"],"related":[]}]