[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dru/drug_/drug__us_1.mp3","phonsUS":"/drʌɡ/","level":"A2","meanings":[{"def":"an illegal substance that some people smoke, inject, etc. for the physical and mental effects it has","examples":["He does not smoke or take drugs.","to use/abuse drugs","(informal) I don't do drugs (= use them).","to smuggle/supply/sell drugs","He was charged with possessing drugs.","illegal/illicit drugs","on drugs She looked like she was on drugs (= had taken drugs).","I found out he was on drugs (= took them regularly).","a drug dealer/trafficker/smuggler","drug use/abuse","She was a drug addict.","The actor struggled with drug addiction.","I never smoke, drink or use drugs.","The movie depicts sex, drinking and drug use.","There was a huge growth in the export of illicit drugs.","He is accused of supplying the drug that killed the teenager.","It was obvious from his arm he had been injecting drugs.","It was many years since he had used cocaine or any other hard drug.","He was the only member of the band who never got into hard drugs.","She became a heavy drug user.","He was a petty thief and drug dealer.","Drug traffickers are getting across the border.","He was murdered by a drugs cartel.","a criminal with connections to the drug trade","This property was all bought with drug money.","She was charged with drug offences.","She died of a drug overdose.","Alcohol and drug treatment programs have been cut.","All athletes have to undergo regular drug testing.","Some workplaces have introduced mandatory drug screening.","The new federal drug czar claimed the nation was winning the war on drugs.","a review of the drug sentencing laws to make penalties harsher","the dangers of drink and drugs","They committed the crime while high on drugs.","the latest moves in the drug war","They had a liberal attitude to recreational drugs.","Drugs have been seized with a street value of two million dollars.","an athlete who tested positive for performance-enhancing drugs","She was found to be under the influence of drugs."],"opposite":"","synonyms":""},{"def":"a substance used as a medicine or used in a medicine","examples":["to prescribe/administer a drug","a prescription drug (= one that must be prescribed by a doctor)","anti-inflammatory/antiviral/painkilling drugs","a new cancer drug","a major drug company","He's taking drugs for depression.","The doctors diagnosed epilepsy and prescribed drugs.","His parents had to learn to administer his drugs.","Patients need to inject the drug every two weeks.","The drug has been approved to treat prostate cancer.","Prescription drug prices rose.","You used to be able to buy this medicine over the counter, but it is now a prescription drug.","The doctor put me on a course of painkilling drugs.","Some infections are now resistant to drugs.","The nurses came around to give the patients their drugs.","They're hailing it as the new wonder drug.","We want to make it possible for African companies to produce cheaper generic drugs.","new drugs that have been developed recently","drugs that help the growth of skin tissue","a powerful drug against tuberculosis","Some veterinary drugs are not approved for use in food-producing animals.","The drug has some bad side effects."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["drug lord","hard drug","soft drug","drug baron","drug dealer","truth drug","designer drug","drug peddler","class A drug","recreational drug","Drug Enforcement Administration","Pure Food and Drug Act","drug barons","drug lords","drug dealers","drug peddlers"]},{"pos":"verb","level":"","meanings":[{"def":"to give a person or an animal a drug, especially to make them unconscious, or to affect their performance in a race or competition","examples":["He was drugged and bundled into the back of the car.","It's illegal to drug horses before a race.","The Civil Liberties group campaigns against forced drugging of prisoners.","He was asleep, heavily drugged with tranquillizers."],"opposite":"","synonyms":""},{"def":"to add a drug to somebody’s food or drink to make them unconscious or sleepy","examples":["Her drink must have been drugged."],"opposite":"","synonyms":""},{"def":"to have taken or been given a lot of drugs","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be drugged up to the eyeballs","def":"to have taken or been given a lot of drugs","examples":[]}],"phrasal":[],"related":[]}]