[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/due/due__/due__us_1.mp3","phonsUS":"/duː/","level":"B1","meanings":[{"def":"caused by somebody/something; because of somebody/something","examples":["The team's success was largely due to her efforts.","He argues that climate change is mainly due to the actions of industrialized countries.","The increase in reported cases is partly due to growing public awareness of the disease.","This increase is due in part to the strong economy.","Most of the problems were due to human error.","The delay to the flight was due to the fact that there was ice on the runway.","The project had to be abandoned due to a lack of government funding.","Due to staff shortages, we are unable to offer a full buffet service on this train.","The dew sparkled in the morning sunlight.","The fourth soloist was absent due to an illness.","Despite his talent, radio and TV have never given him his due.","They sailed due north.","The number of people with diabetes is growing, partly because of an increase in levels of obesity.","The number of overweight children has increased dramatically in recent years, largely as a result of changes in diet and lifestyle.","The increase in childhood obesity is largely due to/the result of changes in lifestyle and diet over the last twenty years.","Many obese children are bullied at school on account of their weight.","Part of the problem with treating childhood obesity stems from the fact that parents do not always recognize that their children are obese.","Childhood obesity may be caused by genetic factors, as well as environmental ones."],"opposite":"","synonyms":""},{"def":"arranged or expected","examples":["When's the baby due?","The next train is due in five minutes.","My essay's due next Friday (= it has to be given to the teacher by then).","due to do something Rose is due to start school in January.","due for something The band's first album is due for release later this month."],"opposite":"","synonyms":""},{"def":"when a sum of money is due, it must be paid immediately","examples":["Payment is due on 1 October.","Membership fees are now due for the coming year."],"opposite":"","synonyms":""},{"def":"owed to somebody as a debt, because it is their right or because they have done something to deserve it","examples":["Have they been paid the money that is due to them?","Our thanks are due to the whole team."],"opposite":"","synonyms":""},{"def":"owed something; deserving something","examples":["due something I'm still due 15 days' leave.","due for something She's due for promotion soon."],"opposite":"","synonyms":""},{"def":"that is suitable or right in the circumstances","examples":["After due consideration, we have decided to appoint Mr Davis to the job.","Due allowance should be made for inexperience.","(British English) He was charged with driving without due care and attention."],"opposite":"","synonyms":""},{"def":"to give somebody the praise they deserve, even if you do not really want to","examples":["Give credit where credit is due—what the man does, he does well."],"opposite":"","synonyms":""},{"def":"at the right time and not before","examples":["Your request will be dealt with in due course."],"opposite":"","synonyms":""},{"def":"used when you are going to disagree, usually quite strongly, with somebody","examples":["With all due respect, the figures simply do not support you on this.","With all due respect, I think you've misunderstood what he said."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"give credit where credit is due","def":"to give somebody the praise they deserve, even if you do not really want to","examples":["Give credit where credit is due—what the man does, he does well."]},{"idiom":"in due course","def":"at the right time and not before","examples":["Your request will be dealt with in due course."]},{"idiom":"with respect | with all due respect","def":"used when you are going to disagree, usually quite strongly, with somebody","examples":["With all due respect, the figures simply do not support you on this.","With all due respect, I think you've misunderstood what he said."]}],"phrasal":[],"related":["due date","due diligence","due process of law","due dates","due process","in due course","give credit where credit is due"]},{"pos":"noun","level":"","meanings":[{"def":"a thing that should be given to somebody by right","examples":["He received a large reward, which was no more than his due (= than what he deserved).","She's a slow worker, but to give her her due (= to be fair to her), she does try very hard.","The dew sparkled in the morning sunlight.","The fourth soloist was absent due to an illness.","Despite his talent, radio and TV have never given him his due.","They sailed due north."],"opposite":"","synonyms":""},{"def":"charges, for example to be a member of a club","examples":["to pay your dues","trade union dues"],"opposite":"","synonyms":""},{"def":"to work hard and gain experience, so that you deserve success or respect","examples":["As a young actor, he paid his dues in small roles.","She is incredibly qualified and has paid her dues to become president."],"opposite":"","synonyms":""},{"def":"to do what is required or expected of you","examples":["Vick paid his dues (= completed his punishment), and since being released from prison has been a model citizen."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"pay your dues","def":"to work hard and gain experience, so that you deserve success or respect","examples":["As a young actor, he paid his dues in small roles.","She is incredibly qualified and has paid her dues to become president.","Vick paid his dues (= completed his punishment), and since being released from prison has been a model citizen."]}],"phrasal":[],"related":[]},{"pos":"adverb","level":"","meanings":[{"def":"exactly; in a straight line","examples":["to sail due east","The village lies five miles due north of York.","The dew sparkled in the morning sunlight.","The fourth soloist was absent due to an illness.","Despite his talent, radio and TV have never given him his due.","They sailed due north."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]