[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/d/dut/duty_/duty__us_1.mp3","phonsUS":"/ˈduːti/","level":"B1","meanings":[{"def":"something that you feel you have to do because it is your moral or legal responsibility","examples":["duty to do something It is my duty to report it to the police.","Local councillors have a duty to serve the community.","under a duty to do something You are under a legal duty to keep accurate records.","to do your duty for your country","duty to somebody/something He has failed in his duty to his client.","duty as somebody your duties as a parent","duty of something The company owes a duty of care to its employees.","duty of doing something Local councils were charged with the duty of allocating land for building.","a statutory/fiduciary duty","a civic/patriotic/moral duty","I don't want you to visit me simply out of a sense of duty.","I’ll have to go, I’m afraid—duty calls (= there is a duty I need to go and do).","a breach/dereliction of duty","I'd be shirking my duty if I didn't warn him.","It's the duty of each and every one of us to do their best for the team.","It was ruled that the injured man was in breach of his duty by not wearing the safety equipment provided.","I feel it's my bounden duty to try and help her.","It was a duty imposed by her father.","It was a clear breach of professional duty.","The time he put in helping new recruits went beyond the call of duty.","I feel it is my civic duty to vote.","She felt she had fulfilled her duty by providing him with a son.","She had violated her legal duty of confidentiality.","He had failed in his duty to his daughter.","He took on the duty of maintaining the family home.","They have a duty to their parents to work hard.","She put down the phone and went out, her duty done.","He felt it was his moral duty to help his neighbour.","You feel that you have to do your duty by your children.","the company's fiduciary duty to its shareholders","the general duty of the police to preserve the peace"],"opposite":"","synonyms":""},{"def":"the work that is your job","examples":["Report for duty at 8 a.m.","He was the duty manager that day.","Colleagues became suspicious when he failed to report for duty.","He was was on kitchen duty.","Police usually do beat duty in pairs.","He's been suspended from active duty.","Sergeant Wilson had pulled parking-lot duty.","The company is liable if you are injured during the execution of your duty.","The regular presenter does double duty as a staff writer.","The soldier was sent to his new duty station.","He has volunteered for temporary duty assignments in counterterrorist activities.","Her son was released from duty in the army to visit her in hospital.","the supermarket's senior duty manager","veterans who saw combat duty in Vietnam"],"opposite":"","synonyms":""},{"def":"tasks that are part of your job","examples":["I spend a lot of time on administrative duties.","The princess has taken on her mother's official duties.","to perform/fulfil/discharge your duties","Your duties will include greeting visitors and answering the phone.","He leaves hospital tomorrow and is expected to resume his duties at the beginning of next month.","He will be allowed to return to his duties after the enquiry.","The cleaning duties now fell to Rachel.","He was accused of neglecting his professional duties.","My household duties were not particularly onerous.","I share the cooking duties with Bell.","He was unable to perform his assigned duties because of ill health.","The troops are here to perform peacekeeping duties.","When I returned to work after my illness I was put on light duties.","The company prefers to handle translation duties in-house.","The members of staff each have their own duties.","When he failed to turn up for training, he was relieved of his duties as captain.","Mr Davies had been relieved of his duties.","The suspect was charged with obstructing an officer in the course of his duties."],"opposite":"","synonyms":""},{"def":"a tax that you pay on things that you buy, especially those that you bring into a country","examples":["customs/excise/import duties","duty on something duty on wine and beer","The US imposed a duty on imports.","They are going to put duty on foreign cars.","Beer for personal use is exempt from duty.","By changing its supplier, the company saved thousands of pounds in import duty.","Cider carries duty at the lower rate.","There will also be stamp duty payable at the applicable rate.","They claim that the wine is for personal use and so evade the duty.","Tobacco duty is a major source of revenue for the government.","We tried to estimate the amount of duty we would have to pay.","You have to pay duty on all electrical goods.","excise duty on spirits","the heavy duty on cigarettes","The company has to pay customs duties on all imports."],"opposite":"","synonyms":""},{"def":"to a higher standard or level than is required for a job or task","examples":["She went above and beyond the call of duty in her efforts to save his life."],"opposite":"","synonyms":""},{"def":"something that you feel you must do; a responsibility which cannot be ignored","examples":["He felt it was his bounden duty to tell the police what he knew.","We have a bounden duty to respond to this call for help."],"opposite":"","synonyms":""},{"def":"to perform two roles or functions at the same time","examples":["This device can pull double duty as a decent laptop and an adequate tablet.","She deserves credit for serving double duty as a host and performer."],"opposite":"","synonyms":""},{"def":"while doing a job","examples":["A policeman was injured in the line of duty yesterday."],"opposite":"","synonyms":""},{"def":"working/not working at a particular time","examples":["Who's on duty today?","What time do you go off duty?","You're not allowed to drink alcohol on duty."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"(above and) beyond the call of duty","def":"to a higher standard or level than is required for a job or task","examples":["She went above and beyond the call of duty in her efforts to save his life.","income tax","tax cuts","The company has to pay customs duties on all imports.","A general tariff was imposed on foreign imports.","Business rates are very high in the city centre."]},{"idiom":"a/your bounden duty","def":"something that you feel you must do; a responsibility which cannot be ignored","examples":["He felt it was his bounden duty to tell the police what he knew.","We have a bounden duty to respond to this call for help."]},{"idiom":"do/pull/serve double duty (as something)","def":"to perform two roles or functions at the same time","examples":["This device can pull double duty as a decent laptop and an adequate tablet.","She deserves credit for serving double duty as a host and performer."]},{"idiom":"in the line of duty","def":"while doing a job","examples":["A policeman was injured in the line of duty yesterday."]},{"idiom":"on/off duty","def":"working/not working at a particular time","examples":["Who's on duty today?","What time do you go off duty?","You're not allowed to drink alcohol on duty."]}],"phrasal":[],"related":["off-duty","duty-free","jury duty","active duty","death duty","duty-bound","heavy-duty","night duty","point duty","stamp duty","duty officer","duty-free shop","duty of care","tour of duty","duty-frees","duty officers"]}]