[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/ech/echo_/echo__us_1.mp3","phonsUS":"/ˈekəʊ/","level":"C1","meanings":[{"def":"if a sound echoes, it is reflected off a wall, the side of a mountain, etc. so that you can hear it again","examples":["Her footsteps echoed in the empty room.","The gunshot echoed through the forest.","His voice echoed around the room.","The call echoed off the walls of the cave.","Their voices echoed back across the water.","The protest seemed to echo across the room.","Her screams still echoed in his ears."],"opposite":"","synonyms":""},{"def":"to send back and repeat a sound; to be full of a sound","examples":["The whole house echoed.","echo to/with something The street echoed with the cries of children.","echo something (back) The valley echoed back his voice.","The great hall echoed with laughter."],"opposite":"","synonyms":""},{"def":"to repeat an idea or opinion because you agree with it","examples":["‘More police, that’s what we need,’ he said, echoing his father’s views on the subject.","This is a view echoed by many on the right of the party.","They had ideas which seem to echo our own.","an opinion that is widely echoed in the tabloid press","In his statement, the minister merely echoed the views of the chief police officer.","Many others echoed her opinion that a change in the law was necessary."],"opposite":"","synonyms":""},{"def":"to repeat what somebody else has just said, especially because you find it surprising","examples":["‘He's gone!’ Viv echoed."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["re-echo","echo chamber","echo sounder","echo chambers","echo sounders"]},{"pos":"noun","level":"C1","meanings":[{"def":"the reflecting of sound off a wall or inside a particular space so that a noise appears to be repeated; a sound that is reflected back in this way","examples":["There was an echo on the phone and I couldn't hear clearly.","The hills sent back a faint echo.","the echo of footsteps running down the corridor","‘So you love him, do you?’ Magda’s voice was a mocking echo of my own.","An echo came back from the walls of the building.","The bat compares the sound of its cry with the sound of the returning echo.","The echo slowly died away.","The echoes reverberated through the auditorium.","Their footsteps on the bare boards sent out hollow echoes."],"opposite":"","synonyms":""},{"def":"the fact of an idea, event, etc. being like another and reminding you of it; something that reminds you of something else","examples":["Yesterday's crash has grim echoes of previous disasters.","The story has echoes of Alice in Wonderland.","There are clear echoes of Elvis Presley in his vocal style.","ghostly echoes of Virginia's past"],"opposite":"","synonyms":""},{"def":"an opinion or attitude that agrees with or repeats one already expressed or thought","examples":["His words were an echo of what she had heard many times before.","The speech found an echo in the hearts of many of the audience (= they agreed with it)."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]