[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/eco/econo/economy__us_1.mp3","phonsUS":"/ɪˈkɑːnəmi/","level":"B1","meanings":[{"def":"the relationship between production, trade and the supply of money in a particular country or region","examples":["The economy is in recession.","the world/global economy","Tourism clearly dominates the local economy.","He favours tax cuts to stimulate the economy.","to boost/revive/grow the economy","Over the past few years, the country's economy has grown at a record pace.","A downturn in the economy is affecting many small businesses.","Agriculture was the backbone of the economy.","Cuba should have been able to diversify its economy.","Each party has its own strategy for building a strong economy.","It's the industry which keeps our national economy moving.","Japan successfully modernized its economy.","Income from this exported crop drove the economy of Mali.","Government measures to slow the economy failed to curb fuel demand growth.","A small manufacturing sector inhibits growth in the economy.","In order for our bubble economy to continue expanding, Americans must continue spending.","Should we be worried that a dollar crisis threatens the economy?","The South African economy emerged from decades of international isolation.","The government devalued the currency to try to revive the flagging economy.","The region has an economy based on services and finance.","This massive retailer has been shaping the economy for a decade.","a modern industrial economy","Transport workers are employed in all sectors of the economy.","The government has been criticized over the state of the economy.","The economy is booming.","the current slowdown/​growth in the economy","Immigrants are paying taxes and contributing to the economy."],"opposite":"","synonyms":""},{"def":"a country, when you are thinking about its economic system","examples":["Ireland was one of the fastest-growing economies in Western Europe in the 1990s.","emerging economies (= that are starting to grow)","developed economies"],"opposite":"","synonyms":""},{"def":"the use of resources in a way that avoids waste","examples":["The company has improved the fuel economy of all its vehicles.","It's a false economy to buy cheap clothes (= it seems cheaper but it is not really since they do not last very long).","(British English) We're on an economy drive at home (= trying to avoid waste and spend as little money as possible)."],"opposite":"","synonyms":""},{"def":"offering good value for money","examples":["Buy the large economy pack."],"opposite":"","synonyms":""},{"def":"ways of saving money","examples":["We need to make substantial economies.","Large firms can benefit from economies of scale (= by producing many items the cost of producing each one is reduced).","economies in something possible economies in phone costs"],"opposite":"","synonyms":""},{"def":"a way of using as little of something as possible","examples":["a technique based on economy of effort","She writes with a great economy of words (= using only the necessary words).","It was impressive to see her economy of movement as she worked the machine."],"opposite":"","synonyms":""},{"def":"the cheapest class of air travel","examples":["We flew economy.","an economy fare/ticket/seat/passenger"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["gig economy","mixed economy","tiger economy","command economy","consumer economy","market economy","planned economy","political economy","sharing economy","controlled economy","black economy","economy class syndrome","underground economy","the black economy","the underground economy"]}]