[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/eco/econo/economic__us_2_rr.mp3","phonsUS":"/ˌiːkəˈnɑːmɪk/","level":"B1","meanings":[{"def":"connected with the trade, industry and development of wealth of a country, an area or a society","examples":["They discussed social, economic and political issues.","economic growth/development","the worst economic crisis since the war","There will be no quick economic recovery.","the government’s economic policy","economic activity/cooperation/reform","an economic downturn/slowdown","A public spending programme is out of the question in the current economic climate.","This book deals with the social, economic and political issues of the period.","She had got into financial difficulties.","Tokyo is a major financial centre.","closer European monetary union","the government’s economic policy","the economic aspects of having children","It is usually economical to buy washing powder in large quantities.","Economic growth was fastest in Japan.","She's a lecturer in economic history.","The government's economic policy has been broadly successful.","This book deals with the social, economic and environmental questions of the period.","They discussed competitiveness in global economic markets.","The current economic downturn has affected the city's art scene.","The welfare state is inefficient in purely economic terms."],"opposite":"","synonyms":"economic"},{"def":"producing enough profit to continue","examples":["The college was not achieving the numbers of students needed to make it economic.","it is economic to do something They found it was not economic to sell their milk to the supermarkets.","it is economic for somebody/something to do something It's simply not economic for these small farmers to start buying large amounts of expensive fertilizer.","The play was very successful on Broadway.","The company has had another successful year.","a highly profitable business","The movie was not a commercial success (= made no profit).","They do a lot of business in lucrative overseas markets.","Small local shops stop being economic when a supermarket opens up nearby.","The business was getting to the stage where it wasn't economic any longer.","Small local shops stop being economic when a supermarket opens up nearby.","These investment projects will become economic in a few years."],"opposite":"uneconomic","synonyms":"successful"}],"idioms":[],"phrasal":[],"related":["economic migrant","socio-economic","Economic and Monetary Union","European Economic Area","European Economic Community","Organization for Economic Cooperation and Development","economic migrants","black economic empowerment"]}]