[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/edi/edito/editor__us_1.mp3","phonsUS":"/ˈedɪtər/","level":"B1","meanings":[{"def":"a person who is in charge of a newspaper, magazine, etc., or part of one, and who decides what should be included","examples":["the editor of the Washington Post","a newspaper/magazine editor","the sports/financial/fashion editor","a contributing/deputy editor","She got a job as a web editor on the local paper.","She was associate editor at the magazine.","He is a former editor of the journal.","On page 12, our City editor comments on the takeover bid.","Russell did a terrific job as book review editor.","She's the editor of a national magazine.","He became the editor-in-chief of the paper."],"opposite":"","synonyms":""},{"def":"a person who prepares a book or other written material to be published, for example by checking and correcting the text, making improvements, etc.","examples":["Jenny Cook is a freelance writer and editor based in New York.","He finally got a position as an assistant editor at a small publishing house."],"opposite":"","synonyms":""},{"def":"a person who prepares a film, radio or television programme for being shown or broadcast by deciding what to include, and what order it should be in","examples":["Kazan hired him as cameraman, editor and producer for ‘The Visitors’ (1972)."],"opposite":"","synonyms":""},{"def":"a person who works as a journalist for radio or television reporting on a particular area of news","examples":["our economics editor"],"opposite":"","synonyms":""},{"def":"a person who chooses texts written by one or by several writers and prepares them to be published in a book","examples":["She's the editor of a new collection of ghost stories."],"opposite":"","synonyms":""},{"def":"a program that allows you to change stored text or data","examples":["There are hundreds of different web editors on the market."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["city editor","copy editor","text editor","story editor","managing editor","editor-in-chief"]}]