[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/edu/educa/education__us_1.mp3","phonsUS":"/ˌedʒuˈkeɪʃn/","level":"A2","meanings":[{"def":"a process of teaching, training and learning, especially in schools, colleges or universities, to improve knowledge and develop skills","examples":["primary/elementary education","post-secondary education","a college/university education","She completed her formal education in 2019.","Students from lower income families are less likely to continue their education.","to further/pursue your education","to get/receive an education","The school provides an excellent all-round education.","music/arts education","in education students in full-time education","a man of little education","the British education system","a bilingual education program","The press made education reform a topic of heated debate.","In those days it was very difficult for poorer people to get a university education.","He was at a disadvantage because of the poor education he had received.","She went to America to complete her education.","He'd received an excellent general education in Poland.","The project seeks to improve education for students.","How well a child does at school is influenced by the level of parental education.","Many people lack the education and training that is needed for these jobs.","No one is denied an education because they are poor in this country.","Nigeria committed itself to universal primary education.","Researchers have found that single-sex education may benefit girls.","She brought up two children while pursuing a college education.","Technology allows distance education to occur at all levels.","He received a classical education.","children in early education settings","the party's policy on comprehensive education","parents who choose private education for their children","young people who are just leaving full-time education","Parents are beginning to wake up to the importance of pre-school education.","There are additional education requirements for nurses on this course.","They set up an account to fund their daughter's education.","They want to broaden their research and education activities.","We acquire much of our world knowledge through education.","efforts to improve education standards","Elementary education is excellent in this area.","Every child in the country needs to be provided with a first-class education.","The government is planning major reforms in the education system.","investment in education","enhancing the quality of education for students","The Steiner system of education offers many lessons to society in general.","Investment in education would play a vital role in the country's development."],"opposite":"","synonyms":""},{"def":"a particular kind of teaching or training","examples":["sex education in schools","education about something education about danger on the roads","The council has launched a new health education campaign.","an alcohol education programme (= to warn of the dangers of alcohol)","Patient education is important to minimize the risk of a second heart attack.","Education about HIV and other preventable diseases needs to improve.","Sex education in schools needs to be improved.","It is only through education that prejudice can be overcome.","environmental education","drug education"],"opposite":"","synonyms":""},{"def":"the institutions or people involved in teaching and training","examples":["the Education Department","the Department of Education","There should be closer links between education and industry.","the education secretary","the minister of education"],"opposite":"","synonyms":""},{"def":"the subject of study that deals with how to teach","examples":["a College of Education","a Bachelor of Education degree","She's an education major.","He has a degree in education."],"opposite":"","synonyms":""},{"def":"an interesting experience that teaches you something","examples":["The rock concert was quite an education for my parents!"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["co-education","re-education","adult education","further education","higher education","public education","special education","state education","distance education","physical education","secondary education","tertiary education","conductive education","continuing education","progressive education","Times Higher Education","Local Education Authority","college of further education","college of higher education","Department of Education"]}]