[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/eff/effec/effect__us_1.mp3","phonsUS":"/ɪˈfekt/","level":"A2","meanings":[{"def":"a change that somebody/something causes in somebody/something else; a result","examples":["the beneficial effects of exercise","What are the long-term effects of this treatment?","The results show a statistically significant effect.","effect on somebody/something Her tears had no effect on him.","the effect of heat on metal","Modern farming methods can have an adverse effect on the environment.","Farms can have both positive and negative effects on the community.","Despite her ordeal, she seems to have suffered no ill effects.","effect upon somebody/something The study examines architecture and its effect upon people's lives.","to examine/study/investigate the effect of something","to evaluate/assess the effect of something","to cause harmful health effects","I can certainly feel the effects of too many late nights.","effect of doing something Her criticisms had the effect of discouraging him completely.","to learn to distinguish between cause and effect","I tried to persuade him, but with little or no effect.","‘I'm feeling really depressed.’ ‘The winter here has that effect sometimes.’","One consequence of changes in diet over recent years has been a dramatic increase in cases of childhood obesity.","Many parents today do not have time to cook healthy meals for their children. Consequently/As a consequence, many children grow up eating too much junk food.","Many children spend their free time online instead of playing outside. As a result, more and more of them are becoming overweight.","Last year junk food was banned in schools. The effect of this has been to create a black market in the playground, with pupils bringing sweets from home to sell to other pupils.","Does television affect children’s behaviour?","Does television have an effect on children’s behaviour?","They hope to effect a reconciliation.","The drug had no effect in curing the illness.","Any delay in delivery of materials will have a knock-on effect throughout the production process.","Giving up smoking had a magical effect on his stamina.","Heavy taxation has a disincentive effect.","It's a policy that will have a chilling effect on free speech.","The drug exerts a powerful effect on the brain.","We had problems with mosquitoes, but this spray had the desired effect.","The plague struck London again with devastating effect.","The project has already had a direct effect on the lives of one million people.","the crippling effect of sanctions on the economy","The full effects of the new tax have not yet been felt.","His comment was intended to calm the situation but it had the opposite effect.","The deterrent effect of the death penalty has long been questioned.","How soon will the effects of the drug wear off?","I am interested in documenting the effects of international events on ordinary people.","There was no discernible effect on cell growth.","a face cream designed to combat the effects of age","drugs which mimic the effects of hormones","Women feel the effects of alcohol more quickly than men.","the serious health effects which result from obesity","to minimize the effects of economic change","I took the medicine with dramatic effect.","The effect lasted only a short time."],"opposite":"","synonyms":""},{"def":"a particular look, sound or impression that somebody, such as an artist or a writer, wants to create","examples":["The overall effect of the painting is overwhelming.","The stage lighting gives the effect of a moonlit scene.","She uses glass to achieve a variety of visual effects.","to produce/create an effect","for an effect Add a scarf for a casual effect.","for effect He only behaves like that for effect (= in order to impress people).","I found that by adding white I could achieve the desired effect.","The yellow pigment produced the opposite effect to that desired.","That is precisely the effect I was aiming at.","The dramatic effect was heightened by her black dress and dead white face."],"opposite":"","synonyms":""},{"def":"lights, sounds, special scenery, computer images, etc. used in a play or film, especially in order to show things that do not normally exist or happen","examples":["The production relied too much on spectacular effects."],"opposite":"","synonyms":""},{"def":"your personal possessions","examples":["The insurance policy covers all baggage and personal effects."],"opposite":"","synonyms":""},{"def":"to cause something to come into use","examples":["The recommendations will soon be put into effect."],"opposite":"","synonyms":""},{"def":"to come into use; to begin to apply","examples":["New controls come into effect next month."],"opposite":"","synonyms":""},{"def":"used when you are stating what the facts of a situation are","examples":["In effect, the two systems are identical.","His refusal to support her had, in effect, forced her resignation.","By asking for these particular qualifications, you are, in effect, excluding most women from applying.","The border closure meant, in effect, that no trade took place between the countries."],"opposite":"","synonyms":""},{"def":"in use","examples":["These laws are in effect in twenty states.","Some laws from the 18th century are still in effect."],"opposite":"","synonyms":""},{"def":"to start to produce the results that are intended","examples":["The aspirins soon take effect.","The medicine started to take effect after a few minutes."],"opposite":"","synonyms":""},{"def":"to come into use; to begin to apply","examples":["The new law takes effect from tomorrow."],"opposite":"","synonyms":""},{"def":"used to show that you are giving the general meaning of what somebody has said or written rather than the exact words","examples":["He left a note to the effect that he would not be coming back.","She told me to get out—or words to that effect."],"opposite":"","synonyms":""},{"def":"producing a good, successful, dramatic, etc. result or impression","examples":["The air conditioning came on, to little effect.","She uses animal sounds to startling effect in her music."],"opposite":"","synonyms":""},{"def":"not producing the result you intend or hope for","examples":["We warned them, but to no effect."],"opposite":"","synonyms":""},{"def":"starting from…","examples":["The government has cut interest rates with effect from the beginning of next month."],"opposite":"","synonyms":""},{"def":"starting now","examples":["She has resigned with immediate effect."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"bring/put something into effect","def":"to cause something to come into use","examples":["The recommendations will soon be put into effect."]},{"idiom":"come into effect","def":"to come into use; to begin to apply","examples":["New controls come into effect next month."]},{"idiom":"in effect","def":"used when you are stating what the facts of a situation are","examples":["In effect, the two systems are identical.","His refusal to support her had, in effect, forced her resignation.","By asking for these particular qualifications, you are, in effect, excluding most women from applying.","The border closure meant, in effect, that no trade took place between the countries.","These laws are in effect in twenty states.","Some laws from the 18th century are still in effect."]},{"idiom":"take effect","def":"to start to produce the results that are intended","examples":["The aspirins soon take effect.","The medicine started to take effect after a few minutes.","The new law takes effect from tomorrow."]},{"idiom":"to the effect that… | to this/that effect","def":"used to show that you are giving the general meaning of what somebody has said or written rather than the exact words","examples":["He left a note to the effect that he would not be coming back.","She told me to get out—or words to that effect."]},{"idiom":"to good, great, dramatic, etc. effect","def":"producing a good, successful, dramatic, etc. result or impression","examples":["The air conditioning came on, to little effect.","She uses animal sounds to startling effect in her music."]},{"idiom":"to no effect","def":"not producing the result you intend or hope for","examples":["We warned them, but to no effect."]},{"idiom":"with effect from…","def":"starting from…","examples":["The government has cut interest rates with effect from the beginning of next month."]},{"idiom":"with immediate effect","def":"starting now","examples":["She has resigned with immediate effect."]}],"phrasal":[],"related":["side effect","after-effect","domino effect","ripple effect","sound effect","butterfly effect","network effect","Doppler effect","greenhouse effect","words to that effect"]},{"pos":"verb","level":"","meanings":[{"def":"to make something happen","examples":["to effect a cure/change/recovery","The negotiators hoped to effect a smooth transition to an interim administration.","These drugs can sometimes effect miraculous cures.","Does television affect children’s behaviour?","Does television have an effect on children’s behaviour?","They hope to effect a reconciliation."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]