[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/eff/effor/effort__us_1.mp3","phonsUS":"/ˈefərt/","level":"B1","meanings":[{"def":"an attempt to do something especially when it is difficult to do","examples":["The project was a team effort.","a joint/collaborative effort","a determined/conscious/special effort","I didn't really feel like going out, but I am glad I made the effort.","effort to do something Please make an effort to be on time.","The local clubs are making every effort to interest more young people.","We need to make a concerted effort to finish on time.","You need to focus your efforts on critical areas first.","We decided to concentrate our efforts on the home study market.","to coordinate/redouble your efforts","I'm glad to hear that many of you support our efforts.","in an effort to do something The company has laid off 150 workers in an effort to save money.","despite somebody's efforts Despite our best efforts, we didn't manage to win the game.","Recognize your staff members for their efforts.","I spent hours cleaning the house, but there isn't much to show for all my efforts.","with an effort With an effort of will he resisted the temptation.","They believed their collaborative efforts would be far more effective than the efforts of any individual.","He failed in his efforts to give up smoking.","Critics said the plan would undermine efforts to address the current crisis.","He spearheaded efforts to raise money for the school.","I can see you have made a big effort to clean up.","I have to make a conscious effort to be polite so early in the morning.","I make sporadic efforts to sort out my files.","She made a feeble effort to smile, then started crying again.","The UN General Secretary flew in in a last-ditch effort to save the talks.","The club has changed the rules in an effort to make them fairer.","The wound resisted all my efforts to stop it bleeding.","I'll make a special effort to finish on time this week.","Students, teachers and families got together in a team effort to decorate the school.","Governments are pooling their efforts to stem international terrorism.","Her efforts earned her a Nobel Prize.","The gallery owner applauded the efforts of firefighters to save the exhibits.","The police have renewed their efforts to find the murderer.","Diplomatic efforts to end the crisis failed.","Through their efforts, enough money was raised to buy the equipment.","We're targeting our efforts at making our website appealing to younger people.","efforts by campaigners to improve working conditions at the plant","She redoubled her efforts to get her writing published."],"opposite":"","synonyms":""},{"def":"the physical or mental energy that you need to do something; something that takes a lot of energy","examples":["You should put more effort into your work.","A great deal of time and effort has gone into making this event a success.","It's a long climb to the top, but well worth the effort.","Getting up this morning was quite an effort (= it was difficult).","The task required almost no effort.","with (an) effort (British English) With an effort (= with difficulty) she managed to stop herself laughing.","It takes constant effort to become fluent in a language.","It took a whole day of hard effort to knock down the wall.","No effort has been spared to make this hotel a welcoming, comfortable place.","This can be done quickly and with very little effort.","an outfit which enables you to look good with minimal effort","They have put a lot of money and effort into their latest album.","Without much effort, our membership has made modest, steady growth."],"opposite":"","synonyms":""},{"def":"a particular activity that a group of people organize in order to achieve something","examples":["the Russian space effort","the United Nations’ peacekeeping effort"],"opposite":"","synonyms":""},{"def":"the result of an attempt to do something","examples":["I'm afraid this essay is a poor effort."],"opposite":"","synonyms":""},{"def":"a force applied by a machine or in a process","examples":[],"opposite":"","synonyms":""},{"def":"to put a lot of effort into one particular thing","examples":["He urged the government to bend every effort to secure the prisoners' release."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"bend (all) your efforts/every effort to something","def":"to put a lot of effort into one particular thing","examples":["He urged the government to bend every effort to secure the prisoners' release."]}],"phrasal":[],"related":[]}]