[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/elb/elbow/elbow__us_1.mp3","phonsUS":"/ˈelbəʊ/","level":"B2","meanings":[{"def":"the joint between the upper and lower parts of the arm where it bends in the middle","examples":["She jabbed him with her elbow.","He rested his elbows on his knees.","She grazed her elbow in the fall.","He's fractured his elbow.","A voice at my elbow said, ‘Would Sir care to be seated?’","Extend your arms without locking your elbows.","He caught her elbow to steady her.","He raised himself on one elbow and looked at the bedside clock.","He rested one elbow on the wall as he spoke.","He took his guest by the elbow and steered him in the direction of the bar.","He was up to his elbows in hot water, doing the washing-up.","I banged my elbow on the table as I got up.","She dug her elbow into Jim's ribs to remind him not to give the secret away.","She opened her eyes and propped herself up on one elbow to look at him.","She slid a hand under his elbow to guide him into the shop.","She thrust her elbow into her attacker's face.","She was cradling a small bundle in the crook of her elbow.","The whole of his arm below the elbow was badly burned."],"opposite":"","synonyms":""},{"def":"the part of a piece of clothing that covers the elbow","examples":["The jacket was worn at the elbows."],"opposite":"","synonyms":""},{"def":"a part of a pipe, chimney, etc. where it bends at a sharp angle","examples":[],"opposite":"","synonyms":""},{"def":"to be told by somebody that they no longer want to have a relationship with you; to be told to go away","examples":[],"opposite":"","synonyms":""},{"def":"to tell somebody that you no longer want to have a relationship with them; to tell somebody to go away","examples":[],"opposite":"","synonyms":""},{"def":"used to encourage somebody or express support for their actions","examples":[],"opposite":"","synonyms":""},{"def":"to be very stupid; to have absolutely no skill","examples":[],"opposite":"","synonyms":""},{"def":"to meet and spend time with a famous person, socially or as part of your job","examples":["He’s rubbing elbows with stars all the time.","He had been rubbing elbows with celebrities."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"get the elbow","def":"to be told by somebody that they no longer want to have a relationship with you; to be told to go away","examples":[]},{"idiom":"give somebody the elbow","def":"to tell somebody that you no longer want to have a relationship with them; to tell somebody to go away","examples":[]},{"idiom":"more power to somebody’s elbow","def":"used to encourage somebody or express support for their actions","examples":[]},{"idiom":"not know your arse from your elbow","def":"to be very stupid; to have absolutely no skill","examples":[]},{"idiom":"rub elbows with somebody","def":"to meet and spend time with a famous person, socially or as part of your job","examples":["He’s rubbing elbows with stars all the time.","He had been rubbing elbows with celebrities."]}],"phrasal":[],"related":["elbow bump","elbow room","elbow grease","tennis elbow","not know your arse from your elbow"]},{"pos":"verb","level":"","meanings":[{"def":"to push somebody with your elbow, usually in order to get past them","examples":["She elbowed me out of the way to get to the front of the line.","He elbowed his way through the crowd.","She elbowed him aside and walked up to the main desk.","His friend elbowed him aside and stepped forward.","He elbowed his way past the other shoppers."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]