[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/ele/elect/election__us_1.mp3","phonsUS":"/ɪˈlekʃn/","level":"B1","meanings":[{"def":"the process of choosing a person or a group of people for a position, especially a political position, by voting","examples":["presidential/parliamentary/local elections","the upcoming midterm elections for Congress","The prime minister is about to call (= announce) an election.","Elections will be held later this year.","to vote in an election","(especially British English) How many candidates are standing for election?","(especially North American English) to run for election","to fight/contest an election","to win/lose an election","the 2020 US election campaign","an election result/victory","election day/night","Who did you vote for in the last election?","They took a vote on who should go first.","They suffered a defeat at the polls.","The leader will be chosen by secret ballot.","All counties have now certified their election returns.","Education is a key election issue.","Elections are scheduled for November.","It was successful in rallying voters at election time.","Membership of the committee is by election.","Predicting the result of close elections is a perilous game.","The Governor faces an unprecedented recall election.","The US is reaching the end of its latest presidential election cycle.","The election turnout in 2018 was high.","The party swept Turkish elections in November.","The party won a landslide election.","The people will decide this election and they will prove all the polls wrong.","The prime minister may decide to call an early election.","The violence in the country will not derail the elections.","They demanded a rerun of the disputed presidential election.","a bitterly disputed election","claims that voter fraud had stolen the election for the Republicans","opinion poll results in the run-up to elections","the democratic concept of popular elections","the scheduled Lebanese elections in May","votes which could swing the entire national election","He first stood for election when he was 21.","It will be a hard-fought election campaign.","She's yet to say whether she will be running for election.","The country's first free elections took place in 1990.","The first election results will be coming in very soon.","The party promised this in their election manifesto.","the upcoming/​forthcoming election","an election candidate/​official","The black vote will help determine the outcome of this election."],"opposite":"","synonyms":"election"},{"def":"the fact of having been chosen by election","examples":["Her election will mark a new beginning for the country.","election as something We welcome his election as president.","election to something a year after her election to the committee","Since his election to the Senate, he has been an ardent gay rights supporter."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["by-election","re-election","general election","primary election"]}]