[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/ele/elect/electricity__us_6.mp3","phonsUS":"/ɪˌlekˈtrɪsəti/","level":"A2","meanings":[{"def":"a form of energy from charged elementary particles, usually supplied as electric current through cables, wires, etc. for lighting, heating, driving machines, etc.","examples":["materials that conduct electricity","to produce/supply electricity","The wind farm will generate enough electricity for some 30 000 homes.","electricity from renewable sources","They are looking to develop more efficient ways of converting the energy from sunlight into electricity.","No progress was made towards harnessing electricity as an energy source.","electricity supply/generation","an electricity bill","a waste of electricity","The electricity is off (= there is no electric power supply).","A high-voltage fault sparked an electricity blackout.","All the houses now have electricity.","Crews did their best to restore electricity after the storm.","Electricity flows through the wires in the circuit.","Her electricity was cut off when she didn't pay her bill.","I switched the light off to save electricity.","Insulating your house could cut your electricity bill by half.","Metals conduct electricity well.","More than a million customers lost electricity following the flooding.","The hydroelectric plant provides electricity for half the island's population.","The town will soon be connected to the national electricity grid.","We run the washing machine at night because off-peak electricity is much cheaper.","a 10% drop in electricity prices","the company's role in California's electricity crisis","services such as gas, water, and electricity","The government are improving the electricity grid and building new pipelines.","Whole villages were left without electricity.","The solar panels produce more electricity than the building consumes.","mains electricity","cars powered by electricity"],"opposite":"","synonyms":""},{"def":"a feeling of great emotion, excitement, etc.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["static electricity","Office of Gas and Electricity Markets"]}]