[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/ema/email/email__us_2.mp3","phonsUS":"/ˈiːmeɪl/","level":"A1","meanings":[{"def":"a way of sending messages and data to other people by means of computers connected together in a network","examples":["I will be on vacation for a week in November, with no access to email.","They use email, conference calls and chat rooms to discuss business.","by email to send a message by email","via email Automated notifications will be sent via email or text message.","through email (especially North American English) Membership notifications go out through email in the fall.","What's your email address?","an email account/message/attachment","an email newsletter/list","Each of the rooms has internet and email access.","If a member does not have email, a letter is sent.","She is in constant email contact with a number of college staff.","Some members used email to renew their membership.","The next day I got 400 email responses.","Users receive email notification of special offers.","Web-based email providers","You can sign up to receive email alerts.","a free email service","the rise in corporate email traffic","Enquiries are answered promptly by phone, email or letter.","She returned from holiday to a full email inbox.","I had an email exchange with him regarding an article I'd written.","The negotiations took place over email."],"opposite":"","synonyms":""},{"def":"a message sent by email","examples":["Thanks for your email.","to send/receive/read an email","to forward/delete an email","We've been exchanging emails over the past few weeks.","I have to check my email.","unsolicited/spam/junk email","I got an email from Andrew last week.","Reading email has become the first task of the morning.","filtering devices that block unwanted email","an email announcing his promotion","When I saw what he'd written I fired off an angry email.","The email contains a link to the retailer's website.","Some companies monitor all employee email.","I sent an email to the company asking about their products.","Most people check their email several times a day.","An email arrives in your inbox.","Concertgoers will receive a confirmation e-mail.","The company shut down its website for two days after its customers were targeted by phishing emails.","The band insists they answer every fan email personally.","Many people have written emails requesting more information.","Consumers are accustomed to seeing phrases like these used to lure them into opening spam emails.","a flood of emails","I had an exchange of e-mails with John about the show."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"A1","meanings":[{"def":"to send a message to somebody by email","examples":["email somebody Patrick emailed me yesterday.","email something (to somebody) I'll email the documents to her.","email somebody something I'll email her the documents.","email for something Call or email for a free information pack."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]