[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/emb/embar/embarrassment__us_1.mp3","phonsUS":"/ɪmˈbærəsmənt/","level":"C1","meanings":[{"def":"shy, uncomfortable or guilty feelings; a feeling of being embarrassed","examples":["I nearly died of embarrassment when he said that.","embarrassment of (doing) something I'm glad you offered—it saved me the embarrassment of having to ask.","to somebody's embarrassment Much to her embarrassment, she realized that everybody had been listening to her singing.","He suffered great personal embarrassment after failing the tests.","Helen changed the subject to save me the embarrassment of replying.","I could finally talk about my problem without embarrassment.","I could have died of embarrassment when I saw her standing behind me.","I felt some embarrassment as we shook hands.","I still squirm with embarrassment at the thought of it.","Much to his embarrassment, Mike realized that a small crowd was watching him.","Much to her embarrassment she realized that everybody in the room had heard her.","Pender decided to risk embarrassment and seek help.","She smiled to hide her slight embarrassment.","We all watched in silent embarrassment as Mr Rogers started to cry.","her embarrassment at being found out"],"opposite":"","synonyms":""},{"def":"a situation that causes problems for somebody","examples":["Her resignation will be a severe embarrassment to the party.","the government's embarrassment over the affair","The protests were becoming something of an embarrassment to the government.","The government wishes to avoid further embarrassment over the affair.","The episode was a huge embarrassment for all concerned.","The agreement was made in secret to avoid public embarrassment."],"opposite":"","synonyms":""},{"def":"a person who causes problems for another person or other people and makes them feel embarrassed","examples":["Poor Lucy! He's such an embarrassment to her.","The poor child was considered an embarrassment to his family.","The president became a national embarrassment."],"opposite":"","synonyms":""},{"def":"so many good things that it is difficult to choose just one","examples":["Stratford has an embarrassment of riches, really, what with three theatres and lovely countryside, too."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"an embarrassment of riches","def":"so many good things that it is difficult to choose just one","examples":["Stratford has an embarrassment of riches, really, what with three theatres and lovely countryside, too."]}],"phrasal":[],"related":[]}]