[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/eme/emerg/emergency__us_2.mp3","phonsUS":"/ɪˈmɜːrdʒənsi/","level":"B1","meanings":[{"def":"a sudden serious and dangerous event or situation that needs immediate action to deal with it","examples":["This is a medical emergency needing urgent treatment with antibiotics.","The government has declared a state of emergency following the earthquake.","In times of national emergency, the usual rules may not apply.","in an emergency This door should only be used in an emergency.","for emergencies I always have some extra cash with me for emergencies.","the emergency exit (= to be used in an emergency)","The pilot made an emergency landing in a field.","The emergency response team was on the scene within eight minutes.","The government has been granted emergency powers (= to deal with an emergency).","The purpose of these drills is to be prepared in the case of an emergency.","The government had to take emergency action.","Call this number if any unforeseen emergency should arise.","Complete retention of urine constitutes a medical emergency.","Don't call me unless its a real emergency.","Emergency admissions to hospital are given top priority.","Emergency supplies of food have been flown to the area.","He got emergency leave when his Dad died.","He missed the meeting because of a family emergency.","I need to know what to do in an emergency.","It's a disaster and a public-health emergency in the making.","There's a fire blanket on the kitchen wall in case of emergencies.","The ambulance crashed while answering an emergency call.","The army provided emergency cover when the ambulance service went on strike.","The assembly declared a national emergency.","The government imposed emergency rule and suspended civil rights.","When a member of staff has a family emergency, a project can get delayed.","Would you know what to do in an emergency situation?","an emergency session of the United Nations","an emergency shutdown of the nuclear reactor","firefighters on call to respond to emergencies","the New York police and fire and emergency responders","the emergency evacuation of more than 300 passengers","There is an emergency exit on each side of the aeroplane.","the hospital emergency department","improved access to emergency contraception","She was brought to the hospital for emergency surgery.","They set up an emergency board meeting.","the humanitarian emergency that resulted from the earthquake","Fire wardens will direct people in the event of an emergency.","emergency crew/​personnel/​vehicles","The new communications system will allow the police to respond to any emergency much faster than previously.","They are well trained to deal with emergencies."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["climate emergency","emergency brake","emergency room","emergency services","accident and emergency","emergency rooms","in case of emergency"]}]