[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/emo/emoti/emotion__us_1.mp3","phonsUS":"/ɪˈməʊʃn/","level":"B1","meanings":[{"def":"a strong feeling such as love, fear or anger; the part of a person’s character that consists of feelings","examples":["to show/express your emotions","They expressed mixed emotions at the news.","Counselling can teach people to handle negative emotions such as fear and anger.","Fear is a normal human emotion.","This documentary manages to capture the raw emotions of life at the tough end.","Emotions are running high (= people are feeling very excited, angry, etc.).","She showed no emotion at the verdict.","The decision was based on emotion rather than rational thought.","Mary was overcome with emotion.","He lost control of his emotions.","Through her work she expresses a wide range of emotion.","Counsellors encourage victims of crime to confront their emotions.","Drama can help children to express their emotions.","Emotions are running high on the issue.","He felt no emotion as she left.","It's about allowing kids to express feelings and emotions through art.","Her performance in the play covered the whole gamut of emotions.","Her voice was choked with emotion.","Releasing these emotions is part of the healing process.","She could not cope with such public displays of emotion.","She felt a sudden rush of emotion at the thought of seeing him again.","She felt torn by conflicting emotions.","She realized she was shaking all over with emotion.","She spoke with deep emotion.","The film captures the real emotion of this terrible event.","The film has a surprising depth of emotion for a comedy.","The nurse was handling his fragile emotions very carefully.","The woman's face showed no emotion.","There wasn't a hint of emotion in his eyes.","a spectacle which no one can view without emotion","Years of pent-up emotion came out as he sobbed.","You could read his emotions by looking into his eyes.","a moving performance full of raw emotion","a speech that was charged with emotion","an incident that has aroused strong emotions locally","the emotions that we experience as children","the heightened emotions which resulted from the terrorist attack","spontaneous outpourings of emotion","This is the kind of expression of emotion that touches a deeper chord.","She was overwhelmed by the emotion of the moment.","The young boy bit his lip to keep his emotions in check.","There's nothing in this movie that will stir your emotions.","His imagery conveys intense emotion."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]