[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/emp/empha/emphasize__us_1.mp3","phonsUS":"/ˈemfəsaɪz/","level":"B2","meanings":[{"def":"to give special importance to something","examples":["emphasize something His speech emphasized the importance of attracting industry to the town.","The report emphasizes the need for economic stability.","She emphasized the point in an interview at the weekend.","emphasize that… She emphasized that their plan would mean sacrifices and hard work.","emphasize how, what, etc… He emphasized how little was known about the disease.","it must/should be emphasized that… It should be emphasized that this is only one possible explanation.","+ speech ‘This must be our top priority,’ he emphasized.","This case emphasizes/highlights the importance of honest communication between managers and employees.","Effective communication skills are essential/crucial/vital.","It should be noted that this study considers only verbal communication. Non-verbal communication is not dealt with here.","It is important to remember that/An important point to remember is that non-verbal communication plays a key role in getting your message across.","Communication is not only about the words you use but also your body language and, especially/above all, the effectiveness with which you listen.","I would like to draw attention to the role of listening in effective communication.","Choose your words carefully: in particular, avoid confusing and ambiguous language.","Finally, and perhaps most importantly, you must learn to listen as well as to speak.","All the arguments serve to emphasize the controversy surrounding this disease.","I have been at pains to emphasize the positive aspects of discipline.","I must emphasize that this is only a summary, and the full report will not be available until next week.","It is important to emphasize this point.","The new law rightly emphasizes parental responsibility.","The foreign minister was at great pains to emphasize the role that Spain could play in the region."],"opposite":"","synonyms":""},{"def":"to make something easier to notice","examples":["She swept her hair back from her face to emphasize her high cheekbones.","The rising tone of his voice emphasized his panic."],"opposite":"","synonyms":""},{"def":"to give extra force to a word or phrase when you are speaking, especially to show that it is important","examples":["‘Let nothing… nothing,’ he emphasized the word, ‘tempt you.’","You stress the first syllable in ‘happiness’.","‘Let nothing … nothing,’ he emphasized the word, ‘tempt you.’"],"opposite":"","synonyms":"stress"}],"idioms":[],"phrasal":[],"related":[]}]