[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/emp/emplo/employment__us_1.mp3","phonsUS":"/ɪmˈplɔɪmənt/","level":"B1","meanings":[{"def":"work, especially when it is done to earn money; the state of being employed","examples":["full-time/part-time employment","people seeking employment","They are finding it more and more difficult to find employment.","The steelworks provided employment for thousands of people.","employment with somebody/something He took up employment with the company in May 2015.","employment in something She hoped to secure employment in the IT sector.","in employment Most of last year's graduates are now in paid employment.","There are limited employment opportunities here.","Such clauses in employment contracts are common in many states.","a specialist in employment law","conditions/terms of employment","(formal) Please list any pension entitlement you have from previous employments.","It’s very difficult to find work at the moment.","Only half the people here are in paid employment.","He had a very distinguished career in the Foreign Office.","He hopes to enter the medical profession.","Please state your name, age, and occupation.","Carpentry is a highly skilled trade.","Interviewers will look carefully at a candidate's employment history.","One company terminated his employment after 30 days.","She had been out of employment for three years.","She lost her employment when the company closed.","Steel making is the only local industry offering large-scale employment.","The company was one of the first to offer meaningful employment to the blind.","recent graduates seeking employment","graduates entering the employment market","The survey studied the employment status and lifestyle of people within the community.","trade union concerns such as conditions of employment and health and safety","Your conditions of employment should tell you how many days of sick leave you are entitled to.","Union negotiate conditions of employment.","It's getting more and more difficult for young people to find regular employment.","There are few employment prospects in the town for unqualified young people.","a state-subsidized employment programme","laws prohibiting employment discrimination","school-leavers entering the employment market","I was put in touch with a local employment agency.","The employment market isn't looking too good at the moment.","Current employment legislation states that no one should work more than 48 hours a week.","There have been significant changes in patterns of employment."],"opposite":"","synonyms":"work"},{"def":"the situation in which people have work","examples":["The government is aiming at full employment.","Changes in farming methods have badly affected employment in the area.","Employment levels rose for the first time this year.","The latest employment figures show a fall in the number of people who are out of work.","The employment picture is not good.","The government aims to achieve full employment within three years.","This investment will certainly create employment in the area.","policies aimed at maintaining a high level of employment","Measures have been taken to stimulate employment in the area.","policies designed to stimulate employment","an area of very low employment","the government's full-employment policy"],"opposite":"unemployment","synonyms":""},{"def":"the act of employing somebody","examples":["The law prevented the employment of children under ten in the cotton mills.","The company's employment practices have been widely criticized.","The expansion of the factory will mean the employment of sixty extra workers.","Changes in employment practices have affected farming jobs in the area."],"opposite":"","synonyms":""},{"def":"the use of something","examples":["the employment of artillery in the capture of the town"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["employment agency","employment equity","self-employment","employment tribunal","employment insurance","Equal Employment Opportunity Commission","employment agencies"]}]