[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/emp/empty/empty__us_2.mp3","phonsUS":"/ˈempti/","level":"","meanings":[{"def":"to continue working or trying despite having no resources, energy, ideas, etc. left","examples":["A lot of the players are running on empty and deserve a good rest."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be running on empty","def":"to continue working or trying despite having no resources, energy, ideas, etc. left","examples":["A lot of the players are running on empty and deserve a good rest."]}],"phrasal":[],"related":["empty nest","empty-handed","empty-headed","empty nester","empty nests","empty nesters"]},{"pos":"adjective","level":"A2","meanings":[{"def":"with no people or things inside","examples":["an empty box/glass/bottle","empty hands (= not holding anything)","an empty plate (= with no food on it)","I noticed an empty space on the bookshelf.","I couldn't see any empty seats (= with nobody sitting in them).","The theatre was half empty.","an empty house/room/bus","As it got later, the streets became empty.","The house had been standing empty (= without people living in it) for some time.","It's not good to drink alcohol on an empty stomach (= without having eaten something).","empty of something (formal) The room was empty of furniture.","The box lay empty on the bed.","The city is letting useful housing stand empty.","The house felt curiously empty without the children.","The house had been left empty for several weeks.","The reservoirs could end up empty if this dry weather continues.","There was a vast expanse of totally empty sky to look at.","There were a few chairs, but the room was otherwise empty.","a half-empty box of chocolates","The streets were empty of people.","For the first time in years, the town square was empty of pigeons."],"opposite":"","synonyms":""},{"def":"with no meaning; not meaning what is said","examples":["empty words","an empty promise","Voters will see through the empty rhetoric.","an empty gesture aimed at pleasing the crowds"],"opposite":"","synonyms":""},{"def":"unhappy because life does not seem to have a purpose, usually after something sad has happened","examples":["Three months after his death, she still felt empty.","My life seems empty without you.","We all feel very empty now she's gone."],"opposite":"","synonyms":""},{"def":"without a quality that you would expect to be there","examples":["words that were empty of meaning"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"B1","meanings":[{"def":"to remove everything that is in a container, etc.","examples":["empty something She emptied the bins, washed the glasses and went to bed.","He emptied his glass and asked for a refill.","empty something out I emptied out my pockets but could not find my keys.","empty something of something The room had been emptied of all furniture.","(figurative) She emptied her mind of all thoughts of home.","He emptied the bottle of its contents.","The cupboards had all been completely emptied.","We emptied out the tank."],"opposite":"","synonyms":""},{"def":"to become empty","examples":["The streets soon emptied when the rain started.","empty of somebody/something The beach gradually emptied of people.","empty out The tank empties out in five minutes.","The streets soon emptied of shoppers.","The hall half emptied as bored businessmen raced for the buffet tables.","The room gradually emptied out.","The bar will empty out quite quickly after they stop serving."],"opposite":"","synonyms":""},{"def":"to take out the contents of something and put them somewhere else","examples":["empty something He stepped outside to empty the trash.","empty something onto something She emptied the contents of her bag onto the table.","empty something into something Many factories emptied their waste into the river.","empty something out of something She emptied the water out of the vase.","He opened his bag and emptied his belongings onto the floor.","I emptied the orange juice into a jug.","She emptied out the contents of the jar."],"opposite":"","synonyms":""},{"def":"to make sure that everyone leaves a room, building, etc.","examples":["Police had instructions to empty the building because of a bomb threat."],"opposite":"","synonyms":""},{"def":"to flow or move out from one place to another","examples":["empty into/onto something The Rhine empties into the North Sea.","empty out into/onto something Fans emptied out onto the streets after the concert.","The castle had a deep moat which emptied into the lake.","Water from the underground pipes empties directly into nearby streams."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]