[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/enc/encou/encounter__us_5.mp3","phonsUS":"/ɪnˈkaʊntər/","level":"B2","meanings":[{"def":"to experience something, especially something unpleasant or difficult, while you are trying to do something else","examples":["We encountered a number of difficulties in the first week.","The report details the problems encountered by families in this situation.","I had never encountered such resistance before."],"opposite":"","synonyms":""},{"def":"to meet somebody, or discover or experience something, especially somebody/something new, unusual or unexpected","examples":["She was the most remarkable woman he had ever encountered.","Plant scientists first encountered the phenomenon in the 1930s.","an idea I first encountered when I was in the army","Researchers at the isolated Arctic outpost encounter a creature from outer space.","Walruses were commonly encountered in the Shetland Islands until quite recently."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Brief Encounter","encounter group","encounter groups"]},{"pos":"noun","level":"B2","meanings":[{"def":"a meeting, especially one that is sudden, unexpected or violent","examples":["a chance encounter","encounter with somebody/something Three of them were killed in the subsequent encounter with the police.","Flaubert was her first encounter with French literature.","encounter between A and B The story describes the extraordinary encounter between a man and a dolphin.","I've had a number of close encounters (= situations that could have been dangerous) with bad drivers.","It was his first sexual encounter (= first experience of sex).","I decided not to risk a second close encounter with the snakes.","I did not see him again, except for a brief encounter on a train.","I had my first encounter with him two years ago.","The whole thing was the result of a chance encounter in 1975.","It was a chance encounter that led to the setting up of the new political party.","A chance encounter with a former acquaintance presents him with an opportunity to make some money.","The press conference was her first direct encounter with the media.","examination of UFO sightings and alien encounters","her early encounters with contemporary art","my first encounter with my new boss","the colonial encounter of Indigenous craftsmen with Europeans","the language we use in everyday social encounters","violent encounters between police and protesters"],"opposite":"","synonyms":""},{"def":"a sports match against a particular player or team","examples":["She has beaten her opponent in all of their previous encounters.","They lost their second-round encounter against Germany."],"opposite":"","synonyms":""},{"def":"an incident in which police shoot dead a suspected criminal","examples":["The two gangsters were later killed in a police encounter."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]