[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/enc/encou/encourage__us_4.mp3","phonsUS":"/ɪnˈkɜːrɪdʒ/","level":"B1","meanings":[{"def":"to give somebody support, courage or hope","examples":["encourage somebody We were greatly encouraged by the positive response of the public.","She encouraged many young writers and artists.","encourage somebody in something My parents have always encouraged me in my choice of career.","+ speech ‘You're doing fine,’ he encouraged her.","She especially encouraged young scientists.","We were greatly encouraged by the support we received."],"opposite":"","synonyms":""},{"def":"to persuade somebody to do something by making it easier for them and making them believe it is a good thing to do","examples":["encourage somebody to do something Banks actively encouraged people to borrow money.","I strongly encourage everyone to go and see this important film.","encourage (doing) something Speaking your mind is highly encouraged at these sessions.","The aim of the campaign is to encourage youngsters not to smoke.","The new measures are designed to encourage more people to cycle."],"opposite":"","synonyms":""},{"def":"to make something more likely to happen or develop","examples":["encourage something There is a clear case for spending public money on encouraging participation in sport.","to encourage development/investment/growth","The government should encourage the use of renewable energy sources.","encourage something in somebody/something They claim that some computer games encourage violent behaviour in young children.","encourage somebody to do something Music and lighting are used to encourage shoppers to buy more.","The government must actively encourage investment in these areas.","We want a company culture that welcomes ideas and encourages innovation.","These questions are designed to encourage debate.","Do toy guns encourage aggression?","Programmes like this just encourage stereotyping.","The treaty is aimed at encouraging cooperation between Member States.","We're looking at ways to encourage recycling.","Seating will be set out in a way that encourages social distancing."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]