[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/end/end__/end__us_1.mp3","phonsUS":"/end/","level":"A1","meanings":[{"def":"the final part of a period of time, an event, an activity or a story","examples":["It's the end of an era.","the end of the book","at the end of something at the end of the week","at the end There’ll be a chance to ask questions at the end.","by the end of something He wants the reports by the end of the month.","to the end of something She remained active as an artist to the end of her life.","towards the end (of something) I was getting bored towards the end of the talk.","until the end We didn't leave until the very end.","until the end of something I'm staying until the end of this week.","We had to hear about the whole journey from beginning to end.","He is nearing the end of his career.","Our end-of-season sale starts next week.","I'll never get to the end of this book!","It stayed hot right up to the end of September.","They get married at the end of the movie.","I hope to finish this by the end of the week.","They finally get named at the end of the book.","Her death marks the end of an era.","You don't know who the murderer is until right at the end of the book.","His story was one big lie from beginning to end.","The award was a fitting end to a distinguished career.","Pigs were weighed at the beginning and end of the experiment.","Near the end of each term, students were selected from each class for a prize.","The new rules could be in place before the end of this year.","The plants die at the end of each growing season.","Her contract expires at the end of the year.","In the six months to the end of March overall revenue rose 18%.","They scored a goal three minutes from the end of extra time."],"opposite":"","synonyms":""},{"def":"a situation in which something does not exist any more","examples":["It was the end of all his dreams.","That was by no means the end of the matter.","at an end The war was finally at an end.","The meeting came to an end (= finished).","The coup brought his corrupt regime to an end.","This latest attack could spell the end of the peace process.","an end to something They have called for an end to violence.","an end to the conflict/war","Let’s put an end to (= stop) these rumours once and for all.","There's no end in sight to the present crisis.","Cheap air travel marked the end of the golden age of the British seaside holiday.","The release of ‘The Jazz Singer’ signalled the end of the silent movie era.","He won't win, but he'll keep fighting to the end.","Talks were in progress to bring an end to the fighting.","The meeting finally came to an end at six.","The proceedings are expected to be at an end by 6 p.m.","What the business community wants is an end to the recession.","The injury brought her career to an early end.","As far as I'm concerned, that's the end of it.","the end of the civil war","They demanded an end to racial discrimination in the workplace.","I think I've finally reached the end of the teen movie craze."],"opposite":"","synonyms":""},{"def":"the part of an object or a place that is the furthest away from its centre","examples":["I joined the end of the queue.","Go to the end of the line!","at the end of something Turn right at the end of the road.","His office is the room at the other end of the corridor.","That's his wife sitting at the far end of the table.","on the end of something You've got something on the end of your nose.","Tie the ends of the string together.","the front/rear end of a cow/tractor","These two products are from opposite ends of the price range.","We've travelled from one end of Mexico to the other.","They live in the end house.","Continue until you reach the end of the road.","The bank is right at the end of the street.","The famous Las Vegas Strip is about three miles from end to end.","Turn into Hope Street and our house is right at the end.","the southern end of the lake","We walked along the whole promenade, from end to end.","The rope was unfastened at one end.","Take the free end of the rope and pass it through the hole.","housebuyers at the cheap end of the market","The two parties represent opposite ends of the political spectrum.","The car was lifted up by the winds and tumbled end over end along the ground.","Their red blood cells were at the low end of the normal range."],"opposite":"","synonyms":""},{"def":"an aim or a purpose","examples":["They are prepared to use violence in pursuit of their ends.","She is exploiting the current situation for her own ends.","He joined the society for political ends.","With this end in view (= in order to achieve this) they employed 50 new staff.","We are willing to make any concessions necessary to this end (= in order to achieve this).","They are working towards common ends.","Set yourself targets that you can reasonably hope to achieve.","attainment targets in schools","What is the main objective of this project?","He continued to pursue his goal of becoming an actor.","The object is to educate people about road safety.","He joined the society for political ends.","That’s only OK if you believe that the end justifies the means (= bad methods of doing something are acceptable if the final result is good).","Despite our differences, we were working to a common end.","She was prepared to lie in order to achieve her ends.","She wished to have a house built, and to this end she engaged a local architect.","The money might have been used to more beneficial ends."],"opposite":"","synonyms":"target"},{"def":"a part of an activity with which somebody is involved, especially in business","examples":["We need somebody to handle the marketing end of the business.","Are there any problems at your end?","I have kept my end of the bargain."],"opposite":"","synonyms":""},{"def":"either of two places connected by a phone call, journey, etc.","examples":["I answered the phone but there was no one at the other end.","Jean is going to meet me at the other end."],"opposite":"","synonyms":""},{"def":"one of the two halves of a sports field","examples":["The teams changed ends at half-time."],"opposite":"","synonyms":""},{"def":"a small piece that is left after something has been used","examples":["a cigarette end"],"opposite":"","synonyms":""},{"def":"a person’s death. People say ‘end’ to avoid saying ‘death’.","examples":["She came to an untimely end (= died young).","I was with him at the end (= when he died).","(literary) He met his end (= died) at the Battle of Waterloo.","He was bound to meet a violent end one day.","The end came when he collapsed after playing golf.","She had a short life and a tragic end."],"opposite":"","synonyms":""},{"def":"a lineman who is nearest to the side of the field","examples":["a defensive end","He does as good a job as any end in football at helping his teammates."],"opposite":"","synonyms":""},{"def":"used to introduce the most important fact after everything has been considered","examples":["At the end of the day, he'll still have to make his own decision."],"opposite":"","synonyms":""},{"def":"having nothing to do and not knowing what you want to do","examples":["Come and see us, if you're at a loose end."],"opposite":"","synonyms":""},{"def":"something unpleasant that happens to somebody, for example punishment or a violent death, usually because of their own actions","examples":["He'll come to a sticky end one of these days if he carries on like that."],"opposite":"","synonyms":""},{"def":"to have almost nothing left of something","examples":["I'm at the end of my patience.","They are at the end of their food supply."],"opposite":"","synonyms":""},{"def":"to feel that you cannot deal with a difficult situation any more because you are too tired, worried, etc.","examples":["You’d better let her know you’re safe. She’s at the end of her tether."],"opposite":"","synonyms":""},{"def":"to be the person that an action, etc. is directed at, especially an unpleasant one","examples":["She found herself on the receiving end of a great deal of criticism."],"opposite":"","synonyms":""},{"def":"to be so worried by a problem that you do not know what to do next","examples":["She was at her wits’ end wondering how she’d manage it all in the time.","I'm at my wits' end trying to cope with his moods."],"opposite":"","synonyms":""},{"def":"when you say that people or situations are the end, you mean that you are annoyed with them","examples":[],"opposite":"","synonyms":""},{"def":"the first sign of something ending","examples":["The scandal was the beginning of the end of his career as a politician.","It wasn't the end of their marriage, but it was the beginning of the end.","That day was the beginning of the end of our friendship."],"opposite":"","synonyms":""},{"def":"to become very tired by trying to do too many things and going to bed late and getting up early","examples":[],"opposite":"","synonyms":""},{"def":"a thing that is itself important and not just a part of something more important","examples":["For her, shopping had become an end in itself.","For her, travelling had become an end in itself rather than a means of seeing new places."],"opposite":"","synonyms":""},{"def":"bad or unfair methods of doing something are acceptable if the result of that action is good or positive","examples":["He defended a morality in which the end justifies the means.","That's only OK if you believe that the end justifies the means."],"opposite":"","synonyms":""},{"def":"(to reach) the point at which something can no longer continue in the same way","examples":["A defeat in the second round marked the end of the line for last year's champion.","The loss of this contract could signal the end of the line for the shipyard.","This latest disagreement could mean the end of the road for the band."],"opposite":"","synonyms":""},{"def":"used when you are stating that there is nothing more that can be said or done about something","examples":["If she doesn’t agree, I won’t go ahead. End of story."],"opposite":"","synonyms":""},{"def":"in a line, with the ends touching","examples":["They arranged the tables end to end."],"opposite":"","synonyms":""},{"def":"to have sex","examples":[],"opposite":"","synonyms":""},{"def":"to be the person in a group who is chosen or forced to perform an unpleasant duty or task","examples":[],"opposite":"","synonyms":""},{"def":"to understand something in the wrong way","examples":[],"opposite":"","synonyms":""},{"def":"to suddenly become very angry or emotional","examples":[],"opposite":"","synonyms":""},{"def":"to do everything possible, even if it is difficult, in order to get or achieve something","examples":["I'd go to the ends of the earth to see her again."],"opposite":"","synonyms":""},{"def":"after a long period of time or series of events","examples":["He tried various jobs and in the end became an accountant.","In the end, they decided to spend Christmas at home."],"opposite":"","synonyms":""},{"def":"after everything has been considered","examples":["You can try your best to impress the interviewers but in the end it's often just a question of luck."],"opposite":"","synonyms":""},{"def":"to start or be made to start a new and difficult activity that you are not prepared for","examples":["Junior hospital doctors are thrown in at the deep end in their first jobs.","The company believes in throwing new employees in at the deep end with no training."],"opposite":"","synonyms":""},{"def":"to continue to be cheerful in a difficult situation","examples":[],"opposite":"","synonyms":""},{"def":"something that shows you are nearly at the end of a long and difficult time or situation","examples":["For the first time since the start of his treatment, we can now see light at the end of the tunnel."],"opposite":"","synonyms":""},{"def":"to earn just enough money to be able to buy the things you need","examples":["Many families struggle to make ends meet."],"opposite":"","synonyms":""},{"def":"to shock or frighten somebody","examples":["a chilling tale that will make your hair stand on end"],"opposite":"","synonyms":""},{"def":"a thing or an action that is not interesting or important in itself but is a way of achieving something else","examples":["He doesn't particularly like the work but he sees it as a means to an end.","I don't enjoy studying computing—it's just a means to an end."],"opposite":"","synonyms":""},{"def":"very much","examples":["It upset me no end to hear they'd split up."],"opposite":"","synonyms":""},{"def":"a lot of something","examples":["We had no end of trouble getting them to agree."],"opposite":"","synonyms":""},{"def":"not the worst thing that could happen to somebody","examples":["Failing one exam is not the end of the world.","It won't be the end of the world if you don't get the job."],"opposite":"","synonyms":""},{"def":"to keep being reminded of something because somebody is always talking to you about it","examples":["If we don't get her a dog we'll never hear the end of it."],"opposite":"","synonyms":""},{"def":"in a position standing upright rather than lying flat","examples":["It'll fit if you stand it on end.","Stand the box on end.","Stand it on end."],"opposite":"","synonyms":""},{"def":"for the stated length of time, without stopping","examples":["He would disappear for weeks on end."],"opposite":"","synonyms":""},{"def":"to kill yourself","examples":[],"opposite":"","synonyms":""},{"def":"a situation in which somebody is treated badly or unfairly","examples":[],"opposite":"","synonyms":""},{"def":"the place or position of greatest difficulty or responsibility","examples":["He started work at the sharp end of the business, as a salesman."],"opposite":"","synonyms":""},{"def":"an event or action that is the beginning of something more serious and/or unpleasant","examples":["The introduction of a tax on workplace parking is seen by many as the thin end of the wedge."],"opposite":"","synonyms":""},{"def":"continuing until you have done everything you can, or until something is completely finished, despite difficulties and problems","examples":["They were prepared to fight to the bitter end for their rights.","We will fight this case to the bitter end."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"at the end of the day","def":"used to introduce the most important fact after everything has been considered","examples":["At the end of the day, he'll still have to make his own decision."]},{"idiom":"at a loose end","def":"having nothing to do and not knowing what you want to do","examples":["Come and see us, if you're at a loose end."]},{"idiom":"a bad/sticky end","def":"something unpleasant that happens to somebody, for example punishment or a violent death, usually because of their own actions","examples":["He'll come to a sticky end one of these days if he carries on like that."]},{"idiom":"be at the end of something","def":"to have almost nothing left of something","examples":["I'm at the end of my patience.","They are at the end of their food supply."]},{"idiom":"be at the end of your tether","def":"to feel that you cannot deal with a difficult situation any more because you are too tired, worried, etc.","examples":["You’d better let her know you’re safe. She’s at the end of her tether."]},{"idiom":"be at/on the receiving end (of something)","def":"to be the person that an action, etc. is directed at, especially an unpleasant one","examples":["She found herself on the receiving end of a great deal of criticism."]},{"idiom":"be at your wits’ end","def":"to be so worried by a problem that you do not know what to do next","examples":["She was at her wits’ end wondering how she’d manage it all in the time.","I'm at my wits' end trying to cope with his moods."]},{"idiom":"be the end","def":"when you say that people or situations are the end, you mean that you are annoyed with them","examples":[]},{"idiom":"the beginning of the end","def":"the first sign of something ending","examples":["The scandal was the beginning of the end of his career as a politician.","It wasn't the end of their marriage, but it was the beginning of the end.","That day was the beginning of the end of our friendship."]},{"idiom":"burn the candle at both ends","def":"to become very tired by trying to do too many things and going to bed late and getting up early","examples":[]},{"idiom":"an end in itself","def":"a thing that is itself important and not just a part of something more important","examples":["For her, shopping had become an end in itself.","For her, travelling had become an end in itself rather than a means of seeing new places."]},{"idiom":"the end justifies the means","def":"bad or unfair methods of doing something are acceptable if the result of that action is good or positive","examples":["He defended a morality in which the end justifies the means.","That's only OK if you believe that the end justifies the means."]},{"idiom":"(reach) the end of the line/road","def":"(to reach) the point at which something can no longer continue in the same way","examples":["A defeat in the second round marked the end of the line for last year's champion.","The loss of this contract could signal the end of the line for the shipyard.","This latest disagreement could mean the end of the road for the band."]},{"idiom":"end of story","def":"used when you are stating that there is nothing more that can be said or done about something","examples":["If she doesn’t agree, I won’t go ahead. End of story."]},{"idiom":"end to end","def":"in a line, with the ends touching","examples":["They arranged the tables end to end."]},{"idiom":"get/have your end away","def":"to have sex","examples":[]},{"idiom":"get the short end of the stick","def":"to be the person in a group who is chosen or forced to perform an unpleasant duty or task","examples":[]},{"idiom":"get (hold of) the wrong end of the stick","def":"to understand something in the wrong way","examples":[]},{"idiom":"go off the deep end","def":"to suddenly become very angry or emotional","examples":[]},{"idiom":"go to the ends of the earth","def":"to do everything possible, even if it is difficult, in order to get or achieve something","examples":["I'd go to the ends of the earth to see her again."]},{"idiom":"in the end","def":"after a long period of time or series of events","examples":["He tried various jobs and in the end became an accountant.","In the end, they decided to spend Christmas at home.","You can try your best to impress the interviewers but in the end it's often just a question of luck."]},{"idiom":"jump/be thrown in at the deep end","def":"to start or be made to start a new and difficult activity that you are not prepared for","examples":["Junior hospital doctors are thrown in at the deep end in their first jobs.","The company believes in throwing new employees in at the deep end with no training."]},{"idiom":"keep your end up","def":"to continue to be cheerful in a difficult situation","examples":[]},{"idiom":"light at the end of the tunnel","def":"something that shows you are nearly at the end of a long and difficult time or situation","examples":["For the first time since the start of his treatment, we can now see light at the end of the tunnel."]},{"idiom":"make (both) ends meet","def":"to earn just enough money to be able to buy the things you need","examples":["Many families struggle to make ends meet."]},{"idiom":"make somebody’s hair stand on end","def":"to shock or frighten somebody","examples":["a chilling tale that will make your hair stand on end"]},{"idiom":"a means to an end","def":"a thing or an action that is not interesting or important in itself but is a way of achieving something else","examples":["He doesn't particularly like the work but he sees it as a means to an end.","I don't enjoy studying computing—it's just a means to an end."]},{"idiom":"no end","def":"very much","examples":["It upset me no end to hear they'd split up."]},{"idiom":"no end of something","def":"a lot of something","examples":["We had no end of trouble getting them to agree."]},{"idiom":"not the end of the world","def":"not the worst thing that could happen to somebody","examples":["Failing one exam is not the end of the world.","It won't be the end of the world if you don't get the job."]},{"idiom":"not/never hear the end of it","def":"to keep being reminded of something because somebody is always talking to you about it","examples":["If we don't get her a dog we'll never hear the end of it."]},{"idiom":"on end","def":"in a position standing upright rather than lying flat","examples":["It'll fit if you stand it on end.","Stand the box on end.","Stand it on end.","He would disappear for weeks on end."]},{"idiom":"put an end to yourself | put an end to it all","def":"to kill yourself","examples":[]},{"idiom":"the rough end of the pineapple","def":"a situation in which somebody is treated badly or unfairly","examples":[]},{"idiom":"the sharp end (of something)","def":"the place or position of greatest difficulty or responsibility","examples":["He started work at the sharp end of the business, as a salesman."]},{"idiom":"the thin end of the wedge","def":"an event or action that is the beginning of something more serious and/or unpleasant","examples":["The introduction of a tax on workplace parking is seen by many as the thin end of the wedge."]},{"idiom":"to/until the bitter end","def":"continuing until you have done everything you can, or until something is completely finished, despite difficulties and problems","examples":["They were prepared to fight to the bitter end for their rights.","We will fight this case to the bitter end."]}],"phrasal":[],"related":["end in","end up","back end","back-end","big end","bin-end","dead end","deep end","dog-end","end run","end user","end zone","fag end","high-end","low-end","rear end","rear-end","tail end","top-end"]},{"pos":"verb","level":"A1","meanings":[{"def":"to finish; to reach a point and go no further; to make something finish","examples":["At last the war ended.","The road ends here.","How does the story end?","The problems did not end there.","end with something Her note ended with the words: ‘See you soon.’","end by doing something The speaker ended by suggesting some topics for discussion.","end something They decided to end their relationship.","to end the occupation/conflict/violence","A back injury effectively ended her career.","end something with something The team ended the season with a 4–0 win.","+ speech ‘And that was that,’ she ended.","It's been lovely/​so nice/​good talking to you.","I'm so glad we got to talk.","I'm sorry, I have to rush off.","It was nice to meet you. I'm sorry I have to go now.","Will you excuse me? There's someone I've got to speak to.","They ended the play with a song.","His speech ended on a positive note.","The meeting ended abruptly when the chairman was called away.","The peace talks have ended inconclusively, with neither side prepared to give way on key points.","The show ended with a song.","We thought they'd never end.","Her workday begins and ends in darkness.","The peace agreement ended the war.","The series finally ended on Saturday night.","A closing reception ends the day.","In chess, the game ends with checkmate.","The attack effectively ended hopes for peace in the region."],"opposite":"","synonyms":""},{"def":"to spend the last part of your life in a particular state or place","examples":["He ended his days in poverty."],"opposite":"","synonyms":""},{"def":"if you say that something will end in tears, you are warning somebody that what they are doing will have an unhappy or unpleasant result","examples":["After all that excitement the day was bound to end in tears.","Needless to say, it ended in tears.","He warned us it would all end in tears."],"opposite":"","synonyms":""},{"def":"to kill yourself","examples":[],"opposite":"","synonyms":""},{"def":"used to emphasize how large, important, exciting, etc. you think something is","examples":["The movie has a car chase to end all car chases."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"end your days/life (in something)","def":"to spend the last part of your life in a particular state or place","examples":["He ended his days in poverty.","I’m afraid time is running out/​we’re running out of time, so we'll have to make this the final question.","We've only got a couple of minutes left, so can we summarize what we've agreed?","I'd like to close the session with a few final remarks…","We'll have to leave it there, but thank you all very much for your input.","Well, that's all we have time for today, but we'll meet again on Tuesday.","I'd like to thank you all for coming and for a very productive meeting."]},{"idiom":"end in tears","def":"if you say that something will end in tears, you are warning somebody that what they are doing will have an unhappy or unpleasant result","examples":["After all that excitement the day was bound to end in tears.","Needless to say, it ended in tears.","He warned us it would all end in tears."]},{"idiom":"end it all | end your life","def":"to kill yourself","examples":[]},{"idiom":"a/the something to end all sths","def":"used to emphasize how large, important, exciting, etc. you think something is","examples":["The movie has a car chase to end all car chases."]}],"phrasal":["end in","end up"],"related":[]}]