[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/ene/energ/energy__us_2.mp3","phonsUS":"/ˈenərdʒi/","level":"A2","meanings":[{"def":"the strength, effort and enthusiasm required for physical or mental activity, work, etc.","examples":["It's a waste of time and energy.","She's always full of energy.","I don't seem to have any energy these days.","nervous energy (= energy produced by feeling nervous)","For five years, she devoted considerable energy to photography.","He expends great energy trying to help them.","Football gives them an outlet for their energy.","He never seems to lack energy.","I admire her boundless energy.","I don't have the time or energy to argue with you.","It was late and my energy was beginning to flag.","It's a waste of energy cutting this grass—nobody's going to see it.","My energy levels are still low.","Prisoners are encouraged to channel their energy into exercise.","She always works with energy and enthusiasm.","She eventually summoned up the energy to cook dinner.","Sugar provides an energy boost.","The children are always full of energy.","The hills sapped his energy and he got off his bike for frequent rests.","The kids were running around crazily, working off their surplus energy.","The volunteers' energy was dissipated by the enormous amounts of paperwork involved in the project.","There is a lack of creative energy in the industry.","We don't want to waste our energy trying to persuade people who are just not interested.","We must invest our time and energy in the development of our craft.","We're trying to deal with young offenders by channelling their energy into sport rather than crime.","With a sudden burst of energy, he ran to the top of the hill.","You can judge how healthy you are by the amount of energy you have.","You could feel the energy coming back to you from the audience.","She brings passion and energy to the part.","Lang has an inner glow that radiates positive energy.","She releases pent up energy on the dance floor."],"opposite":"","synonyms":""},{"def":"the physical and mental effort that you use to do something","examples":["She put all her energies into her work.","He focused his energies on preparing the lectures.","Provide a means of channelling your child's creative energies.","I will put all my energies into improving the situation."],"opposite":"","synonyms":""},{"def":"a source of power, such as fuel, used for driving machines, providing heat, etc.","examples":["solar/wind/renewable energy","to save/conserve energy","to generate/produce energy","The £500 million programme is centred around energy efficiency and renewable power sources.","the country's total energy consumption","an energy crisis (= for example when fuel is not freely available)","energy conservation","the use of photovoltaic panels to generate energy","total energy requirements for the coming year","the change from fossil fuels to renewable energy","state control of the energy industries","equipment that offers long-term energy savings","energy-saving features that can reduce energy bills by 50%","attempts to harness solar energy","a government-sponsored renewable energy project","The nuclear plant provides a fifth of the nation's energy supplies.","The new power station produces vast amounts of energy.","The demand for energy and fuel is expected to increase dramatically.","The country could face an energy crisis if demand continues to rise.","The cost of solar power needs to fall before it makes an impact on the energy market.","No battery could store enough energy to turn over a car's engine.","Reusing existing buildings is less wasteful in terms of energy and resources than new construction.","low water and energy usage","green methods of harnessing free, clean energy","low energy light bulbs","Locally produced food would reduce energy costs."],"opposite":"","synonyms":""},{"def":"the ability of matter or radiation to work because of its mass, movement, electric charge, etc.","examples":["potential/kinetic/electrical energy"],"opposite":"","synonyms":""},{"def":"a person who is full of energy and enthusiasm","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a ball of energy/fire","def":"a person who is full of energy and enthusiasm","examples":[]}],"phrasal":[],"related":["energy bar","atomic energy","energy drink","solar energy","nuclear energy","potential energy","alternative energy","Department of Energy","European Atomic Energy Community","United Kingdom Atomic Energy Authority","Department of Energy and Climate Change","Department for Business, Energy and Industrial Strategy","energy bars","energy drinks"]}]