[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/eng/engag/engage__us_1.mp3","phonsUS":"/ɪnˈɡeɪdʒ/","level":"B2","meanings":[{"def":"to succeed in attracting and keeping somebody’s attention and interest","examples":["It is a movie that engages both the mind and the eye.","Their pleas failed to engage any sympathy.","to engage the public/audience/viewer/reader","It was difficult to engage the students at first.","The party is attempting to engage young voters politically."],"opposite":"","synonyms":""},{"def":"to employ a person, company, etc. to do a particular job","examples":["engage somebody/something She has already engaged a lawyer.","We will have to engage the services of a translator.","engage somebody/something as something He was immediately engaged as a consultant.","engage somebody/something to do something Karl Böhm engaged her to sing in Vienna.","Some of the directors wanted to engage another firm.","They have engaged companies as subcontractors for the construction work","The government engages charitable organizations to help in the distribution of food"],"opposite":"","synonyms":""},{"def":"to become involved with and try to understand something/somebody","examples":["She has the ability to engage with young minds.","We acknowledge the need to engage directly with these problems.","Our contributors are actively engaging with tradition."],"opposite":"","synonyms":""},{"def":"to begin fighting with somebody","examples":["engage somebody He ordered his men to engage the enemy.","engage with somebody The fleet sailed out of Cadiz to engage with the enemy."],"opposite":"","synonyms":""},{"def":"when a part of a machine engages, or when you engage it, it fits together with another part of the machine and the machine begins to work","examples":["The cogwheels are not engaging.","engage with something One cogwheel engages with the next.","engage something Engage the clutch before selecting a gear."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["engage in"],"related":["engage in","engage in something | engage somebody in something"]}]