[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/eng/engag/engagement__us_1.mp3","phonsUS":"/ɪnˈɡeɪdʒmənt/","level":"C1","meanings":[{"def":"an agreement to marry somebody; the period during which two people are engaged","examples":["Their engagement was announced in the local paper.","engagement (to somebody) She has broken off her engagement to Charles.","an engagement party","a long/short engagement","He announced his engagement to his long-time girlfriend."],"opposite":"","synonyms":""},{"def":"an arrangement to do something at a particular time, especially something official or something connected with your job","examples":["an engagement book/diary","He has a number of social engagements next week.","It was her first official engagement.","I had to refuse because of a prior engagement.","I don't keep an engagement diary these days.","It is important that I keep this engagement.","The president fell ill and was forced to cancel all public engagements.","The chairman will carry out no official public engagements during the month of August.","Mrs Meyer regrets that she is unable to attend owing to a previous engagement.","He had an important engagement with his financial adviser."],"opposite":"","synonyms":""},{"def":"being involved with somebody/something in an attempt to understand them/it","examples":["engagement (with somebody/something) Her views are based on years of engagement with the problems of the inner city.","engagement (in something) the lack of engagement in politics","Her church promoted civic engagement.","Higher education can contribute to civic engagement.","his serious intellectual engagement with this issue","the decline in political engagement"],"opposite":"","synonyms":""},{"def":"fighting between two armies, etc.","examples":["The general tried to avoid an engagement with the enemy."],"opposite":"","synonyms":""},{"def":"an arrangement to employ somebody; the process of employing somebody","examples":["The terms of engagement are to be agreed in writing."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["engagement ring","customer engagement","engagement rings"]}]