[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/eng/engin/engine__us_2.mp3","phonsUS":"/ˈendʒɪn/","level":"A2","meanings":[{"def":"the part of a vehicle that produces power to make the vehicle move","examples":["a diesel/petrol engine","I got in the car and started the engine.","My car had to have a new engine.","The engine runs on diesel.","Its engine is powered by both gasoline and electricity.","The plane suffered catastrophic engine failure.","Their helicopter had developed engine trouble.","He pulled up under some trees and cut the engine.","I kept the engine ticking over.","I pressed the starter and the engine caught first time.","She sat at the traffic lights revving the engine.","She waited with the engine running while he bought a paper.","The engine broke down just outside the station.","The engine coughed and died.","The engine runs on unleaded petrol.","The engine was just ticking over.","The engine's firing on all four cylinders now.","The new model is fitted with a more powerful engine.","The plane's engine roared as it prepared for take-off.","The rocket engine is ignited.","This model is powered by a 1.8-litre petrol engine.","Does your car have a diesel or a petrol engine?","You need more oil in the engine.","a 580-horsepower engine","a large plane with twin engines","It looks as if we've got a spot of engine trouble.","a gasoline engine","the ship's engine room","The planes have the ability to land safely in the event of an engine failure."],"opposite":"","synonyms":""},{"def":"a thing that has an important role in making a particular process happen","examples":["engine of something Agriculture is a key engine of growth in most developing countries.","engine for something Great newspapers serve as an engine for positive change.","engine for doing something Business is the principal engine for generating wealth for society as a whole.","He was the engine behind the victory.","Small businesses are the engine of economic growth.","The region's housing market is a major engine of the economy.","The internet really is the growth engine of today's economy.","These industries will be the engine of our future prosperity.","Exports have been an engine for growth."],"opposite":"","synonyms":""},{"def":"a vehicle that pulls a train","examples":[],"opposite":"","synonyms":""},{"def":"having the type or number of engines mentioned","examples":["a twin-engined speedboat"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["engine room","fire engine","jet engine","tank engine","engine driver","search engine","traction engine","internal combustion engine","search engine optimization","Thomas the Tank Engine","engine rooms","engine drivers","outboard engine","internal-combustion engine","search engine optimizations","search engine optimisation"]}]