[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/eng/engin/engineer__us_2.mp3","phonsUS":"/ˌendʒɪˈnɪr/","level":"A2","meanings":[{"def":"a person whose job involves designing and building engines, machines, roads, bridges, etc.","examples":["We worked with a team of scientists and engineers.","You need the advice of a qualified engineer.","engineers who designed and built advanced military aircraft"],"opposite":"","synonyms":""},{"def":"a person who is trained to repair machines and electrical equipment","examples":["They're sending an engineer to fix the problem with the heating.","We were on the phone with a technical support engineer."],"opposite":"","synonyms":""},{"def":"a person whose job is to control and repair engines, especially on a ship or an aircraft","examples":["a flight engineer","the chief engineer on a cruise liner"],"opposite":"","synonyms":""},{"def":"a person whose job is driving a railway engine","examples":[],"opposite":"","synonyms":""},{"def":"a soldier trained to design and build military structures","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["chemical engineer","civil engineer","lighting engineer","software engineer","sound engineer","electrical engineer","mechanical engineer","recording engineer","structural engineer"]},{"pos":"verb","level":"","meanings":[{"def":"to arrange for something to happen or take place, especially when this is done secretly in order to give yourself an advantage","examples":["She engineered a further meeting with him.","She carefully engineered a meeting with the chairman.","He had no idea that his downfall had been engineered by his deputy.","The firm effectively engineered its own takeover."],"opposite":"","synonyms":""},{"def":"to design and build something","examples":["be… engineered The car is beautifully engineered and a pleasure to drive.","engineer something the men who engineered the tunnel"],"opposite":"","synonyms":""},{"def":"to change the genetic structure of something","examples":["genetically engineered crops","Some biotech crops are engineered to ward off pests."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]