[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/ent/enter/enter__us_4.mp3","phonsUS":"/ˈentər/","level":"A2","meanings":[{"def":"to come or go into something","examples":["Knock before you enter.","Enter Hamlet (= for example as stage directions in the text of a play).","enter something Someone entered the room behind me.","people who enter the country illegally","Where did the bullet enter the body?","(figurative) A note of defiance entered her voice.","(figurative) It never entered my head (= I never thought) that she would tell him about me.","He stood back to allow us to enter.","He was refused permission to enter the country.","The dancers entered from the side of the stage.","They pass each other as they enter and exit the building.","We entered through a large iron gate.","I knocked and a bored voice said, ‘Enter’.","No one was allowed to enter the room while the police were there.","The burglars must have entered through a window.","No one was seen entering or leaving the building.","Employees must be wearing safety equipment before entering the work area.","They do not qualify for leave to enter or remain in the United Kingdom.","On the following day, troops entered the city.","Foreign journalists were refused permission to enter the country.","The building is entered via a gate from the sidewalk."],"opposite":"","synonyms":""},{"def":"to put your name on the list for an exam, a race, a competition, etc.; to do this for somebody","examples":["enter something Over a thousand children entered the competition.","enter somebody/something in something Irish trainers have entered several horses in the race.","Her mum entered her in the baby contest.","enter somebody/something for something How many students have been entered for the exam?","enter (for something) Only four British players have entered for the championship.","We're having a class quiz and all the children have entered.","Employees of Telegraph Newspapers Ltd are not eligible to enter the competition.","I wrote a novel for my son and entered it for a competition."],"opposite":"","synonyms":""},{"def":"to begin or become involved in an activity, a situation, etc.","examples":["Several new firms have now entered the market.","The US entered the war in 1917.","The investigation has entered a new phase.","The strike is entering its fourth week.","She graduated in 2017 with plans to enter the financial world.","The programme is now entering the final stage.","The country was entering a period of economic prosperity.","Little by little, women are entering typically male-dominated fields such as politics, economics, engineering, and law .","The fear that the economy is entering uncharted waters is unfounded.","In 1652 Lully entered the service of Louis XIV.","We knew we were entering new territory."],"opposite":"","synonyms":""},{"def":"to become a member of an institution; to start working in an organization or a profession","examples":["to enter a school/college/university","to enter politics","to enter Parliament (= become an MP)","to enter the Church (= become a priest)","to enter the legal/medical profession","He did not wish to enter the Church like his brothers.","I entered politics late in life.","It was his aim to enter the Church.","She entered Parliament in 1998.","She entered college in 2006."],"opposite":"","synonyms":""},{"def":"to put names, numbers, details, etc. in a list, book or computer","examples":["enter something in something Enter your name and occupation in the boxes (= on a form).","enter something into something to enter data into a computer","enter something on something to enter figures on a spreadsheet","enter something You may need to enter this information manually.","Please enter all your personal details on the form provided.","Your details have been entered in our database.","He entered the details of the case into a file.","The notebook window is where you can enter and display data."],"opposite":"","synonyms":""},{"def":"to say something officially so that it can be recorded","examples":["to enter a plea of not guilty (= at the beginning of a court case)","to enter an offer","Her solicitor entered a plea of not guilty on her behalf.","The jury entered a verdict of acquittal."],"opposite":"","synonyms":""},{"def":"to start being used","examples":["When do the new regulations come into force?","The new law comes into force as from midnight tomorrow."],"opposite":"","synonyms":""},{"def":"to apply for a place at a school, in a competition, etc. for somebody or yourself","examples":["Have you entered your name for the quiz yet?","They’ve already put his name down for Eton College.","Have you put your name down for the school play?"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"come/enter into force","def":"to start being used","examples":["When do the new regulations come into force?","The new law comes into force as from midnight tomorrow."]},{"idiom":"enter somebody’s/your name (for something)","def":"to apply for a place at a school, in a competition, etc. for somebody or yourself","examples":["Have you entered your name for the quiz yet?","They’ve already put his name down for Eton College.","Have you put your name down for the school play?"]}],"phrasal":["enter into","enter on","enter upon"],"related":["enter on","re-enter","enter into","enter upon","enter on something","enter into something","enter upon something","enter into something (with somebody)"]}]