[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/ent/enter/entertainment__us_1.mp3","phonsUS":"/ˌentərˈteɪnmənt/","level":"B1","meanings":[{"def":"films, music, etc. used to entertain people; an example of this","examples":["radio, television and other forms of entertainment","There will be live entertainment at the party.","It was typical family entertainment.","It was not something you would watch for light entertainment.","A folk band provided the entertainment.","Local entertainments are listed in the newspaper.","the entertainment industry/business","The show was good entertainment value.","There are three bars, with live entertainment seven nights a week.","It wasn’t serious—it was all done in fun.","We didn’t mean to hurt him. It was just a bit of fun.","The lottery provides harmless fun for millions.","His only form of recreation is playing football.","I go hill-walking for relaxation.","the happy sounds of children at play","Are you in Paris for business or pleasure?","What do you do for amusement round here?","It's pure entertainment and there's nothing wrong with that.","Movies were the new mass entertainment.","Passengers can enjoy free nightly entertainment.","Soaps like ‘Neighbours’ are pure entertainment and there is nothing wrong with that.","The films were bought chiefly for their entertainment value.","The hotel has a varied programme of nightly entertainment.","The leading piece of entertainment news in the US is the Oscars.","The television was his only source of entertainment.","They laid on lavish entertainment for their guests.","Tokyo's entertainment district","Vote for your top light entertainment show.","places of entertainment such as bars","stars from the world of entertainment","the half-time entertainment at football games","The stories will be judged purely on their entertainment value.","There was no TV or radio so we had to make our own entertainment.","the airline's in-flight entertainment channel"],"opposite":"","synonyms":"entertainment"},{"def":"the act of providing people with somebody to interest them or make them laugh","examples":["Ladies and gentlemen, for your entertainment, we present Magic Man."],"opposite":"","synonyms":""},{"def":"the act of inviting people to eat or drink with you as your guests","examples":["a budget for the entertainment of clients"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["home entertainment"]}]