[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/ent/enter/enterprise__us_1.mp3","phonsUS":"/ˈentərpraɪz/","level":"C1","meanings":[{"def":"a company or business","examples":["He is in charge of an enterprise with a turnover of $26 billion.","state-owned/public enterprises","The grant is available to small and medium-sized enterprises.","something that affects all the workers in the enterprise","They plan to privatize over 100 state-owned enterprises."],"opposite":"","synonyms":""},{"def":"a large project, especially one that is difficult","examples":["Have you heard about his latest business enterprise?","a joint enterprise","The music festival is a new enterprise which we hope will become an annual event.","The programme is a joint enterprise with the National Business School.","The team leader will be the most important factor in this difficult enterprise.","They are willing to undertake a new enterprise.","the complex organization of a business enterprise"],"opposite":"","synonyms":""},{"def":"the development of businesses by the people of a country rather than by the government","examples":["They provide grants to encourage enterprise in the region.","an enterprise culture (= in which people are encouraged to develop small businesses)","The Act will encourage private enterprise.","The government has promoted the small firm and the enterprise culture.","The culture of dependency was replaced by an enterprise culture."],"opposite":"","synonyms":""},{"def":"the ability to think of new projects and make them successful","examples":["a job in which enterprise is rewarded","a man of enterprise","Many hotels are showing enterprise and imagination by staging special events.","I thought she showed great enterprise."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["enterprise zone","free enterprise","social enterprise","private enterprise","Starship Enterprise","enterprise bargaining","Queen's Award for Enterprise","enterprise zones"]}]