[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/ent/entra/entrance__us_7.mp3","phonsUS":"/ˈentrəns/","level":"B1","meanings":[{"def":"a door, gate, passage, etc. used for entering a room, building or place","examples":["the front/back/side entrance of the house","A separate entrance leads to the garden.","At last we reached the entrance of the cave.","entrance to something Protesters blocked the entrance to the building.","A lighthouse marks the entrance to the harbour.","at the entrance I'll meet you at the main entrance.","Guards were posted at the entrance.","an entrance hall","He was waiting at the entrance to the cave.","The side entrance is no longer in use.","While the front door is being repaired, please use the side entrance.","There is a back entrance from West Street.","The band left by the rear entrance to escape photographers.","A life-sized mastodon greets visitors at the entrance to the museum.","the entrance into the car park","The little porch marked the entrance to a churchyard.","The building has only one entrance.","She stood firm, blocking the entrance.","She stood in the entrance to the ward."],"opposite":"","synonyms":""},{"def":"the act of entering a room, building or place, especially in a way that attracts the attention of other people","examples":["His sudden entrance took everyone by surprise.","A fanfare signalled the entrance of the king.","She made her entrance after all the other guests had arrived.","The hero makes his entrance (= walks onto the stage) in Scene 2.","After so many years in show business he knew how to make an entrance.","The Prime Minister's entrance to the platform was greeted with loud cheers.","She made a grand entrance once all the guests were assembled."],"opposite":"","synonyms":""},{"def":"the right or opportunity to enter a building or place","examples":["They were refused entrance to the exhibition.","The police were unable to gain entrance to the house.","an entrance fee (= money paid to go into a museum, etc.)","an entrance ticket to the zoo","Is there an entrance fee?","Some of the protesters tried to gain entrance to the meeting."],"opposite":"","synonyms":""},{"def":"the act of becoming involved in something","examples":["The company made a dramatic entrance into the export market.","her entrance into politics"],"opposite":"","synonyms":""},{"def":"permission to become a member of a club, society, university, etc.","examples":["a university entrance exam","What are the entrance requirements for this course?","students hoping to gain entrance to college","entrance (to something) Entrance to the golf club is by sponsorship only."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/ent/entra/entrance__us_2.mp3","phonsUS":"/ɪnˈtræns/","level":"","meanings":[{"def":"to make somebody admire and like somebody/something very much, so they give them/it all their attention","examples":["be entranced (by something) I was entranced by the bird’s beauty.","He listened to her, entranced."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]