[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/ent/entry/entry__us_2.mp3","phonsUS":"/ˈentri/","level":"B1","meanings":[{"def":"an act of going into or getting into a place","examples":["She made her entry to the sound of thunderous applause.","The children were surprised by the sudden entry of their teacher.","They block the entry of the HIV virus into the cells.","entry into something How did the thieves gain entry into the building?","entry to something Efforts to effect an entry to the flooded submarine were unsuccessful.","Drugs come into the country through five main entry points.","There are security checks at the point of entry.","Caesar's triumphal entry into Rome","The children were silenced by the sudden entry of Mrs Robbins.","On my entry they immediately stopped what they were doing.","The champion made his usual dramatic entry into the arena.","She wondered how she could gain entry to the building.","Fire marshals barred entry to the hall.","He found the door locked, but he forced an entry.","New York was the point of entry for most immigrants arriving in the US."],"opposite":"","synonyms":""},{"def":"the right or opportunity to enter a place","examples":["No Entry (= for example, on a sign)","entry to something Entry to the museum is free.","entry into something to be granted/refused entry into the country","Until 1968 Commonwealth citizens were allowed free entry into Britain.","The singer was refused entry to the US.","Hotel guests have free entry to the sports centre.","Entry to the party conference was denied to several journalists.","A sign said: No Entry.","undocumented workers seeking entry to the US","They were later allowed entry into the country.","The sign on the gates read ‘No Unauthorized Entry’.","The landlord had the right of entry to the building with due warning.","The club offers free entry to women on Thursdays.","Entry tickets to most attractions are included in the price of the holiday."],"opposite":"","synonyms":""},{"def":"something that you do, write or make to take part in a competition, for example answering a set of questions","examples":["There have been some impressive entries in the wildlife photography section (= impressive photographs).","The closing date for entries is 31 March.","The winning entry will be published in next month's issue.","The sender of the first correct entry drawn will win a weekend for two in Venice.","Submit your entry by Tuesday 26 March.","one of the best entries to our competition","We have had a lot of entries this year.","We had too many entries for this event.","There were a record 2 000 entries in the under-17 section.","The show attracted entries from all over the country.","Send in your entry as soon as possible!"],"opposite":"","synonyms":""},{"def":"the act of taking part in a competition, race, etc.","examples":["Entry is open to anyone over the age of 18.","an entry form/fee"],"opposite":"","synonyms":""},{"def":"the total number of people who are taking part in a competition, race, etc.","examples":["There's a record entry for this year's marathon."],"opposite":"","synonyms":""},{"def":"an item, for example a piece of information, that is written or printed in a dictionary, an account book, a diary, etc.","examples":["an encyclopedia entry","a blog/diary/journal entry","entry in something There is no entry in his diary for that day.","Very little information is given in the diary entries.","the last entry she made in her diary","Look at the dictionary entry for ‘welcome’.","I post the occasional blog entry.","First examine the entries on the marriage register."],"opposite":"","synonyms":""},{"def":"the act of recording information in a computer, book, etc.","examples":["The job involves filing and data entry."],"opposite":"","synonyms":""},{"def":"the right or opportunity to take part in something or become a member of a group","examples":["entry into something countries seeking entry into the European Union","It is extremely difficult for new companies to gain entry into the market.","entry to something She applied for entry to Nottingham University.","These qualifications will not guarantee you entry into the police force.","The state should reduce entry barriers for developing countries.","The course will ease students' entry into a career.","It has been necessary to restrict entry into the club.","Hungary's entry into the EU","Entry to university should be based on academic potential."],"opposite":"","synonyms":""},{"def":"the act of taking part in an activity or becoming a member of a group","examples":["entry into something Things changed forever with the entry of women into the workforce.","That was before the American entry into the war."],"opposite":"","synonyms":""},{"def":"a door, gate or passage where you enter a building; an entrance hall","examples":["You can leave your umbrella in the entry.","the dramatic entry to the gallery"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["re-entry","entry-level","entry point","forced entry","double-entry bookkeeping","entry points"]}]