[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/env/envir/environment__us_2_rr.mp3","phonsUS":"/ɪnˈvaɪrənmənt/","level":"A2","meanings":[{"def":"the natural world in which people, animals and plants live","examples":["The government should do more to protect the environment.","to preserve/pollute/harm the environment","damage to the natural environment","protection/destruction of the marine environment","The environment minister expressed concern over pollution levels.","the Department of the Environment","pollution of the environment","The label identifies the products that are least harmful to the environment.","factors that have a huge impact on the environment","industries which damage the environment","the amount of carbon in the environment"],"opposite":"","synonyms":""},{"def":"the conditions in which a person, animal or plant lives or operates or in which an activity takes place","examples":["a pleasant work/learning environment","Hospitals have a duty to provide a safe working environment for all staff.","They have created an environment in which productivity should flourish.","Polar bears are totally adapted to their hostile environment.","We operate in a highly competitive business environment.","The tests were carried out in a controlled environment.","An unhappy home environment can affect children’s behaviour.","a pleasant working environment","The island provided an idyllic setting for the concert.","The huts blend in perfectly with their surroundings.","The mountains in the background were capped with snow.","A comfortable working environment will increase productivity.","We aim to provide a pleasant working environment.","An unhappy home environment can affect a child's behaviour.","Children learn best in their home environment.","Cold-blooded animals depend on the temperature of their immediate environment.","In today's competitive business environment, companies focus on minimizing costs.","Investors are showing more caution in the current economic environment.","the political environment","She now had to transfer her design skills to a commercial environment.","The cat walked around, exploring its new environment.","The hospital architect tries to create an environment conducive to healing.","This period provided a favourable environment for the spread of communism.","Walkers can unwittingly damage the fragile environment in which the birds live.","an environment for economic growth","an environment of fear","creatures that have adapted to hostile desert environments","marine life in its natural environment","parents who strive to provide a stimulating environment for their children to grow up in","people working in increasingly competitive environments","the quality of our natural and built environments","For many, school seemed to be a hostile environment.","It didn't take long for them to adapt to the new environment.","Pets may be unsettled in an unfamiliar environment.","The quality of the learning environment is vital to children's education."],"opposite":"","synonyms":"environment"},{"def":"the complete structure (including hardware and software) within which a user, computer or program operates","examples":["a desktop development environment"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Environment Agency","Department for Environment, Food and Rural Affairs","environment-friendly"]}]