[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/equ/equal/equal__us_1.mp3","phonsUS":"/ˈiːkwəl/","level":"B1","meanings":[{"def":"the same in size, quantity, value, etc. as something else","examples":["There is an equal number of boys and girls in the class.","Each side will put in an equal amount of money.","Cut it into four equal parts.","equal in something The two countries are roughly equal in size.","equal to somebody/something One unit of alcohol is equal to half a pint of beer.","An area of forest equal to the size of Wales has been destroyed.","legislation to put Gaelic on an equal footing with English","The decision has attracted both praise and criticism in equal measure (= to the same degree).","Fitness is important in sport, but of at least equal importance are skills.","One pound is roughly equal to two dollars.","The EU nations together have an economy about equal in size to that of the US.","The two books are more or less equal in length.","Their test results were equal in every way.","Three feet is roughly equal to one metre.","We moved some of the better players to make the two sides equal.","Don't you think that both views have equal validity?","Mix the colours in equal amounts.","The company employs men and women in roughly equal proportions.","The ideal would be an equal distribution of wealth between people of different age groups.","The loan is repaid in equal annual instalments."],"opposite":"","synonyms":""},{"def":"having the same rights or being treated the same as other people, without differences such as race, religion or sex being considered","examples":["I believe everyone is born equal.","a society where women and men are equal partners"],"opposite":"","synonyms":""},{"def":"giving people the same rights and opportunities, without differences such as race, religion or sex being considered","examples":["equal rights/pay","The company has an equal opportunities policy (= gives the same chances of employment to everyone).","the desire for a more equal society (= in which everyone has the same rights and chances)","The US constitution guarantees equal protection under the law.","The charity's mission is to help provide equal access to education.","the principles of equal treatment and non-discrimination"],"opposite":"","synonyms":""},{"def":"having the necessary strength, courage and ability to deal with something successfully","examples":["I hope that he proves equal to the challenge.","I felt more than equal to the task.","I felt that nothing could make me equal to the demands being made of me."],"opposite":"","synonyms":""},{"def":"if the conditions stay the same; if other conditions are the same","examples":["All things being equal, we should finish the job tomorrow.","All other things being equal, the bigger fighter should win."],"opposite":"","synonyms":""},{"def":"having the same advantages and disadvantages as somebody else","examples":["Can our industry compete on equal terms with its overseas rivals?"],"opposite":"","synonyms":""},{"def":"although the members of a society, group, etc. appear to be equal, some, in fact, get better treatment than others","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"all/other things being equal","def":"if the conditions stay the same; if other conditions are the same","examples":["All things being equal, we should finish the job tomorrow.","All other things being equal, the bigger fighter should win."]},{"idiom":"on equal terms (with somebody)","def":"having the same advantages and disadvantages as somebody else","examples":["Can our industry compete on equal terms with its overseas rivals?"]},{"idiom":"some (people, members, etc.) are more equal than others","def":"although the members of a society, group, etc. appear to be equal, some, in fact, get better treatment than others","examples":[]}],"phrasal":[],"related":["equal marriage","equal opportunities","separate but equal","Equal Pay Act","Equal Rights Amendment","Equal Opportunities Commission","Equal Employment Opportunity Commission","equal sign","equal signs","equal opportunity","have no equal","be without equal","in some, equal, etc. measure"]},{"pos":"verb","level":"B1","meanings":[{"def":"to be the same in size, quantity, value, etc. as something else","examples":["2x plus y equals 7 (= 2x+y=7)","A metre equals 39.38 inches.","Let x equal the sum of a and b.","Three and three equals six.","Half-year profits equalled the best expectations.","The theatre is equalled in size only by one or two others in the world."],"opposite":"","synonyms":""},{"def":"to be as good as something else or do something to the same standard as somebody else","examples":["This achievement is unlikely ever to be equalled.","Her hatred of religion is equalled only by her loathing for politicians.","With his last jump he equalled the world record.","Maria Theresa displayed a courage and tenacity equalled by very few contemporary rulers.","Natural dyes produce a beauty of tone that has never been equalled by synthetic dyes."],"opposite":"","synonyms":""},{"def":"to lead to or result in something","examples":["Cooperation equals success.","More knowledge equals less prejudice."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"B2","meanings":[{"def":"a person or thing of the same quality or with the same status, rights, etc. as another","examples":["She treats the people who work for her as her equals.","be the equal of somebody/something Our cars are the equal of those produced anywhere in the world.","An interview should be a conversation between equals.","He did not regard himself as her intellectual equal.","He talks even to small children as equals.","I shall never be his equal at chess.","an acceptance of women as the equals of men"],"opposite":"","synonyms":""},{"def":"to be better than anything else or anyone else of the same type","examples":["He is a player without equal.","As a family holiday destination, the seaside has no equal.","His guitar playing is without equal.","In fighting, they had no equals.","As a poet, he had few equals.","When it comes to plain speaking, she has few equals."],"opposite":"","synonyms":""},{"def":"the person or thing with the highest status in a group","examples":["He was regarded as the ‘first among equals’ by the other office clerks."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be without equal | have no equal | have no/few equals","def":"to be better than anything else or anyone else of the same type","examples":["He is a player without equal.","As a family holiday destination, the seaside has no equal.","His guitar playing is without equal.","In fighting, they had no equals.","As a poet, he had few equals.","When it comes to plain speaking, she has few equals."]},{"idiom":"first among equals","def":"the person or thing with the highest status in a group","examples":["He was regarded as the ‘first among equals’ by the other office clerks."]}],"phrasal":[],"related":[]}]