[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/err/error/error__us_2.mp3","phonsUS":"/ˈerər/","level":"A2","meanings":[{"def":"a mistake, especially one that causes problems or affects the result of something","examples":["spelling/typographical/grammatical errors","The report contains some factual errors that must be corrected.","They committed the fatal error of misjudging the weather conditions.","error in something There are too many errors in your work.","error in doing something I think you have made an error in calculating the total.","error of something A simple error of judgement meant that there was not enough food to go around.","an error of fact/principle","a serious/grave error","a glaring error (= a mistake that is very obvious)","in error The computer system was switched off in error (= by mistake.)","There is no room for error in this job.","I get an error message whenever I try to log on.","His attempts to arrange a party ended up as a comedy of errors (= he made so many mistakes it was funny).","It’s a common mistake among learners of English.","spelling mistakes","There are too many errors in your work.","The article is full of inaccuracies.","The report is full of howlers.","Thousands of medical errors occur every year in the nation's hospitals.","No payments were made last week because of a computer error.","Almost all accidents start with a simple error by the pilot.","Do not repeat the errors of your parents and grandparents.","Have the courage to admit your error.","He checked his letter for errors in spelling.","He had committed a grave error in letting them see the document.","He made the fatal error of borrowing more than he could pay back.","He realized his error in not attending the funeral.","His research interests include measurement error in survey research.","I found several factual errors in the report.","I only realized my error when it was too late.","She has avoided the common error of writing too much.","She made several serious errors during the race.","Thank you for catching that silly error on my part.","The Kenyan athlete made a tactical error in starting too fast.","The ability to learn from past errors is vital in business.","The difference is due to a rounding error in the first calculation.","The document contained a lot of typing errors.","The error was pointed out to her by one of her colleagues.","The minister had made an amazing error of judgement.","The paper accidentally printed the victim's address, then compounded their error by printing her name the next day.","The report contained some glaring errors.","The speech contained many errors of fact.","We regret the clerical error made in the letter sent to Mr Finlay.","errors arising from inadequate information","errors caused by illegibly written orders","machines with relatively high error rates","the use of computer systems to reduce hospital errors","He accused the prime minister of committing a serious error of judgement."],"opposite":"","synonyms":"mistake"},{"def":"to realize or admit that you have done something wrong and decide to change your behaviour","examples":["Will they realize the error of their ways before it is too late?"],"opposite":"","synonyms":""},{"def":"the process of solving a problem by trying various methods until you find a method that is successful","examples":["Children learn to use computer programs by trial and error."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"see, realize, etc. the error of your ways","def":"to realize or admit that you have done something wrong and decide to change your behaviour","examples":["Will they realize the error of their ways before it is too late?"]},{"idiom":"trial and error","def":"the process of solving a problem by trying various methods until you find a method that is successful","examples":["Children learn to use computer programs by trial and error."]}],"phrasal":[],"related":["hard error","human error","soft error","error message","error correction","sampling error","standard error","margin of error","error messages"]}]