[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/esc/escap/escape__us_2.mp3","phonsUS":"/ɪˈskeɪp/","level":"B1","meanings":[{"def":"to get away from a place where you have been kept as a prisoner or not allowed to leave","examples":["Two prisoners have escaped.","They were caught trying to escape.","escape from somebody/something He escaped from prison this morning.","She attempted to escape from the pirates holding her hostage.","escape somebody/something She managed to escape her captors.","He escaped prison with two other inmates.","Apparently, they had escaped somehow and gotten home.","He got hurt while struggling to escape.","It was stupid of Lee to let them escape."],"opposite":"","synonyms":""},{"def":"to get away from or avoid something unpleasant or dangerous","examples":["Although he had no idea what life there would be like, he had to take the chance to escape.","escape from something She managed to escape from the burning car.","escape into/to something (figurative) As a child he would often escape into a dream world of his own.","We were able to escape to the countryside during the summer months.","escape with something I escaped with only minor injuries.","+ adj. Both drivers escaped unhurt.","to escape unharmed/uninjured/unscathed","escape something She was lucky to escape punishment.","They were glad to have escaped the clutches of winter for another year.","The pilot escaped death by seconds.","There was no escaping the fact that he was overweight.","escape doing something He narrowly escaped being killed.","I need to escape. I want to go away from here.","It was easy to escape in the confusion of the besieged city.","The survivors barely escape in whatever ships they can find.","pilots who successfully escaped while their aircraft was being shot down","Thieves escaped with property worth over $5 000.","We would always go there to escape from it all.","She eventually escaped to the US.","They escaped into the forest.","She only just escaped with her life.","The driver escaped without injury.","Tony may never escape his emotional struggle.","a lonely man who wants to escape his lifestyle","He had managed to escape the clutches of the police yet again.","Scotland seems to have escaped the worst of the recession.","She managed to escape the fate of the other rebels.","The city largely escaped bombing in the campaign.","So far the robbers have escaped justice.","He fled the country to escape the king's wrath.","The head of department cannot entirely escape responsibility for this situation.","The police will not escape criticism in this affair.","No man can escape his destiny."],"opposite":"","synonyms":""},{"def":"to be forgotten or not noticed","examples":["Her name escapes me (= I can't remember it).","It might have escaped your notice, but I'm very busy at the moment.","errors that had escaped my notice","They're so small they can easily escape notice."],"opposite":"","synonyms":""},{"def":"to get out of a container, especially through a hole","examples":["Put a lid on to prevent heat escaping.","escape into something toxic waste escaping into the sea","The container is sealed so the gas has no means of escaping into the air.","As he twisted the pipe a trickle of water escaped."],"opposite":"","synonyms":""},{"def":"to come out from your mouth without you intending it to","examples":["A groan escaped her lips."],"opposite":"","synonyms":""},{"def":"to try to prevent or avoid loss or damage when it is already too late to do so","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"close, lock, etc. the barn door after the horse has escaped","def":"to try to prevent or avoid loss or damage when it is already too late to do so","examples":[]}],"phrasal":[],"related":["fire escape","escape clause","escape key","escape clauses","make good your escape"]},{"pos":"noun","level":"B1","meanings":[{"def":"the act or a method of escaping from a place or an unpleasant or dangerous situation","examples":["I had a narrow escape (= I was lucky to have escaped).","He had a lucky escape when his car skidded out of control.","As soon as he turned his back, she would make her escape.","escape from something an escape from a prisoner of war camp","There was no hope of escape from her disastrous marriage.","He took an elaborate escape route from South Africa to Britain.","A driver had a lucky escape after a brick was dropped on his car from an overhead bridge.","Celine has been plotting her escape for months.","He had a narrow escape from gunfire.","He made his escape through the window.","He stepped in front of me, blocking my escape.","I made a hasty escape.","She looked around for a means of escape.","The ground became swamped, allowing no escape.","There was clearly no possibility of escape.","Together they formulated an escape plan.","a group of hostages that attempted an escape","one of the greatest escapes of all time","the daring escape of a Resistance fighter from prison"],"opposite":"","synonyms":""},{"def":"a way of forgetting something unpleasant or difficult for a short time","examples":["Craig finds escape in dreams.","escape from something For her, travel was an escape from the boredom of her everyday life.","For many, the ultimate escape is a tranquil beach filled with white sand.","This play offered an escape from the everyday.","city dwellers seeking escape from stress","young people's need for temporary escape from the demanding journey into adulthood"],"opposite":"","synonyms":""},{"def":"the fact of a liquid, gas, etc. coming out of a pipe or container by accident; the amount that comes out","examples":["an escape of gas"],"opposite":"","synonyms":""},{"def":"a button on a computer keyboard that you press to stop a particular operation or leave a program","examples":["Press escape to get back to the menu."],"opposite":"","synonyms":""},{"def":"to manage to escape completely","examples":["He made good his escape from a crowd of journalists by jumping over a barrier.","I found an open door and made good my escape."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"make good your escape","def":"to manage to escape completely","examples":["He made good his escape from a crowd of journalists by jumping over a barrier.","I found an open door and made good my escape."]}],"phrasal":[],"related":[]}]