[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/ess/essay/essay__us_1.mp3","phonsUS":"/ˈeseɪ/","level":"A2","meanings":[{"def":"a short piece of writing by a student as part of a course of study","examples":["I have to write an essay this weekend.","essay on something an essay on the causes of the First World War","essay about somebody/something Have you done your essay about Napoleon yet?","in an essay He made some very good points in his essay.","Essays handed in late will not be accepted.","Have you done your essay yet?","He concludes the essay by calling for a corrective.","I finished my essay about 10 o'clock last night!","Lunch was the only time she could finish her essay assignment.","We have to write an essay on the environment.","You have to answer 3 out of 8 essay questions in the exam.","the teenage winner of an essay contest","We have to write an essay on the causes of the First World War."],"opposite":"","synonyms":""},{"def":"a short piece of writing on a particular subject, written in order to be published","examples":["essay (by somebody) a collection of essays by prominent African American writers","essay on somebody/something The book contains a number of interesting essays on women in society.","essay about somebody/something Pierce contributes a long essay about John F. Kennedy.","in an essay I discuss this in a forthcoming essay.","A version of this essay was presented at the Astronomical Society.","In 2001 she published a collection of essays.","The essays explore Einstein's personal development.","the fifteen essays collected in this volume","‘An Essay on the Principle of Population’ by Thomas Malthus","an essay entitled ‘Memory’","This essay provides a comprehensive overview of the subject."],"opposite":"","synonyms":""},{"def":"an attempt to do something","examples":["His first essay in politics was a complete disaster."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/ess/essay/essay__us_2.mp3","phonsUS":"/eˈseɪ/","level":"","meanings":[{"def":"to try to do something","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]