[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/est/estab/establishment__us_1.mp3","phonsUS":"/ɪˈstæblɪʃmənt/","level":"C1","meanings":[{"def":"an organization, a large institution or a hotel","examples":["The visa is for foreign nationals wishing to study at a university, college or similar educational establishment.","She's now running a small government research establishment.","The hotel is a comfortable and well-run establishment.","the supply of alcohol in licensed establishments","He was the head of a large residential establishment for severely disabled children."],"opposite":"","synonyms":""},{"def":"the people in a society or a profession who have influence and power and who usually do not support change","examples":["the medical/military/political, etc. establishment","young people rebelling against the Establishment","The members were drawn from the ranks of the Establishment.","orthodox Establishment views","O'Connor challenged the liberal establishment on many things.","The British Establishment is very slow to accept change.","a pillar of the liberal establishment","the Washington media establishment","the mainstream political establishment"],"opposite":"","synonyms":""},{"def":"the act of starting or creating something that is meant to last for a long time","examples":["The speaker announced the establishment of a new college.","His visit facilitated the establishment of diplomatic relations between the countries.","the formal establishment of the republic in 1948","a law allowing the establishment of private television stations","With the establishment of major new markets, the economy is thriving.","We would like to encourage the establishment of new farm businesses.","This report led to the establishment of a special committee to investigate the matter.","The months that followed saw the establishment of a strong military presence in the region.","The commission is calling for the establishment of a national holiday.","Opposition MPs are calling for the establishment of an independent food and drugs agency."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Eastern Establishment","Establishment Clause"]}]