[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/est/estab/establish__us_2.mp3","phonsUS":"/ɪˈstæblɪʃ/","level":"B2","meanings":[{"def":"to start or create an organization, a system, etc. that is meant to last for a long time","examples":["The committee was established in 1912.","They now hope to establish a centre in Cuba.","The company established a base in Florida last year.","to establish a state/government/group/school","to establish standards/principles","Let’s establish some ground rules.","The proposal would establish a system of inspections of prisons worldwide.","They are establishing a network of pumps and pipelines to move the oil.","The new treaty establishes a free trade zone.","Its goal is to establish a fund which will support young people in need of help.","He sought to establish a dynasty as well as a business empire.","The king supported efforts to establish an opera company in England.","They have established a basic framework of ground rules for discussions.","The internet was originally established by scientists to share information.","The League was formally established in 1920.","We have successfully established clear rules that most students accept.","A straightforward complaints procedure must be established from the outset.","Settlers established a new colony in the early 18th century.","The Americans established a naval base on the island in the 1960s.","The Romans established a settlement on the south shore.","The generals established a military dictatorship.","The nuns established a convent here in 1692."],"opposite":"","synonyms":""},{"def":"to start having a relationship, especially a formal one, with another person, group or country","examples":["to establish relations/links/contacts/connections","The school is trying to establish a relationship with the local community.","The two countries agreed to establish full diplomatic relations.","We try to establish links with schools."],"opposite":"","synonyms":""},{"def":"to hold a position for long enough or succeed in something well enough to make people accept and respect you","examples":["establish somebody/something/yourself He has now firmly established his position in the organization.","The school has established a reputation for academic excellence.","It took him a long time to establish himself.","He has just set up his own business but it will take him a while to get established.","establish somebody/something/yourself as something The exhibition helped to establish her as an artist.","By then she was established as a star.","establish somebody/something/yourself in something Not long after that she established herself in business.","It was his second symphony that established him.","She has established herself as one of the country's top new female artists.","He quickly established his reputation as a popular musician.","We have now clearly established ourselves as the leader in the market."],"opposite":"","synonyms":""},{"def":"to make people accept a belief, claim, custom etc.","examples":["establish something This success helped to establish the practice of vaccination.","Traditions get established over time.","It was the outbreak of the Second World War that established the tradition of the monarch's Christmas broadcast.","establish something as something The festival has become established as an annual event."],"opposite":"","synonyms":""},{"def":"to discover or prove the facts of a situation","examples":["establish something Police are still trying to establish the cause of the accident.","There will be an investigation to establish the facts.","We are still trying to establish the identity of the dead man.","His guilt has been clearly established.","The effectiveness of the new drug has not yet been scientifically established.","establish that… They have established that his injuries were caused by a fall.","establish where, what, etc… We need to establish where she was at the time of the shooting.","it is established that… It has since been established that the horse was drugged."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]