[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/est/estim/estimate__us_2.mp3","phonsUS":"/ˈestɪmeɪt/","level":"B2","meanings":[{"def":"to form an idea of the cost, size, value etc. of something, but without calculating it exactly","examples":["estimate something to estimate the cost/value/number of something","The satellite will cost an estimated £400 million.","estimate something at something Police estimate the crowd at 30 000.","estimate something from something All variables can be estimated from the data.","estimate something as something The number of breeding pairs was estimated as the number of pairs building nests.","estimate something to do something The deal is estimated to be worth around $1.5 million.","estimate (that)… We estimated (that) it would cost about €5 000.","it is estimated (that)… It is estimated (that) the project will last four years.","estimate how many, large, etc… It is hard to estimate how many children have dyslexia.","Estimate the time it will take to complete each section.","Samples are usually used to estimate paramaters.","The scale of the problem has been estimated by a number of different surveys.","This made it possible to estimate the effect of workplace ventilation.","The results of the survey were used to estimate the preferences of the population at large.","The strike was officially estimated to have cost $80 million.","We estimated that the distance would be roughly 200 km.","It is conservatively estimated that not less than half a million people died in the famine."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/est/estim/estimate__us_1.mp3","phonsUS":"/ˈestɪmət/","level":"B2","meanings":[{"def":"a judgement that you make without having the exact details or figures about the size, amount, cost, etc. of something","examples":["to provide/obtain an estimate","estimate of something I can give you a rough estimate of the amount of wood you will need.","What is the latest estimate of the number of chimpanzees in the wild?","official government estimates of traffic growth over the next decade","a ballpark estimate (= an approximate estimate)","At least 5 000 people were killed, and that's a conservative estimate (= the real figure will be higher).","estimate for something Using this index would produce a lower estimate for the rate of inflation.","estimate from something The map is the best estimate from the data available.","according to an estimate Losses totalled $1.87 billion last year, according to estimates.","The paper presents estimates based on census figures.","According to the highest estimate, over 100 000 men died in the battle.","By one estimate she earns $80 million a year.","Can you make an estimate of the numbers involved?","Casualty estimates vary considerably.","Current estimates suggest that supplies will run out within six months.","Flight times in the brochure are based on our best estimate, and will be confirmed as soon as possible.","Inaccurate estimates can lead to overproduction.","Inflation could rise by 15 per cent according to the latest estimate.","The manufacturers will not make precise estimates.","The slump is causing analysts to revise earnings estimates for next year."],"opposite":"","synonyms":""},{"def":"a statement of how much a piece of work will probably cost","examples":["I asked a couple of local builders for estimates.","We got estimates from three firms and accepted the lowest.","estimate for something Two companies submitted estimates for the work.","We'll send you an estimate for the repairs.","estimate of something an estimate of £300"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]