[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/eve/eveni/evening__us_1.mp3","phonsUS":"/ˈiːvnɪŋ/","level":"A1","meanings":[{"def":"the part of the day between the afternoon and the time you go to bed","examples":["Remember to call me this evening.","We haven't spoken to him since yesterday evening.","I'll see you tomorrow evening.","Come over on Thursday evening.","in the evening What do you usually do in the evening?","Mosquitoes usually bite in the early evening.","for the evening She's going to her sister's for the evening.","on the evening of on the evening of May 15","He hardly spoke throughout the evening.","We spent many enjoyable summer evenings together.","I found it in the pocket of the jacket I had been wearing the previous evening.","The evening meal is served at 7 p.m.","She watched the evening news at 6 p.m. as usual.","As the evening wore on, Sam became more and more unhappy.","Jim's comedy routine was the highlight of the evening's entertainment.","Evening was falling by the time we reached the house.","He spent the entire evening chatting with friends.","I don't want to ruin your evening.","It was early evening and very still.","The two spent a romantic evening together.","We spent the evening walking around the town.","We started our evening by watching TV.","What a way to end an evening!","You deserve an occasional evening out.","a popular place to hang out on weekday evenings","thoroughly enjoying a quiet evening at home","the cool evening air","I'll come and see you this evening.","The evening performance begins at 7.30.","The ball would take place the following evening."],"opposite":"","synonyms":""},{"def":"an event of a particular type happening in the evening","examples":["a musical evening at school (= when music is performed)","the school parents' evening (= when parents are invited to talk to teachers about their children's progress)","Prospective students were invited to the school's open evening.","He hosted the evening in front of a celebrity audience.","The club will hold a social evening to welcome new members.","The orchestra opened the evening with an overture."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["evening class","evening dress","evening gown","evening paper","good evening","evening primrose","evening star","Evening Standard","Manchester Evening News","Saturday Evening Post","evening classes","evening dresses","evening papers","evening primroses","the other day/morning/evening/week"]}]