[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/eve/event/event__us_1.mp3","phonsUS":"/ɪˈvent/","level":"A1","meanings":[{"def":"a thing that happens, especially something important","examples":["recent/current/world events","The tragic events of last Monday occurred only 200 metres from the shore.","Historians long ago established that the event never happened.","TV viewers watched in horror as events unfolded.","a dramatic turn of events (= change in what is happening)","Everyone was frightened by the strange sequence of events.","The police have reconstructed the chain of events leading to the murder.","an unfortunate series of events","Why should we believe his version of events (= description of what happened from his point of view)?","The decisions we take now may influence the course of events (= the way things happen) in the future.","In the normal course of events (= if things had happened as expected) she would have gone with him.","He found that the report he had written had been overtaken by events (= it was no longer relevant).","(medical) A minority of patients suffered adverse events, including heart attacks.","The election was the main event of 2017.","Carter related the events of the past hour to him.","Outside big cities, murder is a rare event.","Subsequent events proved him wrong.","Today is the hospital's fiftieth anniversary, and there will be a party to mark the event.","When the ship finally reached land, only a few of the crew were left to witness the event.","Would it have been possible to change the course of events?","These events quickly led to confusion.","in-depth articles related to current events","our inability to forecast future events","recent events in Saudi Arabia","In the light of later events the decision was proved right."],"opposite":"","synonyms":""},{"def":"a planned public or social occasion","examples":["Is the city ready to host such a major sporting event?","The hospital is organizing a special fundraising event.","They were invited to attend the social event of the year.","As always, the annual event will be held in the grounds of the house.","Events are taking place throughout the summer to celebrate the city's centenary.","Forty such events are scheduled this year.","I would like to thank everyone who attended our charity evening for supporting the event.","They sponsored various community events.","a black-tie event at the Waldorf Astoria","a new international art event","a special opening-night gala event","Details of meetings and social events are sent out to all club members.","She had spent a lot money and effort on an event that turned out to be a disaster.","Forthcoming events are listed on the back page of the local newspaper.","The Birmingham meeting is one of the most prestigious events in the racing calendar."],"opposite":"","synonyms":""},{"def":"one of the races or competitions in a sports programme","examples":["The 800 metres is the fourth event of the afternoon.","Local winners compete in a national event in September.","African runners swept the medals in the distance events.","The team events will take place later this week.","He will represent Scotland in the team event.","It was a season in which he won four USPGA Tour events.","The raft race was one of the final events of the River Festival."],"opposite":"","synonyms":""},{"def":"after something has happened","examples":["I knew nothing about it until after the event."],"opposite":"","synonyms":""},{"def":"to understand something, or realize what you should have done, only after something has happened","examples":["Anyone can be wise after the event."],"opposite":"","synonyms":""},{"def":"the birth of a baby","examples":[],"opposite":"","synonyms":""},{"def":"used to emphasize or show that something is true or will happen despite other circumstances","examples":["I think she'll agree to do it but in any event, all she can say is ‘no’.","I think the economy will recover in any event."],"opposite":"","synonyms":""},{"def":"when the situation actually happened","examples":["I got very nervous about the exam, but in the event, I needn't have worried; it was really easy.","In the event though, the dinner was a very entertaining affair."],"opposite":"","synonyms":""},{"def":"if something happens","examples":["In the event of an accident, call this number.","Sheila will inherit everything in the event of his death.","In the unlikely event of a crash, please remain calm."],"opposite":"","synonyms":""},{"def":"if that happens","examples":["In that event, we will have to reconsider our offer."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"after the event","def":"after something has happened","examples":["I knew nothing about it until after the event."]},{"idiom":"be wise after the event","def":"to understand something, or realize what you should have done, only after something has happened","examples":["Anyone can be wise after the event."]},{"idiom":"a happy event","def":"the birth of a baby","examples":[]},{"idiom":"in any event | at all events","def":"used to emphasize or show that something is true or will happen despite other circumstances","examples":["I think she'll agree to do it but in any event, all she can say is ‘no’.","I think the economy will recover in any event."]},{"idiom":"in the event","def":"when the situation actually happened","examples":["I got very nervous about the exam, but in the event, I needn't have worried; it was really easy.","In the event though, the dinner was a very entertaining affair."]},{"idiom":"in the event of something | in the event that something happens","def":"if something happens","examples":["In the event of an accident, call this number.","Sheila will inherit everything in the event of his death.","In the unlikely event of a crash, please remain calm."]},{"idiom":"in that event","def":"if that happens","examples":["In that event, we will have to reconsider our offer."]}],"phrasal":[],"related":["non-event","field event","track event","event manager","event planner","event management","event planning","event managers"]}]