[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/evi/evide/evidence__us_1.mp3","phonsUS":"/ˈevɪdəns/","level":"A2","meanings":[{"def":"the facts, signs or objects that make you believe that something is true","examples":["evidence (of something) Researchers have found clear scientific evidence of a link between exposure to sun and skin cancer.","evidence for something There is a growing body of evidence for the existence of black holes that are ten times as massive as the Sun.","evidence that… There is not a shred of evidence that the meeting actually took place.","evidence to suggest, support, show, etc. Have you any evidence to support this allegation?","The study provides empirical evidence (= based on experiments or experience) to prove that the drug has no long-term side effects.","Anecdotal evidence (= based on personal accounts) suggests that drivers over the age of 70 find it difficult to get insurance.","on the evidence of something On the evidence of their recent matches, it is unlikely the Spanish team will win.","In the absence of evidence to the contrary, it should be assumed that proper procedures were followed.","There is clear evidence that TV advertising influences what children buy.","It is clear from numerous studies that TV advertising influences what children buy.","Recent research demonstrates that TV advertising influences children’s spending habits.","Many parents think that TV advertising influences their children. This view is supported by the findings of a recent study, which show a clear link between television advertisements and children’s spending habits.","The findings also reveal that most children are unaware of the persuasive purpose of advertising.","There is little evidence that children understand the persuasive intent of advertising.","The results contradict claims that advertising is unrelated to children’s spending habits.","Manufacturers argue that it is difficult to prove that advertising alone influences what children buy.","We found further scientific evidence for this theory.","The room bore evidence of a struggle.","She mulled over these scraps of evidence.","The first chapter reviews the evidence on how children learn language.","No new evidence has contradicted this research.","Another team of scientists has come up with conflicting evidence.","Available evidence points to pilot error as the cause of the crash.","The company denies, in the face of overwhelming evidence, that smoking causes cancer.","The team cited evidence from a recent earthquake to back up their idea.","Archaeologists found evidence of a rich and varied culture at the settlement.","Scientists are looking for evidence of life on other planets.","The figures provide concrete evidence of the bank's claim to provide the best service.","He says he's been working hard, but I haven't seen any evidence of it.","The tapes provided evidence of her intentions.","The rise in crime is often cited as evidence of a general breakdown of authority.","The scandal is damning evidence of the government's contempt for democracy.","He cited Australia's sporting success as evidence for his theory.","I'll accept this as prima facie evidence that there might be a problem.","There is ample evidence that the world is getting hotter.","Evidence indicates that the true death toll could be as high as 40 000.","Scientists have found fresh evidence to suggest that a huge explosion led to the death of the dinosaurs."],"opposite":"","synonyms":""},{"def":"the information that is used in court to try to prove something","examples":["I was asked to give evidence (= to say what I knew, describe what I had seen, etc.) at the trial.","The defence accused the prosecution of withholding several key pieces of evidence.","circumstantial/forensic evidence","evidence against somebody Despite a lack of evidence against him, Burton will appear in court next week.","He was released when the judge ruled there was no evidence against him.","as evidence of something The emails were presented as evidence of his involvement in the fraud.","in evidence The police officer took a statement which was later used in evidence.","The jury heard evidence from 38 witnesses.","They will weigh this evidence and come to a rational conclusion.","They convicted the wrong man on the basis of a signed confession with no corroborative evidence.","There was a mass of circumstantial evidence linking Watson to the murder.","The team have been collecting evidence about war crimes.","A photo of the victim's injuries was produced in evidence.","The judge can decide whether to admit or exclude evidence.","The court was shown photographic evidence.","evidence linking her to the crime","She admitted giving false evidence to the court.","Prosecutors say they destroyed evidence related to the case.","In the light of new evidence, a new enquiry into the crash is likely to take place."],"opposite":"","synonyms":""},{"def":"(considering) the evidence on both sides of an argument, to find the most likely reason for or result of something","examples":["The balance of evidence suggests the Liberal party's decline began before the First World War.","The coroner thought that on the balance of probabilities, the pilot had suffered a stroke just before the crash."],"opposite":"","synonyms":""},{"def":"(to be) present and clearly seen","examples":["The police were much in evidence at today's demonstration.","a trend that has been much in evidence in recent years"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"(on) the balance of evidence/probability","def":"(considering) the evidence on both sides of an argument, to find the most likely reason for or result of something","examples":["The balance of evidence suggests the Liberal party's decline began before the First World War.","The coroner thought that on the balance of probabilities, the pilot had suffered a stroke just before the crash."]},{"idiom":"(be) in evidence","def":"(to be) present and clearly seen","examples":["The police were much in evidence at today's demonstration.","a trend that has been much in evidence in recent years"]}],"phrasal":[],"related":["King’s evidence","Queen’s evidence","state’s evidence","Police and Criminal Evidence Act","(on) the balance of evidence/probability","(on) the balance of probability/evidence"]},{"pos":"verb","level":"","meanings":[{"def":"to prove or show something; to be evidence of something","examples":["as evidenced by something The legal profession is still a largely male world, as evidenced by the small number of women judges.","be evidenced in something The scale of the problem is not evidenced in police statistics."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]