[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exa/exact/exact__us_1.mp3","phonsUS":"/ɪɡˈzækt/","level":"A2","meanings":[{"def":"correct in every detail","examples":["The new palace is an exact replica of the original building.","It is an exact copy of the original document.","The model is exact in every detail.","For now they are keeping the exact date and location of the wedding a secret.","The exact nature of her illness (= precisely what her illness is) has not been made public.","Her second husband was the exact opposite of her first (= completely different).","The colours were an almost exact match.","She's in her mid-thirties—thirty-six to be exact.","(informal) I had the exact same problem as you when I first started.","What were his exact words?","A clear definition requires very exact wording.","Nobody knows the exact number of people affected, but it is over 10 000.","He started to phone me at the exact moment I started to phone him (= at the same time).","We need to know the exact time the incident occurred.","She gave an exact description of the attacker.","The two men were exact contemporaries at university."],"opposite":"","synonyms":""},{"def":"very accurate and careful about details","examples":["He was very exact about everything he did."],"opposite":"","synonyms":""},{"def":"using accurate measurements and following set rules","examples":["Assessing insurance risk can never be an exact science."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to demand and get something from somebody","examples":["She was determined to exact a promise from him.","No doubt they will exact payment in due course."],"opposite":"","synonyms":""},{"def":"to make something bad happen to somebody","examples":["exact something He exacted (= took) a terrible revenge for their treatment of him.","exact something from somebody Stress can exact a high price from workers (= can affect them badly)."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]