[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exa/examp/example__us_5.mp3","phonsUS":"/ɪɡˈzæmpl/","level":"A1","meanings":[{"def":"something such as an object, a fact or a situation that shows, explains or supports what you say","examples":["Let me give you an example.","It is important to cite examples to support your argument.","to provide/offer an example","I shall take four different examples from contemporary literature to illustrate my point.","example of something Can you show me an example of what you mean?","This dictionary has many examples of how words are used.","Just to give you an example of his generosity—he gave me his old car and wouldn't take any money for it.","The progress the students have made serves as an example of the benefit of small class sizes.","By way of example, we'll look at our most recent advertising campaign.","The website has a variety of interactive exercises (e.g. matching games, crosswords and quizzes).","The website has a variety of interactive exercises, including matching games, crosswords and quizzes.","Internet technologies, such as wikis, blogs and social networking sites, have changed the way that people find information and interact with it.","Many websites allow users to contribute information. A good example of this is the ‘wiki’, a type of website that anyone can edit.","Wikis vary in how open they are. For example, some wikis allow anybody to edit content, while others only allow registered users to do this.","Wikis vary in how open they are. Some wikis, for example/for instance, allow anybody to edit content, while others only allow registered users to do this.","More and more people read their news on the internet. To take one example, over 14 million people now read the online version of ‘The Oxford Herald’.","Online newspapers are now more popular than paper ones. ‘The Oxford Herald’ is a case in point. Its print circulation has fallen in recent years, while its website attracts millions of users every month.","Consider the following example…","He uses a number of historical examples to support his thesis.","Let me give a concrete example of what I mean.","The book is full of practical examples of classroom activities.","The leaflet includes several examples of bad grammar.","The teacher in our example is clearly wrong.","These examples suggest that there is a connection between the two processes.","This is far from an isolated example.","To take an obvious example, if there is a good harvest the price of grain will fall.","Twenty-seven examples are presented in this video.","We can still find examples of discrimination today.","We've seen other examples of this same problem recently.","a book filled with real-life examples that anyone can relate to","a telling example of how difficult it can be to succeed in business","the example shown in Figure 2"],"opposite":"","synonyms":""},{"def":"a thing that is typical of or represents a particular group or set","examples":["This is a good example of the artist's early work.","It is a perfect example of this type of architecture.","Japan is often quoted as the prime example of a modern industrial nation.","It is a classic example of how not to design a new city centre.","Can you give me an example of what you mean?","In some cases people have had to wait several weeks for an appointment.","The report highlights a number of instances of injustice.","The aquarium has some interesting specimens of unusual tropical fish.","The statistics are a clear illustration of the point I am trying to make.","The film was held up as an example of good cinema.","This is a classic example of a badly designed building.","This is among the worst examples of corporate greed.","a magnificent example of 18th-century architecture","His treatment of his secretary was a blatant example of managerial arrogance."],"opposite":"","synonyms":"example"},{"def":"a person or their behaviour that is thought to be a good model for others to copy","examples":["example to somebody Her courage is an example to us all.","example for somebody He sets an example for the other students.","example of something She is a shining example of what people with disabilities can achieve.","by example He is a captain who leads by example.","Top management should be seen to lead by example."],"opposite":"","synonyms":""},{"def":"a person’s behaviour, either good or bad, that other people copy","examples":["It would be a mistake to follow his example.","They started to plan protests, inspired by the example of their neighbours."],"opposite":"","synonyms":""},{"def":"used to emphasize something that explains or supports what you are saying; used to give an example of what you are saying","examples":["There is a similar word in many languages, for example in French and Italian.","The report is incomplete; it does not include sales in France, for example.","It is possible to combine computer science with other subjects, for example physics.","An athlete, for example, might turn the pedals 80 times a minute.","The website has a variety of interactive exercises (e.g. matching games, crosswords and quizzes).","The website has a variety of interactive exercises, including matching games, crosswords and quizzes.","Internet technologies, such as wikis, blogs and social networking sites, have changed the way that people find information and interact with it.","Many websites allow users to contribute information. A good example of this is the ‘wiki’, a type of website that anyone can edit.","Wikis vary in how open they are. For example, some wikis allow anybody to edit content, while others only allow registered users to do this.","Wikis vary in how open they are. Some wikis, for example/for instance, allow anybody to edit content, while others only allow registered users to do this.","More and more people read their news on the internet. To take one example, over 14 million people now read the online version of ‘The Oxford Herald’.","Online newspapers are now more popular than paper ones. ‘The Oxford Herald’ is a case in point. Its print circulation has fallen in recent years, while its website attracts millions of users every month."],"opposite":"","synonyms":""},{"def":"to punish somebody as a warning to others not to do the same thing","examples":["The teacher made an example of him by suspending him from school."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"for example","def":"used to emphasize something that explains or supports what you are saying; used to give an example of what you are saying","examples":["There is a similar word in many languages, for example in French and Italian.","The report is incomplete; it does not include sales in France, for example.","It is possible to combine computer science with other subjects, for example physics.","An athlete, for example, might turn the pedals 80 times a minute.","The website has a variety of interactive exercises (e.g. matching games, crosswords and quizzes).","The website has a variety of interactive exercises, including matching games, crosswords and quizzes.","Internet technologies, such as wikis, blogs and social networking sites, have changed the way that people find information and interact with it.","Many websites allow users to contribute information. A good example of this is the ‘wiki’, a type of website that anyone can edit.","Wikis vary in how open they are. For example, some wikis allow anybody to edit content, while others only allow registered users to do this.","Wikis vary in how open they are. Some wikis, for example/for instance, allow anybody to edit content, while others only allow registered users to do this.","More and more people read their news on the internet. To take one example, over 14 million people now read the online version of ‘The Oxford Herald’.","Online newspapers are now more popular than paper ones. ‘The Oxford Herald’ is a case in point. Its print circulation has fallen in recent years, while its website attracts millions of users every month."]},{"idiom":"make an example of somebody","def":"to punish somebody as a warning to others not to do the same thing","examples":["The teacher made an example of him by suspending him from school."]}],"phrasal":[],"related":["for example"]}]