[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exa/exami/examination__us_4.mp3","phonsUS":"/ɪɡˌzæmɪˈneɪʃn/","level":"B2","meanings":[{"def":"a formal written, spoken or practical test, especially at school or college, to see how much you know about a subject, or what you can do","examples":["successful candidates in GCSE examinations","examination in something to sit an examination in mathematics","examination for something In 1864 he passed the examination for the Indian Civil Service.","Applicants are selected for jobs on the results of a competitive examination.","He failed his examination in history.","He has just completed his final examinations at London University.","He was marking school examination papers during the summer vacation.","One of the teacher's principal duties is to prepare students for external examinations.","She will take her examinations later this year.","Students may enter for both examinations.","The examinations are set by individual teachers.","The stiff entrance examination removes 60 per cent of prospective students.","an examination on human anatomy","the faults in the examination system","There has been a fall in the number of examination candidates."],"opposite":"","synonyms":""},{"def":"the act of looking at or considering something very carefully","examples":["Careful examination of the ruins revealed an even earlier temple.","The issue needs further examination.","The review is the most detailed examination of policing since 1992.","The chapter concludes with a brief examination of some of the factors causing family break-up.","after (an) examination After a thorough examination, they announced that the suspicious device was harmless.","on examination On closer examination it was found that the signature was not genuine.","under examination Your proposals are still under examination.","examination by somebody The party would open up the issue to examination by a Senate Committee.","Constraints of space do not permit a thorough examination of all of these points.","His ideas about social change do not stand up to close examination.","The school curriculum has undergone critical examination in recent years.","This argument requires examination from several angles."],"opposite":"","synonyms":""},{"def":"a close look at something/somebody, especially to see if there is anything wrong or to find the cause of a problem","examples":["a medical/physical examination","a post-mortem/forensic examination","Regular breast examination is advised.","A specialist should carry out an examination of the patient.","Diagnosis can be made only by direct examination of affected brain tissue.","examination by somebody Further examination by an orthopaedic surgeon will be needed today.","A visual examination corroborated this.","I was advised to have a full eyesight examination.","Patients were asked to lie on the examination table.","She lay on the examination couch and waited for the doctor to return.","They rushed her into the examination room.","We did examinations on the bodies.","We will make a more thorough examination of the area later.","a microscopic examination of the cell structure","a periodic health examination","a routine breast examination","genital checks and other intimate examinations"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["cross-examination","re-examination","self-examination","exit examination","medical examination","physical examination","post-mortem examination","Graduate Record Examination"]}]