[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exa/exam_/exam__us_1.mp3","phonsUS":"/ɪɡˈzæm/","level":"A1","meanings":[{"def":"a formal written, spoken or practical test, especially at school or college, to see how much you know about a subject, or what you can do","examples":["to take an exam","to pass/fail an exam","(British English) I hate doing exams.","(British English, formal) to sit an exam","(British English) to mark an exam","(North American English) to grade an exam","I failed the college entrance exam (= to get a place at college).","exam in something Every term we would have exams in maths, English, French, etc.","in an exam (British English) She did well in her exams.","on an exam (North American English) She did well on her exams.","an exam paper","I got my exam results today.","A lot of students suffer from exam nerves.","a trivia quiz","a quiz show.","As soon as the exams are over I'm going on holiday.","Candidates found cheating in any exam will be disqualified from all their exams.","Girls were doing better than boys in many school exams.","He did badly in his history exam.","I can't go out because I'm revising for end of year exams.","Sample exam questions are also provided for each chapter.","Offences included taking mobile phones, books or notes into the exam room.","I just finished my last law school exam.","I wrote two awful essays and was lucky to scrape through the exam.","In spite of her worries, she passed the exam with flying colours.","The exam format has been changed to include multiple choice questions.","The final exam is set by a board of professors.","The midterm exams are coming up.","The regional exam boards all get together regularly to ensure equal standards.","There is a subdued atmosphere in the school at exam time.","We had an English exam on this play.","a Master's program's comprehensive exam","an exam for nurses","an exam for school leavers","an exam in chemistry","the California high-school exit exam","the New York state bar exam","He's practising hard for his piano exam.","I got my exam grades/​scores today."],"opposite":"","synonyms":""},{"def":"a medical test of a particular part of the body","examples":["an eye exam","She carried out a thorough exam and didn't find anything unusual.","The doctor will then perform a physical exam on the child.","The follow-up exams showed the baby was healthy.","You should have a clinical breast exam every year.","an ultrasound exam of the baby"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["exit exam"]}]