[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exa/exami/examine__us_1.mp3","phonsUS":"/ɪɡˈzæmɪn/","level":"B1","meanings":[{"def":"to consider or study an idea, a subject, etc. very carefully","examples":["examine something This study sets out to examine in detail the possible effects of climate change.","Her new show critically examines the relationship between the arts and popular culture.","This important issue must be carefully examined.","Only recently have historians begun to examine the impact and influence of these changes.","examine how, what, etc… It is necessary to examine how the proposals can be carried out.","The weather gave researchers an opportunity to examine what happens to insect numbers when temperatures rise.","These ideas will be examined in more detail in Chapter 10.","The job involves gathering and analysing data.","He tried to analyse his feelings.","The government will review the situation later in the year.","We will study the report carefully before making a decision.","This topic will be discussed at greater length in the next chapter.","The book is about homeless people in the cities.","The report deals with the issue of homelessness in London.","The writer discusses the problems faced by homeless people.","The article presents an overview of the issues surrounding homelessness.","The novel explores the theme of friendship among homeless people.","The first chapter examines the relationship between homelessness and drug addiction.","The paper considers the question of why so many young people become homeless.","These ideas will be examined in more detail in Chapter 10.","Critically examine your work as if you were looking at someone else's efforts.","He didn't even bother to examine the note.","He fails to examine the implications of such a development.","It is instructive to examine the data we have so far.","Let us examine the implications of this theory.","This claim needs to be examined separately.","We continue to examine new ways of doing business."],"opposite":"","synonyms":"examine"},{"def":"to look at somebody/something closely, to see if there is anything wrong or to find the cause of a problem","examples":["examine somebody/something The doctor examined her carefully but could find nothing wrong.","to be examined by a doctor/psychiatrist/specialist/vet","examine yourself She examined herself closely in the mirror.","examine something/somebody for something The samples were examined under the microscope for the presence of damaged cells.","The goods were examined for damage on arrival.","Investigators examined the room minutely for clues.","Check your work before handing it in.","The goods were examined for damage on arrival.","Make sure you inspect the goods before signing for them.","The Tourist Board inspects all recommended hotels at least once a year.","Go over your work for spelling mistakes before you hand it in."],"opposite":"","synonyms":"check"},{"def":"to give somebody a test to see how much they know about a subject or what they can do","examples":["be examined in something The students will be examined in all subjects at the end of term.","be examined on something You are only being examined on this semester's work.","be examined The course is externally examined (= arranged and marked by somebody from outside a school, a university or an organization)."],"opposite":"","synonyms":""},{"def":"to ask somebody questions formally, especially in court","examples":["The prosecution examined 20 witnesses."],"opposite":"","synonyms":""},{"def":"to be crazy","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"need (to have) your head examined","def":"to be crazy","examples":[]}],"phrasal":[],"related":["re-examine","cross-examine"]}]