[{"pos":"preposition","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exc/excep/except__us_1.mp3","phonsUS":"/ɪkˈsept/","level":"A2","meanings":[{"def":"used before you mention the only thing or person about which a statement is not true","examples":["We work every day except Sunday.","They all came except Matt.","I had nothing on except for my socks.","What other sports do you like besides football?","I like all sports except football.","What other sports do you like apart from football?","I like all sports apart from football.","She wrote all of the songs on the album except for the final track.","Apart from/aside from the final track, all of the songs on the album were written by her.","The songwriting—with a few minor exceptions—is of a very high quality.","With only one or two exceptions, the songwriting is of a very high quality.","The majority of the compositions are less than three minutes long, with the notable exception of the title track.","With the exception of the title track, this album is a huge disappointment.","Here is a list of all the band’s CDs, excluding unofficial ‘bootleg’ recordings."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"conjunction","level":"B1","meanings":[{"def":"used before you mention something that makes a statement not completely true","examples":["I didn't tell him anything except that I needed the money.","Our dresses were the same except mine was red."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to not include somebody/something","examples":["be excepted (from something) Children under five are excepted from the survey.","Tours are arranged all year round (January excepted)."],"opposite":"","synonyms":""},{"def":"used after being rude or critical about somebody to say that the people you are talking to are not included in the criticism","examples":["The people in this office are so narrow-minded, present company excepted, of course."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"present company excepted","def":"used after being rude or critical about somebody to say that the people you are talking to are not included in the criticism","examples":["The people in this office are so narrow-minded, present company excepted, of course."]}],"phrasal":[],"related":[]}]