[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exc/exces/excess__us_1.mp3","phonsUS":"/ɪkˈses/","level":"C1","meanings":[{"def":"more than is necessary, reasonable or acceptable","examples":["You can throw away any excess.","excess of something Are you suffering from an excess of stress in your life?","In an excess of enthusiasm I agreed to work late.","to excess He started drinking to excess after losing his job.","in excess of something The increase will not be in excess of (= more than) two per cent.","‘Avoid excess’ is the golden rule for a healthy life.","a large excess of gas","His statements cannot be simply dismissed as rhetorical excess.","The car can travel at speeds in excess of 150 miles per hour.","The drug can be harmful if taken in excess."],"opposite":"","synonyms":""},{"def":"an amount by which something is larger than something else","examples":["We cover costs up to £600 and then you pay the excess."],"opposite":"","synonyms":""},{"def":"the part of an insurance claim that a person has to pay while the insurance company pays the rest","examples":["There is an excess of £100 on each claim under this policy.","Increasing the excess on home insurance from the standard £50 to £100 is likely to save 15%."],"opposite":"","synonyms":""},{"def":"the fact of doing too much of something, especially eating or drinking","examples":["He gave in to bouts of alcoholic excess."],"opposite":"","synonyms":""},{"def":"extreme behaviour that is unacceptable, illegal or morally wrong","examples":["We need a free press to curb government excesses.","legislation to control the worst excesses of the press and the courts in relation to rape cases","Washington has always been a city of wretched excesses.","the worst excesses committed by the occupying army"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["excess baggage"]},{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exc/exces/excess__us_2_rr.mp3","phonsUS":"/ˈekses/","level":"C1","meanings":[{"def":"in addition to an amount that is necessary, usual or legal","examples":["Excess food is stored as fat.","Driving with excess alcohol in the blood is a serious offence.","The book is hard to obtain, because of excess demand following the author’s appearance on TV."],"opposite":"","synonyms":""},{"def":"required as extra payment","examples":["The full excess fare had to be paid."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]