[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exc/excha/exchange__us_1.mp3","phonsUS":"/ɪksˈtʃeɪndʒ/","level":"B1","meanings":[{"def":"an act of giving something to somebody or doing something for somebody and receiving something in return","examples":["The exchange of prisoners took place this morning.","We need to promote an open exchange of ideas and information.","an exchange of glances/insults","an exchange of fire (= between enemy soldiers)","I buy you lunch and you fix my computer. Is that a fair exchange?","in exchange for something Wool and timber were sent to Egypt in exchange for linen or papyrus.","in exchange I'll type your report if you'll babysit in exchange.","She had a full and frank exchange of views with her boss before resigning.","We get together once a month for a mutual exchange of ideas.","There were exchanges of goods between the two regions."],"opposite":"","synonyms":""},{"def":"the process of changing an amount of one currency for an equal value of another","examples":["currency exchange facilities","Where can I find the best exchange rate/rate of exchange?"],"opposite":"","synonyms":""},{"def":"an arrangement when two people or groups from different countries visit each other’s homes or do each other’s jobs for a short time","examples":["exchange (with somebody/something) Our school does an exchange with a school in France.","trade and cultural exchanges with China","on an exchange Nick went on the French exchange.","She is in France on a student exchange.","an exchange with a German student"],"opposite":"","synonyms":""},{"def":"a conversation or an argument","examples":["There was only time for a brief exchange.","exchange with somebody The prime minister was involved in a heated exchange with Opposition MPs.","exchange between A and B There was an angry exchange between the two players.","There were many acrimonious exchanges between the two men.","angry exchanges about the problem of unemployment","an exchange over the question of Joe Hill's guilt","They've had many spirited exchanges.","The meeting was marked by a violent verbal exchange between the two presidents."],"opposite":"","synonyms":""},{"def":"a building where business people met in the past to buy and sell a particular type of goods","examples":["the old Corn Exchange"],"opposite":"","synonyms":""},{"def":"a place where phone calls are connected so that people can speak to each other","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["corn exchange","gas exchange","part exchange","part-exchange","post exchange","foreign exchange","stock exchange","bill of exchange","telephone exchange","Exchange and Mart","Royal Exchange","American Stock Exchange","exchange-rate mechanism","London Stock Exchange","New York Stock Exchange","Stock Exchange Automated Quotations","Securities and Exchange Commission"]},{"pos":"verb","level":"B1","meanings":[{"def":"to give something to somebody and at the same time receive the same type of thing from them","examples":["exchange something to exchange news/information","We use the forum to exchange ideas.","Juliet and David exchanged glances (= they looked at each other).","Everyone in the group exchanged email addresses.","The two men exchanged blows (= hit each other).","exchange something with somebody I shook hands and exchanged a few words with the manager.","(be) exchanged between A and B He read the letters exchanged between Anna and her friend."],"opposite":"","synonyms":""},{"def":"to change an amount of one currency for an equal value of another","examples":["exchange something Where can I exchange my money?","exchange A for B You can exchange your currency for dollars in the hotel."],"opposite":"","synonyms":""},{"def":"to give or return something that you have and get something different or better instead","examples":["exchange something If it doesn't fit, take it back and the store will exchange it.","exchange A for B I need to exchange this for a larger size."],"opposite":"","synonyms":""},{"def":"when a buyer and seller exchange contracts, especially on the sale of a house or land, they each sign a copy of the contract and give it to the other person","examples":["The firm has just exchanged contracts on a nine-acre site.","We exchanged on the house last week."],"opposite":"","synonyms":""},{"def":"to have an argument with somebody","examples":["We've had words.","Words were exchanged."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"have/exchange words (with somebody) (about something)","def":"to have an argument with somebody","examples":["We've had words.","Words were exchanged."]}],"phrasal":[],"related":[]}]