[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exc/excit/excitement__us_1.mp3","phonsUS":"/ɪkˈsaɪtmənt/","level":"B1","meanings":[{"def":"the state of feeling or showing happiness and enthusiasm","examples":["The news caused great excitement among her friends.","The sport needs new stars to generate excitement.","to feel a surge/thrill/shiver of excitement","There's a genuine sense of excitement because there is a British player in the final.","excitement about something He did not share their excitement about the project.","excitement about doing something I could hardly contain my excitement about going with Brandon.","excitement at something She told of her excitement at the prospect of a new career as a pilot.","excitement at doing something He was unable to control his excitement at hearing this.","excitement of doing something I can remember the excitement of winning that game.","excitement of something The app enables users to experience the excitement of space exploration.","with excitement You'll jump up from your seat with excitement.","in excitement The dog leapt and wagged its tail in excitement.","in somebody's excitement In her excitement she dropped her glass.","Excitement was bubbling up inside her.","There was a note of excitement in his voice.","For sheer excitement, white-water rafting is hard to beat.","I step lightly, with childlike excitement.","My visits always brought great excitement to my family.","She clapped her hands in excitement.","She could feel the excitement coursing through her veins.","A shiver of excitement ran through her.","She felt a surge of excitement when she heard the song.","She was almost sick with excitement and apprehension.","The element of risk just adds excitement.","The tension and excitement built up gradually all day.","There was an air of excitement about the place.","He was flushed with excitement at the thought."],"opposite":"","synonyms":""},{"def":"something that you find exciting","examples":["The new job was not without its excitements."],"opposite":"","synonyms":""},{"def":"the state of feeling sexual desire","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]