[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exc/exclu/exclusive__us_1.mp3","phonsUS":"/ɪkˈskluːsɪv/","level":"C1","meanings":[{"def":"only to be used by one particular person or group; only given to one particular person or group","examples":["The hotel has exclusive access to the beach.","exclusive rights to televise the World Cup","His mother has told ‘The Times’ about his death in an exclusive interview (= not given to any other newspaper).","The recording deal is not necessarily exclusive. The band can record material for other companies as well.","These products are exclusive to our outlets.","the course's almost exclusive concentration on grammar (= it includes almost nothing else)"],"opposite":"","synonyms":""},{"def":"not very willing to allow new people to become members, especially if they are from a lower social class","examples":["He belongs to an exclusive club.","His clientele was exclusive and wealthy."],"opposite":"","synonyms":""},{"def":"of a high quality and expensive and therefore not often bought or used by most people","examples":["an exclusive hotel","exclusive designer clothes","She had been sent to one of London's most exclusive girls' schools.","It is one of the most expensive, exclusive resorts in the Mediterranean."],"opposite":"","synonyms":""},{"def":"not including anything else","examples":["He had an exclusive focus on success and making money.","This list is not exclusive."],"opposite":"","synonyms":""},{"def":"not including somebody/something","examples":["The price is for accommodation only, exclusive of meals."],"opposite":"inclusive","synonyms":""},{"def":"not able to exist or be a true statement at the same time as something else","examples":["The two options are not mutually exclusive (= you can have them both)."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["mutually exclusive"]},{"pos":"noun","level":"","meanings":[{"def":"an item of news or a story about famous people that is published in only one newspaper or magazine or broadcast on only one TV or radio station","examples":["We feature an exclusive on the mothers whose babies were swapped at birth.","The paper printed a world exclusive on the presidential scandal."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]