[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exc/excus/excuse__us_1.mp3","phonsUS":"/ɪkˈskjuːs/","level":"B2","meanings":[{"def":"a reason, either true or invented, that you give to explain or defend your behaviour","examples":["Late again! What's your excuse this time?","I tried desperately to think of a good excuse.","a lame/feeble/poor/flimsy excuse","a reasonable/valid excuse","I know I missed the deadline, but I have an excuse.","excuse for something There's no excuse for such behaviour.","excuse for doing something His excuse for forgetting her birthday was that he had lost his diary.","You don't have to make excuses for her (= try to think of reasons for her behaviour).","It's late. I'm afraid I'll have to make my excuses (= say I'm sorry, give my reasons and leave).","He said no but he didn’t give a reason.","The most likely explanation is that his plane was delayed.","She left the room abruptly without explanation.","You have no grounds for complaint.","On what basis will this decision be made?","Late again! What’s your excuse this time?","It gave me an excuse to take the car.","There seemed to be no motive for the murder.","I can see no possible justification for any further tax increases.","He left the party early on the pretext of having to work.","I don't want to hear any more excuses.","Justin mumbled some excuse and left.","What possible excuse could he have?","He became moody and unreasonable, flailing out at Katherine at the slightest excuse.","He had no excuse for being so late.","Don't let perfectionism become an excuse for never getting started.","He's run out of excuses for not cleaning his room.","She made some feeble excuse about the car having broken down.","She seized on every excuse to avoid doing the work."],"opposite":"","synonyms":"reason"},{"def":"a good reason that you give for doing something that you want to do for other reasons","examples":["Eating ice cream for a sore throat isn't really a cure, but I like it, so any excuse!","excuse for something It's just an excuse for a party.","excuse for doing something Any occasion is a good excuse for having a barbecue.","excuse to do something It gave me an excuse to take the car.","He tried unsuccessfully to find an excuse to leave.","The demonstration was used as an excuse to impose martial law.","She had to find a valid excuse for leaving the room.","The children provided a convenient excuse for missing the party.","Her mother's illness provided her with an excuse to stay at home.","The political crisis is being used as an excuse to dock people's pay."],"opposite":"","synonyms":""},{"def":"a very bad example of something","examples":["Why get involved with that pathetic excuse for a human being?","a sorry excuse for a man","She's a pitiful excuse for an actress."],"opposite":"","synonyms":""},{"def":"a note written by a parent or doctor to explain why a student cannot go to school or somebody cannot go to work","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["excuse me?","excuse me","excuse/pardon my French"]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exc/excus/excuse__us_2.mp3","phonsUS":"/ɪkˈskjuːz/","level":"B2","meanings":[{"def":"to forgive somebody for something that they have done, for example not being polite or making a small mistake","examples":["excuse something Please excuse the mess.","excuse somebody You must excuse my father—he's not always that rude.","excuse somebody for something She had been excused for her actions.","excuse somebody for doing something I hope you'll excuse me for being so late.","(British English) You might be excused for thinking that Ben is in charge (= he is not, but it is an easy mistake to make).","excuse somebody doing something Excuse me interrupting you.","(formal) Excuse my interrupting you.","If you'll excuse me pointing this out, I think you've made a mistake here."],"opposite":"","synonyms":""},{"def":"to make your or somebody else’s behaviour seem less offensive by finding reasons for it","examples":["excuse something Nothing can excuse such rudeness.","excuse something as something He tried to excuse his behaviour as ‘a bit of harmless fun’.","excuse somebody/yourself I could try to excuse myself, but why bother?","excuse somebody/yourself for something Should her previous good actions excuse her for the terrible things she is doing now?","excuse somebody/yourself for doing something He excused himself for being late by explaining that his flight had been delayed.","I know she had a traumatic experience, but that doesn't excuse her.","That did not excuse him for not carrying on with the matter.","She makes no attempt to excuse herself for her deeds."],"opposite":"","synonyms":""},{"def":"to allow somebody to leave; to say in a polite way that you are leaving","examples":["Now if you'll excuse me, I'm a very busy man.","She excused herself and left the meeting early."],"opposite":"","synonyms":""},{"def":"to allow somebody to not do something that they should normally do","examples":["be excused (from something/from doing something) She was excused from giving evidence because of her age.","be excused something He was excused military service because of poor health."],"opposite":"","synonyms":""},{"def":"used to say that you are sorry for swearing","examples":[],"opposite":"","synonyms":""},{"def":"used to politely get somebody’s attention, especially somebody you do not know","examples":["Excuse me, is this the way to the station?"],"opposite":"","synonyms":""},{"def":"used to politely ask somebody to move so that you can get past them","examples":["Excuse me, could you let me through?"],"opposite":"","synonyms":""},{"def":"used to say that you are sorry for interrupting somebody or behaving in a slightly rude way","examples":["Guy sneezed loudly. ‘Excuse me,’ he said."],"opposite":"","synonyms":""},{"def":"used to disagree politely with somebody","examples":["Excuse me, but I don't think that's true."],"opposite":"","synonyms":""},{"def":"used to politely tell somebody that you are going to leave or talk to somebody else","examples":["‘Excuse me for a moment,’ she said and left the room."],"opposite":"","synonyms":""},{"def":"used to say sorry for pushing somebody or doing something wrong","examples":["Oh, excuse me. I didn't see you there."],"opposite":"","synonyms":""},{"def":"used when you did not hear what somebody said and you want them to repeat it","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"excuse/pardon my French","def":"used to say that you are sorry for swearing","examples":[]},{"idiom":"excuse me","def":"used to politely get somebody’s attention, especially somebody you do not know","examples":["Excuse me, is this the way to the station?","Excuse me, could you let me through?","Guy sneezed loudly. ‘Excuse me,’ he said.","Excuse me, but I don't think that's true.","‘Excuse me for a moment,’ she said and left the room.","Oh, excuse me. I didn't see you there."]}],"phrasal":[],"related":[]}]