[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exe/execu/execution__us_1.mp3","phonsUS":"/ˌeksɪˈkjuːʃn/","level":"C1","meanings":[{"def":"the act of killing somebody, especially as a legal punishment","examples":["He faced execution by hanging for murder.","Over 200 executions were carried out last year.","Human rights organizations have accused the army of summary executions.","She was taken prisoner and suffered eventual execution.","If caught, the men could face execution.","The US Supreme Court refused to stay the execution.","The army oversaw the trial and execution of the king.","The tribunal ordered the execution of 42 coup plotters.","prisoners who are on death row awaiting execution","the hours before his scheduled execution","the Supreme Court decision to ban juvenile executions"],"opposite":"","synonyms":""},{"def":"the act of doing a piece of work, performing a duty, or putting a plan into action","examples":["He had failed in the execution of his duty.","The idea was good, but the execution was poor.","The company is liable for any damage caused by faulty execution of the building work.","proper execution of the exercise","She was charged with obstruction of a police officer in the execution of his duties."],"opposite":"","synonyms":""},{"def":"skill in performing or making something, such as a piece of music or work of art","examples":["Her execution of the piano piece was perfect.","the poor execution of the film"],"opposite":"","synonyms":""},{"def":"the act of following the instructions in a legal document, especially those in somebody’s will","examples":["The solicitors are proceeding with the execution of her mother’s will.","the successful execution of the contract","The court has discretion to stay or suspend execution of the order."],"opposite":"","synonyms":""},{"def":"a delay in following the order of a court","examples":["to grant a stay of execution","There will be no stay of execution and few mourners for this concrete tower block, due to be demolished next month."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a stay of execution","def":"a delay in following the order of a court","examples":["to grant a stay of execution","There will be no stay of execution and few mourners for this concrete tower block, due to be demolished next month."]}],"phrasal":[],"related":[]}]