[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exh/exhib/exhibition__us_2.mp3","phonsUS":"/ˌeksɪˈbɪʃn/","level":"B1","meanings":[{"def":"a collection of things, for example works of art, that are shown to the public","examples":["Have you seen the Picasso exhibition?","to hold/organize an exhibition","an art exhibition","His first solo exhibition took place in Barcelona in 1925.","an exhibition of something an exhibition of paintings/photographs","The gallery is hosting an exhibition of his work.","exhibition on somebody/something She is currently preparing an exhibition on Van Gogh and Expressionism.","in an exhibition His sculptures have been featured in exhibitions all over the world.","at an exhibition The paintings are on display at an exhibition which opened on Friday.","the catalogue for a recent exhibition at the museum","She is to be the subject of a major exhibition next year.","The exhibition includes drawings by Rembrandt.","The exhibition is on view from 11 April to 5 July.","The exhibition moves on to the National Gallery, Washington, next month.","The exhibition opens at the Metropolitan Museum of Art in July.","The museum hosted a big exhibition of her work last year.","There is a series of special exhibitions throughout the year.","They plan to stage an art exhibition in a nearby town.","a major exhibition of the painter's work","a touring exhibition of Impressionist drawings","an exhibition devoted to female painters","an exhibition illustrating the history and development of the university","an exhibition on local history","the international food trade exhibition in Cologne","The exhibition centre was built in 1999."],"opposite":"","synonyms":""},{"def":"the act of showing something, for example works of art, to the public","examples":["She refused to allow the exhibition of her husband's work.","The portrait is going on public exhibition for the first time.","Hundreds of companies had exhibition stands.","The new wing will provide 20 000 more square feet of exhibition space."],"opposite":"","synonyms":""},{"def":"the act of showing a skill, a feeling, or a kind of behaviour","examples":["We were treated to an exhibition of the footballer's speed and skill.","an appalling exhibition of bad manners"],"opposite":"","synonyms":""},{"def":"an amount of money that is given as a prize to a student","examples":[],"opposite":"","synonyms":""},{"def":"to behave in a bad or stupid way in public","examples":["I'm afraid I lost my temper and made an exhibition of myself."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"make an exhibition of yourself","def":"to behave in a bad or stupid way in public","examples":["I'm afraid I lost my temper and made an exhibition of myself."]}],"phrasal":[],"related":["Great Exhibition","National Exhibition Centre"]}]