[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exh/exhib/exhibit__us_1.mp3","phonsUS":"/ɪɡˈzɪbɪt/","level":"B2","meanings":[{"def":"to show something in a public place for people to enjoy or to give them information","examples":["exhibit something (at/in…) They will be exhibiting their new designs at the trade fairs.","Only one painting was exhibited in the artist's lifetime.","He longed for the chance to exhibit his work publicly.","exhibit (at/in…) He exhibits regularly in local art galleries."],"opposite":"","synonyms":""},{"def":"to show clearly that you have or feel a particular quality, ability, feeling or symptom","examples":["The patient exhibited signs of fatigue and memory loss.","The three novels exhibit a growing confidence in the author's use of language."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"B2","meanings":[{"def":"an object or a collection of objects put in a public place, for example a museum, so that people can see it","examples":["The museum contains some interesting exhibits on Spanish rural life.","The artist is now having her first solo exhibit in New York.","The exhibit features unique photographs of San Francisco in the 1900s.","The exhibit opened to the public on July 1.","The exhibit runs through February 1.","The library has a policy of mounting changing exhibits.","The library is celebrating its tenth anniversary with a special exhibit.","The museum features rotating exhibits.","There are forty gigantic works on exhibit.","a major exhibit of the painter's work","a traveling exhibit of antiques","an exhibit of video art","an exhibit on local history","the museum's new exhibit space","a Matisse exhibit at the National Gallery"],"opposite":"","synonyms":""},{"def":"a collection of things, for example works of art, that are shown to the public","examples":["The new exhibit will tour a dozen US cities next year."],"opposite":"","synonyms":""},{"def":"a thing that is used in court to prove that somebody is guilty or not guilty","examples":["The first exhibit was a knife which the prosecution claimed was the murder weapon."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]