[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exi/exit_/exit__us_1_rr.mp3","phonsUS":"/ˈeksɪt/","level":"B2","meanings":[{"def":"a way out of a public building or vehicle","examples":["Where's the exit?","There is a fire exit on each floor of the building.","The emergency exit is at the back of the bus.","He left through the south exit.","I remember that there's a secret exit here.","I walked through the school's main exit.","She headed for the nearest exit.","They moved to the exits.","an exit to the street"],"opposite":"","synonyms":""},{"def":"a place where vehicles can leave a road to join another road","examples":["Leave the roundabout at the second exit.","Take the exit for Brno.","I pulled off the road at the next exit.","Take the first exit over the bridge.","They took the exit to the hospital.","Traffic lights control the exit from the M8 at Newbridge.","You need to get off at the next exit.","the number of entry and exit points on the main road network"],"opposite":"","synonyms":""},{"def":"an act of leaving, especially of an actor from the stage","examples":["The heroine made her exit to great applause.","He made a quick exit to avoid meeting her.","She turned on her heel and made what she hoped was a dignified exit.","The students made a dramatic exit toward the end of his speech.","I made my exit as discreetly as possible.","The dancers made their exits and entrances with perfect timing.","We go back and look at our exit interviews as to why people leave."],"opposite":"","synonyms":""},{"def":"the fact of leaving a particular situation or activity","examples":["exit from something They were disappointed by the team's early exit from the World Cup.","She was trying to make a graceful exit from public life.","Her sudden exit from the proceedings was a mystery.","a mass exit of members from the party"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["exit exam","exit poll","exit visa","exit wound","exit strategy","exit interview","exit…","exit polls","exit visas","exit wounds","exit interviews","exit strategies","exit examination"]},{"pos":"verb","level":"C1","meanings":[{"def":"to go out; to leave a building, stage, vehicle, etc.","examples":["(+ adv./prep.) The bullet entered her back and exited through her chest.","We exited via a fire door.","exit something As the actors exited the stage the lights went on.","Exit the motorway at junction 23.","One of the intruders must have exited through a side door.","Passengers exited the aircraft through the rear door."],"opposite":"","synonyms":""},{"def":"to finish using a computer program","examples":["exit (from something) To exit from this page, press the return key.","exit something I exited the database and switched off the computer."],"opposite":"","synonyms":""},{"def":"used in the instructions printed in a play to say that an actor must leave the stage","examples":["Exit Macbeth."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]