[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exp/expan/expand__us_1.mp3","phonsUS":"/ɪkˈspænd/","level":"B1","meanings":[{"def":"to become greater in size, number or importance; to make something greater in size, number or importance","examples":["Metals expand when they are heated.","Student numbers are expanding rapidly.","a greatly expanded version of his earlier book","A child's vocabulary expands through reading.","expand to do something The waist expands to fit all sizes.","The gallery's focus will expand to include the work of modern artists.","expand (from something) to something By 1999, the event had expanded from two to three days.","expand something They are continuing to expand the range of goods and services they offer.","to expand a programme/service","In breathing the chest muscles expand the rib cage and allow air to be sucked into the lungs.","There are no plans to expand the local airport.","expand something into something The short film is being expanded into a full-length documentary.","The number of managers has expanded from 700 to 1 300.","The government has expanded economic aid to the region.","The town has expanded into a city.","I needed to expand my possibilities of making a living.","The new system expanded the role of family doctors."],"opposite":"contract","synonyms":""},{"def":"if a business expands or is expanded, new branches are opened, it makes more money, etc.","examples":["an expanding economy (= with more businesses starting and growing)","The organic market is rapidly expanding among middle-class shoppers.","expand into something They have recently expanded into the Middle East.","expand something We've expanded the business by opening two more stores.","The company is planning to expand its American operations.","American publishers attempted to expand their markets overseas.","Both companies are aggressively expanding their business models in Europe.","He has plans to expand beyond computer consulting to include engineer training.","internet companies expanding abroad","The business has expanded greatly over the last year.","Several brands have successfully expanded their market presence."],"opposite":"","synonyms":""},{"def":"to talk more; to add details to what you are saying","examples":["I repeated the question and waited for her to expand."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["expand on","expand upon"],"related":["expand on","expand upon","expand on something","expand upon something"]}]