[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exp/exper/experiment__us_2.mp3","phonsUS":"/ɪkˈsperɪmənt/","level":"A2","meanings":[{"def":"a scientific test that is done in order to study what happens and to gain new knowledge","examples":["to do/perform/conduct an experiment","laboratory experiments","The results of the experiment were inconclusive.","in an experiment The 30 subjects in each experiment were divided into two groups.","during an experiment The temperature was kept constant during the experiment.","experiment on somebody/something Many people do not like the idea of experiments on animals.","experiment with somebody/something The experiment with cells from other species was unsuccessful.","by experiment Facts can be established by observation and experiment.","Further experiments will be carried out to verify this result.","The results were obtained from four independent experiments.","proved by experiment","If the conditions are not right, the experiment will not work.","In these experiments, chilling is necessary.","Pavlov's famous experiment with the dog and the dinner bell","The appropriate concentration of the drug is best determined by experiment.","NASA carried out experiments to ascertain the effects of weightlessness.","This pattern emerged clearly in the experiment."],"opposite":"","synonyms":""},{"def":"a new activity, idea or method that you try out to see what happens or what effect it has","examples":["I've never cooked this before so it's an experiment.","experiment in something the country’s brief experiment in democracy","experiment with something His experiments with narrative form were very influential.","as an experiment The system was installed four years ago as an experiment.","Brazil's unique experiment with alcohol-powered cars","The school decided to try an experiment in single-sex teaching.","an experiment aimed at cutting road deaths resulting from excessive speeding","the country's bold experiment with economic reform"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["controlled experiment"]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exp/exper/experiment__us_3.mp3","phonsUS":"/ɪkˈsperɪment/","level":"B1","meanings":[{"def":"to do a scientific experiment or experiments","examples":["After experimenting at Columbia University, he realized that fission was the key to releasing nuclear energy.","experiment on somebody/something Some people feel that experimenting on animals is wrong.","They experimented successfully on the plants to discover disease-resistant varieties.","experiment with something The country had secretly experimented with biological weapons for years."],"opposite":"","synonyms":""},{"def":"to try or test new ideas, methods, etc. to find out what effect they have","examples":["I experimented until I got the recipe just right.","experiment with something She had experimented with drugs when she was at college.","He wanted to experiment more with different textures in his paintings.","The students freely experimented with paints.","We have experimented with various different designs of kite.","The equipment encourages the children to experiment in different ways.","He is experimenting on a variety of themes, ranging from horror to action films."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]