[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exp/exper/experience__us_1.mp3","phonsUS":"/ɪkˈspɪriəns/","level":"A2","meanings":[{"def":"the knowledge and skill that you have gained through doing something for a period of time; the process of gaining this","examples":["My lack of practical experience was a disadvantage.","experience of something Do you have any previous experience of this type of work?","This new approach draws on years of experience of teaching children to read.","experience in doing something a doctor with experience in dealing with patients suffering from stress","experience in something He gained extensive experience in the field of artificial intelligence whilst working on the project.","experience as something I have over ten years’ experience as a teacher.","experience with something The course provides hands-on experience with various systems.","She didn't get paid much but it was all good experience.","We all learn by experience.","The new player will bring a wealth of experience to the team.","Rolls Royce's unrivalled experience in high technology manufacturing","Ann brings a wealth of knowledge and experience to the department.","She has considerable professional experience of translation.","The opportunities available will depend on your previous work experience and qualifications.","She wanted to broaden her experience in international affairs.","Students require field experience rather than just observation.","the importance of hands-on experience as well as academic training","The returning soldiers bring valuable experience to the Army."],"opposite":"","synonyms":""},{"def":"the things that have happened to you that influence the way you think and behave","examples":["Experience has taught me that life can be very unfair.","Experience shows that this strategy does not always work.","The book is based on personal experience.","from experience It is important to try and learn from experience.","She knew from past experience that Ann would not give up easily.","in somebody's experience In my experience, very few people really understand the problem.","experience of something He had first-hand experience of poverty.","the collective experience of everyday life","We know from experience that hot objects are painful to touch.","Choose illustrative examples from the children's everyday experience.","In her book, she draws on her first-hand experience of mental illness.","It is a matter of common experience that disorder will increase if things are left to themselves.","There are few areas of human experience that have not been written about."],"opposite":"","synonyms":""},{"def":"an event or activity that affects you in some way","examples":["a unique/positive/wonderful experience","experience of something Share your experiences of parenthood by emailing the address below.","We aim to give our guests the experience of a lifetime.","experience of doing something It was her first experience of living alone.","The play is based loosely on his own life experiences.","He found the whole experience traumatic.","Losing four matches in a row proved a valuable learning experience (= it showed the players what they need to improve).","Living in Africa was very different from home and quite an experience (= unusual for us).","an enjoyable/​exciting/​unusual/​unforgettable experience","He seems to have had some sort of religious experience.","I had a bad experience with fireworks once.","I think you will enjoy the experience of taking part in the show.","a hair-raising experience of white-water rafting","The sound system greatly enhances the experience of the movie.","Does anyone have any experiences—good or bad—that they would like to share with the group?","Early experiences shape the way we deal with crises in later life.","It could take him years to get over this experience.","It is a common experience to feel that an author writes well, without being able to say why.","It was quite an experience being involved in making a television programme.","Reliving past experiences can release powerful feelings that have been pent up too long.","The novel is based on his experiences in the war.","The use of drama can motivate students by allowing them to share a common experience.","We aim to create an experience the consumer will remember."],"opposite":"","synonyms":""},{"def":"what it is like for somebody to use a service, do an activity, attend an event, etc.","examples":["We are continually looking for ways to improve the customer experience.","Enjoy a fine dining experience with quality service."],"opposite":"","synonyms":""},{"def":"events or knowledge shared by all the members of a particular group in society, that influences the way they think and behave","examples":["musical forms like jazz that emerged out of the Black American experience"],"opposite":"","synonyms":""},{"def":"used to say that somebody should think of a failure as being something that they can learn from","examples":["We lost a lot of money, but we just put it down to experience."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"put something down to experience","def":"used to say that somebody should think of a failure as being something that they can learn from","examples":["We lost a lot of money, but we just put it down to experience."]}],"phrasal":[],"related":["experience points","user experience","work experience","near-death experience","out-of-body experience","Songs of Innocence and of Experience","put something down to experience"]},{"pos":"verb","level":"B1","meanings":[{"def":"to have a particular situation affect you or happen to you","examples":["Many people have never experienced these difficulties first-hand.","We are currently experiencing problems with our IT systems.","They had the opportunity to experience life at sea.","Rapid growth has been experienced by over 50% of companies in the sector.","Everyone experiences these problems at some time in their lives.","The country experienced a foreign currency shortage for several months.","He hadn't directly experienced the fighting in the city.","I have personally experienced poverty and faced problems in pursuing higher studies."],"opposite":"","synonyms":""},{"def":"to have and be aware of a particular emotion or physical feeling","examples":["I have never experienced such pain before.","I experienced feelings of sadness and loss.","I experienced a moment of panic as I boarded the plane.","Patients reported experiencing unpleasant symptoms such as nausea and headaches.","To watch him dance is to experience joy in one's physical existence."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]