[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exp/exper/expert__us_1.mp3","phonsUS":"/ˈekspɜːrt/","level":"A2","meanings":[{"def":"a person with special knowledge, skill or training in something","examples":["a legal/security/medical/computer expert","Police consulted their own team of forensic experts.","according to an expert According to our panel of leading industry experts, a downturn is inevitable.","Experts believe/predict/say…","expert in something Experts in the field of child psychology warn of the dangers of social media.","expert on something I don't pretend to be an expert on the subject .","expert at something Nobody can be an expert at everything.","expert in doing something You will need to become an expert in analysing data.","expert on doing something an expert on managing change in the workplace","expert at doing something He's an expert at getting his own way.","Don't ask me—I'm no expert!","A panel of experts will answer questions from the television audience.","Experts agree that a balanced diet is the key to great health.","She is a world expert on butterflies.","Medical experts are predicting a massive rise in obesity-related illnesses.","Weapons experts were sent to try to uncover evidence of a nuclear programme.","I'm no expert, but I think you should get that cut seen to.","The so-called experts seem to have no explanation for this.","The article quoted climate experts as saying that we should expect more extreme weather events."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["expert system","expert systems"]},{"pos":"adjective","level":"A2","meanings":[{"def":"done with, having or involving great knowledge or skill","examples":["to seek expert advice","Only a fully qualified doctor can give an expert opinion.","an expert witness","His expert evidence played a key role in the trial.","expert at/in/on something They are expert in these matters.","He has become expert on European politics.","expert at/in/on doing something She's expert at making cheap but stylish clothes.","We need some expert help.","She has expert knowledge of child psychology.","Both teams are considered expert at what they do."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]