[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exp/expen/expense__us_4.mp3","phonsUS":"/ɪkˈspens/","level":"B2","meanings":[{"def":"the money that you spend on something","examples":["The garden was transformed at great expense.","No expense was spared (= they spent as much money as was needed) to make the party a success.","He's arranged everything, no expense spared.","She always travels first-class regardless of expense.","The results are well worth the expense.","house prices","How much are these? They don’t have a price on them.","I can’t afford it at that price.","A new computer system has been installed at a cost of £80 000.","The winner will receive a prize to the value of £1 000.","The garden was transformed at great expense.","Running a car is a big expense.","He has a personal net worth of $10 million.","We were taken out for a meal at the company's expense.","It emerged that they had received free first-class travel at the taxpayer's expense.","The bridge was built at public expense.","They had to repair the damage at their own expense.","Your monthly housing expense should not be greater than 28% of your income.","The accommodation package includes admission to the golf course at no extra expense.","She had to meet the expense herself.","Net interest expense increased to $5.9 million from $4.1 million."],"opposite":"","synonyms":"price"},{"def":"something that makes you spend money","examples":["Running a car is a big expense.","The company views its workers as an expense instead of an asset.","Insurance is an ongoing expense.","The real expense of the trip was the flights.","Save the expense of calling out a plumber by learning some of the basics yourself.","Meetings, and the time for them, are a considerable management expense.","The process turned out to be a significant capital expense."],"opposite":"","synonyms":""},{"def":"money spent in doing a particular job, or for a particular purpose","examples":["living/medical/travel expenses","legal/household expenses","The company has cut operating expenses to their lowest levels in three years","Can I give you something towards expenses?","financial help to meet the expenses of an emergency","The payments he gets barely cover his expenses.","Property investors are entitled to offset the expenses incurred buying the property.","labour/​production costs","rising costs","public spending","More spending on health was promised.","expenditure on education","legal expenses","travel expenses","High overheads mean small profit margins.","The best equipment is costly but is well worth the outlay.","My expenses are constantly rising and my income stays the same.","Medical expenses can be quite high if you are not insured.","You can reduce your expenses by selling your old car at a good price.","You can expect to receive compensation for all expenses arising out of the accident.","We will recoup our expenses within 24 months.","You will receive expense reimbursement for up to $5 000 for legal representation.","Total employee expenses were up about 6%.","Operating expenses rose by more than 23% last year.","Look for a fund with low expenses."],"opposite":"","synonyms":"costs"},{"def":"money that you spend while you are working and that your employer will pay back to you later","examples":["You can claim back your travelling/travel expenses.","We paid their expenses, but nothing more.","an all-expenses-paid trip","on expenses (British English) to take a client out for a meal on expenses","labour/​production costs","rising costs","public spending","More spending on health was promised.","expenditure on education","legal expenses","travel expenses","High overheads mean small profit margins.","The best equipment is costly but is well worth the outlay.","Relocated employees received grants towards incidental expenses like buying carpets.","The guides are unpaid except for basic expenses.","They are claiming expenses for travel and meals."],"opposite":"","synonyms":"costs"},{"def":"paid for by somebody","examples":["We were taken out for a meal at the company's expense."],"opposite":"","synonyms":""},{"def":"if you make a joke at somebody’s expense, you laugh at them and make them feel silly","examples":[],"opposite":"","synonyms":""},{"def":"with loss or damage to somebody/something","examples":["He built up the business at the expense of his health.","an education system that benefits bright children at the expense of those who are slower to learn"],"opposite":"","synonyms":""},{"def":"to spend money on something","examples":["They went to all the expense of redecorating the house and then they moved."],"opposite":"","synonyms":""},{"def":"to make somebody spend money on something","examples":["Their visit put us to a lot of expense."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"at somebody’s expense","def":"paid for by somebody","examples":["We were taken out for a meal at the company's expense."]},{"idiom":"at the expense of somebody/something","def":"with loss or damage to somebody/something","examples":["He built up the business at the expense of his health.","an education system that benefits bright children at the expense of those who are slower to learn"]},{"idiom":"go to the expense of something/of doing something | go to a lot of, etc. expense","def":"to spend money on something","examples":["They went to all the expense of redecorating the house and then they moved."]},{"idiom":"put somebody to the expense of something/of doing something | put somebody to a lot of, etc. expense","def":"to make somebody spend money on something","examples":["Their visit put us to a lot of expense."]}],"phrasal":[],"related":["expense account","expense accounts","damn the consequences, expense, etc."]}]