[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exp/expec/expect__us_1.mp3","phonsUS":"/ɪkˈspekt/","level":"A2","meanings":[{"def":"to think or believe that something will happen or that somebody will do something","examples":["expect something The company is expecting record sales this year.","Change often happens when you least expect it.","expect something from somebody/something Don't expect sympathy from me!","expect something of somebody/something That's not the sort of behaviour I expect of you!","expect to do something They never expected to find their dream home.","I looked back, half expecting to see someone following me.","expect somebody/something to do something Analysts expect the company to announce growth of at least 5 per cent.","I fully expected her to refuse my offer.","House prices are expected to rise sharply.","Do you really expect me to believe you?","expect (that)… Many people were expecting (that) the peace talks would break down.","it is expected that… It is widely expected that interest rates will rise.","By 2050, one in six people on the planet will be aged 65 or over.","The number of people globally aged 65 and over is expected/likely to more than double by 2050.","Experts have predicted/forecast that the over-65s will make up 17 per cent of the global population by 2050.","World population is set to reach 9.8 billion by 2050.","Net migration into Britain over the last decade was higher than expected.","Overall population growth in Britain has been in line with predictions.","We are expecting a rise in food prices this month.","You can't expect to learn a foreign language in a few months.","I didn’t expect him to become a successful writer.","It is expected that the report will suggest some major reforms.","As expected, they lost the election.","I do not necessarily expect an easy answer to this question.","‘Will Bill be there?’ ‘I expect so.’","I didn't really expect them to come.","Double the expected number of people came to the meeting.","She confidently expects to win.","We can expect to see an improvement in the weather over the next few days.","My parents fully expect us to get married.","I would expect the factory to be working again as normal by next week.","The economy is expected to pick up in the first half of next year.","This kind of behaviour is to be expected from a two-year-old.","Was she really naive enough to expect that he had changed?"],"opposite":"","synonyms":""},{"def":"to be waiting for somebody/something to arrive, as this has been arranged","examples":["expect somebody/something to expect a visit/call/letter from somebody","We were expecting him yesterday.","They are not expected until tomorrow.","Are you expecting visitors?","I'm expecting an important call.","expect somebody to do something We were expecting him to arrive yesterday."],"opposite":"","synonyms":""},{"def":"to demand that somebody will do something because it is their duty or responsibility","examples":["expect something It is reasonable to expect changes in the way we work.","No one has a right to expect good results without working hard.","These are the high standards that hotel guests have come to expect.","expect something from somebody He's still getting over his illness, so it's unrealistic to expect too much from him.","expect something of somebody Are you clear what is expected of you?","expect somebody to do something You can't reasonably expect people to pay such high taxes.","We are expected to work on Saturdays.","It would be unreasonable to expect them to do all that work for free.","expect to do something I expect to be paid promptly for the work.","She demanded an immediate explanation.","All candidates will be required to take a short test.","I expect to be paid promptly for the work.","I didn’t want to go but he insisted.","We insist on the highest standards at all times.","You’re asking too much of him.","Her parents expected high standards from her.","They expected all their children to be high achievers.","You are entitled to expect certain minimum standards of accommodation.","We expect good results from our employees.","They rightly expect to be obeyed.","I think my parents always expected too much of me."],"opposite":"","synonyms":"demand"},{"def":"used when you think something is probably true","examples":["‘Will you be late?’ ‘I expect so.’","‘Are you going out tonight?’ ‘I don't expect so.’","expect (that…) ‘Who’s eaten all the cake?’ ‘Tom, I expect/I expect it was Tom.’"],"opposite":"","synonyms":""},{"def":"to be pregnant","examples":["Ann's expecting a baby in June.","I didn't know she was expecting!"],"opposite":"","synonyms":""},{"def":"to be likely to happen; to be quite normal","examples":["A little tiredness after taking these drugs is to be expected."],"opposite":"","synonyms":""},{"def":"used to tell somebody not to be surprised by something","examples":["She swore at you? What do you expect when you treat her like that?"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be expecting (a baby/child)","def":"to be pregnant","examples":["Ann's expecting a baby in June.","I didn't know she was expecting!"]},{"idiom":"be (only) to be expected","def":"to be likely to happen; to be quite normal","examples":["A little tiredness after taking these drugs is to be expected."]},{"idiom":"what (else) do you expect?","def":"used to tell somebody not to be surprised by something","examples":["She swore at you? What do you expect when you treat her like that?"]}],"phrasal":[],"related":[]}]