[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exp/expec/expectation__us_1.mp3","phonsUS":"/ˌekspekˈteɪʃn/","level":"B2","meanings":[{"def":"a belief that something will happen because it is likely","examples":["expectation of something We are confident in our expectation of a full recovery.","We certainly had a reasonable expectation of success.","expectation about something the government's expectations about the economy","expectation that… There was a general expectation that he would win.","She had a legitimate expectation that her application would succeed.","The expectation is that property prices will rise.","in expectation of something Buyers are holding back in expectation of further price cuts.","in expectation I applied for the post more in hope than expectation.","Contrary to expectations, interest rates did not rise.","Against all expectations, she was enjoying herself.","Profits are broadly in line with expectations.","Sales came in above expectations this week.","She has defied all expectations with her career.","The article was written before the election result in the clear expectation of a Labour victory.","The course has produced results way beyond expectation.","The plaintiff is aged 30 and has a normal expectation of life.","The rise in share price confounded expectations.","The various categories of operating expenditure are broadly in line with expectations.","There is still a general expectation that married couples will have children.","They bought real estate in the expectation of a rise in prices.","Users have changed their expectations of library services.","differences in the expectations held by different social groups"],"opposite":"","synonyms":""},{"def":"a hope that something good will happen","examples":["She went to college with great expectations.","to have high/low expectations","I don't want to raise your expectations too much.","The results exceeded our expectations.","The numbers attending fell short of expectations.","The event did not live up to expectations.","There was an air of expectation and great curiosity.","expectations for somebody/something He has high expectations for the team.","The White House said that they did not have any grand expectations for today's meeting.","He had been successful beyond his expectations.","They've found success far beyond their initial expectations.","This realization of our dreams surpassed even our wildest expectations.","the tensions and expectations surrounding the show","Heightened expectations for educational progress had not been realized.","Her approach sought to lower people's expectations.","We have high expectations for her future.","Many children start with low expectations."],"opposite":"","synonyms":""},{"def":"a strong belief about the way something should happen or how somebody should behave","examples":["Unfortunately the new software has failed to meet expectations.","expectations of somebody Some parents have unrealistic expectations of their children.","Her new car has not lived up to her expectations.","I have modest expectations about what my research can accomplish.","What should you do when an employee's performance is below expectation?","trying to influence public expectations of the police","It doesn't conform to people's normal expectations of what a zoo is."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["expectation of life","life expectation"]}]