[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exp/explo/explode__us_1.mp3","phonsUS":"/ɪkˈspləʊd/","level":"B1","meanings":[{"def":"to burst (= break apart) or make something burst loudly and violently, causing damage","examples":["A second bomb exploded in a crowded market.","The firework exploded in his hand.","explode something Bomb disposal experts exploded the device under controlled conditions.","There was a huge bang as if someone had exploded a rocket outside.","The jet smashed into a hillside and exploded.","The bomb was exploded under controlled conditions.","A police officer was killed when his car blew up.","The bomb went off in a crowded street.","That balloon’s going to burst.","Two other bombs failed to detonate.","The chemical is liable to explode on contact with water.","A blast bomb was thrown but the device failed to explode.","The jet smashed into a hillside and exploded.","My heart was nearly exploding in fright."],"opposite":"","synonyms":"explode"},{"def":"to suddenly become very angry or dangerous","examples":["Tension between the two sides could explode at any time.","explode with something Suddenly Charles exploded with rage.","explode into something The protest exploded into a riot.","+ speech ‘Of course there's something wrong!’ Jem exploded.","She almost exploded with anger.","A disagreement over public spending is set to explode."],"opposite":"","synonyms":""},{"def":"to suddenly express an emotion","examples":["We all exploded into wild laughter."],"opposite":"","synonyms":""},{"def":"to suddenly and quickly do something; to move suddenly with a lot of force","examples":["After ten minutes the game exploded into life.","He suddenly exploded into action."],"opposite":"","synonyms":""},{"def":"to make a sudden very loud noise","examples":["Thunder exploded overhead."],"opposite":"","synonyms":""},{"def":"to increase suddenly and very quickly in number","examples":["the exploding world population"],"opposite":"","synonyms":""},{"def":"to show that something is not true, especially something that people believe","examples":["At last, a women's magazine to explode the myth that thin equals beautiful.","The report explodes the theory that there was a conspiracy."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]