[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exp/explo/explore__us_1.mp3","phonsUS":"/ɪkˈsplɔːr/","level":"B1","meanings":[{"def":"to travel to or around an area or a country in order to learn about it","examples":["As soon as we arrived on the island we were eager to explore.","explore something They explored the land to the south of the Murray River.","The city is best explored on foot.","Westerners did not set out to explore the world until the fifteenth century.","explore something for something Bears will sometimes explore urban areas for food.","explore for something companies exploring for (= searching for) oil","We were keen to explore the region.","A day isn't really long enough to explore the town.","After the meeting you will be free to explore at leisure.","Bicycles can be hired if you want to explore further afield.","Stick to the main roads and don't be tempted to go exploring down minor ones."],"opposite":"","synonyms":""},{"def":"to examine a subject or a possibility completely or carefully in order to find out more about it","examples":["to explore a theme/an issue","We will explore these ideas in more detail in chapter 7.","to explore the possibilities/options","The firm will explore possible joint development projects.","A team was brought in to explore ways to create the most profit for shareholders.","He intends to explore the relationship between economic class and career choice.","a series of programmes in which she explores the world of ballet","The book is about homeless people in the cities.","The report deals with the issue of homelessness in London.","The writer discusses the problems faced by homeless people.","The article presents an overview of the issues surrounding homelessness.","The novel explores the theme of friendship among homeless people.","The first chapter examines the relationship between homelessness and drug addiction.","The paper considers the question of why so many young people become homeless.","This course offers you the opportunity to explore the history of English.","We need to explore every possible avenue.","The study explores the differences between the way girls and boys talk.","The research will explore whether there are common patterns across groups.","These questions have not been fully explored yet.","The film usefully explores some of the issues surrounding adoption."],"opposite":"","synonyms":""},{"def":"to feel something with your hands or another part of the body","examples":["She explored the sand with her toes."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]