[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exp/explo/explosion__us_1.mp3","phonsUS":"/ɪkˈspləʊʒn/","level":"B1","meanings":[{"def":"the sudden violent bursting and loud noise of something such as a bomb exploding; the act of deliberately causing something to explode","examples":["a bomb/nuclear/gas explosion","There were two loud explosions and then the building burst into flames.","a huge/massive explosion","Bomb Squad officers carried out a controlled explosion of the device.","Some witnesses said they heard an explosion before the plane hit the ground.","The accused denies conspiring to cause an explosion.","in an explosion 300 people were injured in the explosion.","explosion of something a spectacular explosion of fireworks","A huge explosion rocked the entire building.","The build-up of gas caused a small explosion.","The explosion caused major structural damage.","A massive explosion ripped through the chemical works.","The explosion sent a large cloud of smoke and dust into the air.","The world changed with the explosion of the first atomic bomb."],"opposite":"","synonyms":""},{"def":"a large, sudden or rapid increase in the amount or number of something","examples":["a population explosion","explosion of something an explosion of interest in learning Japanese","explosion in something an explosion in oil prices","How can we keep up with the information explosion?","If no action is taken, the country runs the risk of a social explosion.","In the 1860s a veritable explosion of major scientific publications took place.","a great explosion of creativity","a sudden explosion in the number of students","I believe we will see an explosion in lawsuits of this kind."],"opposite":"","synonyms":""},{"def":"a sudden, violent expression of emotion, especially anger","examples":["Do you know what brought on that explosion?","Demonstrators clashed with riot police in an explosion of anger at live animal exports.","The shock waves of this political explosion engulfed the whole of Europe."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["population explosion"]}]