[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exp/expla/explain__us_3.mp3","phonsUS":"/ɪkˈspleɪn/","level":"A1","meanings":[{"def":"to tell somebody about something in a way that makes it easy to understand","examples":["explain (something) He was trying to explain the difference between hip hop and rap.","First, I'll explain the rules of the game.","The theory is not explained in detail.","‘Let me explain!’ he added helpfully.","explain (something) to somebody It was difficult to explain the concept to beginners.","explain that… I explained that an ambulance would be coming soon.","explain who, how, etc… He explained who each person in the photo was.","Can you explain how this machine works?","explain to somebody who, how, etc… She explained to the children exactly what to do in an emergency.","+ speech ‘It works like this,’ she explained.","it is explained that… It was explained that attendance was compulsory.","I’m sorry, I didn’t quite understand.","Would you mind explaining that again? I’m not sure that I’ve understood correctly.","Sorry, I don't quite follow (you).","Can I just check that I’ve got this right?","I’m not quite/​exactly clear about/​really sure what I’m supposed to do.","Sorry, could you repeat that? I didn’t hear what you said.","Sorry, would you mind repeating what you just said?","If I understand you correctly, you want me to phone the customer and apologise?","Do you mean (to say) that the deal's off?","What exactly are you saying?","So you're saying that the meeting's cancelled?","Sorry, did you mean that I should wait here or come back later?","Can you just confirm your date of birth for me, please?","She saw his quick frown and hastened to explain.","I'll explain the system in greater detail next time.","The general principles behind the method used are explained clearly and concisely.","It is a book which seeks to explain the birth of Greek tragedy.","Many theories purport to explain growth in terms of a single cause.","I tried to explain the problem to the technician.","She explained the plan to me very carefully.","It's difficult to explain exactly how the system works.","Let me explain what I mean."],"opposite":"","synonyms":""},{"def":"to give a reason, or be a reason, for something","examples":["She tried to explain but he wouldn't listen.","explain that… Alex explained that his car had broken down.","explain why, how, etc… Well, that doesn't explain why you didn't phone.","explain something Please explain your reasons.","(informal) Oh well then, that explains it (= I understand now why something happened).","The phenomenon is partly explained by the fact that global temperatures are rising.","Slow growth in the economy is to be explained in terms of a lack of demand.","explain something to somebody The government now has to explain its decision to the public.","+ speech ‘It was like this,’ she explained.","You're going to have some explaining to do when your parents get home!","There's no need to explain. We understand.","She was unable to explain her behaviour.","The official explained patiently that our documents were not valid.","scientific findings that help explain the origins of the universe","I can explain everything! I was just trying to help her with her homework!","He explained awkwardly that he had not slept at his own home that night.","This partly explains why he was so late.","This goes some way towards explaining the hostility between the two groups.","The reasons for the accident have not been fully explained.","I know I'm late, but I can explain why.","I have a letter here which explains everything."],"opposite":"","synonyms":""},{"def":"to give somebody reasons for your behaviour, especially when they are angry or upset because of it","examples":["I really don't see why I should have to explain myself to you."],"opposite":"","synonyms":""},{"def":"to say what you mean in a clear way","examples":["Could you explain yourself a little more—I didn't understand."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"explain yourself","def":"to give somebody reasons for your behaviour, especially when they are angry or upset because of it","examples":["I really don't see why I should have to explain myself to you.","Could you explain yourself a little more—I didn't understand."]}],"phrasal":["explain away"],"related":["explain away","explain something"]}]