[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exp/expos/exposure__us_1.mp3","phonsUS":"/ɪkˈspəʊʒər/","level":"B2","meanings":[{"def":"the state of being in a place or situation where there is no protection from something harmful or unpleasant","examples":["prolonged exposure to harmful radiation","At high exposures, the chemical can affect the liver and kidneys.","(finance) the company’s exposure on the foreign exchange markets (= to the risk of making financial losses)","Banks will seek to minimize their exposure to risk.","The report recommends people to avoid prolonged exposure to sunlight.","human exposure to asbestos","long-term human exposure to mercury","prenatal exposure to cigarette smoke"],"opposite":"","synonyms":""},{"def":"the fact of having the true facts about somebody/something told after they have been hidden because they are bad, dishonest or illegal","examples":["his exposure as a liar and a fraud","the exposure of illegal currency deals","full exposure of the links between government officials and the arms trade","There were damaging exposures of the government's own practices."],"opposite":"","synonyms":""},{"def":"the fact of being discussed or mentioned on television, in newspapers, etc.","examples":["Her new movie has had a lot of exposure in the media.","He receives regular exposure in the papers.","The magazine aims to give exposure to the work of women artists.","a would-be television personality who is constantly trying to get media exposure"],"opposite":"","synonyms":""},{"def":"the fact of experiencing something new or different","examples":["We try to give our children exposure to other cultures."],"opposite":"","synonyms":""},{"def":"a medical condition caused by being out in very cold weather for too long without protection","examples":["Two climbers were brought in suffering from exposure.","Three of the men died of exposure."],"opposite":"","synonyms":""},{"def":"the length of time for which light is allowed into the camera when taking a photograph","examples":["I used a long exposure for this one."],"opposite":"","synonyms":""},{"def":"a length of film in a camera that is used to take a photograph","examples":["There were three exposures left on the roll of film."],"opposite":"","synonyms":""},{"def":"the act of showing something that is usually hidden","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["auto-exposure","time exposure","exposure meter","indecent exposure","exposure meters"]}]