[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exp/expos/expose__us_1.mp3","phonsUS":"/ɪkˈspəʊz/","level":"B2","meanings":[{"def":"to show something that is usually hidden","examples":["expose something He smiled suddenly, exposing a set of amazingly white teeth.","Miles of sand are exposed at low tide.","My job as a journalist is to expose the truth.","expose something to somebody He did not want to expose his fears and insecurity to anyone.","She lifted her chin in a gesture that deliberately exposed the line of her throat.","He was outclassed by an Aston Villa side that cruelly exposed his lack of pace.","a report which clearly exposes the weakness of the government's economic policy"],"opposite":"","synonyms":""},{"def":"to tell the true facts about a person or a situation, and show them/it to be dishonest, illegal, etc.","examples":["expose somebody/something He threatened to expose the racism that existed within the police force.","expose somebody/something as something She was exposed as a liar and a fraud."],"opposite":"","synonyms":""},{"def":"to put somebody/something in a place or situation where they are not protected from something harmful or unpleasant","examples":["expose somebody/something/yourself This tactic allowed the rebels to attack without the risk of exposing themselves.","expose somebody/something/yourself to something Children are being exposed to new dangers on the internet.","Do not expose babies to strong sunlight.","You could be exposing yourself to unnecessary risks when driving alone.","The roof collapsed, exposing the timbers to the elements.","These drawings must not be exposed to the air.","The general public is constantly exposed to radiation.","The cells were not exposed to any radiation at all.","to expose yourself to ridicule"],"opposite":"","synonyms":""},{"def":"to let somebody find out about something by giving them experience of it or showing them what it is like","examples":["We want to expose the kids to as much art and culture as possible.","mountain communities that had not been exposed to tourism before"],"opposite":"","synonyms":""},{"def":"to allow light into a camera when taking a photograph","examples":[],"opposite":"","synonyms":""},{"def":"a person who exposes himself or herself, shows their sexual organs in public in a way that is offensive to other people","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["exposé"]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exp/expos/expose_1_us_1.mp3","phonsUS":"/ˌekspəʊˈzeɪ/","level":"","meanings":[{"def":"an account of the facts of a situation, especially when these shock people or have deliberately been kept secret","examples":["a damning exposé of police corruption"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]