[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exp/expre/express__us_6.mp3","phonsUS":"/ɪkˈspres/","level":"A2","meanings":[{"def":"to show or make known a feeling, an opinion, etc. by words, looks or actions","examples":["express something Teachers have expressed concern about the changes.","to express a view/an opinion","to express a hope/desire","to express fears/doubts","Customers expressed interest in trying the product.","express something to somebody I'd like to express my gratitude to everyone who helped us.","express how, what, etc… Words cannot express how pleased I am.","His views have been expressed in numerous speeches.","Differences of opinion were freely expressed in public debate.","He expressed his anger openly.","Many patients feel unable to express their fears.","I want to express my sincere thanks to the many readers who sent messages of support.","Business leaders expressed disappointment with the decision.","Later, he expressed his regret that he hadn't taken the chance.","She expressed sympathy, but said she could not help.","Residents expressed frustration with the slowness of the process.","Many people have expressed reservations about this approach.","It's important to be able to express your feelings.","The architect expressed doubts that the museum would be ready in time.","Students must learn to express a point of view cogently and with clarity.","The poet eloquently expresses the sense of lost innocence.","In the show, the concept of freedom is expressed through dance.","International solidarity is expressed through a logo featuring combined flags.","There was no agreement either expressed or implied."],"opposite":"","synonyms":""},{"def":"to speak, write or communicate in some other way what you think or feel","examples":["Teenagers often have difficulty expressing themselves.","express yourself + adv./prep. Perhaps I have not expressed myself very well.","She expresses herself most fully in her paintings.","He expressed himself freely on the subject of immigration.","(formal) express yourself + adj. They expressed themselves delighted.","She doesn't express herself well in writing.","We want to give young people an opportunity to express themselves through art.","He expresses himself in simple, straightforward terms.","I need to express myself artistically.","the ability of students to express themselves clearly and articulately","It is easier to express yourself when you have a clear message.","The architect must not only express himself but design a functioning building.","She expressed herself disappointed."],"opposite":"","synonyms":""},{"def":"to become obvious in a particular way","examples":["Their pleasure expressed itself in a burst of applause."],"opposite":"","synonyms":""},{"def":"to represent something in a particular way, for example by symbols","examples":["express something as something The figures are expressed as percentages.","express something in something Educational expenditure is often expressed in terms of the amount spent per student."],"opposite":"","synonyms":""},{"def":"to remove air or liquid from something by pressing","examples":["Coconut milk is expressed from grated coconuts."],"opposite":"","synonyms":""},{"def":"to send something by express post","examples":["As soon as I receive payment I will express the book to you."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Express","express lane","American Express™","Federal Express","Daily Express","Pony Express","New Musical Express","Sunday Express","The Express","express train"]},{"pos":"adjective","level":"","meanings":[{"def":"travelling very fast; operating very quickly","examples":["an express bus/coach/train","express delivery services"],"opposite":"","synonyms":""},{"def":"sent by express service","examples":["express mail"],"opposite":"","synonyms":""},{"def":"providing an express service","examples":["an air express company"],"opposite":"","synonyms":""},{"def":"clearly and openly stated","examples":["It was his express wish that you should have his gold watch after he died.","I came here with the express purpose of speaking with the manager."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adverb","level":"","meanings":[{"def":"using a special fast service","examples":["I'd like to send this express, please."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"","meanings":[{"def":"a fast train that does not stop at many places","examples":["the 8.27 express to Edinburgh","the Trans-Siberian Express"],"opposite":"","synonyms":""},{"def":"a service for sending or transporting things quickly","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]