[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/exp/expre/expression__us_1.mp3","phonsUS":"/ɪkˈspreʃn/","level":"A2","meanings":[{"def":"a word or phrase","examples":["What's the meaning of the expression ‘on cloud nine’?","She uses a lot of slang expressions that I've never heard before.","Keep a list of useful words and expressions.","(informal) He's a pain in the butt, if you'll pardon the expression.","Do not write more than 200 words.","He uses a lot of long words.","technical/​legal/​scientific terms","‘Old man’ is a slang term for ‘father’.","Who coined the phrase ‘fake news’?","He tends to use a lot of slang expressions that I’ve never heard before.","‘Let the cat out of the bag’ is an idiom meaning to tell a secret by mistake.","an old-fashioned expression","Her writing is full of colourful expressions.","He tends to use strange expressions like ‘It's enough to make a cat laugh’.","I've not heard that expression before.","Until the mid-nineteenth century, ‘Italy’ was just a geographical expression.","Our spooky Hallowe'en weekend breaks give a whole new meaning to the expression ‘chilling out’!"],"opposite":"","synonyms":"word"},{"def":"things that people say, write or do in order to show their feelings, opinions and ideas","examples":["Freedom of expression (= freedom to say what you think) is a basic human right.","(formal) The poet's anger finds expression in (= is shown in) the last verse of the poem.","Only in his dreams does he give expression to his fears.","He describes drawing as a very personal form of artistic expression.","Words, as a means of expression, can be limiting.","expression of something the expression of emotion/feelings","expressions of concern/sympathy/support","We are calling for expressions of interest from people wanting to take part in the project.","laws which aim to restrict free expression of opinion","The riots are the most serious expression of anti-government feeling yet.","Expressions of sympathy flooded in from all over the country.","Their frustration needs some form of expression.","The tango is the ultimate expression of love if it is danced the right way.","A constitution is the written expression of the people's will.","Harvest festival was the occasion for the collective expression of a community's religious values.","He wanted to write a verse drama in which the verse would seem a natural expression of modern life.","Her statement was a clear expression of her views on this subject.","His highest expression of praise was ‘Not bad!’","Just because there is no direct expression of prejudice, that does not mean the prejudice does not exist.","She suddenly felt happy beyond expression.","Suddenly her deeper feelings demanded expression.","The new concept of form reached its fullest expression in the work of Picasso.","The report gave concrete expression to the fears of many immigrants.","an anger and frustration that finds expression in violence","the highest expression of human creativity","the open expression of emotion","the outward expression of inner emotional feelings","the verbal expression of one's feelings","to allow scope for individual expression"],"opposite":"","synonyms":""},{"def":"a look on a person’s face that shows their thoughts or feelings","examples":["The actors' gestures and facial expressions are perfect.","He had a pained expression on his face.","The blank expression in her eyes showed that she hadn't understood.","He looked down at the tiny child and his expression softened.","His expression changed from surprise to one of amusement.","Her expression betrayed nothing of her thoughts.","expression of something She wore an expression of anger.","There was a worried expression on her face.","The expression in her eyes told me something was wrong.","A surprised expression appeared on her face.","Catching a fleeting expression on Lucy's face, she persisted with her question.","He cracks jokes with a deadpan expression on his face.","He hung around with this pathetic hangdog expression on his face.","He wore an expression of anxiety on his face.","Her expression hardened into one of strong dislike.","Her expression suddenly turned serious.","His expression grew thoughtful.","His expression softened when he saw her.","His face never changed expression.","His face showed no expression.","His grim expression told her it would be useless.","I looked at her, trying to read the expression on her face.","Rose's face took on the fierce expression of a schoolgirl talking about her most hated teacher.","She carefully put on her most innocent expression.","She had a very bewildered expression on her face.","She had been watching the expression that crossed his face.","The children's faces all wore the same rapt expression.","They all just looked at me with blank expressions."],"opposite":"","synonyms":""},{"def":"a strong show of feeling when you are playing music, speaking, acting, etc.","examples":["Try to put a little more expression into it!","She plays the violin with great expression."],"opposite":"","synonyms":""},{"def":"a group of signs that represent an idea or a quantity","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["expression mark","gender expression","self-expression","expression marks"]}]