[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/ext/exten/extent__us_1.mp3","phonsUS":"/ɪkˈstent/","level":"B2","meanings":[{"def":"how large, important, serious, etc. something is","examples":["It is difficult to assess the full extent of the damage.","She was exaggerating the true extent of the problem.","They have launched an investigation to determine the extent of police misconduct in this case.","We don't know the extent of his injuries at this point.","I was amazed at the extent of his knowledge.","The government sought to play down the extent of the problem.","The operation revealed the extent of the cancer.","The overall extent of civilian casualties remained unclear.","We do not yet know the extent of her injuries.","a lengthy agenda outlining the extent of global environmental problems"],"opposite":"","synonyms":""},{"def":"the physical size of an area","examples":["You can't see the full extent of the beach from here.","in extent The island is 300 square kilometres in extent.","At its greatest extent the empire comprised most of western France.","a statement defining the extent of Latvia's territory"],"opposite":"","synonyms":""},{"def":"used to show how far something is true or how great an effect it has","examples":["To a certain extent, we are all responsible for this tragic situation.","He had changed to such an extent (= so much) that I no longer recognized him.","To some extent what she argues is true.","The pollution of the forest has seriously affected plant life and, to a lesser extent, wildlife.","To what extent is this true of all schools?","The book discusses the extent to which (= how much) family life has changed over the past 50 years.","Women generally earn less than men.","Generally speaking, jobs traditionally done by women are paid at a lower rate than those traditionally done by men.","In general/By and large, women do not earn as much as men.","Certain jobs, like nursing and cleaning, are still mainly carried out by women.","Senior management posts are predominantly held by men.","Most senior management posts tend to be held by men.","Women are, for the most part, still paid less than men.","Economic and social factors are, to a large extent, responsible for women being concentrated in low-paid jobs.","He had withdrawn from the company of his friends to an alarming extent.","I will answer your questions about this case to the extent possible.","People no longer live in small communities to the same extent as they used to.","The victory underlined the extent to which Prussia had become a major power.","To an extent East-West distrust continued throughout the war."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"to… extent","def":"used to show how far something is true or how great an effect it has","examples":["To a certain extent, we are all responsible for this tragic situation.","He had changed to such an extent (= so much) that I no longer recognized him.","To some extent what she argues is true.","The pollution of the forest has seriously affected plant life and, to a lesser extent, wildlife.","To what extent is this true of all schools?","The book discusses the extent to which (= how much) family life has changed over the past 50 years.","Women generally earn less than men.","Generally speaking, jobs traditionally done by women are paid at a lower rate than those traditionally done by men.","In general/By and large, women do not earn as much as men.","Certain jobs, like nursing and cleaning, are still mainly carried out by women.","Senior management posts are predominantly held by men.","Most senior management posts tend to be held by men.","Women are, for the most part, still paid less than men.","Economic and social factors are, to a large extent, responsible for women being concentrated in low-paid jobs.","He had withdrawn from the company of his friends to an alarming extent.","I will answer your questions about this case to the extent possible.","People no longer live in small communities to the same extent as they used to.","The victory underlined the extent to which Prussia had become a major power.","To an extent East-West distrust continued throughout the war."]}],"phrasal":[],"related":[]}]