[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/ext/exten/extension__us_1.mp3","phonsUS":"/ɪkˈstenʃn/","level":"B2","meanings":[{"def":"the act of increasing the area of activity, group of people, etc. that is affected by something","examples":["the extension of new technology into developing countries","a gradual extension of the powers of central government","The bank plans various extensions to its credit facilities.","My home life was becoming no more than an extension of my job.","The company sees brand extensions as a means of tempting back customers.","The team appraisal is a logical extension of the individual appraisal interview.","This new job is a further extension of his role as a manager."],"opposite":"","synonyms":""},{"def":"a new room or rooms that are added to a house","examples":["They're building an extension to their house."],"opposite":"","synonyms":""},{"def":"a new part that is added to a building","examples":["a planned two-storey extension to the hospital"],"opposite":"","synonyms":""},{"def":"an extra period of time allowed for something","examples":["He's been granted an extension of the contract for another year.","a visa extension","She was given an extension to finish writing her thesis.","(British English) The pub had an extension (= was allowed to stay open longer) on Christmas Eve.","He's applied for an extension of his visa.","The player has signed a five-year contract extension."],"opposite":"","synonyms":""},{"def":"an extra phone line connected to a central phone in a house or to a switchboard in a large building. In a large building, each extension usually has its own number.","examples":["We have an extension in the bedroom.","What's your extension number?","Can I have extension 4332 please?","I'll give you my extension number, so you can phone me directly."],"opposite":"","synonyms":""},{"def":"the act of making something longer or larger; the thing that is made longer and larger","examples":["The extension of the subway will take several months.","extensions to the original railway track"],"opposite":"","synonyms":""},{"def":"pieces of artificial hair that are added to somebody's own hair to make it longer","examples":["These extensions are very easy to use and won't damage your own hair."],"opposite":"","synonyms":""},{"def":"a part of a college or university that offers courses to students who are not studying full-time; a programme of study for these students","examples":["La Salle Extension University","extension courses"],"opposite":"","synonyms":""},{"def":"the set of three letters that are placed after the dot (= small round mark) at the end of the name of a file and that show what type of file it is","examples":["The extension .doc indicates a word-processing file."],"opposite":"","synonyms":""},{"def":"an extra length of electric wire, used when the wire on an electrical device is not long enough","examples":[],"opposite":"","synonyms":""},{"def":"taking the argument or situation one stage further","examples":["The blame lies with the teachers and, by extension, with the Education Service."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"by extension","def":"taking the argument or situation one stage further","examples":["The blame lies with the teachers and, by extension, with the Education Service."]}],"phrasal":[],"related":["extension agent","extension lead","hair extension","extension leads"]}]