[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/ext/exten/extend__us_3.mp3","phonsUS":"/ɪkˈstend/","level":"B2","meanings":[{"def":"to make something longer or larger","examples":["to extend a fence/road/house","There are plans to extend the children's play area.","The Democratic candidate extended her early lead in the polls.","There are plans to extend the road network in the north of the country.","You can add value to your house by extending or renovating it."],"opposite":"","synonyms":""},{"def":"to make something last longer","examples":["extend something to extend a deadline/visa","Careful maintenance can extend the life of your car.","extend something for something The show has been extended for another six weeks.","extend something to something The proposal was to extend paid leave to six months.","extend something from something Contracts were gradually extended from the initial single year.","extend something from something to something The repayment period will be extended from 20 years to 25 years."],"opposite":"","synonyms":""},{"def":"to make a business, an idea, an influence, etc. cover more areas or operate in more places","examples":["extend something The school is extending the range of subjects taught.","a terrorist organization intent on extending its reach","extend something to something The service will soon be extended to other areas of the UK.","extend something into something The company plans to extend its operations into Europe."],"opposite":"","synonyms":""},{"def":"to relate to or include somebody/something","examples":["The offer does not extend to employees' partners.","His willingness to help did not extend beyond making a few phone calls."],"opposite":"","synonyms":""},{"def":"to cover a particular area, distance or length of time","examples":["Our land extends as far as the river.","His writing career extended over a period of 40 years.","The wood does not extend very far.","The country's power extends far beyond its military capabilities."],"opposite":"","synonyms":""},{"def":"to make something reach something or stretch","examples":["to extend a rope between two posts"],"opposite":"","synonyms":""},{"def":"to stretch part of your body, especially an arm or a leg, away from yourself","examples":["He extended his hand to (= offered to shake hands with) the new employee.","(figurative) to extend the hand of friendship to (= try to have good relations with) another country"],"opposite":"","synonyms":""},{"def":"to offer or give something to somebody","examples":["extend something to somebody I'm sure you will join me in extending a very warm welcome to our visitors.","to extend your sympathy/congratulations/thanks to somebody","to extend hospitality to overseas students","The bank refused to extend credit to them (= to lend them money).","extend somebody something to extend somebody an invitation","They extended the invitation to all members of staff.","We extend our greetings to you and thank you for listening to us.","We extend our sympathy to the families of the victims.","Benefits must be extended to all workers."],"opposite":"","synonyms":""},{"def":"to make somebody/something use all their effort, abilities, supplies, etc.","examples":["Jim didn't really have to extend himself in the exam.","Hospitals were already fully extended because of the epidemic."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]