[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/ext/extra/extraordinary__us_1.mp3","phonsUS":"/ɪkˈstrɔːrdəneri/","level":"B2","meanings":[{"def":"unexpected, surprising or strange","examples":["What an extraordinary thing to say!","The president took the extraordinary step of apologizing publicly for his behaviour!","We are a normal family dealing with extraordinary circumstances.","it is extraordinary that… It's extraordinary that he managed to sleep through the party.","it is extraordinary how… It is extraordinary how little evidence supports this view.","What makes it so extraordinary is that the experts had all dismissed her theories as nonsense.","The discussion was about the treatment of extraordinary items in the company accounts.","It seems extraordinary that she could have got away with this for so long.","I find it extraordinary that anybody on a murder charge should be given bail."],"opposite":"","synonyms":""},{"def":"not normal or ordinary; greater or better than usual","examples":["an extraordinary achievement","She was a truly extraordinary woman.","They went to extraordinary lengths to explain their behaviour.","The film tells the extraordinary story of two people struggling to survive in the Arctic.","The response from the public has been quite extraordinary.","The portrait does not do justice to her extraordinary beauty.","The festival offers an extraordinary range of artistic events.","She must have been an extraordinary artist to work with.","I found an extraordinary number of errors in the document.","He did the work with extraordinary energy and good humour.","He used the extraordinary powers granted to him by Parliament to introduce economic reforms."],"opposite":"","synonyms":""},{"def":"arranged for a special purpose and happening in addition to what normally or regularly happens","examples":["An extraordinary meeting was held to discuss the problem.","The ruling Socialist Party held an extraordinary congress in July, two months before the annual congress."],"opposite":"","synonyms":""},{"def":"employed for a special purpose in addition to the usual staff","examples":["an envoy extraordinary"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["extraordinary rendition","extraordinary renditions"]}]