[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/ext/extra/extra__us_1.mp3","phonsUS":"/ˈekstrə/","level":"A1","meanings":[{"def":"more than is usual, expected, or than exists already","examples":["extra money/cash/funding","Breakfast is provided at no extra charge.","The rate for a room is £60, but breakfast is extra.","plans to offer increased broadband speeds at no extra cost","Employees are expected to put in extra hours without pay.","The DVD comes with lots of extra features.","extra help for single parents","a diet that can help you lose that extra weight","The conference is going to be a lot of extra work.","The government has promised an extra £1 billion for healthcare.","Take extra care on the roads this evening.","an extra pint of milk","We've had to take on extra staff to cope with the demand.","It's a big house, but we need the extra space because we have a daughter now.","We all need to make an extra effort to reduce waste.","The play is to run for an extra week!"],"opposite":"","synonyms":""},{"def":"behaving in a way that is too dramatic or shows too much effort","examples":["Calm down—you're being so extra right now.","You can be really extra and buy a dog birthday cake kit."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["extra-","extra time","extra virgin","extra large","extra small","go the extra mile (for somebody/something)"]},{"pos":"noun","level":"B1","meanings":[{"def":"a thing that is added to something that is not usual, standard or necessary and that costs more","examples":["The monthly fee is fixed and there are no hidden extras (= unexpected costs).","While I was saving I had no money for little extras or luxuries.","(British English) Metallic paint is an optional extra (= a thing you can choose to have or not, but must pay more for if you have it).","Regular guests also get added extras like free room service.","No extras are included.","The DVD extras include trailers and a behind-the-scenes feature.","Extras include an interview with the director.","The only extra on the disc is the theatrical trailer."],"opposite":"","synonyms":""},{"def":"a person who is employed to play a very small part in a film, usually as a member of a crowd","examples":["We need hundreds of extras for the battle scenes."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adverb","level":"B1","meanings":[{"def":"in addition; more than is usual, expected or exists already","examples":["to pay/cost extra","We don't charge extra for the activities—everything is included in the admission fee.","I need to earn a bit extra this month.","Now even bigger! Ten per cent extra!"],"opposite":"","synonyms":""},{"def":"more than usually","examples":["You need to be extra careful not to make any mistakes.","extra cautious/vigilant","an extra large T-shirt","Do you have this sweatshirt in an extra large size?","She tried extra hard.","He wanted to cook something extra special for dinner that night."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"prefix","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/ext/extra/extra__1_us_2.mp3","phonsUS":"/ekstrə/","level":"","meanings":[{"def":"outside; beyond","examples":["extramarital sex","extraterrestrial beings"],"opposite":"","synonyms":""},{"def":"very; more than usual","examples":["extra-thin","extra-special"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]