[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/ext/extre/extreme__us_1.mp3","phonsUS":"/ɪkˈstriːm/","level":"A2","meanings":[{"def":"very great in degree","examples":["We are working under extreme pressure at the moment.","people living in extreme poverty","extreme heat/cold/temperatures","The heat in the desert was extreme.","Such results should be treated with extreme caution.","The film depicts extreme violence.","I'm having extreme difficulty in not losing my temper with her."],"opposite":"","synonyms":""},{"def":"not ordinary or usual; serious or severe","examples":["extreme weather events such as floods and heatwaves","Children will be removed from their parents only in extreme circumstances.","It can cause nausea and, in extreme cases, death.","The ship got into difficulties in extreme conditions.","She was forced to take extreme measures.","Don't go doing anything extreme like leaving the country.","It was the most extreme example of cruelty to animals I had ever seen.","extreme weather conditions","This is hero-worship at its most extreme."],"opposite":"","synonyms":""},{"def":"far from what most people consider to be normal, reasonable or acceptable","examples":["extreme left-wing/right-wing views","Fascism was basically an extreme form of nationalism.","an extreme nationalist organization","Their ideas are too extreme for me.","She didn't like the idea—it sounded too extreme."],"opposite":"moderate","synonyms":""},{"def":"as far as possible from the centre, the beginning or in the direction mentioned","examples":["Kerry is in the extreme west of Ireland.","She sat on the extreme edge of her seat.","politicians on the extreme left of the party"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["extreme sport","extreme fighting","extreme unction","extreme vetting","in the extreme","go, etc. to extremes/an extreme","take something to extremes/an extreme"]},{"pos":"noun","level":"B2","meanings":[{"def":"a feeling, situation, way of behaving, etc. that is as different as possible from another or is opposite to it","examples":["extremes of love and hate","He used to be very shy, but now he's gone to the opposite extreme (= changed from one extreme kind of behaviour to another).","She goes from one extreme to the other (= changes from one extreme kind of behaviour to another).","At the other extreme, the top 10 per cent receives 30 per cent of the nation's income.","between extremes He takes a position somewhere these two extremes.","After always putting too much salt in her cooking, she went to the opposite extreme and banished it completely.","At the other extreme, women still childless at 32 were more likely to be from a professional background.","Avoid any extremes of emotional behaviour.","These photographs show extremes of obesity and emaciation.","She goes from one extreme to the other, and either works very hard or does absolutely nothing.","Their views are at opposite extremes from each other.","There has to be a solution between these extremes."],"opposite":"","synonyms":""},{"def":"the greatest or highest degree of something","examples":["The climate is mild with no extremes of temperature.","extremes of cold, wind or rain","the climatic extremes of the mountains","Many of these plants won't tolerate temperature extremes.","At the extreme, some nuclear waste is so radioactive it has to be kept isolated for thousands of years.","He went to the extreme of adulation, describing Churchill as the greatest man who ever lived.","It's a difficult place to live in because of its climatic extremes."],"opposite":"","synonyms":""},{"def":"to act or be forced to act in a way that is far from normal or reasonable","examples":["It's embarrassing the extremes he'll go to in order to impress his boss.","Taken to extremes, this kind of behaviour can be dangerous.","In the jungle they were driven to extremes in order to survive.","There is no need to go to such extremes.","It's foolish to take any dieting to extremes.","She has taken cleanliness to a new extreme."],"opposite":"","synonyms":""},{"def":"to a great degree","examples":["The journey would be dangerous in the extreme.","His voice was scornful in the extreme."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"go, etc. to extremes/an extreme | take something to extremes/an extreme","def":"to act or be forced to act in a way that is far from normal or reasonable","examples":["It's embarrassing the extremes he'll go to in order to impress his boss.","Taken to extremes, this kind of behaviour can be dangerous.","In the jungle they were driven to extremes in order to survive.","There is no need to go to such extremes.","It's foolish to take any dieting to extremes.","She has taken cleanliness to a new extreme."]},{"idiom":"in the extreme","def":"to a great degree","examples":["The journey would be dangerous in the extreme.","His voice was scornful in the extreme."]}],"phrasal":[],"related":[]}]