[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/ext/extra/extract__us_1.mp3","phonsUS":"/ˈekstrækt/","level":"B2","meanings":[{"def":"a short passage from a book, piece of music, etc. that gives you an idea of what the whole thing is like","examples":["The following extract is taken from her new novel.","He read out a brief extract from his book.","The extract is taken from a long essay.","The disc also includes an extract from one of his earlier operas."],"opposite":"","synonyms":""},{"def":"a substance that has been obtained from something else using a particular process","examples":["yeast extract","face cream containing natural plant extracts","(North American English) vanilla extract","extract of apricot"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["yeast extract"]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/ext/extra/extract__us_2.mp3","phonsUS":"/ɪkˈstrækt/","level":"C1","meanings":[{"def":"to remove or obtain a substance from something, for example by using an industrial or a chemical process","examples":["a machine that extracts excess moisture from the air","The Egyptians used a primitive form of distillation to extract the essential oils from plants.","Animals take in food and extract nutrients from it."],"opposite":"","synonyms":""},{"def":"to obtain information, money, etc., often by taking it from somebody who is unwilling to give it","examples":["Journalists managed to extract all kinds of information about her private life."],"opposite":"","synonyms":""},{"def":"to choose information, etc. from a book, a computer, etc. to be used for a particular purpose","examples":["This article is extracted from his new book."],"opposite":"","synonyms":""},{"def":"to take or pull something out, especially when this needs force or effort","examples":["The dentist may decide that the wisdom teeth need to be extracted.","He rifled through his briefcase and extracted a file.","I tried extracting the rusty nails with a claw hammer."],"opposite":"","synonyms":""},{"def":"to get a particular feeling or quality from a situation","examples":["They are unlikely to extract much benefit from the trip."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]