[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/e/eye/eye__/eye__us_1.mp3","phonsUS":"/aɪ/","level":"A1","meanings":[{"def":"either of the two organs on the face that you see with","examples":["The suspect has dark hair and green eyes.","to close/open your eyes","to lower your eyes (= to look down)","She rolled her eyes in disgust.","Keep your eyes shut!","in somebody's eyes/eye There were tears in his eyes.","I have something in my eye.","She had a haunted look in her dark eyes.","His eyes filled with tears.","The ending was so sad it brought tears to my eyes.","I could see a pair of blue eyes peering out at me.","Her eyes widened in disbelief.","His eyes narrowed suspiciously.","Their eyes lit up when they saw all the presents.","to make/avoid eye contact with somebody (= to look/avoid looking at them at the same time as they look at you)","All eyes were on him (= everyone was looking at him) as he walked on to the stage.","a feast/treat/delight for the eyes","As my eyes accustomed to the darkness, I could make out a shape by the window.","He drew the curtains to make sure no prying eyes saw what he was doing.","He held up the newspaper to shield his eyes from the sun.","He let his eyes roam around the scene.","He looked at me with a twinkle in his eye.","He turned his eyes to the door when he heard the handle turning.","Her bleary eyes showed that she hadn't slept.","Her eyes danced with amusement.","Her eyes dilated with horror at what she had done.","Her eyes flew open in surprise.","Her eyes glazed over when I said I worked in dictionaries.","Her eyes prickled with unshed tears.","Her eyes squinted against the brightness.","His eyes blazed with menace.","Her eyes told me nothing.","His eyes bulged in fury.","His eyes crinkled up at the corners as he smiled.","His eyes darted from face to face.","His eyes drifted over to Helen's chair.","His eyes hardened as he remembered how they had laughed at him.","His eyes held a mischievous gleam.","His eyes never left mine.","His eyes reflected his anguish.","His eyes rounded in mock amazement.","His eyes were drawn to a bundle of papers in the corner.","His narrow eyes betrayed his impatience.","I didn't want to strain my eyes to read, so I put the light on.","If I hadn't seen his jump with my own eyes, I would never have believed it possible.","It is essential to wear some form of eye protection.","My eyes followed his every move.","My eyes strained to make anything out in the darkness.","My eyes stream when I chop onions.","My eyes took in every detail as I entered the house for the first time in twenty years.","Out of the corner of her eye, she saw Harry start forward.","She averted her eyes from his face.","She could feel the old lady's eyes bore into her.","She just looked at me with those big blue eyes of hers.","She laughed, her eyes alight with excitement.","She reached up and tried to gouge her attacker's eyes.","She responded softly, her eyes showing concern.","She tried to sit up, her eyes fixed on Jean's face.","Skiers wear goggles to protect their eyes from the sun.","The dog's hungry eyes were on my sandwich.","The sun was in my eyes and I couldn't see the road.","Their eyes locked together in a battle of wills.","Tina squeezed her eyes shut and bit her lip."],"opposite":"","synonyms":""},{"def":"having the type or number of eyes mentioned","examples":["a blue-eyed blonde","a one-eyed monster"],"opposite":"","synonyms":""},{"def":"the ability to see","examples":["A surgeon needs a good eye and a steady hand.","Her skill at working with wood is coupled to a keen eye for design."],"opposite":"","synonyms":""},{"def":"a particular way of seeing something","examples":["with the eye of somebody He looked at the design with the eye of an engineer.","with a… eye She viewed the findings with a critical eye.","to somebody's eye To my eye, the windows seem out of proportion.","To an expert eye, the painting is an obvious fake.","He saw his students with new eyes now that he had a child of his own.","You need to look at your website through the user's eyes."],"opposite":"","synonyms":""},{"def":"the hole in the end of a needle that you put the thread through","examples":[],"opposite":"","synonyms":""},{"def":"a small thin piece of metal curved round, that a small hook fits into, used for fastening clothes","examples":["It fastens with a hook and eye."],"opposite":"","synonyms":""},{"def":"a calm area at the centre of a storm, etc.","examples":[],"opposite":"","synonyms":""},{"def":"a dark mark on a potato from which another plant will grow","examples":[],"opposite":"","synonyms":""},{"def":"a person or thing that is loved more than any other","examples":["She is the apple of her father's eye."],"opposite":"","synonyms":""},{"def":"to the horizon (= where the sky meets the land or sea)","examples":["The bleak moorland stretched on all sides as far as the eye could see."],"opposite":"","synonyms":""},{"def":"to open and close your eyes quickly, in a way that is supposed to be attractive","examples":[],"opposite":"","synonyms":""},{"def":"to be watching somebody/something carefully and with a lot of interest","examples":["The kids were all eyes as he slowly unwrapped the package."],"opposite":"","synonyms":""},{"def":"people all have different ideas about what is beautiful","examples":[],"opposite":"","synonyms":""},{"def":"in somebody’s presence; in front of somebody","examples":["He had seen his life's work destroyed before his very eyes.","Before our very eyes, the bird snatched the fish from the plate and flew off."],"opposite":"","synonyms":""},{"def":"to have a lot of something to deal with","examples":["We're up to our eyes in work."],"opposite":"","synonyms":""},{"def":"a view of something from a high position looking down","examples":["From the plane we had a bird's-eye view of Manhattan."],"opposite":"","synonyms":""},{"def":"to look at or examine something quickly","examples":["Could you just run your eyes over this report?","I cast my eyes around the room but couldn't see any familiar faces."],"opposite":"","synonyms":""},{"def":"to attract somebody’s attention","examples":["Can you catch the waiter's eye?"],"opposite":"","synonyms":""},{"def":"to see somebody/something","examples":["I haven't clapped eyes on them for weeks.","I hope I never set eyes on this place again!","Tom fell in love the moment he laid eyes on her."],"opposite":"","synonyms":""},{"def":"to look at or listen to something/somebody carefully and with a lot of attention","examples":[],"opposite":"","synonyms":""},{"def":"pleasant to listen to or look at","examples":["The room was painted in soft pastels that were easy on the eye."],"opposite":"","synonyms":""},{"def":"pleasant to look at","examples":["The room was painted in soft pastels that were easy on the eye."],"opposite":"","synonyms":""},{"def":"used to show that you do not believe somebody/something","examples":["‘It's an antique.’ ‘An antique, my eye!’"],"opposite":"","synonyms":""},{"def":"used to say that you should punish somebody by doing to them what they have done to you or to somebody else","examples":["They advocate a justice system that works on the principle of an eye for an eye."],"opposite":"","synonyms":""},{"def":"used to say that somebody has been greedy by taking more food than they can eat","examples":[],"opposite":"","synonyms":""},{"def":"to look at somebody/something and get great pleasure","examples":[],"opposite":"","synonyms":""},{"def":"to be seen only by a particular person","examples":["I'll lend you the letters but they're for your eyes only."],"opposite":"","synonyms":""},{"def":"to practise so that you are able to make good judgements about a task or activity that you are doing","examples":["I've got my eye in now—the ball is landing just where I want it."],"opposite":"","synonyms":""},{"def":"to be able to judge if things look attractive, valuable, etc.","examples":["I've never had much of an eye for fashion.","She has an eye for a bargain."],"opposite":"","synonyms":""},{"def":"to be watching somebody carefully, especially to check that they do not do anything wrong","examples":["And remember, I'll have my eye on you so you'd better behave.","The store detective had his eye on a group of boys who were acting suspiciously."],"opposite":"","synonyms":""},{"def":"to be thinking about asking somebody out, offering somebody a job, etc. because you think they are attractive, good at their job, etc.","examples":["He's got his eye on the new girl in your class."],"opposite":"","synonyms":""},{"def":"to be thinking about buying something","examples":[],"opposite":"","synonyms":""},{"def":"to be aware of everything that is happening around you, even things that seem difficult or impossible to see","examples":["You can’t get away with anything in her class. She has eyes in the back of her head."],"opposite":"","synonyms":""},{"def":"to be able to notice or see everything","examples":["She's bound to notice that chipped glass. The woman has eyes like a hawk!"],"opposite":"","synonyms":""},{"def":"to look at or watch something while doing something else, especially in a secret way so that other people do not notice","examples":["During his talk, most of the delegates had one eye on the clock."],"opposite":"","synonyms":""},{"def":"to always be looking for the chance to have a new sexual relationship","examples":[],"opposite":"","synonyms":""},{"def":"to be very obvious to somebody","examples":[],"opposite":"","synonyms":""},{"def":"very quickly; in a short time","examples":[],"opposite":"","synonyms":""},{"def":"in somebody’s opinion or according to the way that they see the situation","examples":["She can do no wrong in her father's eyes.","To Western eyes, it may seem that the city is overcrowded."],"opposite":"","synonyms":""},{"def":"according to the law, most people in the world, etc.","examples":["In the eyes of the law she is guilty, though few ordinary people would think so.","In the eyes of the law his knife was an offensive weapon."],"opposite":"","synonyms":""},{"def":"well known to many people through television, newspapers, the internet, etc.","examples":["She doesn't want her children growing up in the public eye."],"opposite":"","synonyms":""},{"def":"very quickly","examples":["Suddenly, in the twinkling of an eye, her whole life had been turned upside down."],"opposite":"","synonyms":""},{"def":"to watch somebody/something carefully","examples":["Over the next few months we will keep a close eye on sales."],"opposite":"","synonyms":""},{"def":"to listen or look out for somebody/something that you might hear or see","examples":[],"opposite":"","synonyms":""},{"def":"to take care of somebody/something and make sure that they are not harmed, damaged, etc.","examples":["We've asked the neighbours to keep an eye on the house for us while we are away.","Could you keep an eye on my bag while I go to the toilet?"],"opposite":"","synonyms":""},{"def":"to continue to give your attention to what is most important","examples":[],"opposite":"","synonyms":""},{"def":"to look for somebody/something while you are doing other things","examples":["Police have asked residents to keep an eye out for anything suspicious.","I walked around the store, keeping an eye out for bargains."],"opposite":"","synonyms":""},{"def":"to look out for somebody/something that you might see","examples":[],"opposite":"","synonyms":""},{"def":"to look out for somebody/something that you might see","examples":["We kept our eyes peeled for any signs of life."],"opposite":"","synonyms":""},{"def":"to watch somebody/something carefully in case you need to take action","examples":["Keep a weather eye on your competitors."],"opposite":"","synonyms":""},{"def":"to look straight at somebody without feeling embarrassed or ashamed","examples":["Can you look me in the eye and tell me you're not lying?","She looked her father straight in the eye and answered his question truthfully.","I'll never be able to look her in the face again!"],"opposite":"","synonyms":""},{"def":"to look at somebody in a way that shows that you find them sexually attractive","examples":["He's definitely giving you the eye!"],"opposite":"","synonyms":""},{"def":"if you meet somebody’s eye(s), you look directly at them as they look at you; if two people’s eyes meet, they look directly at each other","examples":["She was afraid to meet my eye.","Their eyes met across the crowded room.","She met his gaze without flinching."],"opposite":"","synonyms":""},{"def":"if a sight meets your eyes, you see it","examples":["A terrible sight met their eyes."],"opposite":"","synonyms":""},{"def":"your imagination","examples":["He pictured the scene in his mind's eye."],"opposite":"","synonyms":""},{"def":"the normal power of your eyes without the help of an instrument","examples":["The planet should be visible with/to the naked eye."],"opposite":"","synonyms":""},{"def":"to show no surprise or concern when something unusual happens","examples":["She didn't bat an eyelid when I told her my news."],"opposite":"","synonyms":""},{"def":"to be very surprised at something you hear/see","examples":["I couldn't believe my eyes when she walked in."],"opposite":"","synonyms":""},{"def":"to be very surprised at something you see","examples":["I couldn't believe my eyes when she walked in."],"opposite":"","synonyms":""},{"def":"used to say that everyone was very emotional about something","examples":["There wasn't a dry eye in the house when they announced their engagement."],"opposite":"","synonyms":""},{"def":"to not share the same views as somebody about something","examples":["The two of them have never seen eye to eye on politics."],"opposite":"","synonyms":""},{"def":"to find somebody/something so interesting, attractive, etc. that you watch them all the time","examples":["He couldn't keep his eyes off the girl sitting opposite him."],"opposite":"","synonyms":""},{"def":"a result, action, etc. that is disappointing or a defeat for somebody/something","examples":["The appointment of a woman was one in the eye for male domination."],"opposite":"","synonyms":""},{"def":"to be in love with only one particular person","examples":["He's only ever had eyes for his wife."],"opposite":"","synonyms":""},{"def":"to realize or make somebody realize the truth about something","examples":["Travelling really opens your eyes to other cultures."],"opposite":"","synonyms":""},{"def":"to be very attractive to look at","examples":[],"opposite":"","synonyms":""},{"def":"to hide your real actions or intentions from somebody by making them believe something that is not true","examples":[],"opposite":"","synonyms":""},{"def":"to think about or see something the way that another person sees it","examples":["Try looking at it through her eyes for a change.","Events are seen through the eyes of a Polish refugee."],"opposite":"","synonyms":""},{"def":"to see something by accident or not very clearly because you see it from the side of your eye and are not looking straight at it","examples":["Out of the corner of her eye, she saw him coming closer."],"opposite":"","synonyms":""},{"def":"to pretend that you have not noticed something so that you do not have to deal with it","examples":["You can't just close your eyes to his violence.","They seem intent on shutting their eyes to the problems of pollution."],"opposite":"","synonyms":""},{"def":"a person or thing that you are pleased to see; something that is very pleasant to look at","examples":[],"opposite":"","synonyms":""},{"def":"to stop giving your attention to what is most important","examples":[],"opposite":"","synonyms":""},{"def":"a person or thing is more complicated or interesting than you might think at first","examples":[],"opposite":"","synonyms":""},{"def":"to pretend not to notice something bad that is happening, so you do not have to do anything about it","examples":["The authorities were either unaware of the problem or they turned a blind eye to it."],"opposite":"","synonyms":""},{"def":"being watched carefully by somebody","examples":["The children played under the watchful eye of their father.","I want you under my eye."],"opposite":"","synonyms":""},{"def":"if a person does not know about something that they would normally think was bad, then it cannot hurt them","examples":["What does it matter if I use his flat while he’s away? What the eye doesn’t see…!"],"opposite":"","synonyms":""},{"def":"with the hope of using a particular situation in order to gain some advantage for yourself","examples":[],"opposite":"","synonyms":""},{"def":"fully aware of the possible problems or results of a particular course of action","examples":["I went into this with my eyes open so I guess I only have myself to blame."],"opposite":"","synonyms":""},{"def":"very easily, without thinking about it","examples":["I've made this trip so often, I could do it with my eyes shut."],"opposite":"","synonyms":""},{"def":"with the intention of doing something","examples":["He bought the warehouse with an eye to converting it into a hotel."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the apple of somebody’s eye","def":"a person or thing that is loved more than any other","examples":["She is the apple of her father's eye."]},{"idiom":"as far as the eye can/could see","def":"to the horizon (= where the sky meets the land or sea)","examples":["The bleak moorland stretched on all sides as far as the eye could see."]},{"idiom":"bat your eyes/eyelashes","def":"to open and close your eyes quickly, in a way that is supposed to be attractive","examples":[]},{"idiom":"be all eyes","def":"to be watching somebody/something carefully and with a lot of interest","examples":["The kids were all eyes as he slowly unwrapped the package."]},{"idiom":"beauty is in the eye of the beholder","def":"people all have different ideas about what is beautiful","examples":[]},{"idiom":"before/in front of somebody’s (very) eyes","def":"in somebody’s presence; in front of somebody","examples":["He had seen his life's work destroyed before his very eyes.","Before our very eyes, the bird snatched the fish from the plate and flew off."]},{"idiom":"be up to your eyes in something","def":"to have a lot of something to deal with","examples":["We're up to our eyes in work."]},{"idiom":"a bird’s-eye view (of something)","def":"a view of something from a high position looking down","examples":["From the plane we had a bird's-eye view of Manhattan."]},{"idiom":"cast/run an eye/your eyes over something","def":"to look at or examine something quickly","examples":["Could you just run your eyes over this report?","I cast my eyes around the room but couldn't see any familiar faces."]},{"idiom":"catch somebody’s eye","def":"to attract somebody’s attention","examples":["Can you catch the waiter's eye?"]},{"idiom":"clap/lay/set eyes on somebody/something","def":"to see somebody/something","examples":["I haven't clapped eyes on them for weeks.","I hope I never set eyes on this place again!","Tom fell in love the moment he laid eyes on her."]},{"idiom":"cock an ear/eye at something/somebody","def":"to look at or listen to something/somebody carefully and with a lot of attention","examples":[]},{"idiom":"easy on the ear/eye","def":"pleasant to listen to or look at","examples":["The room was painted in soft pastels that were easy on the eye."]},{"idiom":"easy on the eye","def":"pleasant to look at","examples":["The room was painted in soft pastels that were easy on the eye."]},{"idiom":"my eye!","def":"used to show that you do not believe somebody/something","examples":["‘It's an antique.’ ‘An antique, my eye!’"]},{"idiom":"an eye for an eye (and a tooth for a tooth)","def":"used to say that you should punish somebody by doing to them what they have done to you or to somebody else","examples":["They advocate a justice system that works on the principle of an eye for an eye."]},{"idiom":"somebody’s eyes are bigger than their stomach","def":"used to say that somebody has been greedy by taking more food than they can eat","examples":[]},{"idiom":"feast your eyes (on somebody/something)","def":"to look at somebody/something and get great pleasure","examples":[]},{"idiom":"for somebody’s eyes only","def":"to be seen only by a particular person","examples":["I'll lend you the letters but they're for your eyes only."]},{"idiom":"get your eye in","def":"to practise so that you are able to make good judgements about a task or activity that you are doing","examples":["I've got my eye in now—the ball is landing just where I want it."]},{"idiom":"have an eye for something","def":"to be able to judge if things look attractive, valuable, etc.","examples":["I've never had much of an eye for fashion.","She has an eye for a bargain."]},{"idiom":"have your eye on somebody","def":"to be watching somebody carefully, especially to check that they do not do anything wrong","examples":["And remember, I'll have my eye on you so you'd better behave.","The store detective had his eye on a group of boys who were acting suspiciously.","He's got his eye on the new girl in your class."]},{"idiom":"have your eye on something","def":"to be thinking about buying something","examples":[]},{"idiom":"have eyes in the back of your head","def":"to be aware of everything that is happening around you, even things that seem difficult or impossible to see","examples":["You can’t get away with anything in her class. She has eyes in the back of her head."]},{"idiom":"have (got) eyes like a hawk","def":"to be able to notice or see everything","examples":["She's bound to notice that chipped glass. The woman has eyes like a hawk!"]},{"idiom":"have one eye/half an eye on something","def":"to look at or watch something while doing something else, especially in a secret way so that other people do not notice","examples":["During his talk, most of the delegates had one eye on the clock."]},{"idiom":"have a roving eye","def":"to always be looking for the chance to have a new sexual relationship","examples":[]},{"idiom":"hit somebody (straight/right) in the eye","def":"to be very obvious to somebody","examples":[]},{"idiom":"in the blink of an eye","def":"very quickly; in a short time","examples":[]},{"idiom":"in somebody’s eyes","def":"in somebody’s opinion or according to the way that they see the situation","examples":["She can do no wrong in her father's eyes.","To Western eyes, it may seem that the city is overcrowded."]},{"idiom":"in the eyes of the law, world, etc.","def":"according to the law, most people in the world, etc.","examples":["In the eyes of the law she is guilty, though few ordinary people would think so.","In the eyes of the law his knife was an offensive weapon."]},{"idiom":"in the public eye","def":"well known to many people through television, newspapers, the internet, etc.","examples":["She doesn't want her children growing up in the public eye."]},{"idiom":"in the twinkling of an eye","def":"very quickly","examples":["Suddenly, in the twinkling of an eye, her whole life had been turned upside down."]},{"idiom":"keep a close eye/watch on somebody/something","def":"to watch somebody/something carefully","examples":["Over the next few months we will keep a close eye on sales."]},{"idiom":"keep your ears/eyes open (for somebody/something)","def":"to listen or look out for somebody/something that you might hear or see","examples":[]},{"idiom":"keep an eye on somebody/something","def":"to take care of somebody/something and make sure that they are not harmed, damaged, etc.","examples":["We've asked the neighbours to keep an eye on the house for us while we are away.","Could you keep an eye on my bag while I go to the toilet?"]},{"idiom":"keep your eye on the ball","def":"to continue to give your attention to what is most important","examples":[]},{"idiom":"keep an eye open/out (for somebody/something)","def":"to look for somebody/something while you are doing other things","examples":["Police have asked residents to keep an eye out for anything suspicious.","I walked around the store, keeping an eye out for bargains."]},{"idiom":"keep your eyes open (for somebody/something)","def":"to look out for somebody/something that you might see","examples":[]},{"idiom":"keep your eyes peeled/skinned (for somebody/something)","def":"to look out for somebody/something that you might see","examples":["We kept our eyes peeled for any signs of life."]},{"idiom":"keep a weather eye on somebody/something","def":"to watch somebody/something carefully in case you need to take action","examples":["Keep a weather eye on your competitors."]},{"idiom":"look somebody in the eye(s)/face","def":"to look straight at somebody without feeling embarrassed or ashamed","examples":["Can you look me in the eye and tell me you're not lying?","She looked her father straight in the eye and answered his question truthfully.","I'll never be able to look her in the face again!"]},{"idiom":"make eyes at somebody | give somebody the eye","def":"to look at somebody in a way that shows that you find them sexually attractive","examples":["He's definitely giving you the eye!"]},{"idiom":"meet somebody’s eye(s) | meet somebody’s gaze, look, etc. | people’s eyes meet","def":"if you meet somebody’s eye(s), you look directly at them as they look at you; if two people’s eyes meet, they look directly at each other","examples":["She was afraid to meet my eye.","Their eyes met across the crowded room.","She met his gaze without flinching.","A terrible sight met their eyes."]},{"idiom":"your mind’s eye","def":"your imagination","examples":["He pictured the scene in his mind's eye."]},{"idiom":"the naked eye","def":"the normal power of your eyes without the help of an instrument","examples":["The planet should be visible with/to the naked eye."]},{"idiom":"not bat an eyelid","def":"to show no surprise or concern when something unusual happens","examples":["She didn't bat an eyelid when I told her my news."]},{"idiom":"not believe your ears/eyes","def":"to be very surprised at something you hear/see","examples":["I couldn't believe my eyes when she walked in."]},{"idiom":"not believe your eyes","def":"to be very surprised at something you see","examples":["I couldn't believe my eyes when she walked in."]},{"idiom":"not a dry eye in the house","def":"used to say that everyone was very emotional about something","examples":["There wasn't a dry eye in the house when they announced their engagement."]},{"idiom":"not see eye to eye with somebody (on something)","def":"to not share the same views as somebody about something","examples":["The two of them have never seen eye to eye on politics."]},{"idiom":"not (be able to) take your eyes off somebody/something","def":"to find somebody/something so interesting, attractive, etc. that you watch them all the time","examples":["He couldn't keep his eyes off the girl sitting opposite him."]},{"idiom":"one in the eye (for somebody/something)","def":"a result, action, etc. that is disappointing or a defeat for somebody/something","examples":["The appointment of a woman was one in the eye for male domination."]},{"idiom":"only have eyes for/have eyes only for somebody","def":"to be in love with only one particular person","examples":["He's only ever had eyes for his wife."]},{"idiom":"open your/somebody’s eyes (to something)","def":"to realize or make somebody realize the truth about something","examples":["Travelling really opens your eyes to other cultures."]},{"idiom":"please the eye","def":"to be very attractive to look at","examples":[]},{"idiom":"pull the wool over somebody’s eyes","def":"to hide your real actions or intentions from somebody by making them believe something that is not true","examples":[]},{"idiom":"see, look at, etc. something through somebody’s eyes","def":"to think about or see something the way that another person sees it","examples":["Try looking at it through her eyes for a change.","Events are seen through the eyes of a Polish refugee."]},{"idiom":"see something out of the corner of your eye","def":"to see something by accident or not very clearly because you see it from the side of your eye and are not looking straight at it","examples":["Out of the corner of her eye, she saw him coming closer."]},{"idiom":"shut/close your eyes to something","def":"to pretend that you have not noticed something so that you do not have to deal with it","examples":["You can't just close your eyes to his violence.","They seem intent on shutting their eyes to the problems of pollution."]},{"idiom":"a sight for sore eyes","def":"a person or thing that you are pleased to see; something that is very pleasant to look at","examples":[]},{"idiom":"take your eye off the ball","def":"to stop giving your attention to what is most important","examples":[]},{"idiom":"there is more to somebody/something than meets the eye","def":"a person or thing is more complicated or interesting than you might think at first","examples":[]},{"idiom":"turn a blind eye (to something)","def":"to pretend not to notice something bad that is happening, so you do not have to do anything about it","examples":["The authorities were either unaware of the problem or they turned a blind eye to it."]},{"idiom":"under the (watchful) eye of somebody","def":"being watched carefully by somebody","examples":["The children played under the watchful eye of their father.","I want you under my eye."]},{"idiom":"what the eye doesn’t see (the heart doesn’t grieve over)","def":"if a person does not know about something that they would normally think was bad, then it cannot hurt them","examples":["What does it matter if I use his flat while he’s away? What the eye doesn’t see…!"]},{"idiom":"with an eye for/on/to the main chance","def":"with the hope of using a particular situation in order to gain some advantage for yourself","examples":[]},{"idiom":"with your eyes open","def":"fully aware of the possible problems or results of a particular course of action","examples":["I went into this with my eyes open so I guess I only have myself to blame."]},{"idiom":"with your eyes shut/closed","def":"very easily, without thinking about it","examples":["I've made this trip so often, I could do it with my eyes shut."]},{"idiom":"with an eye to something/to doing something","def":"with the intention of doing something","examples":["He bought the warehouse with an eye to converting it into a hotel."]}],"phrasal":[],"related":["eye up","lazy eye","red-eye","rib-eye","shut-eye","black eye","eagle eye","eye candy","eye level","eye teeth","Queer Eye","Birds Eye™","Eastern Eye","eye-rolling","eye-opener","eye-opening","eye-popping","eye strain"]},{"pos":"verb","level":"","meanings":[{"def":"to look at somebody/something carefully, especially because you want something or you suspect that something is wrong","examples":["to eye somebody suspiciously","He couldn't help eyeing the cakes hungrily.","They eyed us with alarm.","The children eyed the cakes greedily."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["eye up"],"related":[]}]