[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fac/facil/facility__us_4.mp3","phonsUS":"/fəˈsɪləti/","level":"B2","meanings":[{"def":"buildings, services, equipment, etc. that are provided for a particular purpose","examples":["leisure/sports facilities","medical/recreational/educational facilities","shopping/banking/cooking facilities","Recycling facilities are provided.","The school is upgrading its outdoor play facilities.","They provide facilities management services to corporations, hospitals and universities.","facilities for somebody/something There are not enough facilities for families with young children.","All rooms have private facilities (= a private bathroom).","All bedrooms offer private facilities.","Facilities include a large indoor pool, jacuzzi and sauna.","I made full use of the computing facilities.","The communal facilities were in a bad state.","The hotel provides excellent facilities for children.","The hotel has special facilities for welcoming disabled people.","There are childcare facilities on site.","Residents complain about a lack of healthcare facilities in the area.","The railway station was criticized for its lack of disabled facilities.","The airport plans to improve internet facilities in its terminals.","The new headquarters house offices, restaurants, and conference facilities.","The school has no facilities for the teaching of music.","The toilets and other communal facilities were in a shocking state.","We are looking to upgrade the existing facilities.","The report warns that there are no back-up facilities if the reprocessing plant breaks down.","a hotel with only basic facilities","hospitals, schools and other major community facilities","to improve access to essential facilities","training and other support facilities"],"opposite":"","synonyms":""},{"def":"a place, usually including buildings, used for a particular purpose or activity","examples":["the world’s largest nuclear waste facility","a new healthcare facility","a production/manufacturing/research/storage facility","a detention/correctional facility (= a prison)","A doctor visited the facility and found deplorable conditions.","She trains with the team at their practice facility.","The 100 000 square-foot facility houses labs for NASA's research.","The company expects to open its facility by late September.","The old facility is now used for storage of dry products.","He spent 90 days at the county's local correctional facility.","residents of long-term care facilities","prisoners in state and federal facilities","plans to renovate an existing facility","a water treatment facility","a temporary storage facility for blood samples","a production facility located in New Mexico","a new facility for military training","a mental health facility"],"opposite":"","synonyms":""},{"def":"a special feature of a machine, service, etc. that makes it possible to do something extra","examples":["a bank account with an overdraft facility","This facility allows the user to input text in various forms onto the screen and thus create a true newspaper page.","facility for doing something a facility for checking spelling","The archive offers a central facility for cataloguing and indexing data.","The device has a facility for storing any sound you like.","The software's ‘list’ facility allows users to compile their own list."],"opposite":"","synonyms":""},{"def":"a natural ability to learn or do something easily","examples":["She has a facility for languages.","He plays the piano with surprising facility.","He played with great facility.","She showed an amazing facility for mind-reading."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]