[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fac/facul/faculty__us_1.mp3","phonsUS":"/ˈfæklti/","level":"C1","meanings":[{"def":"a department or group of related departments in a college or university","examples":["the Faculty of Law","students who are doing degrees in the Arts Faculty","the Faculty of Arts"],"opposite":"","synonyms":""},{"def":"all the teachers in a faculty of a college or university","examples":["the Law School faculty","a faculty meeting","faculty members","Larger grants may ensure more funding for faculty development.","My faculty adviser made an effort to contact me.","a hearing before a faculty committee","collaboration across faculties"],"opposite":"","synonyms":""},{"def":"all the teachers of a particular university or college","examples":["faculty members","She joined the faculty of the University of Maryland.","the faculty at public institutions","her colleagues on the faculty","The degree of job security for tenured faculty is high relative to most other jobs.","Teachers are typically part-timers and adjunct faculty.","I was fortunate to receive a faculty appointment at Ohio State."],"opposite":"","synonyms":""},{"def":"any of the physical or mental abilities that a person is born with","examples":["the faculty of sight","She retained her mental faculties (= the ability to think and understand) until the day she died.","to be in full possession of your faculties (= be able to speak, hear, see, understand, etc.)","intellectual/critical/artistic faculties","He is not in full possession of all his mental faculties.","She is over eighty but still has all her faculties.","We try to develop the student's critical faculties.","the evolution of man's higher faculties"],"opposite":"","synonyms":""},{"def":"a particular ability for doing something","examples":["the faculty of understanding complex issues","He had a faculty for seeing his own mistakes.","our faculty for picking up speech even in noisy environments"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]