[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fai/fail_/fail__us_1.mp3","phonsUS":"/feɪl/","level":"A2","meanings":[{"def":"to not be successful in achieving something","examples":["Many diets fail because they are boring.","Ultimately all their efforts failed.","a policy/plan fails","fail in something I failed in my attempt to persuade her.","He failed in his bid for the presidency.","fail to do something The department failed to meet its sales targets.","They promised a lot, but utterly failed to deliver.","The song can't fail to be a hit (= definitely will be a hit).","I tried to cheer her up, but failed miserably.","Economic policy has failed miserably to address these issues.","Others have tried and failed.","Can we succeed where others have failed?","He tries to be a good father, but ultimately fails in his responsibility.","She failed in her bid to be re-elected.","She failed to get into art college.","The film completely fails to convince.","If the play has some message to get across, it singularly fails to do so.","That joke never fails.","She came up with several plans that failed spectacularly before finally achieving success.","The show didn't just fail, it failed spectacularly.","The game fails in many respects.","Opponents say it's a policy doomed to fail.","She tried to put an all-women crew together, but failed dismally.","They had tried and they had failed."],"opposite":"succeed","synonyms":""},{"def":"to not pass a test or an exam; to decide that somebody/something has not passed a test or an exam","examples":["What will you do if you fail?","fail something He failed his driving test.","Students who fail the exam can retake it.","She was disqualified after failing a drugs test.","The restaurant failed a hygiene inspection.","fail somebody The examiners failed over half the candidates.","My car failed its MOT.","Schools that fail their inspection can be taken over.","I failed all my A levels but I turned out fine.","She was convinced she'd failed the audition.","He was rejected for the army after failing the physical.","If your attendance drops below 80%, you automatically fail the course.","They can fail you for poor attendance.","He failed me for not looking in my rear-view mirror often enough.","If you fail, you have to resit.","There's no grade: it's just pass or fail.","Once a student has failed on a few tasks, they lose motivation."],"opposite":"pass","synonyms":""},{"def":"to not do something","examples":["fail to do something People failed to recognize her talent.","His article fails to mention that he actually supported this change.","If you fail to comply, you can be fined.","The government has failed to provide the needed resources.","Such comments never failed to annoy him.","I fail to see (= I don't understand) why you won't even give it a try.","She cannot fail to (= must) be aware of the situation.","fail in something They failed in their duty to protect the public.","He failed to keep the appointment.","The authorities have totally failed to address this problem.","I fail to understand why this can't be resolved.","They fail to understand the underlying causes.","The country failed to comply with UN resolutions.","He has repeatedly failed to explain his actions.","He felt he would be failing in his duty if he did not report it.","Politicians are failing in their responsibility to tackle climate change.","She failed in her obligation to warn the client."],"opposite":"","synonyms":""},{"def":"to stop working","examples":["The brakes on my bike failed half way down the hill.","The air-conditioning system failed on the hottest day of the year.","Sadly, his kidneys had failed.","The plane can still be flown if one engine fails.","The ship was towed into harbour when its engines failed.","Many of the plane's systems failed before the crash.","The PA system failed partway through his speech.","Telephone systems can fail during a storm.","What happens if your internet connection fails while you are downloading a file?","If your power fails, or your broadband connection goes down, you can't make or receive calls.","If the circuit is broken the entire network could fail.","An overdose could cause the heart to fail."],"opposite":"","synonyms":""},{"def":"to become weak","examples":["Her eyesight is failing.","The light began to fail."],"opposite":"","synonyms":""},{"def":"to disappoint somebody; to be unable to help when needed","examples":["When he lost his job, he felt he had failed his family.","She tried to be brave, but her courage failed her.","(figurative) Words fail me (= I cannot express how I feel)."],"opposite":"","synonyms":""},{"def":"to not be enough when needed or expected","examples":["The crops failed again last summer.","The rains had failed and the rivers were dry."],"opposite":"","synonyms":""},{"def":"to be unable to continue","examples":["Several banks failed during the recession.","an enterprise that was doomed to fail from the start","A high percentage of businesses fail because of the collapse of a major customer.","Businesses fail because they can't pay their bills.","More banks failed as people rushed to withdraw their money."],"opposite":"","synonyms":""},{"def":"used to suggest something that somebody can do if nothing else they have tried is successful","examples":["If all else fails, you can always sell your motorbike."],"opposite":"","synonyms":""},{"def":"so important to the economy of a country that when it finds itself in financial trouble, the government or central bank must act to save it","examples":["Shouldering the huge costs of rescuing banks that are too big to fail has been left to taxpayers."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"if all else fails","def":"used to suggest something that somebody can do if nothing else they have tried is successful","examples":["If all else fails, you can always sell your motorbike."]},{"idiom":"too big to fail","def":"so important to the economy of a country that when it finds itself in financial trouble, the government or central bank must act to save it","examples":["Shouldering the huge costs of rescuing banks that are too big to fail has been left to taxpayers."]}],"phrasal":[],"related":["fail-safe","pass-fail","Fianna Fáil","without fail","too big to fail"]},{"pos":"noun","level":"","meanings":[{"def":"the result of an exam in which a person is not successful","examples":["I got three passes and one fail."],"opposite":"pass","synonyms":""},{"def":"a mistake or lack of success in doing something","examples":["The show was an epic fail.","For the sake of that potential, I'm willing to put up with some fail."],"opposite":"","synonyms":""},{"def":"when you tell somebody to do something without fail, you are telling them that they must do it","examples":["I want you here by two o'clock without fail."],"opposite":"","synonyms":""},{"def":"always","examples":["He hands in his assignment every week without fail."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"without fail","def":"when you tell somebody to do something without fail, you are telling them that they must do it","examples":["I want you here by two o'clock without fail.","He hands in his assignment every week without fail.","We have to wait for the final chapter for the big reveal."]}],"phrasal":[],"related":[]}]