[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fai/failu/failure__us_2.mp3","phonsUS":"/ˈfeɪljər/","level":"B2","meanings":[{"def":"lack of success in doing or achieving something","examples":["The success or failure of the plan depends on you.","She is still coming to terms with the failure of her marriage.","The attempt was doomed to failure.","All my efforts ended in failure.","the problems of economic failure and increasing unemployment","Their bid to win the contract resulted in abject failure.","The decision to withdraw funding represents a failure of imagination.","the intelligence failures that preceded the terrorist attacks","All her efforts were doomed to failure.","Children who are doing badly tend to expect failure and criticism.","Fear of failure should not deter you from trying.","He attributes the failure of the project to lack of government support.","He was too proud to admit failure.","She wanted someone to blame for the failure of their relationship.","I will not tolerate failure.","Initial failure was followed by unexpected, if modest, success.","John had a long history of academic failure.","There is a high failure rate with this treatment.","War is the ultimate failure of public communication."],"opposite":"success","synonyms":""},{"def":"a person or thing that is not successful","examples":["The whole thing was a complete failure.","A team learns from experience, both successes and failures.","failure as something He was a failure as a teacher.","Her ideas were large: if she could not succeed, she would at least be a heroic failure.","I felt (like) a complete failure.","The film was one of the rare failures in his career.","The venture proved a costly failure.","This breach constitutes a serious failure in performance.","failures arising from circumstances beyond your control","to learn from past failures","The project was considered a failure in both technical and economic terms.","The rebellion was a dismal failure."],"opposite":"success","synonyms":""},{"def":"an act of not doing something, especially something that you are expected to do","examples":["failure to do something Failure to comply with the regulations will result in prosecution.","the city's failure to provide an efficient public transport system","the government's failure to carry out reforms in the energy sector","His confession followed repeated failures to appear in court.","failure of somebody/something to do something the failure of the United Nations to maintain food supplies","failure by somebody/something to do something a report on the failure by the police to protect her","Nothing can excuse your failure to ask my permission.","He lamented his failure to formulate a satisfactory theory.","government failure to listen to the voice of the electorate"],"opposite":"","synonyms":""},{"def":"the state of not working correctly or as expected; an occasion when this happens","examples":["patients suffering from heart/kidney/liver failure","renal/respiratory failure","Production has been hampered by mechanical failure.","A power failure plunged everything into darkness.","The cause of the crash was given as engine failure.","Poor maintenance caused the failure of two electricity generators.","patients with chronic renal failure","the commonest cause of acute liver failure","The aircraft seems to have experienced an engine failure.","a failure in the computer system","a rare viral infection that can lead to heart failure"],"opposite":"","synonyms":""},{"def":"a situation in which a business has to close because it is not successful","examples":["There has been an alarming increase in business failures.","Are we going to see more closures or failures in the ISP business?","Business failures rose by 30% in 2018."],"opposite":"","synonyms":""},{"def":"a situation in which crops do not grow correctly and do not produce food","examples":["Bad weather has resulted in crop failure."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["heart failure"]}]