[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fal/fall_/fall__us_1.mp3","phonsUS":"/fɔːl/","level":"A1","meanings":[{"def":"to drop down from a higher level to a lower level","examples":["The rain was falling steadily.","They were injured by falling rocks.","fall + adv./prep. Several of the books had fallen onto the floor.","The label must have fallen off.","The leaves were falling from the trees.","The seeds fall to the ground and germinate.","One of the kids fell into the river.","+ noun He fell 20 metres onto the rocks below.","It was September and the leaves were starting to fall.","A tile fell off the roof.","70 millimetres of rain fell in just a few hours.","Snow had fallen during the night.","the snow falling on the fields","I've lost my necklace—it must have fallen off.","A cup fell off the shelf and broke.","He was walking by the canal and he fell in.","A leaf fell into my drink.","The plate fell to the floor.","Part of a satellite fell to earth.","Tears fell freely from her eyes.","She lifted her arm, but then let it fall.","Loose bricks were falling down onto the ground.","Her hands fell limply to her sides.","He fell overboard in heavy seas.","He fell from the fourth floor.","He fell on some broken glass.","Careful, or you'll fall!"],"opposite":"","synonyms":""},{"def":"to suddenly stop standing","examples":["She slipped on the ice and fell.","A tree fell, just missing his car.","fall + adv./prep. I fell over and cut my knee.","The house looked as if it was about to fall down.","She fell heavily to the ground.","She fell headlong, with a cry of alarm.","One of the children fell over.","He stumbled and almost fell.","I nearly fell on the ice, but recovered.","She tripped and fell going downstairs.","A shot rings out, and he falls backwards.","He fell through a glass door.","She fell forward and hit her head on the table.","I fell back onto the bed.","When a tree falls, it is cut up for firewood."],"opposite":"","synonyms":""},{"def":"to decrease in amount, number or strength","examples":["Prices continued to fall on the stock market today.","The temperature fell sharply in the night.","Falling birth rates could have an impact on future economic growth.","Reputations rise and fall for a variety of reasons.","fall by something Their profits have fallen by 30 per cent.","fall + noun Share prices fell 30p.","Petroleum sales fell almost 11 per cent.","fall against something The dollar fell slightly against the yen.","fall to something Her voice fell to a whisper.","Unemployment fell to its lowest level in 30 years.","The price of coal fell sharply.","Profits were falling and so was the stock price.","With falling ad revenues, the magazine was in trouble.","TV ratings have fallen dramatically.","The country's birth rate has fallen to 1.8 children per family.","Winter temperatures never fall below 10°C.","Real hourly wages have fallen significantly over the past 25 years.","The number of people unemployed has fallen from two million to just over one and a half million.","The company's shares fell 19 per cent following the announcement.","Demand is likely to fall by some 15 per cent.","Expenditure on education fell by 10 per cent last year.","During that period, visitor numbers fell by half."],"opposite":"","synonyms":""},{"def":"to pass into a particular state; to begin to be something","examples":["fall + adj. He had fallen asleep on the sofa.","She fell ill soon after and did not recover.","The room had fallen silent.","When the rent fell due, she couldn't pay.","The book fell open at a page of illustrations.","fall into something I had fallen into conversation with a man on the train.","The house had fallen into disrepair.","Partway through the expedition, he fell sick and had to give up.","When the post fell vacant, she applied.","His mouth fell open in astonishment.","They had been married for just a few weeks when she fell pregnant.","At last the house fell quiet and everyone slept.","They met when they were students, and fell in love.","By that time the building had fallen into disuse.","words and phrases that have fallen into disuse","He fell into a coma from which he never recovered.","She fell into a daydream.","We fell into the habit of walking to work together every day."],"opposite":"","synonyms":""},{"def":"to hang down","examples":["Her hair fell over her shoulders in a mass of curls."],"opposite":"","synonyms":""},{"def":"to slope downwards","examples":["The land falls away sharply towards the river."],"opposite":"","synonyms":""},{"def":"to be defeated or captured","examples":["The coup failed but the government fell shortly afterwards.","fall to somebody Troy finally fell to the Greeks."],"opposite":"","synonyms":""},{"def":"to die in battle; to be shot","examples":["a memorial to those who fell in the two world wars"],"opposite":"","synonyms":""},{"def":"to come quickly and suddenly","examples":["A sudden silence fell.","Darkness falls quickly in the tropics.","fall on somebody/something An expectant hush fell on the guests."],"opposite":"","synonyms":""},{"def":"to happen or take place","examples":["My birthday falls on a Monday this year."],"opposite":"","synonyms":""},{"def":"to move in a particular direction or come in a particular position","examples":["My eye fell on (= I suddenly saw) a curious object.","Which syllable does the stress fall on?","A shadow fell across her face."],"opposite":"","synonyms":""},{"def":"to belong to a particular class, group or area of responsibility","examples":["Out of over 400 staff there are just seven that fall into this category.","This case falls outside my jurisdiction.","This falls under the heading of scientific research.","This case falls squarely within the committee's jurisdiction.","That topic falls outside the scope of this thesis."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["fall about","fall apart","fall away","fall back","fall back on","fall behind","fall behind with","fall down","fall for","fall in","fall into","fall in with","fall off","fall on","fall out","fall over","fall over yourself to do","fall through","fall to","fall upon"],"related":["fall for","fall guy","fall in","fall off","fall-off","fall on","fall out","fall to","fall away","fall back","fall down","fall into","fall over","fall upon","free fall","fall about","fall apart","fall behind"]},{"pos":"noun","level":"A2","meanings":[{"def":"an act of falling","examples":["I had a bad fall and broke my arm.","fall from something She was killed in a fall from a horse.","He was hurt in a fall at his home yesterday.","Luckily a bush broke his fall.","She broke her neck in a fall from a horse.","She took a bad fall while out riding.","The chances of surviving a fall under a train are almost nil.","The doctor says she's had a very nasty fall."],"opposite":"","synonyms":""},{"def":"an amount of snow, rain, rocks, etc. that falls or has fallen","examples":["a heavy fall of snow","a rock fall","covered by a light fall of volcanic ash","a fresh fall of snow"],"opposite":"","synonyms":""},{"def":"the season of the year between summer and winter, when leaves change colour and the weather becomes colder","examples":["in the fall of 2019","last fall","Cool, damp fall weather brings out snails.","He returned to school a month into the fall semester.","New England's gorgeous fall foliage","The trees were on fire with vibrant fall colors."],"opposite":"","synonyms":""},{"def":"a decrease in size, number, rate or level","examples":["Share prices suffered a slight fall yesterday.","fall in something a sharp fall in prices","a steep/dramatic fall in profits","a 3 per cent fall in unemployment","Car crime in Oxford fell significantly last year.","Car crime fell by about a quarter over a 12-month period.","The number of stolen vehicles dropped from 1 013 to 780, a fall of 26 per cent.","According to this data, 780 vehicles were stolen, 26 per cent down on the previous year.","There was an 11 per cent drop in reported thefts from motor vehicles, from 1 971 to 1 737.","These figures show that, as far as car crime is concerned, the main trend is downwards.","The fall in age at first marriage occurred during the second half of the eighteenth century.","The opinion polls show a significant fall in her popularity.","This figure represents a fall of 21 per cent on the same period last year.","This triggered the recent dramatic falls on the Tokyo stock exchange.","a big fall in house prices","a large fall in share prices","a projected fall of 2 per cent"],"opposite":"","synonyms":""},{"def":"a loss of political, economic, etc. power or success; the loss or defeat of a city, country, etc. in war","examples":["the fall of the Roman Empire","the rise and fall of British industry","the fall of Berlin","the fall of Rome to the barbarians","The scandal undoubtedly contributed to his fall from power.","The novel is set in the revolutionary period in France, following the fall of Louis Philippe.","The economic crisis worsened, bringing about the fall of the government.","Napoleon's rise and fall","He remained determined to prevent the fall of South Vietnam to the Communists.","the actions that led to his eventual fall from power","a book charting the rise and fall of the Habsburg Empire"],"opposite":"","synonyms":""},{"def":"a situation in which a person, an organization, etc. loses the respect of other people because they have done something wrong","examples":["the TV preacher’s spectacular fall from grace","His diary charts his dramatic fall from grace."],"opposite":"","synonyms":""},{"def":"a large amount of water falling down from a height","examples":["The falls upstream are full of salmon.","Niagara Falls"],"opposite":"","synonyms":""},{"def":"the way in which something falls or happens","examples":["the fall of the dice","the dark fall of her hair (= the way her hair hangs down)"],"opposite":"","synonyms":""},{"def":"the occasion when Adam and Eve did not obey God and had to leave the Garden of Eden","examples":[],"opposite":"","synonyms":""},{"def":"to be doing something that involves risks and that may end in disaster","examples":[],"opposite":"","synonyms":""},{"def":"to stop somebody from falling onto something hard","examples":["Luckily, a bush broke his fall."],"opposite":"","synonyms":""},{"def":"if you have too high an opinion of yourself or your abilities, something will happen to make you look stupid","examples":[],"opposite":"","synonyms":""},{"def":"to accept responsibility or punishment for something that you did not do, or did not do alone","examples":["He took the fall for his boss and resigned.","Who will take the fall for the scandal?","Someone has to take the fall."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be riding for a fall","def":"to be doing something that involves risks and that may end in disaster","examples":[]},{"idiom":"break somebody’s fall","def":"to stop somebody from falling onto something hard","examples":["Luckily, a bush broke his fall."]},{"idiom":"pride comes/goes before a fall","def":"if you have too high an opinion of yourself or your abilities, something will happen to make you look stupid","examples":[]},{"idiom":"take the fall (for somebody/something)","def":"to accept responsibility or punishment for something that you did not do, or did not do alone","examples":["He took the fall for his boss and resigned.","Who will take the fall for the scandal?","Someone has to take the fall."]}],"phrasal":[],"related":[]}]