[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fam/famil/family__us_2_rr.mp3","phonsUS":"/ˈfæməli/","level":"A1","meanings":[{"def":"a group consisting of one or two parents and their children","examples":["I introduced Neil to the other members of my family.","The event promises games and fun for the entire family.","This is a summer movie for the whole family.","Every family has its own story to tell.","All my family enjoy skiing.","one-parent/single-parent families","a family of four/five, etc Taking a family of four to the cinema is expensive.","families with young children","He's a friend of the family (= he is known and liked by the parents and the children).","From early childhood he was a mystery to the rest of his family.","He barely earns enough money to pay his rent and feed his family.","She works tirelessly to provide for her family.","They help children to find placements with adoptive families.","It is difficult for them to earn enough to feed their families.","issues which create conflict within the family","tax incentives for low-income families","Many of our students come from poor families."],"opposite":"","synonyms":""},{"def":"a group consisting of one or two parents, their children and close relations","examples":["All our family came to Grandad's eightieth birthday party.","The support of family and friends is vital.","We've only told the immediate family (= the closest relations).","the royal family (= the children and close relations of the king or queen)","I always think of you as one of the family.","in a family There are a lot of girls in our family.","outside a family Nobody outside his family knew that he had a daughter.","We all knew her so well that we felt she was almost part of the family.","(informal) She's family (= she is a relation).","We have family in France.","We are a very close-knit family and support each other through any crises.","a helpline set up to counsel bereaved families","a counselling agency to help bereaved families","These problems occur in all families.","She grew up in a military family.","She married into a wealthy family.","The movie is a portrait of a dysfunctional family."],"opposite":"","synonyms":""},{"def":"all the people who are related to each other, including those who are now dead","examples":["Some families have farmed in this area for hundreds of years.","This painting has been in our family for generations.","He belonged to an aristocratic family.","She is of Muslim heritage on her father's side of the family."],"opposite":"","synonyms":""},{"def":"a couple’s or a person’s children, especially young children","examples":["They have a large family.","I addressed it to Mr and Mrs Jones and family.","Do they plan to start a family (= have children)?","This is a wonderful place to raise a family.","She brought up a family of six children on her own.","She chose to stop work to have a family.","They got married last year and plan to start a family soon.","Average family size has decreased since the Victorian era.","parents with young families","I always wanted to have a large family.","It's a struggle to bring up a family on a low income."],"opposite":"","synonyms":""},{"def":"a group into which animals, plants, etc. that have similar characteristics are divided, smaller than an order and larger than a genus","examples":["Lions belong to the cat family.","This bird is a member of the crow family.","family of something Orchids are the largest family of flowering plants."],"opposite":"","synonyms":""},{"def":"a group of related languages","examples":["the Germanic family of languages"],"opposite":"","synonyms":""},{"def":"(to be/become) pregnant","examples":[],"opposite":"","synonyms":""},{"def":"to be a common feature in a particular family","examples":["Heart disease runs in the family.","a medical condition which runs in the family"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"(be/get) in the family way","def":"(to be/become) pregnant","examples":[]},{"idiom":"run in the family","def":"to be a common feature in a particular family","examples":["Heart disease runs in the family.","a medical condition which runs in the family"]}],"phrasal":[],"related":["family man","family name","family room","family tree","word family","family court","family doctor","family leave","family style","family-style","family values","joint family","blended family","extended family","family-friendly","family medicine","family planning","family practice","nuclear family"]},{"pos":"adjective","level":"A1","meanings":[{"def":"connected with the family or a particular family","examples":["family life","The job was starting to affect his family life.","your family background","Only close family members called her ‘Sally’.","a family friend (= a friend of the whole family)","family ties/connections","It's a family tradition.","She has become interested in her family history.","He has a family history of heart disease.","Do you know anything about her family background?","The job wouldn't really fit in with my family commitments.","In 1941 he carried on the family tradition and enlisted in the army.","They prefer to stay in their home country because of family ties.","a good family man, completely devoted to his wife and kids","a family history of heart disease"],"opposite":"","synonyms":""},{"def":"owned by a family","examples":["They had to sell the family home.","a family business","the family car","She had to sell the family jewels in order to pay off her gambling debts."],"opposite":"","synonyms":""},{"def":"suitable for all members of a family, both adults and children","examples":["a family show","family entertainment"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]