[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fam/famil/familiar__us_1.mp3","phonsUS":"/fəˈmɪliər/","level":"B1","meanings":[{"def":"well known to you; often seen or heard and therefore easy to recognize","examples":["to look/sound/seem familiar","I couldn’t see any familiar faces in the room.","He's a familiar figure in the neighbourhood.","Then she heard a familiar voice.","The cast contains a number of familiar names.","The song was vaguely familiar.","familiar to somebody The smell is very familiar to everyone who lives near a bakery.","Violent attacks are becoming all too familiar (= sadly familiar).","Her face looked strangely familiar.","His face looked awfully familiar.","His face was instantly familiar, even after all those years.","The name sounded vaguely familiar to her.","The place felt faintly familiar to me.","The report's conclusions were already familiar enough to the government.","The room looked distinctly familiar.","a name that was somehow familiar","a situation which has become all too familiar to most teachers","The company's brand has become a familiar sight."],"opposite":"unfamiliar","synonyms":""},{"def":"knowing something very well","examples":["an area with which I had been familiar since childhood","You will soon become familiar with the different activities.","Are you familiar with the computer software they use?","She would have been familiar with the work of this 18th-century German philosopher.","Ishii is clearly intimately familiar with his script and characters.","You will need to be thoroughly familiar with our procedures.","I'm not overly familiar with these issues.","I was now getting much more familiar with the local area.","By now you will be familiar with the one-way system in the centre of town."],"opposite":"unfamiliar","synonyms":""},{"def":"very informal, sometimes in a way that is unpleasant","examples":["You seem to be on very familiar terms with your tutor.","After a few drinks her boss started getting too familiar for her liking.","familiar with somebody He was being overly familiar with Gloria."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Bartlett's Familiar Quotations"]}]