[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fan/fan__/fan__us_1.mp3","phonsUS":"/fæn/","level":"A2","meanings":[{"def":"a person who admires somebody/something or enjoys watching or listening to somebody/something very much","examples":["sports/music fans","Movie fans will be familiar with his work already.","Crowds of football fans filled the streets.","I like his films, but I wouldn't say I'm a diehard fan (= one who strongly admires somebody/something in all circumstances).","fan of somebody/something I'm a big fan of her books.","I'm a huge fan of Rihanna.","I'm not a great fan of bushy beards (= I don't like them).","Hundreds of fans besieged the star's hotel.","Hundreds of fans clamoured/​clamored to catch a glimpse of the star.","I'm a big fan of Italian food.","He's an avid fan of the horror genre.","The singer said that she hated to disappoint the fans but she had to cancel.","It's not very original, but it should please her fans.","More than 40 000 fans turned up for the 12-hour event.","Only diehard Tolkien fans will enjoy this book.","Over 120 000 fans packed into the stadium.","Over 25 000 fans applauded both teams off the field.","You know I'm a big baseball fan.","His family are all cricket fans.","Soccer fans converged on the capital for the cup final.","Tennis fans flocked to Wimbledon.","The actress is asking the court to protect her from an obsessive fan who is making her life a misery.","The big band sound of Syd Lawrence and his Orchestra will delight fans.","The goal was greeted by jubilation from the home fans.","The show has an extensive and loyal fan base.","The singer says her dad is her number one fan.","There were clashes between opposing fans after the game.","a film that millions of rabid fans have waited years to see","one of the team's biggest fans","I'm so excited to meet you - I'm a huge fan.","He's a big Yankees fan.","I didn't agree with the article, but then I'm not his greatest fan.","I'm no fan of modern architecture but this is fantastic.","I'm not really a cheese fan, so I don't eat much pizza.","The character is a fan favourite and will recur in future movies.","He's always had a huge fan following."],"opposite":"","synonyms":""},{"def":"a machine that creates a current of air","examples":["to switch on the electric fan","a fan heater","a fan blowing cold air"],"opposite":"","synonyms":""},{"def":"a thing that you hold in your hand and wave to create a current of cool air","examples":[],"opposite":"","synonyms":""},{"def":"when somebody in authority finds out about something bad or wrong that somebody has done","examples":["When the shit hits the fan, I don't want to be here."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"when the shit hits the fan","def":"when somebody in authority finds out about something bad or wrong that somebody has done","examples":["When the shit hits the fan, I don't want to be here."]}],"phrasal":[],"related":["fan base","fan belt","fan club","fan mail","fan out","fan oven","fan site","fan fiction","fan bases","fan belts","fan clubs","fan ovens","fan sites","extractor fan","fan out | fan something","fan the flames (of something)"]},{"pos":"verb","level":"","meanings":[{"def":"to make air blow onto somebody/something by waving a fan, your hand, etc.","examples":["He fanned himself with a newspaper to cool down.","A warm breeze fanned her cheeks."],"opposite":"","synonyms":""},{"def":"to make a fire burn more strongly by blowing on it","examples":["Fanned by a westerly wind, the fire spread rapidly through the city."],"opposite":"","synonyms":""},{"def":"to make a feeling, an attitude, etc. stronger","examples":["His reluctance to answer her questions simply fanned her curiosity."],"opposite":"","synonyms":""},{"def":"to make a feeling such as anger, hate, etc. worse","examples":["His writings fanned the flames of racism."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"fan the flames (of something)","def":"to make a feeling such as anger, hate, etc. worse","examples":["His writings fanned the flames of racism."]}],"phrasal":["fan out"],"related":[]}]