[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fan/fanta/fantasy__us_1.mp3","phonsUS":"/ˈfæntəsi/","level":"B2","meanings":[{"def":"a pleasant situation that you imagine but that is unlikely to happen","examples":["He spoke of his childhood fantasies about becoming a famous football player.","He was able to play out his fantasy of pop stardom.","He was willing to indulge her wildest fantasies.","I cherished the fantasy that I might one day have a son who would fulfil the dream.","My childhood fantasies were finally fulfilled.","She didn't entertain silly fantasies about love at first sight.","She had a fantasy about going to live on a South Pacific island.","She had woven a whole fantasy about living in a cottage by the sea.","She was seething with anger and filled with revenge fantasies.","They indulge in teenage fantasies about being the greatest rock band in the world.","adolescent fantasies of power, glory and recognition","the ultimate human fantasy: being able to fly","She dismissed the idea as a wild fantasy."],"opposite":"","synonyms":""},{"def":"a product of your imagination","examples":["Her books are usually escapist fantasies."],"opposite":"","synonyms":""},{"def":"the act of imagining things; a person’s imagination","examples":["This is a work of fantasy.","Stop living in a fantasy world.","I live in the real world, not fantasy land.","She was no longer able to distinguish between fantasy and reality.","Most of what they told us was pure fantasy.","She felt she had entered a world of fantasy.","The idea belonged in the realms of fantasy.","children that project their own identities onto fantasy figures"],"opposite":"","synonyms":""},{"def":"a type of story that is set in a world, or a version of our world, that does not really exist and involves magic, monsters, etc.","examples":["She wrote a series of fantasy novels filled with wizards, witches and dragons."],"opposite":"","synonyms":""},{"def":"a competition in which you choose players to make your own imaginary team, and score points according to the performance of the real players","examples":["In his personal time, Stephen blogs for several fantasy hockey leagues."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["fantasy football"]}]