[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/far/fare_/fare__us_1.mp3","phonsUS":"/fer/","level":"B2","meanings":[{"def":"the money that you pay to travel by bus, plane, taxi, etc.","examples":["bus/taxi fares","train/rail fares","Children travel (at) half fare.","When do they start paying full fare?","a low hourly rate of pay","interest rates","an admission charge","legal fees","an annual membership fee","a parking fine","He faces charges of dodging taxi fares.","I'm afraid you will have to pay the full fare.","Last-minute fares start at $219 each way.","Round-trip fares range from $118 to $258.","The airline has introduced a cheap fare to New York.","The company is promising reductions in fares.","The fare will cost you less if you travel midweek.","The return fare will cost you less than two single tickets.","They caught him trying to dodge bus fares.","a simplified fare structure","a special fare deal for air travellers","air fares slashed by a massive 30%","Cheap fares mean using your car is unnecessary.","Do you want the standard fare or the first-class fare?","Fare dodgers will be dealt with severely.","Fares can be expensive in the city.","Fares have been increased by 10%.","How much is the return/​single fare?","I spend about £40 a week on fares.","Pay your fare at the ticket office.","Round-trip fare from New York to Cincinnati is $229.","The new mayor has promised to reduce fares on all buses and trains.","one-way fare"],"opposite":"","synonyms":"rate"},{"def":"a passenger in a taxi","examples":["The taxi driver picked up a fare at the station."],"opposite":"","synonyms":""},{"def":"a range of food of a particular type","examples":["The restaurant provides good traditional fare.","tourists seeing the sights and sampling the local Mexican fare","a restaurant serving traditional Scottish fare"],"opposite":"","synonyms":""},{"def":"something that is offered to the public, especially as a form of entertainment","examples":["This movie is perfect family fare.","The band's music was standard rock fare.","His student drawings were not standard art school fare.","Court trials involving famous people are the daily fare of newspapers."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["bill of fare","bills of fare"]},{"pos":"verb","level":"","meanings":[{"def":"to be successful/unsuccessful in a particular situation","examples":["The party fared very badly in the last election.","The North, by and large, has fared better than most regions in avoiding high unemployment figures.","He fared well against his main rival.","She should fare better in this competition.","This movie fared poorly at the British box office."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]