[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fas/faste/fasten__us_2.mp3","phonsUS":"/ˈfæsn/","level":"B1","meanings":[{"def":"to close or join together the two parts of something; to become closed or joined together","examples":["fasten something Fasten your seat belts, please.","Emma shivered and fastened the top button of her coat.","fasten something up He fastened up his coat and hurried out.","fasten (something) with something The garment is fastened with a sash.","fasten + adv./prep. The dress fastens at the back.","a short yellow skirt which fastens up the side.","The gown fastens down the front with Velcro."],"opposite":"unfasten","synonyms":""},{"def":"to close something so that it will not open; to be closed in this way","examples":["Fasten the gates securely so that they do not blow open.","Make sure all the exits are securely fastened.","The window wouldn't fasten."],"opposite":"unfasten","synonyms":""},{"def":"to fix something in a particular position","examples":["He fastened back the shutters.","Use the special kit provided to fasten the child seat in the car.","A gold locket was fastened around Eleanor's neck.","Each bundle of 100 votes was rolled up and fastened with a rubber band."],"opposite":"","synonyms":""},{"def":"to attach or tie one thing to another thing","examples":["fasten A and B together He fastened the papers together with a paper clip.","fasten A to B She fastened the rope to a tree."],"opposite":"","synonyms":""},{"def":"if you fasten your arms around somebody, your teeth into something, etc., or if your arms, teeth, etc. fasten around, into, etc. somebody/something, you hold the person/thing strongly with your arms, etc.","examples":["fasten something + adv./prep. The dog fastened its teeth in his leg.","+ adv./prep. His hand fastened on her arm."],"opposite":"","synonyms":""},{"def":"if you fasten your eyes on somebody/something or your eyes fasten on somebody/something, you look at them for a long time","examples":["He fastened his gaze on her face."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["fasten on"],"related":["fasten on","fasten on(to) somebody/something"]}]