[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fat/fathe/father__us_2.mp3","phonsUS":"/ˈfɑːðər/","level":"A1","meanings":[{"def":"a male parent of a child or an animal; a person who is acting as the father to a child","examples":["My father died in 2017.","Ben's a wonderful father.","Our new boss is a father of three (= he has three children).","father to somebody You've been like a father to me.","He was a wonderful father to both his natural and adopted children.","I never met my biological father.","(old-fashioned) Father, I cannot lie to you.","Boland, a father of two, was arrested on charges of theft.","Elena's brother was a surrogate father to her kids after her husband died.","He followed in his father's footsteps and became a motor mechanic.","He followed the footsteps of his famous father into the film industry.","He had a domineering mother and a cold, distant father.","He has an ailing father and two younger brothers to support.","He has just become the proud father of a baby girl.","He is very good with children and would make a devoted father.","He paced like an expectant father.","He succeeded his father as Professor of Botany.","He was both a bad husband and a bad father.","I always thought of you as a second father.","I buried my father, and mourned his death.","I lost my father when I was nine.","Jesse is now married and father to a young son.","Meet your new father.","Ryan has gone looking for his long-lost father.","She followed her father into the legal profession.","She inherited the urge to travel from her father.","She kept the books that had belonged to her beloved father.","Some of his students regard him as a father figure.","The land passes on from father to son.","The new father took his son into his arms.","The two boys were like their mother in character, but Louise took after her father.","Their musician father encouraged their love of music.","Try your best to honor your father.","a married father of two","the grieving father of two children lost at sea"],"opposite":"","synonyms":""},{"def":"a person’s ancestors (= people who are related to you who lived in the past)","examples":["the land of our fathers"],"opposite":"","synonyms":""},{"def":"the first man to introduce a new way of thinking about something or of doing something","examples":["Henry Moore is considered to be the father of modern British sculpture."],"opposite":"","synonyms":""},{"def":"used by Christians to refer to God","examples":["Father, forgive us.","God the Father"],"opposite":"","synonyms":""},{"def":"the title of a priest, especially in the Roman Catholic Church and the Orthodox Church","examples":["Father Dominic"],"opposite":"","synonyms":""},{"def":"from one generation of a family to the next","examples":[],"opposite":"","synonyms":""},{"def":"used to say that a son’s character or behaviour is similar to that of his father","examples":[],"opposite":"","synonyms":""},{"def":"very much older than somebody (especially used to suggest that a romantic or sexual relationship between the two people is not appropriate)","examples":[],"opposite":"","synonyms":""},{"def":"we believe a thing because we want it to be true","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"from father to son","def":"from one generation of a family to the next","examples":[]},{"idiom":"like father, like son","def":"used to say that a son’s character or behaviour is similar to that of his father","examples":[]},{"idiom":"old enough to be somebody’s father/mother","def":"very much older than somebody (especially used to suggest that a romantic or sexual relationship between the two people is not appropriate)","examples":[]},{"idiom":"the wish is father to the thought","def":"we believe a thing because we want it to be true","examples":[]}],"phrasal":[],"related":["city father","Father Time","Our Father","Father Brown","father figure","Father Christmas","father-in-law","founding father","Holy Father","father of the chapel","Father of the Constitution","Father of the House","Eternal Father, Strong to Save","father figures","Founding Father","Father Christmases"]},{"pos":"verb","level":"","meanings":[{"def":"to become the father of a child by making a woman pregnant","examples":["He claims to have fathered over 20 children."],"opposite":"","synonyms":""},{"def":"to create new ideas or a new way of doing something","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]