[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fau/fault/fault__us_4.mp3","phonsUS":"/fɔːlt/","level":"B2","meanings":[{"def":"the responsibility for something wrong that has happened or been done","examples":["Why should I say sorry when it's not my fault?","It's nobody's fault.","He believes that the product’s poor image is partly the fault of the press.","fault (that)… It was his fault that we were late.","fault for doing something It's your own fault for being careless.","fault for something He would not admit fault for the collision.","at fault I think the owners are at fault (= responsible) for not warning us.","Many people live in poverty through no fault of their own.","Having made an error of judgement she was not without fault in the matter.","It was my entire fault. I ruined everything.","It's all your own fault, you know.","It's his own stupid fault his car was stolen—he should have kept it locked.","Many of the soldiers died through his fault.","The fault lay in the structure of the economy.","The fault lay not with her but with her manager.","The party at fault in a court case usually pays the other party's legal costs.","helping people who, through no fault of their own, have lost their homes","the absence of fault on the part of the prosecution"],"opposite":"","synonyms":""},{"def":"a bad or weak aspect of somebody’s character","examples":["He's proud of his children and blind to their faults.","I love her for all her faults (= in spite of them).","I think my worst fault is impatience.","The children were told to pray that their moral faults would be overcome.","She is blind to all her son's faults.","He viewed independence as a serious fault in a young girl.","We all have our faults.","She was prepared to overlook his faults.","No one had ever pointed out my faults to my face before.","My biggest fault was my laziness.","Incorrectness in speech was considered a great fault in a gentleman.","I have to accept and realize my faults.","Her great fault was that she thought too much of herself.","For all her faults she was a great woman."],"opposite":"","synonyms":""},{"def":"something that is wrong or not perfect; something that is wrong with a machine or system that stops it from working correctly","examples":["The book's virtues far outweigh its faults.","a mechanical/technical fault","The fire was caused by an electrical fault.","The system, for all its faults, is the best available at the moment.","fault in something a major fault in the design","We're trying to correct the faults in the program.","fault with something a common fault with this type of machine","without fault The film is not without fault.","There seemed to be some fault with the cooling system.","The healthcare system, for all its faults, is far better than ever before.","If a fault develops in the equipment, you can call us 24 hours a day.","Broadcasting was suspended because of a technical fault in the transmitter.","A major design fault was discovered in the latest model of the car.","You should report any fault directly to the phone company.","When she tested the recorder she could find no fault with it.","They've found a major fault with the electrical system.","There is a basic fault in the design of the engine. It cannot be fixed.","These are just a few of the glaring faults that ruined the movie for me.","The only real fault of the book is its looseness of structure.","The engine has a serious fault.","The car soon developed another fault.","Of course, minor mechanical faults sometimes occur.","For all its faults, we love this city.","Diabetes is caused by a fault in the insulin production of the body.","a structural fault"],"opposite":"","synonyms":""},{"def":"a mistake made when serving","examples":["He has served a number of double faults in this set.","Even tennis champions sometimes serve double faults."],"opposite":"","synonyms":""},{"def":"a place where there is a break that is longer than usual in the layers of rock in the earth’s crust","examples":["the San Andreas fault","a fault line"],"opposite":"","synonyms":""},{"def":"to look for and discover mistakes in somebody/something; to complain about somebody/something","examples":["My mother did nothing but find fault with my manners.","She was always finding fault with his manners."],"opposite":"","synonyms":""},{"def":"used to say that somebody has a lot, or even too much, of a particular good quality","examples":["She is generous to a fault."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"find fault (with somebody/something)","def":"to look for and discover mistakes in somebody/something; to complain about somebody/something","examples":["My mother did nothing but find fault with my manners.","She was always finding fault with his manners."]},{"idiom":"to a fault","def":"used to say that somebody has a lot, or even too much, of a particular good quality","examples":["She is generous to a fault."]}],"phrasal":[],"related":["no-fault","fault line","foot fault","double fault","double-fault","fault-finding","San Andreas Fault","fault lines"]},{"pos":"verb","level":"","meanings":[{"def":"to find a mistake or a weakness in somebody/something","examples":["Her colleagues could not fault her dedication to the job.","He had always been polite—she couldn't fault him on that."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]