[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fav/favou/favourite__us_2_rr.mp3","phonsUS":"/ˈfeɪvərɪt/","level":"","meanings":[{"def":"to show that you like something that somebody has put on a social media site","examples":["It wasn't long until their original post was favourited over 1  200 times."],"opposite":"","synonyms":""},{"def":"to save the address of a website or other online data so that you can easily find it again","examples":["The ‘Favourites’ tab lets you access places you've favourited."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["somebody’s favourite son"]},{"pos":"adjective","level":"A1","meanings":[{"def":"liked more than others of the same kind","examples":["It's one of my favourite movies.","What is your all-time favourite song?","Who is your favourite writer?","January is my least favourite month.","She’s the obvious choice for the job.","Which one’s your favourite?","Tastes and preferences vary from individual to individual.","A selection of reader’s comments are published below.","She was his pick for best actress."],"opposite":"","synonyms":"choice"},{"def":"a performer, politician, sports player, etc., who is popular where they were born","examples":[],"opposite":"","synonyms":""},{"def":"(in the US) a candidate for president who is supported by his or her own state in the first part of a campaign","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"somebody’s favourite son","def":"a performer, politician, sports player, etc., who is popular where they were born","examples":[]}],"phrasal":[],"related":[]},{"pos":"noun","level":"A1","meanings":[{"def":"a person or thing that you like more than the others of the same type","examples":["Which one's your favourite?","The band played all my old favourites.","One of my personal favourites is a movie that should please every age group.","favourite of somebody's This song is a particular favourite of mine.","favourite with somebody The programme has become a firm favourite with young people.","These biscuits are great favourites with the children.","‘Show Me Love’ became a festival favourite.","He began recording sentimental favourites.","If I had to choose a favourite, it would be Monet's ‘Water Lilies’.","It may become a holiday favourite on video.","My very favourite film is ‘The Wizard of Oz’.","The band started with a crowd favourite.","The forest was a favourite for family walks.","The movie has become a cult favourite.","The song is a firm favourite with their fans.","They perform their greatest hit and a new favourite.","They were singing their childhood favourite, ‘Waterloo’.","This movie is my all-time favourite.","This song is an old favourite of mine.","You will find all your old favourites in this book of poems.","a theme song that remains a fan favourite"],"opposite":"","synonyms":""},{"def":"a person who is liked better by somebody and receives better treatment than others","examples":["She loved all her grandchildren but Ann was her favourite.","Parents should never have favourites.","favourite with somebody She was an extremely good student and a great favourite with the nuns.","favourite among somebody He is a favourite among his teammates."],"opposite":"","synonyms":""},{"def":"a record of a section of an app or the address of a website that enables you to find it quickly","examples":["Add the website as a favourite.","Have you added this website to your favourites list?","I've added the sports section to my favourites."],"opposite":"","synonyms":""},{"def":"the horse, runner, team, etc. that is expected to win","examples":["The favourite came third.","favourite for something Her horse is the hot favourite for the race.","favourite to do something The Brazilians still look firm favourites to take the title.","Jopanini is second favourite for Saturday's race, behind Bright Spark.","The Colts are 5.5-point favourites at San Francisco this week","The Spanish are the favourites to win.","The horse is an even money favourite.","Tiger Woods is 3–2 favourite to win the Challenge.","China was the early favourite to win the bidding."],"opposite":"","synonyms":""},{"def":"the person who is expected by most people to get a particular job or position","examples":["favourite for something She's the favourite for the job.","favourite to do something She's the favourite to succeed him as leader.","On paper, Stanford looks like the favourite.","Gunn and Moran are prohibitive favourites (= so likely to win that there will not really be any competition)."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]