[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fav/favou/favour__us_2.mp3","phonsUS":"/ˈfeɪvər/","level":"B1","meanings":[{"def":"a thing that you do to help somebody","examples":["Could you do me a favour and pick up Sam from school today?","Can I ask a favour?","I would never ask for any favours from her.","I'll ask Steve to take it. He owes me a favour.","Thanks for helping me out. I'll return the favour (= help you because you have helped me) some time.","as a favour (to somebody) I'm going as a favour to Ann, not because I want to.","Do yourself a favour (= help yourself) and wear a helmet on the bike.","Would you mind if I opened the window?","Could I possibly borrow your phone?","I hate to ask, but could I please borrow your phone?","Do you happen to have a pair of gloves I could borrow for the evening?","Would it be all right if I left five minutes early?","Is there any chance that we could stay at your house the night before our flight?","Would it be OK to leave my bag here?","Yes, of course.","Go ahead.","That's fine.","I'd rather you didn't, if you don't mind.","I'd prefer it if you asked somebody else.","If there's someone else you can ask, I'd be grateful.","He needed another favour from her.","Although I am friends with the tennis ace, I don't expect any favours from him on court.","As a personal favour to me, please don't release my story to the press.","Do yourself a favour and cut your credit cards in half.","Thanks very much. I'll return the favour one day.","I came here to ask you a big favour.","I don't expect any favours from my friends on the tennis court.","I'll ask Jane. She owes me a favour.","Rodrigo accepted the favours bestowed on him by the new king.","She had one last favour to ask her brother."],"opposite":"","synonyms":""},{"def":"approval or support for somebody/something","examples":["Artists sought the favour of wealthy patrons.","favour with somebody The suggestion to close the road has found favour with (= been supported by) local people.","to gain/win/lose favour with somebody","The programme has lost favour with viewers recently.","favour among somebody The policy is gaining favour among voters.","in favour (with somebody) She's not in favour with (= supported or liked by) the media just now.","It seems Tim is back in favour with the boss (= the boss likes him again).","out of favour (with somebody) Reality TV has begun to fall out of favour with viewers.","an athlete who fell from favour after a drugs scandal","(formal) The government looks with favour upon (= approves of) the report's recommendations.","Depth of training is looked upon with favour by many employers.","He stood in high favour at the court of Lewis the Pious.","Her political views have not found favour in recent years.","In the Christian tradition, the world exists only as an act of divine favour.","She is too popular with the public to find much favour with the critics.","The bishop was said to have enjoyed the king's favour.","The senior officials were punished and rapidly fell from favour.","This argument found favour among advocates of multiculturalism.","This did not meet with public favour.","This idea has long since fallen out of favour.","Traditionally, vigilante groups have found greater favour on the political right.","Why are we trying to court the favour of critics?","This piece of software has two points in its favour: it's fast and inexpensive."],"opposite":"","synonyms":""},{"def":"treatment that is generous to one person or group in a way that seems unfair to others","examples":["As an examiner, she showed no favour to any candidate."],"opposite":"","synonyms":""},{"def":"a small gift given to children at a party","examples":[],"opposite":"","synonyms":""},{"def":"agreement to have sex with somebody","examples":["demands for sexual favours"],"opposite":"","synonyms":""},{"def":"you are likely to succeed because the conditions are good and you have an advantage","examples":[],"opposite":"","synonyms":""},{"def":"to try to get somebody to like or support you by praising or helping them a lot","examples":["He’s always trying to curry favour with the boss.","He tried to curry favour with the teachers."],"opposite":"","synonyms":""},{"def":"used in reply to a question that you think is silly","examples":["‘Do you think they'll win?’ ‘Do me a favour! They haven't got a single decent player.’"],"opposite":"","synonyms":""},{"def":"to do something that is not helpful to somebody or that gives a bad impression of them","examples":["You're not doing yourself any favours, working for nothing.","The orchestra did Beethoven no favours."],"opposite":"","synonyms":""},{"def":"if you are in favour of somebody/something, you support and agree with them/it","examples":["He argued in favour of a strike.","There were 247 votes in favour (of the motion) and 152 against.","I'm all in favour of (= completely support) equal pay for equal work.","Most of the ‘don't knows’ in the opinion polls came down in favour of (= eventually chose to support) the Democrats.","He is strongly in favour of capital punishment.","No one was willing to speak out in favour of their colleague.","She argued in favour of this policy.","The committee came down in favour of setting up a national body.","an argument in favour of censorship","Environmental conservation generally works in favour of maintaining the status quo."],"opposite":"","synonyms":""},{"def":"in exchange for another thing (because the other thing is better or you want it more)","examples":["He abandoned teaching in favour of a career as a musician.","Early in his musical career he abandoned blues in favour of jazz."],"opposite":"","synonyms":""},{"def":"if something is in somebody’s favour, it gives them an advantage or helps them","examples":["The exchange rate is in our favour at the moment.","She was willing to bend the rules in Mary's favour.","The golf tournament went in the Americans' favour."],"opposite":"","synonyms":""},{"def":"a decision or judgement that is in somebody’s favour benefits that person or says that they were right","examples":["The court decided in Ms Smith’s favour and she received compensation for unfair dismissal.","The High Court found in favour of the plaintiffs."],"opposite":"","synonyms":""},{"def":"in a fair way","examples":["They undertook to make their judgement without fear or favour."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the cards/odds are stacked in your favour","def":"you are likely to succeed because the conditions are good and you have an advantage","examples":[]},{"idiom":"curry favour (with somebody)","def":"to try to get somebody to like or support you by praising or helping them a lot","examples":["He’s always trying to curry favour with the boss.","He tried to curry favour with the teachers."]},{"idiom":"do me a favour!","def":"used in reply to a question that you think is silly","examples":["‘Do you think they'll win?’ ‘Do me a favour! They haven't got a single decent player.’"]},{"idiom":"do somebody no favours","def":"to do something that is not helpful to somebody or that gives a bad impression of them","examples":["You're not doing yourself any favours, working for nothing.","The orchestra did Beethoven no favours."]},{"idiom":"in favour (of somebody/something)","def":"if you are in favour of somebody/something, you support and agree with them/it","examples":["He argued in favour of a strike.","There were 247 votes in favour (of the motion) and 152 against.","I'm all in favour of (= completely support) equal pay for equal work.","Most of the ‘don't knows’ in the opinion polls came down in favour of (= eventually chose to support) the Democrats.","He is strongly in favour of capital punishment.","No one was willing to speak out in favour of their colleague.","She argued in favour of this policy.","The committee came down in favour of setting up a national body.","an argument in favour of censorship","Environmental conservation generally works in favour of maintaining the status quo.","He abandoned teaching in favour of a career as a musician.","Early in his musical career he abandoned blues in favour of jazz."]},{"idiom":"in somebody’s favour","def":"if something is in somebody’s favour, it gives them an advantage or helps them","examples":["The exchange rate is in our favour at the moment.","She was willing to bend the rules in Mary's favour.","The golf tournament went in the Americans' favour.","The court decided in Ms Smith’s favour and she received compensation for unfair dismissal.","The High Court found in favour of the plaintiffs."]},{"idiom":"without fear or favour","def":"in a fair way","examples":["They undertook to make their judgement without fear or favour."]}],"phrasal":[],"related":["grace and favour","curry favour (with somebody)","the cards/odds are stacked in your favour","load the dice (against/in favour of somebody)"]},{"pos":"verb","level":"B2","meanings":[{"def":"to prefer one system, plan, way of doing something, etc. to another","examples":["favour something Many countries favour a presidential system of government.","It’s a resort favoured by families with young children.","Another solution, which I strongly favour, is lower taxes for everyone.","With make-up I favour a minimalist approach.","favour something over something She favours hugs over handshakes.","favour doing something Most patients favour seeing the same GP for all their health needs.","We strongly favour reform of the system.","Black voters overwhelmingly favour the Democratic Party.","Haitians especially favour seafoods.","I personally favour this last option.","Pot plants are increasingly favoured as gifts by guests.","She continues to favour large-scale developments.","The Democrat candidate is favoured for re-election.","The polls slightly favour the Republicans.","The prime minister is thought to favour an early referendum on the issue."],"opposite":"","synonyms":""},{"def":"to treat one person, group or organization better than you treat others, especially in an unfair way","examples":["favour somebody/something The treaty seems to favour the US.","My parents always favoured my older brother.","He favoured some individuals at the expense of others.","favour somebody/something over somebody/something News coverage should not favour one party over another."],"opposite":"","synonyms":""},{"def":"to provide suitable conditions for a particular person, group, etc.","examples":["The warm climate favours many types of tropical plants."],"opposite":"","synonyms":""},{"def":"to look like one of your parents or older relations","examples":["She definitely favours her father."],"opposite":"","synonyms":""},{"def":"to be expected to achieve something, especially in a competition","examples":["He is favoured to win a third Olympic gold medal."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be favoured to do something","def":"to be expected to achieve something, especially in a competition","examples":["He is favoured to win a third Olympic gold medal."]}],"phrasal":[],"related":[]}]