[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fea/fear_/fear__us_1.mp3","phonsUS":"/fɪr/","level":"A2","meanings":[{"def":"the bad feeling that you have when you are in danger or when a particular thing frightens you","examples":["Her eyes showed no fear.","The child was shaking with fear.","I suddenly felt gripped by fear.","She nearly went crazy with fear and anxiety.","The attacks created a climate of fear.","Terror attacks are a tool to instil fear in the public.","He managed to overcome his fears.","fear of somebody/something Fear of crime can affect people's lives.","in fear of somebody/something We lived in constant fear of losing our jobs.","without fear of somebody/something Women should be able to work without fear of harassment.","(a) fear of flying","She showed no fear.","Her eyes were wild with terror.","I had a sudden moment of panic.","The doctor said there was no cause for alarm.","She cried out in fright.","He says that a culture of fear is behind this obsession with firearms.","An atmosphere of fear and hatred has been created around immigration.","He lied out of fear.","He ran away in fear.","The children were cowering in fear.","His face was white with fear.","I was paralysed by fear.","It was the first time she had experienced real fear.","She did not know why she should feel such fear.","She stared at him without fear.","The boy showed no fear.","The men hesitated in fear of whatever was to come next.","The men set off in fear and trepidation.","The people live in fear of attack by the bandits.","They have a terrible fear of failure.","When she heard the news, some of her fear subsided.","The pupils obeyed through fear of punishment.","the constant fear of discovery","the fear that her mother had instilled in her","the girl's childhood fear of being eaten by monsters","Arachnophobia is an irrational fear of spiders.","the most primal fear, that of death"],"opposite":"","synonyms":"fear"},{"def":"a feeling of concern about somebody's safety or about something bad that might happen","examples":["The doctor's report confirmed our worst fears.","Police tried hard to allay the fears of local residents.","fear for somebody/something her fears for her son’s safety","Alan spoke of his fears for the future.","fear that… the fear that he had cancer","The announcement sparked fears that interest rates will rise.","amid fears The government announced the new measures amid growing security fears.","Doctors have voiced fears that we may be facing an epidemic.","consumer fears about health risks","The concert was cancelled amid health and safety fears.","There are growing fears of water shortages.","Fears are growing of a new oil embargo.","Stock markets tumbled amid fears of a new recession.","There were fears about the weather impacting attendance.","My biggest fear was that my children would get sick.","My worst fears were confirmed.","Our fears proved unfounded.","Public fears about the disease increased.","The government is anxious to allay the public's fears.","This incident has fuelled fears of a full-scale war.","This stoked fears of financial difficulties.","new fears over terrorism","new terrorism fears"],"opposite":"","synonyms":""},{"def":"to avoid the danger of something happening","examples":["We spoke quietly for fear of waking the guards.","I had to run away for fear (that) he might one day kill me.","Nobody refused for fear of losing their job.","He wrote under a false name for fear of reprisals."],"opposite":"","synonyms":""},{"def":"feeling frightened that you might be killed","examples":[],"opposite":"","synonyms":""},{"def":"used to say that you definitely do not want to do something","examples":["‘Are you coming climbing?’ ‘No fear!’"],"opposite":"","synonyms":""},{"def":"to make somebody very frightened, especially in order to make them do something","examples":[],"opposite":"","synonyms":""},{"def":"to make somebody be afraid, etc.","examples":["The sound of gunfire struck fear into the hearts of the villagers."],"opposite":"","synonyms":""},{"def":"in a fair way","examples":["They undertook to make their judgement without fear or favour."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"for fear of something/of doing something | for fear (that)…","def":"to avoid the danger of something happening","examples":["We spoke quietly for fear of waking the guards.","I had to run away for fear (that) he might one day kill me.","Nobody refused for fear of losing their job.","He wrote under a false name for fear of reprisals."]},{"idiom":"in fear of your life","def":"feeling frightened that you might be killed","examples":[]},{"idiom":"no fear","def":"used to say that you definitely do not want to do something","examples":["‘Are you coming climbing?’ ‘No fear!’"]},{"idiom":"put the fear of God into somebody","def":"to make somebody very frightened, especially in order to make them do something","examples":[]},{"idiom":"strike fear, etc. into somebody/sb’s heart","def":"to make somebody be afraid, etc.","examples":["The sound of gunfire struck fear into the hearts of the villagers."]},{"idiom":"without fear or favour","def":"in a fair way","examples":["They undertook to make their judgement without fear or favour."]}],"phrasal":[],"related":["fear for","I fear","fear of missing out","fear for somebody/something","without fear or favour","fools rush in (where angels fear to tread)"]},{"pos":"verb","level":"B1","meanings":[{"def":"to be frightened of somebody/something or frightened of doing something","examples":["fear somebody/something All his employees fear him.","They have reason to fear the police.","to fear death/persecution/the unknown","Everyone feared the coming war.","propaganda designed to make us hate and fear the enemy","Don't worry, you have nothing to fear from us.","fear to do something (formal) She feared to tell him the truth.","fear doing something (formal) She feared going out at night.","He learned to fear and respect this force of nature.","We fear violence, but we are also fascinated by it.","This disease is greatly feared.","He says he fears no one but God.","People feared to speak because he got so angry.","She says she doesn't fear dying, but she worries for her children."],"opposite":"","synonyms":""},{"def":"to feel that something bad might have happened or might happen in the future","examples":["fear something She has been missing for three days now and police are beginning to fear the worst (= think that she is dead).","The government feared a backlash from farmers.","fear (that)… Experts fear that terrorists could use the internet to launch attacks.","They rightly feared that presidents, like kings, might abuse their power.","He genuinely feared his life was at risk.","fear doing something The company feared losing its tax breaks.","be feared to be/have something Women and children are feared to be among the victims.","The death toll is not as bad as initially feared.","it is feared (that)… It is feared (that) he may have been kidnapped.","It was feared that unemployment could rise.","fear somebody/something + adj. Hundreds of people are feared dead.","Never fear/Fear not (= Don’t worry), I shall return.","Several were former officials who feared reprisals if they returned home.","They fear a repeat of the controversy that dogged the last election.","Doctors fear side effects in children from the contamination.","Fearing an attack, the police called for reinforcements.","He fears more violence at the polls next month.","Some critics feared undue government influence in the project.","Opponents of the plan fear the long-term consequences of exposure to these chemicals.","Scientists fear loss of funding.","She feared (that) he might be dead.","I really feared that this might be the end.","Campaigners fear the large roadside structures could distract drivers.","Some residents fear their homes will be destroyed.","They fear becoming a burden to their families.","He doesn't say anything because he fears upsetting his wife."],"opposite":"","synonyms":""},{"def":"used to tell somebody that you think that something bad has happened or is true","examples":["They are unlikely to get here on time, I fear.","‘He must be dead then?’ ‘I fear so.’","‘She's not coming back?’ ‘I fear not.’"],"opposite":"","synonyms":""},{"def":"people with little experience try to do the difficult or dangerous things that more experienced people would not consider doing","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"fools rush in (where angels fear to tread)","def":"people with little experience try to do the difficult or dangerous things that more experienced people would not consider doing","examples":[]}],"phrasal":["fear for"],"related":[]}]