[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fea/featu/feature__us_2.mp3","phonsUS":"/ˈfiːtʃər/","level":"A2","meanings":[{"def":"something important, interesting or typical of a place or thing","examples":["An interesting feature of the city is the old market.","geographical features","Teamwork is a key feature of the training programme.","I've added some new features to my website.","new safety/security features","There are a number of special features included on the disc.","The main bonus feature on the DVD is a lengthy interview with the director.","The most distinctive feature of this track is the trumpet sound.","The one redeeming feature (= good thing about it) of the plan was its low cost.","Which features do you look for when choosing a car?","The software has no particular distinguishing features.","A feature that characterizes all anteaters is an extremely slow metabolic rate.","A touch-screen feature allows visitors to call up relevant information.","He took me around our new offices, pointing out all the salient features.","Self-deprecation is a recurring feature as Stevenson talks.","Special features include passenger airbags and an electric sunroof.","The house retains most of its original features.","The network offers interactive features.","The site brims with interactive features.","The site had a number of interesting features.","Their life histories shared many common features.","These walks became a regular feature of his day.","We're adding new features and functionality every month.","a car with new built-in safety features","a distinctive feature of his poems","some of the more advanced features of the software","the common feature in all these cases","the essential feature that distinguishes anorexia nervosa from other eating disorders","The design has many new built-in safety features."],"opposite":"","synonyms":""},{"def":"a part of somebody’s face such as their nose, mouth and eyes","examples":["facial features","his strong handsome features","Her eyes are her most striking feature.","He had sharp features, with high cheekbones.","He has the right physical features for the role.","I admired his rugged features.","She has very delicate features.","a slim figure with delicate features","a woman with small, neat features","a young woman with fine features","her striking, dark-eyed features"],"opposite":"","synonyms":""},{"def":"a special article or programme about somebody/something","examples":["In today's programme we have a special feature on education.","There are in-depth feature articles in every issue.","She is a feature writer for the ‘Evening Standard’.","an in-depth feature on the Italian fashion scene","The magazine runs a regular feature on ethnic cooking.","Next month they will publish a special feature on computer books."],"opposite":"","synonyms":""},{"def":"the main film in a cinema programme","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["feature film","feature phone","water feature","double feature","feature-length","feature films","feature phones"]},{"pos":"verb","level":"B1","meanings":[{"def":"to include a particular person or thing as a special feature","examples":["feature somebody/something as somebody/something The film features Cary Grant as a professor.","feature somebody/something The latest model features alloy wheels and an electronic alarm.","a new Star Wars movie featuring the original actors","be featured in/on something The actress was featured on the cover of Time magazine last month.","Many of the hotels featured in the brochure offer special deals for weekend breaks.","His movies typically featured torrid romances.","His work is featured in a special documentary tonight.","The school has been featured on television.","Women's magazines regularly feature diets and exercise regimes.","The film features Anne Hathaway as Jane Austen."],"opposite":"","synonyms":""},{"def":"to have an important part in something","examples":["feature in something Olive oil and garlic feature prominently in his recipes.","feature on something Several local musicians featured on the album.","Reading over his past speeches, you'll see that housing, public health and education feature strongly."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]