[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fee/fee__/fee__us_1.mp3","phonsUS":"/fiː/","level":"B2","meanings":[{"def":"an amount of money that you pay for professional advice or services","examples":["Employees are reimbursed for any legal fees incurred when they relocate.","fee-paying schools (= that you have to pay to go to)","The school fees are expected to rise again next year.","Students take out loans to cover tuition fees.","fee for something Customers pay an annual fee for the service.","fee for doing something Does the bank charge a fee for setting up the account?","for a fee Users can block ads for a small monthly fee.","a low hourly rate of pay","interest rates","an admission charge","legal fees","an annual membership fee","a parking fine","Additional security fees apply.","All fees are payable when the invoice is issued.","Freelance writers often set their own fees.","He agreed to waive his usual fee.","I expect you had to pay a fat fee to your divorce lawyers.","Many tax advisers now offer fixed fee interviews.","Send the form, together with the appropriate fee, to the Land Registry.","She negotiated a fee of $1 800 a week.","The company will earn a fee for every barrel of oil produced.","The company's consultancy fee income rose by 3% last year.","The fee includes the cost of testing the electric wiring.","Their fees are quite reasonable.","There is no additional fee for this insurance cover.","They charge higher fees to overseas students.","We will be taking active steps to collect the outstanding fees.","You'll need money to cover fees and expenses.","the administrative fees on the pension scheme","the professional fees of the lawyers and accountants involved","university top-up fees","The family spent over £20 000 on legal fees.","They send their children to a fee-paying school."],"opposite":"","synonyms":"rate"},{"def":"an amount of money that you pay to join an organization, or to do something","examples":["a membership/subscription fee","There is no entrance fee to the gallery.","the TV licence fee","You have to pay a fee to enter the race.","fee for something The registration fee for the event is £35.","For a small fee, anyone can use these facilities.","The admission fee has gone up.","We had to pay a nominal fee to join the club.","We now charge a fee for museum entrance.","a £30 membership fee","a $1 200 initiation fee","Club members pay an annual membership fee of £775."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["fah-fee","user fee","contingency fee"]}]