[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fee/feed_/feed__us_1.mp3","phonsUS":"/fiːd/","level":"A2","meanings":[{"def":"to give food to a person or an animal","examples":["feed somebody/something/yourself Have you fed the cat yet?","The baby can't feed itself yet (= can't put food into its own mouth).","feed somebody/something sth It's important to feed children a well-balanced diet.","He has to be fed liquids through a tube in his stomach.","feed somebody/something (on) something The cattle are fed (on) barley.","feed something to somebody/something The barley is fed to the cattle.","feed somebody/something with something The animals are fed with hay and grass.","Most of the crop is fed to the cattle.","She fed the children on baked beans and fish fingers.","She fed the children on junk food.","Feed the kids and make sure they're in bed by nine."],"opposite":"","synonyms":""},{"def":"to eat food","examples":["Slugs and snails feed at night.","Egrets and a solitary grey heron were busily feeding.","The bears feed voraciously in summer and store energy as fat."],"opposite":"","synonyms":""},{"def":"to provide food for a person or group of people","examples":["They have a large family to feed.","There's enough here to feed an army.","Have they been feeding you well?","They struggled to feed and clothe the children.","Having another mouth (= person) to feed can be a strain.","He could no longer afford to feed his family.","He saw the new baby as just another mouth to feed.","How can we feed a hungry world?","Let us discipline ourselves so as to help feed a hungry world.","The children were poorly fed.","My grandmother always feeds me well.","She could barely feed and clothe herself."],"opposite":"","synonyms":""},{"def":"to give a plant a special substance to make it grow","examples":["Feed the plants once a week."],"opposite":"","synonyms":""},{"def":"to give advice, information, etc. to somebody/something","examples":["be fed something We are constantly fed gossip and speculation by the media.","be fed with something The media were being fed with accusations and lies.","be fed to somebody Gossip and speculation are constantly fed to us by the media."],"opposite":"","synonyms":""},{"def":"to supply something to somebody/something","examples":["be fed (by something) The lake is fed by a river.","A is fed with B The electricity line is fed with power through an underground cable.","B is fed into A Power is fed into the electricity line through an underground cable."],"opposite":"","synonyms":""},{"def":"to put or push something into or through a machine","examples":["feed A (with B) He fed the meter with coins.","feed B into A He fed coins into the meter.","The information was fed into the data store.","feed something into/through something The fabric is fed through the machine.","Receptors constantly feed information into the system.","This feeds the paper through to the printer.","The data is fed directly into a computer."],"opposite":"","synonyms":""},{"def":"to satisfy a need, desire, etc. and keep it strong","examples":["For drug addicts, the need to feed the addiction takes priority over everything else."],"opposite":"","synonyms":""},{"def":"to harm somebody who has helped you or supported you","examples":[],"opposite":"","synonyms":""},{"def":"to eat a lot of food or too much food","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"bite the hand that feeds you","def":"to harm somebody who has helped you or supported you","examples":[]},{"idiom":"feed your face","def":"to eat a lot of food or too much food","examples":[]}],"phrasal":["feed back","feed into","feed off","feed on","feed through","feed up"],"related":["feed off","feed on","feed up","drip feed","drip-feed","feed back","feed into","live feed","bottle-feed","feed reader","foliar feed","force-feed","spoon-feed","chicken feed","feed through","feed readers","feed into something","feed on something","feed off something"]},{"pos":"noun","level":"B2","meanings":[{"def":"a meal of milk for a young baby; a meal for an animal","examples":["her morning feed"],"opposite":"","synonyms":""},{"def":"food for animals or plants","examples":["a sack of animal feed","winter feed for the horses","liquid tomato feed"],"opposite":"","synonyms":""},{"def":"material supplied to a machine","examples":[],"opposite":"","synonyms":""},{"def":"a pipe, device, etc. that supplies a machine with something","examples":["The printer has an automatic paper feed.","feed to something the cold feed to the water cylinder"],"opposite":"","synonyms":""},{"def":"a large meal","examples":["They needed a bath and a good feed."],"opposite":"","synonyms":""},{"def":"television programmes that are sent from a central station to other stations in a network; the system of sending out these programmes","examples":["network feed"],"opposite":"","synonyms":""},{"def":"a special feature on a blog, news website, social media site, etc. that allows you to see new information that has been added without having to visit the website, usually using a feed reader (= a piece of software that displays this information)","examples":["an RSS feed","the film's official Twitter feed"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]