[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fee/feel_/feel__us_1.mp3","phonsUS":"/fiːl/","level":"A1","meanings":[{"def":"to experience a particular feeling or emotion","examples":["+ adj. The bus ride made me feel sick.","Are you feeling comfortable?","She sounded more confident than she felt.","I was feeling guilty.","You'll feel better after a good night's sleep.","I feel sorry for him.","I feel bad about leaving you like this.","She felt betrayed.","+ adv./prep. How are you feeling today?","I know exactly how you feel (= I feel sympathy for you).","We all felt the same way.","Luckily I was feeling in a good mood.","feel something I felt the need to explain.","I felt a sense of relief.","feel like something I felt like a complete idiot.","She made me feel like a child by doing everything for me.","feel as if/though… I feel as if nobody cares.","She felt as though she was going to cry.","feel + noun to feel an idiot/a fool","I feel great this morning.","Mum! I feel sick.","The heat made him feel faint.","He sounded happy, but I don't think he felt it.","I really felt bad about what I had done.","She felt uncomfortable about asking him for help.","I suddenly felt inspired.","He'd never felt really content in his job.","I just want her to feel safe.","How do you feel: happy, relieved, surprised?","It made me feel so proud to see him standing up there.","Do you feel tired all the time?","I've never felt this way before.","I feel a lot of sympathy for them.","She didn't feel the pain so much as the shock.","He seemed to feel no remorse at all.","He feels a strong connection with her.","He felt shame at not having helped her.","She felt nothing when she saw him.","Are you disappointed? I feel that way too.","I feel like such a failure.","They felt like outsiders.","I don't like feeling like a tourist when I travel.","I feel like I'm going to be sick.","We never felt like we were rich.","I always felt as though I had to try harder than other people.","They feel as if nobody listens to them.","I feel as if I've eaten too many sweets."],"opposite":"","synonyms":""},{"def":"to notice or be aware of something because it is touching you or having a physical effect on you","examples":["feel something I could feel the warm sun on my back.","She felt a sharp pain in her hand.","She could not feel her legs.","I can’t feel his pulse.","He felt a hand on his shoulder.","You may feel a slight pressure in your chest.","feel somebody/something/yourself doing something He felt a hand touching his shoulder.","She could feel herself blushing.","He felt the sweat running down his face.","feel somebody/something/yourself do something I felt something crawl up my arm.","We felt the ground give way under our feet.","As soon as you get off the plane you feel the heat.","They felt an impact as the bomb hit.","I felt tears welling up in my eyes.","He could feel his heart pounding.","I felt him trembling.","I could feel myself getting faint.","I felt a hand touch my knee.","I felt the handle wobble when I picked it up.","He felt his knee give way.","I felt something fall out of my pocket.","I felt her relax in my arms.","She felt a tear trickle down her cheek.","He felt himself blush."],"opposite":"","synonyms":""},{"def":"to become aware of something even though you cannot see it, hear it, etc.","examples":["Can you feel the tension in this room?","They all feel pressure from managers to make a sale.","I definitely felt the importance of the occasion.","I felt their disapproval.","We all feel the urgency of the problem.","You can feel the chemistry between them from the opening scene.","I immediately felt the difference after he'd gone.","Women feel society's expectation that they should be caring and nurturing.","The tension between the film-maker and the subject is clearly felt in the documentary."],"opposite":"","synonyms":""},{"def":"to give you a particular feeling or impression","examples":["+ adj. This situation doesn't feel right.","You need to go somewhere that feels safe.","My mouth felt completely dry.","it feels + adj. to do something It felt strange to be back in my old school.","feel like something The place still feels like a small fishing village.","it feels like something The interview only took ten minutes, but it felt like hours.","I've lived here for years, but it still doesn't feel like home.","It feels like rain (= seems likely to rain).","It's three degrees right now, but with the wind chill factor it feels like minus 12.","How does it feel to be alone all day?","feel as if/though… Her head felt as if it would burst.","it feels as if/though… It felt as though he had run a marathon.","My eyes feel sore.","My stomach feels bloated.","The house feels warm and cosy.","The end result feels totally different.","I enjoy it so much, it doesn't feel like work.","The whole thing felt like a dream.","It feels great to be home.","It feels intrusive to go into someone's bedroom when they're not there.","Does it feel weird to think he's not coming back?","The house feels as if something is missing.","The paintings feel as if they've been done with great emotion.","It feels as if something exciting is going to happen.","My legs feel as though they've been beaten with sticks.","It feels as though someone is lurking in the shadows.","It sometimes feels like I'm not welcome here.","The plan definitely felt like it was going to work."],"opposite":"","synonyms":""},{"def":"to have a particular physical quality that you become aware of by touching","examples":["+ adj. The water feels warm.","Its skin feels really smooth.","feel like something This wallet feels like leather.","Your hands feel like ice.","The room felt cold.","The dress felt really silky.","It made my hair smell fresh and feel soft.","The sand under my feet felt cool and velvety.","This bed feels too hard.","The breeze felt wonderful on my cheek.","The leaves are so rough, they feel like sandpaper.","Her skin felt like velvet.","What is it? It feels like jelly.","It feels exactly like real sheepskin."],"opposite":"","synonyms":""},{"def":"to deliberately move your fingers over something in order to find out what it is like","examples":["feel something Can you feel the bump on my head?","Try to tell what this is just by feeling it.","People like to touch and feel the fabric before they buy.","feel how, what, etc… Feel how rough this is.","Tangible assets are things that you can touch and feel.","You get the chance to see, smell and feel the products.","The doctor felt his abdomen.","I gently felt the cut on his knee.","Feel how soft my hair is.","Can you feel how itchy this sweater is?","Can you feel what this is?"],"opposite":"","synonyms":""},{"def":"to think or believe that something is the case; to have a particular opinion or attitude","examples":["feel (that)… We all felt (that) we were unlucky to lose.","We've always felt this was our home.","I felt (that) I had to apologize.","I feel I could continue playing until I am 35.","+ adv./prep. This is something I feel strongly about.","How do you feel about inviting the children too?","I didn't know you felt like that about it.","feel it + noun She felt it her duty to tell the police.","I feel it a great honour to be chosen.","feel it to be + noun She felt it to be the best course of action to remain.","feel it + adj. Why did you feel it necessary to do that?","I felt it advisable to do nothing.","feel it to be + adj. We felt it to be unfortunate.","This decision is, I feel, a huge mistake.","Do you think (that) they’ll come?","Well, I like it. What do you think?","Police believe (that) the man may be armed.","We all felt (that) we were unlucky to lose.","I reckon (that) I’m going to get that job.","I was under the impression that the work had already been completed.","We all feel similarly about this issue.","I still feel it was wrong to involve her.","I personally feel that someone new should be appointed.","Do you feel there is any justification for this claim?","He feels very strongly about a lot of issues.","It's a chance for people to say what they feel about the changes.","I'm not sure how I feel about the new boss.","Many people think this is a good thing, but I feel differently.","You might feel it a good idea to read the document first.","I feel it absurd that anyone should question this."],"opposite":"","synonyms":"think"},{"def":"to experience the effects or results of something, often strongly","examples":["He feels the cold a lot.","Cathy was really feeling the heat.","We're all starting to feel the pressure at work.","I was OK after my run, but I'll feel it tomorrow.","She felt her mother's death very deeply.","The effects of the recession are being felt everywhere.","We all felt the force of her arguments.","Her loss has been keenly felt.","I don't feel the cold.","I felt their pain.","I'm 65 now, and I'm starting to feel my age.","You may be fine immediately after going to the gym, but feel it more the next day.","It was some months after his wife's death that he really began to feel his loss.","The trauma can continue to be felt for years afterwards.","All sides feel the pressure to reach an agreement.","We're all still feeling the shock of the election result.","We all felt the weight of her loss.","His influence is still felt today."],"opposite":"","synonyms":""},{"def":"to search for something with your hands, feet, etc.","examples":["+ adv./prep. She felt in her bag and pulled out a pen.","If you feel under the desk you'll find a hook.","feel for something She felt for the step with her foot.","+ adv./prep. for something I had to feel about in the dark for the light switch.","He felt in his pockets for some money.","I felt around in my bag for a tissue.","He felt around in the drawer but there was nothing but paper.","Feel in the bottom of the wardrobe—there should be a bag.","I felt along the wall until I found the switch.","He felt for a foothold.","She was feeling around in the kitchen cupboards for some sugar.","She felt along the bench for her towel."],"opposite":"","synonyms":""},{"def":"to be pleased because somebody has made you feel important or special","examples":["He was flattered by her attention.","I felt flattered at being asked to give a lecture.","She was flattered to hear that he had been asking about her.","I suppose we should be flattered that he agreed to come at all."],"opposite":"","synonyms":""},{"def":"to be or feel unfairly treated","examples":["She has every right to feel hard done by—her parents have given her nothing."],"opposite":"","synonyms":""},{"def":"to feel proud and happy","examples":["I was honoured to have been mentioned in his speech.","‘Would you be my best man?’ ‘I’d be honoured.’"],"opposite":"","synonyms":""},{"def":"to feel weak because you are nervous","examples":[],"opposite":"","synonyms":""},{"def":"to realize that you are getting old, especially compared with people you are with who are younger than you","examples":[],"opposite":"","synonyms":""},{"def":"used to tell somebody that they are allowed to do something","examples":["Feel free to ask questions if you don't understand.","‘Can I use your phone?’ ‘Feel free.’"],"opposite":"","synonyms":""},{"def":"to feel happy, confident, etc.","examples":["It makes me feel good to know my work is appreciated."],"opposite":"","synonyms":""},{"def":"to be certain about something even though you do not have any direct proof and cannot explain why you are certain","examples":["I know I'm going to fail this exam—I can feel it in my bones."],"opposite":"","synonyms":""},{"def":"to want to have or do something","examples":["I feel like a drink.","We all felt like celebrating.","He felt like bursting into tears.","We'll go for a walk if you feel like it."],"opposite":"","synonyms":""},{"def":"to not have enough money","examples":["Lots of people who have lost their jobs are starting to feel the pinch."],"opposite":"","synonyms":""},{"def":"to move along carefully, for example when it is dark, by touching walls, objects, etc.","examples":[],"opposite":"","synonyms":""},{"def":"to be careful about how you do things, usually because you are in a situation that you are not familiar with","examples":["She was new in the job, still feeling her way."],"opposite":"","synonyms":""},{"def":"to feel that you must do something because of your sense of moral duty","examples":["She felt honour-bound to attend as she had promised to.","He felt honour bound to help her."],"opposite":"","synonyms":""},{"def":"to look or feel very ill or tired","examples":[],"opposite":"","synonyms":""},{"def":"to look/feel extremely good","examples":["Wow, you look like a million dollars."],"opposite":"","synonyms":""},{"def":"to look or feel stupid, weak, ashamed, etc.","examples":["There’s no need to make me look small in front of all these people.","I felt really small when I realized how much time he’d spent on it."],"opposite":"","synonyms":""},{"def":"to do something to make people very aware of the fact that you are there; to have a strong influence on a group of people or a situation","examples":["She’s only been here a couple of weeks but she is already making her presence felt.","She certainly made her presence felt in the boardroom."],"opposite":"","synonyms":""},{"def":"not to feel as well or lively as usual","examples":["I’m not feeling up to the mark at the moment."],"opposite":"","synonyms":""},{"def":"to not feel healthy and well","examples":["I’m not quite feeling myself today."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be/feel flattered","def":"to be pleased because somebody has made you feel important or special","examples":["He was flattered by her attention.","I felt flattered at being asked to give a lecture.","She was flattered to hear that he had been asking about her.","I suppose we should be flattered that he agreed to come at all."]},{"idiom":"be/feel hard done by","def":"to be or feel unfairly treated","examples":["She has every right to feel hard done by—her parents have given her nothing."]},{"idiom":"be/feel honoured (to do something)","def":"to feel proud and happy","examples":["I was honoured to have been mentioned in his speech.","‘Would you be my best man?’ ‘I’d be honoured.’"]},{"idiom":"be/feel like jelly | turn to jelly","def":"to feel weak because you are nervous","examples":[]},{"idiom":"feel your age","def":"to realize that you are getting old, especially compared with people you are with who are younger than you","examples":[]},{"idiom":"feel free (to do something)","def":"used to tell somebody that they are allowed to do something","examples":["Feel free to ask questions if you don't understand.","‘Can I use your phone?’ ‘Feel free.’"]},{"idiom":"feel good","def":"to feel happy, confident, etc.","examples":["It makes me feel good to know my work is appreciated."]},{"idiom":"feel (it) in your bones (that…)","def":"to be certain about something even though you do not have any direct proof and cannot explain why you are certain","examples":["I know I'm going to fail this exam—I can feel it in my bones."]},{"idiom":"feel like something/like doing something","def":"to want to have or do something","examples":["I feel like a drink.","We all felt like celebrating.","He felt like bursting into tears.","We'll go for a walk if you feel like it."]},{"idiom":"feel the pinch","def":"to not have enough money","examples":["Lots of people who have lost their jobs are starting to feel the pinch."]},{"idiom":"feel your way","def":"to move along carefully, for example when it is dark, by touching walls, objects, etc.","examples":["She was new in the job, still feeling her way."]},{"idiom":"(feel) honour-bound to do something","def":"to feel that you must do something because of your sense of moral duty","examples":["She felt honour-bound to attend as she had promised to.","He felt honour bound to help her."]},{"idiom":"look/feel like death warmed up","def":"to look or feel very ill or tired","examples":[]},{"idiom":"look/feel like a million dollars/bucks","def":"to look/feel extremely good","examples":["Wow, you look like a million dollars."]},{"idiom":"look/feel small","def":"to look or feel stupid, weak, ashamed, etc.","examples":["There’s no need to make me look small in front of all these people.","I felt really small when I realized how much time he’d spent on it."]},{"idiom":"make your presence felt","def":"to do something to make people very aware of the fact that you are there; to have a strong influence on a group of people or a situation","examples":["She’s only been here a couple of weeks but she is already making her presence felt.","She certainly made her presence felt in the boardroom."]},{"idiom":"not be/feel up to the mark","def":"not to feel as well or lively as usual","examples":["I’m not feeling up to the mark at the moment."]},{"idiom":"not feel yourself","def":"to not feel healthy and well","examples":["I’m not quite feeling myself today."]}],"phrasal":["feel for","feel up","feel up to"],"related":["feel for","feel up","feel-good","feel up to","the feel","feel for somebody","feel somebody","feel up to something","feel strange","feel your age","be/feel hard done by","the feel-good factor","feel sorry for yourself","be/feel sorry for somebody","get/have a feel for something","feel (it) in your bones (that…)","(feel) honour-bound to do something","look/feel like death warmed up","get the feel of (doing) something"]},{"pos":"noun","level":"B2","meanings":[{"def":"the feeling you get when you touch something or are touched","examples":["You can tell it's silk by the feel.","The model has the look and feel of wood.","She loved the feel of the sun on her skin."],"opposite":"","synonyms":""},{"def":"an act of feeling or touching","examples":["I had a feel of the material."],"opposite":"","synonyms":""},{"def":"the impression that is created by a place, situation, etc.; atmosphere","examples":["It's a big city but it has the feel of a small town.","The overall feel of the album is slow and dreamlike.","feel to something The film has a documentary feel to it.","A white colour scheme creates a bright and airy feel.","His novels all have a realistic and contemporary feel.","The room has a comfortable feel to it.","There is an international feel to the restaurant."],"opposite":"","synonyms":""},{"def":"feelings of extreme emotion","examples":["The anniversary concert is guaranteed to give fans all the feels."],"opposite":"","synonyms":""},{"def":"to get/have an understanding of something or be naturally good at doing it","examples":["She has a real feel for languages."],"opposite":"","synonyms":""},{"def":"to become familiar with something or with doing something","examples":["I haven't got the feel of the brakes in this car yet."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"get/have a feel for something","def":"to get/have an understanding of something or be naturally good at doing it","examples":["She has a real feel for languages."]},{"idiom":"get the feel of (doing) something","def":"to become familiar with something or with doing something","examples":["I haven't got the feel of the brakes in this car yet."]}],"phrasal":[],"related":[]}]