[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fee/feeli/feeling__us_2.mp3","phonsUS":"/ˈfiːlɪŋ/","level":"A1","meanings":[{"def":"something that you feel through the mind or through the senses","examples":["a feeling of something a feeling of guilt/helplessness/anger/sadness","He struggled with feelings of isolation and loneliness.","You might experience feelings of dizziness and nausea.","a strange/horrible feeling","You need to stop having these guilty feelings.","I've got a tight feeling in my stomach.","(informal) ‘I really resent the way he treated me.’ ‘I know the feeling (= I know how you feel).’","‘I'm going to miss you.’ ‘The feeling's mutual (= I feel exactly the same).’","I remember a terrible feeling of helplessness and anger.","He was suffering from feelings of inadequacy.","They began a friendship based on their mutual feeling of isolation.","I had this awful feeling of dread.","Constant comparisons can undermine your confidence and create a feeling of insecurity.","We can help you deal with feelings of anxiety.","I was left with a vague feeling of sadness at the end.","There was just a great feeling of excitement.","his feelings of grief","He was determined to banish all feelings of guilt.","He still harboured feelings of resentment.","I had a strange feeling in my stomach.","A horrible feeling of sickness came over me.","He felt a wonderful warm feeling come over him.","the painful feeling in his gut","It's a weird feeling giving a speech at your old school.","It was such an overwhelming feeling seeing them again.","It's a lovely feeling when everything's going so well.","She experienced a whole range of feelings.","She loved the feeling of being close to him.","The video conveys a feeling of optimism.","I don't have those guilt feelings any more.","I fought back my feelings of jealousy.","He suddenly had a terrible sinking feeling in the pit of his stomach.","I hated the feeling of uncertainty.","I started to get a familiar feeling in my stomach.","I tried to ignore my irrational feelings of jealousy.","It gave me a warm fuzzy feeling to hear him say that.","It was a good feeling to be arriving home again.","Rielle had an overwhelming feeling of guilt.","She ignored the queasy feeling in her stomach.","It was the practical aspect of life that heightened her feelings of loneliness and loss.","The drink gave me a feeling of confidence.","She gives me this creepy feeling."],"opposite":"","synonyms":""},{"def":"a person’s emotions rather than their thoughts or ideas","examples":["He hates talking about his feelings.","to express/share your feelings","People's words often hide their true feelings.","Talk to someone about your thoughts and feelings.","I didn't mean to hurt your feelings (= offend you).","He had never been one to share his feelings.","She finds it difficult to express her feelings.","There's nothing wrong with showing your feelings.","You need to realize that your parents have feelings too.","He's not very in touch with his feelings.","Can you try to describe your feelings at this moment?","He wanted just to be able to let his feelings out.","I finally gave vent to my feelings and started yelling at him.","discussing his innermost feelings with me","We discussed our innermost feelings.","When people fight, there are bound to be hurt feelings.","She was lucky that she had suffered no more than hurt feelings.","I'm sorry if I've hurt your feelings.","Her poems reflected her personal feelings.","She could finally release her pent-up feelings."],"opposite":"","synonyms":""},{"def":"strong emotion","examples":["Feeling runs deep (= people feel strongly) on this issue.","feeling about something the depth/strength of feeling about an issue","with feeling She spoke with feeling about the plight of the homeless.","The debate aroused strong feelings on both sides.","Feelings are running high (= people are very angry or excited).","Feelings were running high as the meeting continued.","The government has underestimated the depth of feeling about this.","I was taken aback by the strength of feeling at the meeting.","the sheer intensity of feeling that drove these changes","It was a perfect tool to arouse local feelings.","Their aim was to stir up feeling against the war.","He invests so much feeling in his work.","She gave a speech full of passion and feeling."],"opposite":"","synonyms":""},{"def":"an attitude or opinion about something","examples":["The general feeling was against the decision.","My own feeling is that we should buy the cheaper one.","Public feeling is being ignored by the government.","feeling about something I don't have any strong feelings about it one way or the other.","She had mixed feelings about giving up her job.","feeling on something You know my feelings on this.","feeling towards/toward somebody/something his complicated feelings towards his classmates","They are completely ignoring the feelings of local people.","I have mixed feelings on that.","I didn't like it, but I kept my feelings to myself.","There are strong feelings both for and against the idea.","Most people's feelings are against the war.","My feelings about the changes are mostly positive.","What are your feelings on this issue?","Personal feelings don't come into it—we have to do what's right.","I had mixed feelings about meeting them again.","I don't want there to be any ill feeling about this.","What are your feelings towards religion now?","He wants to overcome his negative feelings toward women.","My feeling towards this album is similar to yours—I admire it, but I don't love it."],"opposite":"","synonyms":""},{"def":"the idea or belief that a particular thing is true or a particular situation is likely to happen","examples":["Our gut feeling tells us that this will work.","feeling (that)… I got the feeling he didn't like me much.","I had this nagging feeling that I had forgotten something.","feeling of (doing) something He suddenly had the feeling of being followed.","feeling about something I have a bad feeling about this (= I have the impression it is not going to go well).","I couldn't shake the feeling that something was wrong with him.","Do you get the feeling that we're not welcome here?","My gut feeling was that it had been a mistake to come.","We had this feeling of impending doom.","I had this feeling of danger.","I had a feeling about that place.","I didn't have a good feeling about the situation.","I've got a really good feeling about this.","I had a nasty feeling that she was lying to me.","My gut feeling was that we couldn't trust her.","She was left with the feeling that he did not care.","I have a weird feeling everything's going to be OK.","I had a feeling you were going to do that!","She had the strange feeling he already knew what she was going to say.","I've got a funny feeling you're going to win tomorrow.","I had a nasty feeling that we were lost.","'Do you think he meant to do it?'—'That's my feeling, yes.'","If you get a good feeling from it, then buy it."],"opposite":"","synonyms":""},{"def":"sympathy or love for somebody/something","examples":["He never told her his feelings.","feeling for somebody/something You have no feeling for the sufferings of others.","I still have feelings for her (= feel attracted to her in a romantic way).","Although she did not reciprocate his feelings, she did not discourage him.","I can bring out Aminta's romantic feelings.","He never told her his true feelings.","They definitely have feelings for each other.","Feelings don't always last.","When you work closely together, feelings can develop.","Heather is slowly admitting her feelings.","They begin to develop feelings for one another.","a sweet old man with genuine feelings for Virginia","It makes no difference to my feelings for you.","She still had a lot of feeling for David.","the feeling between a mother and child","the depth of feeling between old friends","What I love about this book is its genuine feeling for people.","How can you be so cruel? Have you no feeling?"],"opposite":"","synonyms":""},{"def":"the ability to feel physically","examples":["I've lost all feeling in my legs.","Feeling gradually began to return to my frozen feet.","Will she ever get the feeling back in her fingers?","Wait for the feeling to come back into your arm.","You may experience a loss of feeling in your extremities.","I had no feeling in my toes.","After the accident he lost all feeling in his legs.","I seemed to be losing the feeling in my feet."],"opposite":"","synonyms":""},{"def":"the ability to understand somebody/something or to do something in a sensitive way","examples":["He played the piano with great feeling.","feeling for somebody/something She has a wonderful feeling for colour.","He had developed a feeling for when not to disturb her.","feeling of something He had great design sense, and a great feeling of proportion.","She plays her part with feeling.","His performance was accurate, but lacked feeling.","As a writer she has a great feeling for different perspectives.","His work shows a powerful feeling for the grandeur of nature.","His earthy yet poetic feeling for character may be considered typically English.","The designer shows an exquisite feeling for texture.","Once they'd seen the footage, they started to get a feeling of how it was working on screen.","She has no feeling of how to get people on her side.","a film-maker who has a great feeling of place"],"opposite":"","synonyms":""},{"def":"the atmosphere of a place, situation, etc.","examples":["They have managed to recreate the feeling of the original theatre.","The house had a feeling of neglect about it.","There's a great patriotic feeling in the country.","There was a feeling of sadness in the room.","There was a general feeling of change in the air.","They have managed to recreate the feeling of the original building.","Light colours create a feeling of spaciousness."],"opposite":"","synonyms":""},{"def":"anger between people, especially after an argument","examples":["There was a lot of bad feeling between the two groups of students.","I don't want any bad feelings between us."],"opposite":"","synonyms":""},{"def":"used after you have been arguing with somebody or have beaten them in a contest but you would still like to be friendly with them","examples":["It looks like I'm the winner again. No hard feelings, Dave, eh?","Someone has to lose. No hard feelings, eh?"],"opposite":"","synonyms":""},{"def":"an unpleasant feeling that you get when you realize that something bad has happened or is going to happen","examples":["I had a horrible sinking feeling when I saw the ambulance outside the house."],"opposite":"","synonyms":""},{"def":"to be careful not to do or say anything that might upset somebody","examples":["I kept off the subject of divorce so as to spare her feelings."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"bad/ill feeling","def":"anger between people, especially after an argument","examples":["There was a lot of bad feeling between the two groups of students.","I don't want any bad feelings between us."]},{"idiom":"no hard feelings","def":"used after you have been arguing with somebody or have beaten them in a contest but you would still like to be friendly with them","examples":["It looks like I'm the winner again. No hard feelings, Dave, eh?","Someone has to lose. No hard feelings, eh?"]},{"idiom":"a/that sinking feeling","def":"an unpleasant feeling that you get when you realize that something bad has happened or is going to happen","examples":["I had a horrible sinking feeling when I saw the ambulance outside the house."]},{"idiom":"spare somebody’s feelings","def":"to be careful not to do or say anything that might upset somebody","examples":["I kept off the subject of divorce so as to spare her feelings."]}],"phrasal":[],"related":["fellow feeling","ill/bad feeling"]}]