[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fie/field/field__us_1.mp3","phonsUS":"/fiːld/","level":"A2","meanings":[{"def":"an area of land in the country used for growing crops or keeping animals in, usually surrounded by a fence, etc.","examples":["We had to walk across a ploughed field.","in a field We camped in a field near the village.","People were working in the fields.","field of something We saw golden fields of wheat.","He planted a field of beans.","a rice/wheat field","The house overlooks the sugar cane fields.","She grew up in the countryside, playing in the woods and fields.","There was a big field behind our house.","tractors working out in the field","The straw can be chopped and spread on the field.","The fields around the village are full of corn.","They went walking in the fields outside the city.","When I was a child this was all fields.","Despite the war, they continued to work the fields.","He planted fields full of sunflowers.","looking out on the green fields of Shropshire","the green fields of my homeland","The farmer had just ploughed the field, ready for planting the next crop.","This weed can cause problems in corn, soybean, and wheat fields.","Emerald green rice fields stretched as far as the eye could see.","We saw endless fields of sunflowers."],"opposite":"","synonyms":""},{"def":"an area of land used for the purpose mentioned","examples":["a landing field"],"opposite":"","synonyms":""},{"def":"a large area of land covered with the thing mentioned; an area from which the thing mentioned is obtained","examples":["The territory is covered with snow, bare rock and ice fields.","Prisoners were sent to work in the gas fields in the north.","the discovery of the oil and gas fields in the North Sea"],"opposite":"","synonyms":""},{"def":"an area of land used for playing a sport on","examples":["a football/soccer/sports field","a baseball/cricket/rugby field","on/off the field Every player on the field did their best today.","Players need discipline both on and off the field (= when they are playing and also in their free time).","There was huge excitement as the teams came onto the field.","Today they take the field (= go on to the field to play a game) against county champions Essex.","The area has golf courses, community gardens, and sports fields.","They were walking home from the sports field.","From the train we saw people playing at a baseball field.","There are soccer fields behind the school.","She made a name for herself on the hockey field.","He spends his weekends on muddy rugby fields.","As soon as she came on the field she made a difference.","She limped off the field.","He was booed off the field.","Players are only reselected if they retain their form on the field (= when they are playing a match).","For Liverpool fans, it was a night to remember both on and off the field (= the match was good and so were the celebrations afterwards).","She passed the ball across the field.","He likes to play in the middle of the field."],"opposite":"","synonyms":""},{"def":"the team that is trying to catch the ball rather than hit it","examples":["He took the ball early and hit it through a gap in the field."],"opposite":"","synonyms":""},{"def":"all the people or animals competing in a particular sports event","examples":["The strong field includes three world record holders.","She managed to head the field across the finishing line of the London Marathon.","His superb technique puts him head and shoulders ahead of the field."],"opposite":"","synonyms":""},{"def":"an area of land where a battle is fought","examples":["in the field a medal for bravery in the field","on the field to die on the field of battle","a field ambulance/kitchen"],"opposite":"","synonyms":""},{"def":"a particular subject or activity that somebody works in or is interested in","examples":["Child development is such an interesting field.","Genetic science has developed dramatically since I entered the field 40 years ago.","in a field All of them are experts in their chosen field.","He was awarded a Nobel Prize for his work in this field.","in the field of something She works in the field of adult education.","I enjoy meeting people in other fields of business.","field of something This discovery has opened up a whole new field of study.","‘How big was the bomb, if it did all that damage?’ ‘I don’t know. Not my field’ (= that is not one of the subjects I know about).","people who work in this field","I work in the field of computer science.","She has made a huge impact in the field of literary history.","Computer modelling is used extensively in the field of climate science.","She was a pioneer in the field of digital art.","Researchers in the field believe this could be a major breakthrough.","You may use libraries or labs depending on your field of research.","These academics are world leaders in their respective fields.","I can't answer that—I'm afraid it's outside my field.","Etymology is not really my field, but I'll try to answer your questions.","There has been no solid research in this field.","He was equally famous in the fields of politics and of science."],"opposite":"","synonyms":""},{"def":"the fact of people doing practical work or study, rather than working in a library or laboratory","examples":["a field study/experiment","field recordings/observations","Her findings were based on extensive field and laboratory work.","We then tested the questionnaire in field conditions.","in the field tests carried out in the field","In 2016, the first field trials of the vaccine were carried out.","In a series of field experiments, we investigated the effect on the frog population.","Until further field research has been conducted on these products, caution is recommended with their use.","field recordings of natural sounds","This research finding tends to support the field observation that organizations change only when they have to.","Companies might use focus groups or field surveys for market research.","The researchers went on to conduct a three-year field and laboratory study.","The research-and-development unit comes up with new products and tests them in the field.","The device can directly measure soil erodibility in the field or laboratory."],"opposite":"","synonyms":""},{"def":"all the people or products competing in a particular area of business","examples":["They lead the field in home entertainment systems."],"opposite":"","synonyms":""},{"def":"an area within which the force mentioned has an effect","examples":["the earth’s gravitational field","an electromagnetic field","Weak electric fields are emitted by all living organisms."],"opposite":"","synonyms":""},{"def":"part of a record that is a separate item of data","examples":["You will need to create separate fields for first name, surname and address.","the use of keys to move between fields"],"opposite":"","synonyms":""},{"def":"to enable somebody to be successful in a particular area of activity because other people or groups have given up competing with them","examples":["The complete disarray of the opposition parties leaves the field clear for the government to implement urgent reforms."],"opposite":"","synonyms":""},{"def":"to create a situation where everyone has the same opportunities","examples":[],"opposite":"","synonyms":""},{"def":"to have sexual relationships with a lot of different people","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"leave the field clear for somebody","def":"to enable somebody to be successful in a particular area of activity because other people or groups have given up competing with them","examples":["The complete disarray of the opposition parties leaves the field clear for the government to implement urgent reforms."]},{"idiom":"level the playing field","def":"to create a situation where everyone has the same opportunities","examples":[]},{"idiom":"play the field","def":"to have sexual relationships with a lot of different people","examples":[]}],"phrasal":[],"related":["on-field","field day","ice field","Field","field corn","field event","field goal","field hand","field house","field mouse","field test","field-test","field trial","field trip","force field","left field","left-field","right field"]},{"pos":"verb","level":"","meanings":[{"def":"to provide a candidate, speaker, team, etc. to represent you in an election, a competition, etc.","examples":["Each of the main parties fielded more than 300 candidates.","England fielded a young side in the World Cup."],"opposite":"","synonyms":""},{"def":"to be the person or the team that catches the ball and throws it back after somebody has hit it","examples":["He won the toss and chose to field first."],"opposite":"","synonyms":""},{"def":"to catch the ball and throw it back","examples":["He fielded the ball expertly."],"opposite":"","synonyms":""},{"def":"to receive and deal with questions or comments","examples":["The BBC had to field more than 300 phone calls after last night's programme."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]