[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fig/fight/fight__us_1.mp3","phonsUS":"/faɪt/","level":"A2","meanings":[{"def":"to take part in a war or battle against an enemy","examples":["soldiers trained to fight","He fought in Vietnam.","fight against somebody My grandfather fought against the Fascists in Spain.","fight somebody/something to fight a war/battle","They gathered soldiers to fight the invading army.","fight for something They fought for control of the island.","fight somebody/something for something Didn't we fight a war for freedom?","fight over something They were fighting over disputed land.","fight somebody/something over something Future wars will be fought over water supplies.","We fought and won.","Millions fought and died.","He did not believe that the enemy was ready to fight.","We believed we were fighting for freedom.","These men fought for their country.","Many African American soldiers fought for the Union.","He fought alongside his comrades.","I met someone who fought alongside my father in the war.","They fought bravely against the enemy.","The country fought several wars against its neighbours.","The soldiers were trained to fight in the jungle.","Bolshevik troops fought Polish forces in what is today Western Ukraine and Belarus.","These soldiers fought under the imperial banner.","Modern wars are fought with more sophisticated technology."],"opposite":"","synonyms":""},{"def":"to struggle physically with somebody","examples":["My little brothers are always fighting.","He taught me how to fight with a sword.","fight with somebody Riot police fought with demonstrators.","He sometimes fights with other children in the playground.","fight somebody She fought her attacker, eventually forcing him to flee.","fight over something Children will fight even over small things.","dogs fighting over scraps of food","fight somebody over something They were fighting each other over a toy.","fight (somebody) for something Paris offers to fight Menelaus for Helen's hand.","fight against somebody/something She fought hard against his strong grip.","He was suspended from school for fighting.","How did you get the black eye? Have you been fighting?","I caught them fighting with sticks.","He fought another boy over a girl.","He fought against his attacker.","Thousands of rioting students fought with police.","They practically fought (with) each other for the honour of carrying my bag.","A boy said he wanted to fight me after school."],"opposite":"","synonyms":""},{"def":"to have an argument with somebody about something","examples":["I remember lying in bed listening to my parents fighting.","fight about something It's a trivial matter and not worth fighting about.","fight over something Scholars have long fought over this point.","fight with somebody I'm always fighting with my sister.","It's normal for couples to fight.","The thing we fight about most is money.","We've fought over many issues, but always respected one another.","Let's not fight over the details.","He was well-liked by his peers, but often fought with his teachers."],"opposite":"","synonyms":""},{"def":"to try hard to stop, deal with or oppose something bad or something that you disagree with","examples":["We will continue to fight for as long as it takes.","She fought bravely, but died of the disease.","fight something to fight terrorism/crime/corruption/poverty","Vitamin C helps your body to fight disease.","Workers are fighting the decision to close the factory.","The fire crews had problems fighting the blaze.","She fought a long battle against cancer.","fight against something They are committed to fighting against racism.","fight for somebody She spent her life fighting for the poor.","fight something with something We must fight hatred with love.","fight to do something She'll fight like a tiger to protect her children.","We are committed to fighting poverty.","The government will introduce new measures to fight terrorism.","a superhero who wants to fight crime and clean up the city","Fighting corruption is essential to restore public confidence.","He vowed to fight against the decision.","He has used his fame to become a spokesman for alleviating world poverty and fighting AIDS.","His body was too weak to fight the infection.","Why did you fight so hard against these changes?","I've always had to fight against prejudice.","They are fighting unwinnable wars against corporate giants.","We're fighting for people who are discriminated against.","The organization fights on behalf of political prisoners across the world.","This battle is being fought with spin and PR."],"opposite":"","synonyms":""},{"def":"to try very hard to get something or to achieve something","examples":["We fought for years before we got the recognition we deserved.","fight for something Women fought for the right to vote.","He's still fighting for compensation after the accident.","fight to do something Doctors fought for more than six hours to save his life.","She fought hard to get this film made.","fight your way… She gradually fought her way to the top of the company.","the campaign for parliamentary reform","an advertising campaign","She finally won the legal battle for compensation.","the endless battle between man and nature","the struggle for independence","the struggle between good and evil","the drive for greater efficiency","a drive to reduce energy consumption","the war against crime","Workers won their fight to stop compulsory redundancies.","The company is fighting for survival at the moment.","We will never give up fighting for justice.","He fought tirelessly for the abolition of slavery.","Regional monopolies were bitterly fought for.","We need a good manager who is prepared to fight for a fair share of the funds.","We are fighting for equal rights.","Campaigners fought to save the hospital from closure.","She fought desperately to suppress her laughter.","He fought hard to overcome his disability.","They say they are fighting to preserve their way of life.","She fought to keep her composure.","We fought our way across London in heavy traffic.","This small company fought its way to global success."],"opposite":"","synonyms":"campaign"},{"def":"to take part in a contest against somebody","examples":["fight somebody/something (for something) to fight an election/a campaign","fight for something She's fighting for a place in the national team.","There are twelve parties fighting the election.","The second half was fiercely fought, but neither side managed to score."],"opposite":"","synonyms":""},{"def":"to take part in a boxing match","examples":["Doctors fear he may never fight again.","fight somebody/​something He has fought 37 bouts with 24 knockouts."],"opposite":"","synonyms":""},{"def":"to try to get what you want in court","examples":["fight (somebody) for something He fought his wife for custody of the children.","fight something I'm determined to fight the case."],"opposite":"","synonyms":""},{"def":"to defend your/somebody’s position against other people","examples":[],"opposite":"","synonyms":""},{"def":"to use similar methods in a fight or an argument to those your opponent is using","examples":[],"opposite":"","synonyms":""},{"def":"to make a great effort to stay alive, especially when you are badly injured or seriously ill","examples":["A young cyclist is fighting for his life after the accident."],"opposite":"","synonyms":""},{"def":"to be able to win an argument or get what you want without anyone’s help","examples":["I wouldn't get involved—he's old enough to fight his own battles.","My parents believed in leaving me to fight my own battles."],"opposite":"","synonyms":""},{"def":"to be unwilling to accept something or do something, and to try to avoid it","examples":["Successive governments have fought shy of such measures."],"opposite":"","synonyms":""},{"def":"to fight until one of the two people or groups is dead, or until one person or group defeats the other","examples":["The soldiers were prepared to fight to the death if they had to."],"opposite":"","synonyms":""},{"def":"to fight in a very determined way for what you want","examples":["The residents are fighting tooth and nail to stop the new development.","She fought tooth and nail to keep custody of the children."],"opposite":"","synonyms":""},{"def":"used to say that although you have failed or had a bad experience, you will continue","examples":[],"opposite":"","synonyms":""},{"def":"(to try to do) something that you will probably never succeed in doing","examples":["I’m fighting a losing battle against the mess in this house!","She wanted him to take some responsibility for his actions, but she knew it was a losing battle."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"fight your/somebody’s corner","def":"to defend your/somebody’s position against other people","examples":[]},{"idiom":"fight fire with fire","def":"to use similar methods in a fight or an argument to those your opponent is using","examples":[]},{"idiom":"fight for (your) life","def":"to make a great effort to stay alive, especially when you are badly injured or seriously ill","examples":["A young cyclist is fighting for his life after the accident."]},{"idiom":"fight your own battles","def":"to be able to win an argument or get what you want without anyone’s help","examples":["I wouldn't get involved—he's old enough to fight his own battles.","My parents believed in leaving me to fight my own battles."]},{"idiom":"fight shy of something/of doing something","def":"to be unwilling to accept something or do something, and to try to avoid it","examples":["Successive governments have fought shy of such measures."]},{"idiom":"fight to the death/finish","def":"to fight until one of the two people or groups is dead, or until one person or group defeats the other","examples":["The soldiers were prepared to fight to the death if they had to."]},{"idiom":"fight tooth and nail","def":"to fight in a very determined way for what you want","examples":["The residents are fighting tooth and nail to stop the new development.","She fought tooth and nail to keep custody of the children."]},{"idiom":"live to fight another day","def":"used to say that although you have failed or had a bad experience, you will continue","examples":[]},{"idiom":"(fight) a losing battle","def":"(to try to do) something that you will probably never succeed in doing","examples":["I’m fighting a losing battle against the mess in this house!","She wanted him to take some responsibility for his actions, but she knew it was a losing battle."]}],"phrasal":["fight back","fight down","fight it out","fight off","fight out"],"related":["fight off","fight out","fight back","fight down","fight it out","dog fight","fight something","fight out something | fight it out","fight somebody/something","fight back (against somebody/something)","fight your own battles","(fight) a losing battle","be spoiling for a fight","a fight to the finish","fight your/somebody’s corner","live to fight another day","fight to the death/finish","have a dog in the fight"]},{"pos":"noun","level":"A2","meanings":[{"def":"a struggle against somebody/something using physical force","examples":["a street/gang fight","fight with somebody/something He got into a fight with a man in the bar.","(figurative) I had a fight with the ticket machine, which was being temperamental.","fight between A and B A fight broke out between rival groups of fans.","He got into a fight with a man in the bar.","Clashes broke out between police and demonstrators.","a drunken brawl in a bar","There were no signs of a struggle at the murder scene.","He was involved in a scuffle with a photographer.","Andy was drunk and spoiling for a fight.","Don't get into any more fights!","He killed a man in a fight.","He tried to pick a fight with me.","He was killed during a series of running fights outside a disco.","I don't know who started the fight.","In a straight fight the army usually won.","In a straight fight the crusaders usually won; in skirmishes, the Saracens often overcame their more numerous opponents.","It was a fair fight and Stephen won.","Suddenly the argument developed into a real fight.","The fight was broken up by a teacher.","There's nothing he likes so much as a good fight.","They got involved in a fight with some older boys.","They inadvertently got mixed up in a free fight involving some 20 people.","They nearly had a fight over who should move first.","The referee stopped the fight in the third round.","Did you two have a fight?","a fist fight","fights between hostile clans","fights between police and football fans"],"opposite":"","synonyms":"fight"},{"def":"an occasion when people fight as a sport, especially in boxing","examples":["They got tickets to watch the world title fight.","He is unbeaten in 34 fights."],"opposite":"","synonyms":""},{"def":"an argument about something","examples":["Paul and I had this terrible fight last night.","fight with somebody Did you have a fight with him?","He is still engaged in a bitter fight with his old company.","fight (with somebody) over something We had a fight over money."],"opposite":"","synonyms":""},{"def":"the work of trying to destroy, prevent or achieve something","examples":["fight against something the fight against crime/terrorism","He lost his fight against cancer earlier this year.","fight for something a fight for justice/survival","She just gave up her fight for life.","fight to do something Workers won their fight to stop compulsory redundancies.","The workers are determined to put up a fight (= to fight hard) to save their jobs.","Union leaders know that they have a real fight on their hands (= will have to fight very hard).","Doctors have now joined in the fight to make this treatment available to all.","Are we losing the fight against illegal drugs?","She died at the age of 43 after a brave fight against cancer.","Now he is facing his toughest fight yet—back to fitness after a series of injuries.","She said they would continue their fight to find a cure for AIDS.","their fight for a fair deal","the company's desperate fight for survival in a cut-throat market","lawyers leading the fight for compensation for the injured workers","The fight for justice goes on.","The fight for supremacy in the sport is on.","The fight is on to have this brutal practice stamped out.","The government has vowed to step up the fight against crime.","a long fight to beat inflation","a new weapon in the fight against car crime","his fight with cancer","The government has released new figures in the fight against crime.","She vowed to take her fight to the High Court.","I'm not giving up without a fight!"],"opposite":"","synonyms":""},{"def":"a competition or an act of competing, especially in a sport","examples":["The team put up a good fight (= they played well) but were finally beaten.","She now has a fight on her hands (= will have to play very well) to make it through to the next round.","fight between A and B This will be a straight fight between the two parties.","the campaign for parliamentary reform","an advertising campaign","She finally won the legal battle for compensation.","the endless battle between man and nature","the struggle for independence","the struggle between good and evil","the drive for greater efficiency","a drive to reduce energy consumption","the war against crime","Workers won their fight to stop compulsory redundancies.","This will be a straight fight between Labour and the Conservatives: the other parties are nowhere.","No doubt Ferguson wants his team to make a fight of it.","By 1807 politics had become a fight to the death between the two factions."],"opposite":"","synonyms":"campaign"},{"def":"a battle, especially for a particular place or position","examples":["In the fight for Lemburg, the Austrians were defeated."],"opposite":"","synonyms":""},{"def":"the desire or ability to keep fighting for something","examples":["In spite of many defeats, they still had plenty of fight left in them.","Losing their leader took all the fight out of them."],"opposite":"","synonyms":""},{"def":"to want to fight with somebody very much","examples":[],"opposite":"","synonyms":""},{"def":"a sports competition, election, etc. between sides that are so equal in ability that they continue fighting very hard until the end","examples":["Six teams are bitter rivals in what will be a fight to the finish.","If the polls are wrong and it's a fight to the finish, the result may not be known until all the votes have been counted."],"opposite":"","synonyms":""},{"def":"to be involved in a situation so that you will gain or lose according to the result","examples":["I really don't have a dog in this fight, so I can just enjoy the game.","The employees have a dog in the hunt, so their views should be listened to."],"opposite":"","synonyms":""},{"def":"to deliberately start a fight or an argument with somebody","examples":["He had drunk too much and was ready to pick a fight with anyone who crossed his path.","She tried to pick a quarrel with me."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be spoiling for a fight","def":"to want to fight with somebody very much","examples":[]},{"idiom":"a fight to the finish","def":"a sports competition, election, etc. between sides that are so equal in ability that they continue fighting very hard until the end","examples":["Six teams are bitter rivals in what will be a fight to the finish.","If the polls are wrong and it's a fight to the finish, the result may not be known until all the votes have been counted."]},{"idiom":"have a dog in the fight","def":"to be involved in a situation so that you will gain or lose according to the result","examples":["I really don't have a dog in this fight, so I can just enjoy the game.","The employees have a dog in the hunt, so their views should be listened to."]},{"idiom":"pick a fight/quarrel (with somebody)","def":"to deliberately start a fight or an argument with somebody","examples":["He had drunk too much and was ready to pick a fight with anyone who crossed his path.","She tried to pick a quarrel with me."]}],"phrasal":[],"related":[]}]