[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fig/figur/figure__us_2.mp3","phonsUS":"/ˈfɪɡjər/","level":"A2","meanings":[{"def":"a number representing a particular amount, especially one given in official information","examples":["the latest sales/crime/unemployment figures","Official figures indicate that crime is falling.","Figures for April show a slight improvement on previous months.","By 2017, this figure had risen to 14 million.","Viewing figures for the series have dropped dramatically.","Figures released by the hospital reveal a rise in the number of admissions.","Experts put the real figure at closer to 75%.","according to… figures According to government figures, 3.6 million children are living in poverty.","Her argument is backed up with plenty of facts and figures.","We don't need a lot of facts and figures to understand that homelessness is a problem—we see it every day in our cities.","The most recent trade figures vividly illustrate this problem.","According to figures published recently, more people are in serious debt.","Figures obtained by this newspaper show that the group spent 3.6 million euro on TV advertising.","For 2016–17, the figure quoted is $1.295 billion.","The report cites figures as high as 85%.","We can't put a firm figure on it, but attendance was better than ever.","Even though he doubled his sales figures every year, he was fired.","The bank's figures reveal mortgage borrowing rose by £7.9 billion.","The company hopes to double this figure by the end of the year.","64% of American women breastfeed during their infants' first weeks of life, but after 6 months, that figure drops to 29%.","These figures reflect sales for just the early part of the summer.","Do those figures include families with no children living at home?","A breakdown of the figures shows that 73% of the employees who requested flexible working were women.","The average price is nearly 20% above the figure for the previous year.","This figure represents an increase of nearly 13%.","This figure might suggest several billion pounds a year of losses worldwide.","The government has just released new unemployment figures.","The industry remains in the doldrums, according to official figures out today.","These figures don't add up.","The final figure looks like being much higher than predicted.","Lots of different figures were being bandied about."],"opposite":"","synonyms":""},{"def":"a symbol rather than a word representing one of the numbers between 0 and 9","examples":["Write the figure ‘7’ on the board.","paths built in the shape of a figure 8","a six-figure salary (= over 100 000 pounds or dollars)","in… figures Her salary is now in six figures.","My unread email was in triple figures (= more than 100).","Ticket prices for the show are likely to be into three figures (= at least 100 pounds or dollars).","Roads loop around the site in a figure eight.","Skaters carve figure eights in the ice.","Write a figure “1” next to bids that were successful and \"0\" next to those that were not.","Inflation is now in single figures.","The rate of inflation reached double figures.","England's batsmen failed to reach triple figures.","She's earning a six-figure salary.","At that time, very few artists made as many as four figures.","He took a photo of her and sold it to a tabloid newspaper for five figures.","I'd be surprised if the fee doesn't run into five figures.","The gross sales of a moderately successful book come in the low five figures.","After five years she can expect to earn in the high five figures.","The crowds the band can attract have dipped to the low four figures."],"opposite":"","synonyms":""},{"def":"the area of mathematics that deals with adding, multiplying, etc. numbers","examples":["Are you any good at figures?","I'm afraid I don't have a head for figures (= I am not good at adding, etc.).","I was never very good at figures."],"opposite":"","synonyms":""},{"def":"a person of the type mentioned","examples":["a leading figure in the music industry","a senior figure in the organization","a key/prominent/central figure","King's widow, Coretta Scott King, later became a public figure in her own right.","teachers and other authority figures","figure of something a figure of authority/ridicule","He was a well-known figure in London at that time.","one of the most popular figures in athletics","When she last saw him, he was a sad figure—old and tired.","Several powerful political figures spoke out against him.","As a public figure, you have certain responsibilities.","a key figure on the committee","He was one of the most prominent figures of the Pop Art movement.","She was a central figure in revolutionary politics at that time.","one of modern architecture's most influential figures","She often came into conflict with teachers and other authority figures.","Kinsey was a controversial figure in his own time.","celebrities who have become figures of ridicule","He was not only a composer but a figure of some historical importance.","She is interested in Jesus as a historical figure.","He corresponded with notable artists, art historians, and literary figures.","He was an Italian painter, a shadowy figure about whose life very little is known.","a relatively unknown figure from the world of fashion","He was a familiar figure in the local pub.","They were visited by the unlikely figure of Donald Trump.","A male Scottish law professor seems an unlikely figure to be writing novels about an African woman detective."],"opposite":"","synonyms":""},{"def":"the shape of a person seen from a distance or not clearly","examples":["There before him stood a tall figure in black.","A shadowy figure can be seen through the window.","The seated figure in the corner beckoned me over.","I saw a shadowy figure approaching.","A hooded figure stood by the door.","Who is the figure in the background?","I opened my eyes to see several figures standing over me.","She appears as a ghostly figure.","Just then, two figures appeared over the horizon.","There was a figure coming up the path."],"opposite":"","synonyms":""},{"def":"the shape of the human body, especially a woman’s body that is attractive","examples":["She's always had a good figure.","I'm watching my figure (= trying not to get fat).","You need to watch your figure.","foods that are good for the health and the figure","Dancing is fun and great for your figure.","You have a lovely figure.","She's kept her figure after all these years.","I thought if I had a baby I'd lose my figure.","How do you get such a great figure?","He's small, with a rather plump figure."],"opposite":"","synonyms":""},{"def":"a person or an animal in a drawing, painting, etc., or in a story","examples":["The central figure in the painting is the artist's daughter."],"opposite":"","synonyms":""},{"def":"a statue of a person or an animal","examples":["a bronze figure of a horse"],"opposite":"","synonyms":""},{"def":"a picture, diagram, etc. in a book, that is referred to by a number or letter","examples":["The results are illustrated in figure 3 opposite.","See Figure 8.","Figure 4 represents the process of soil erosion."],"opposite":"","synonyms":""},{"def":"a particular shape formed by lines or surfaces","examples":["a five-sided figure","a solid figure"],"opposite":"","synonyms":""},{"def":"a pattern or series of movements performed on ice","examples":["The skater executed a perfect set of figures."],"opposite":"","synonyms":""},{"def":"to be/become somebody that other people laugh at","examples":[],"opposite":"","synonyms":""},{"def":"to have a particular appearance","examples":["He cut a striking figure in his white dinner jacket.","He cut a dashing figure in his uniform."],"opposite":"","synonyms":""},{"def":"accurate and detailed information","examples":["I've asked to see all the facts and figures before I make a decision."],"opposite":"","synonyms":""},{"def":"to say the exact price or number of something","examples":["It’s impossible to put a figure on the number of homeless people in London.","You can't put a dollar figure on the lives ruined by the hurricane."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be/become a figure of fun","def":"to be/become somebody that other people laugh at","examples":[]},{"idiom":"cut a… figure","def":"to have a particular appearance","examples":["He cut a striking figure in his white dinner jacket.","He cut a dashing figure in his uniform."]},{"idiom":"facts and figures","def":"accurate and detailed information","examples":["I've asked to see all the facts and figures before I make a decision."]},{"idiom":"put a figure on something","def":"to say the exact price or number of something","examples":["It’s impossible to put a figure on the number of homeless people in London.","You can't put a dollar figure on the lives ruined by the hurricane."]}],"phrasal":[],"related":["figure on","figure out","six-figure","action figure","double-figure","father figure","mother figure","stick figure","figure-hugging","figure skating","matchstick figure","figure of eight","figure of speech","figure on doing","significant figure","Staffordshire figure","figure eight"]},{"pos":"verb","level":"B2","meanings":[{"def":"to be part of a process, situation, etc. especially an important part","examples":["My feelings about the matter didn't seem to figure at all.","figure in something The question of the peace settlement is likely to figure prominently in the talks.","Do I still figure in your plans?","figure on something It did not figure high on her list of priorities.","figure among somebody/something This man did not figure among the suspects.","The issue figured prominently in our discussion.","Vegetables hardly figure at all in their diet."],"opposite":"","synonyms":""},{"def":"to think or decide that something will happen or is true","examples":["figure (that)… I figured (that) if I took the night train, I could be in Scotland by morning.","We figured the sensible thing to do was to wait.","figure something That's what I figured.","figure why, whether, etc… He tried to figure why she had come.","figure somebody/something for something Gary had figured Pete for a carpenter or some other construction worker.","If we can figure roughly how much it will cost, we can decide what to do.","She tried to figure who might have made the call.","That's exactly what I figured.","There was only one thing to do, he figured.","I figured him to be well over 40."],"opposite":"","synonyms":""},{"def":"to calculate an amount or the cost of something","examples":["We figured the attendance at 150 000.","The cost of manufacture is figured at $15 000."],"opposite":"","synonyms":""},{"def":"to represent somebody/something in a particular way in art or literature","examples":["Tom Eakins was figured as a regular guy, an ordinary Joe.","Rushdie figures death as regenerative as well as destructive."],"opposite":"","synonyms":""},{"def":"used to say that you do not understand the reason for something, or that you do not want to give an explanation for something because you think it is obvious","examples":["In Cambridge, ‘May Balls’ are always held in June. Go figure."],"opposite":"","synonyms":""},{"def":"used to say that something was expected or seems logical","examples":["‘John called in sick.’ ‘That figures, he wasn't feeling well yesterday.’","(disapproving) ‘She was late again.’ ‘Yes, that figures.’"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"go figure","def":"used to say that you do not understand the reason for something, or that you do not want to give an explanation for something because you think it is obvious","examples":["In Cambridge, ‘May Balls’ are always held in June. Go figure."]},{"idiom":"it/that figures","def":"used to say that something was expected or seems logical","examples":["‘John called in sick.’ ‘That figures, he wasn't feeling well yesterday.’","(disapproving) ‘She was late again.’ ‘Yes, that figures.’"]}],"phrasal":["figure on","figure on doing","figure out"],"related":[]}]