[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fil/fill_/fill__us_1.mp3","phonsUS":"/fɪl/","level":"A1","meanings":[{"def":"to make something full of something; to become full of something","examples":["fill something Please fill this glass for me.","to fill a space/vacuum/void","Smoke filled the room.","Her image filled the screen.","The wind filled the sails.","A Disney film can always fill cinemas (= attract a lot of people to see it).","The school is filled to capacity.","fill something with something She filled the page with writing.","bags filled with household waste","Carl took a mug and filled it to the brim with hot coffee.","fill something + adj. Fill a pan half full of water.","You've filled it too full.","The room was filling quickly.","fill with something Her eyes suddenly filled with tears.","The room filled with smoke.","The sails filled with wind.","Mourners filled the streets.","Fireworks filled the sky.","Crowds filled the stadium.","I started to write and quickly filled two pages.","Air rushes in to fill the vacuum.","A sculpture may fill a void at the end of a hallway.","They have to fill containers with water from the river.","Fill the device with purified water.","I filled a box with books.","She filled her pockets with sweets.","She had filled the room with flowers.","He seemed to fill the room with his presence.","The sky was filled with stars.","The drawers were all filled to the brim.","Don't fill the cups completely full so we can add milk.","Fill a bag full of small presents.","She filled the kettle from the tap.","The room soon filled with people.","The river rose and the cellar filled with water.","The sails began to fill.","The school is filled to capacity—we simply can't take any more students."],"opposite":"","synonyms":""},{"def":"to block a hole with a substance","examples":["fill something They used putty to fill the holes.","fill something with something The crack in the wall had been filled with plaster.","They stuffed cloths in the window frames to fill the cracks.","Fill all the nail holes before you paint the wall."],"opposite":"","synonyms":""},{"def":"a put a filling (= a small amount of special material) in a hole in a tooth","examples":["I need to have two teeth filled."],"opposite":"","synonyms":""},{"def":"to make somebody have a strong feeling; to become full of a strong feeling","examples":["fill somebody A deep joy filled me.","fill somebody with something We were all filled with admiration for his achievements.","fill with something His heart filled with pride.","Hearing this news, he was filled with joy.","Filled with delight to see her, they hugged her.","I was filled with despair.","I felt myself fill with loathing.","Horror and disgust filled my heart.","My heart filled with sorrow.","She was filled with love and gratitude.","I was filled with so much emotion I didn't know what to do.","This news has filled us with new hope.","His experiences have filled his heart with rage.","You have filled your mind with hatred."],"opposite":"","synonyms":""},{"def":"if a smell, sound or light fills a place, it is very strong, loud or bright and easy to notice","examples":["fill something The sound of bells ringing filled the air.","fill something with something Large windows fill the room with light.","The streets were filled with the smell of food cooking.","The smell of paint filled the air.","A strong smell of burning filled the room.","Sunlight fills the house.","He walks in, and tension fills the air.","The air is filled with birds singing.","When she comes home, she fills the house with laughter.","Her parents' house was always filled with music.","a garden filled with the scent of flowers"],"opposite":"","synonyms":""},{"def":"full of the thing mentioned","examples":["a smoke-filled room","a fun-filled day"],"opposite":"","synonyms":""},{"def":"to supply something that is missing","examples":["More nurseries will be built to fill the need for high-quality childcare.","Choose the best word to fill the gap in each sentence.","The product has filled a gap in the market.","She left a space in his life that nothing could fill.","More reading will fill the gaps in your knowledge.","I needed extra coaching to fill the gaps in my grasp of the subject.","These kids use drugs to fill a hole in their lives.","We believe we are filling a void in the educational system."],"opposite":"","synonyms":""},{"def":"to do a job, have a role or position, etc.","examples":["The team needs someone to fill the role of manager.","to fill a post/position","He fills the post satisfactorily (= performs his duties well)."],"opposite":"","synonyms":""},{"def":"to choose somebody for a job","examples":["The vacancy has already been filled."],"opposite":"","synonyms":""},{"def":"to use up a particular period of time doing something","examples":["fill something How do you fill your day now that you've retired?","Work expands to fill the time available.","fill something up I have plenty to fill up my leisure hours.","fill something in She went for a walk to fill in the time before her next appointment."],"opposite":"","synonyms":""},{"def":"to make somebody/yourself feel unable to eat any more","examples":["The kids filled themselves with snacks."],"opposite":"","synonyms":""},{"def":"if somebody fills an order or a prescription, they give the customer what they have asked for","examples":["We need to reduce the time taken to fill orders."],"opposite":"","synonyms":""},{"def":"to be what is needed in a particular situation or for a particular purpose","examples":["On paper, several of the applicants fit the bill."],"opposite":"","synonyms":""},{"def":"used to invite somebody to take as much as they like of something such as food, drink, etc; help yourself","examples":[],"opposite":"","synonyms":""},{"def":"to do somebody’s job in an acceptable way when they are not there","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"fill/fit the bill","def":"to be what is needed in a particular situation or for a particular purpose","examples":["On paper, several of the applicants fit the bill."]},{"idiom":"fill your boots","def":"used to invite somebody to take as much as they like of something such as food, drink, etc; help yourself","examples":[]},{"idiom":"fill somebody’s shoes/boots","def":"to do somebody’s job in an acceptable way when they are not there","examples":[]}],"phrasal":["fill in","fill out","fill up","fill up on"],"related":["fill in","fill out","fill up","fill-up","fill light","fill up on","fill-ups","fill lights","fill in/out","fill something out","fill something in","fill something","fill in (for somebody)","fill up on something","fill somebody in (on something)"]},{"pos":"noun","level":"","meanings":[{"def":"as much of something/somebody as you are willing to accept","examples":["I've had my fill of entertaining for one week."],"opposite":"","synonyms":""},{"def":"as much as you can eat/drink","examples":["All we had was what was left after the guests had eaten their fill.","The pigs had had their fill of the leftovers."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]