[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fil/film_/film__us_1.mp3","phonsUS":"/fɪlm/","level":"A1","meanings":[{"def":"a series of moving pictures recorded with sound that tells a story, watched at a cinema or on a television or other device","examples":["Let's stay in and watch a film.","We're going out to see a film.","There's a good film on tonight (= showing at the cinema or on TV).","a horror/documentary/feature film","an action/animated film","a silent film (= one recorded without sound)","a film about something As a student he made a short film about his home town.","to shoot/direct/produce a film","The film was shot on location in France.","The film has been downloaded some 21 million times since its release.","a film crew/critic/director/producer","an international film festival","a film version/adaptation of a novel by Henry James","His film credits (= the films he has made) as director include ‘Mood Music’ and ‘Lies’.","He's a great composer of film music.","She makes children's films.","He was an ad director before starting to make feature films.","Your typical Hollywood film has a happy ending.","Her dream was to star in a Hollywood film.","What's your favourite film?","Do you like James Bond films?","The latest film by Kathryn Bigelow is out soon.","The film came out last week.","Now you can stream films on your mobile device.","It's an independent cinema screening mainly art films.","Her music is used throughout the film.","She thought the film far too violent to show to children.","The film contains explicit scenes of violence.","The film depicts immense courage amid the horrors of war.","The film manages to capture the mood of the times.","The film opens with a bird's-eye shot of London.","The film stars Nicole Kidman as a nightclub singer.","The film was finally released after weeks of protest by religious groups.","The film was heavily edited for screening on television.","There is a great car chase in the film.","There's an interesting film on at the local cinema.","There's a season of classic films on TV.","one of the earliest colour films","They've just started shooting a film of the novel.","a film adaptation of a well-known fairy tale","a film version of Jane Austen's famous novel","This film tells the remarkable story of a disabled actor.","We went to an awful film last night.","a film about Nelson Mandela","a film based on the novel by Charles Potter","a film dealing with old age","a film entitled ‘Bitter Moon’","a film from Spanish director Luis Eduardo Aute","a film recording the first powered flight","a film with an all-star cast","He was killed when a film stunt went wrong.","We stayed for the film credits to see who the music was by.","The scramble for the film rights to her next novel has already begun.","They built a massive film set of an airport.","the ‘Star Wars’ film series","the film classic ‘Fantasia’"],"opposite":"","synonyms":""},{"def":"the art or business of making films","examples":["jobs in film and television","She'd like to write for theatre and film.","the film industry","a film buff (= somebody who is very interested in and knows a lot about film)","You can study theatre, film and dance as well as painting at the school.","Many of them work in film or photography.","She knows everything there is to know about film.","He wrote several books about film in the 1970s.","the history of film","one of the greatest talents working in Indian film","He worked for a major film studio.","Tyrannical Hollywood film moguls ruled their stars' lives.","The star has plenty of what film people call ‘bankability’.","Working Title is a British film production company.","We're a small film company."],"opposite":"","synonyms":""},{"def":"moving pictures of real events, shown for example on television","examples":["television news film of the riots","on film The accident was caught on film.","It was amazing to be able to capture those moments on film.","They showed a film clip of the interview.","film taken by security cameras","When I watched the film back, I noticed someone in the background.","They study film of their opponents before the game.","CCTV film captured the assault.","Police examined video film from a security camera on the bus.","He hoped the existence of the security film would lead to a successful prosecution.","You can download film clips from the news archive.","There is some old film footage of the meeting.","Music plays over the film footage.","The news always contains several film reports.","They captured the incident on film.","It's one of the most dramatic moments I've ever seen on film.","Their encounter has been preserved on film."],"opposite":"","synonyms":""},{"def":"thin plastic that is sensitive to light, used especially in the past for taking photographs and making films; a roll of this plastic, used in cameras","examples":["a roll of film","a 35mm film","There was no film in the camera.","Fast film is best for action shots.","He spliced the two lengths of film together.","In the darkroom they found that only half the film had been exposed.","I used to get my films developed at a local shop.","a roll of 35 millimetre film","She put a new film in her camera.","Do you use a film camera or a digital camera?","He returned with several rolls of colour and black-and-white film.","He used 16mm colour film.","The film got accidentally exposed and ruined."],"opposite":"","synonyms":""},{"def":"a thin layer of something, usually on the surface of something else","examples":["Grease coated everything in a thin film.","film of something Everything was covered in a film of dust.","There was a film of soot everywhere.","The leaves were still covered with a film of dew.","The film of water left by the tide shimmered in the sun.","There was a fine film of sweat on her forehead.","The books were covered in a thin film of dust."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["film noir","film star","action film","cling film","film-maker","film-making","feature film","Carry On film","film certificate","UK Film Council","British Film Institute","London Film Festival","National Film Theatre","Royal Film Performance","Sundance Film Festival","Portobello Film Festival","British Board of Film Classification","National Museum of Photography, Film and Television","film-goer"]},{"pos":"verb","level":"A2","meanings":[{"def":"to make a film of a story or a real event; to record somebody/something on film","examples":["They are filming in Moscow right now.","film something/somebody The show was filmed on location in New York.","It took them six weeks to film the documentary.","That day, we filmed the scene in the church.","film somebody/something doing something A young boy was filmed by the security camera stealing a pair of jeans.","The controversial experiment involved secretly filming a group of children.","The serial was filmed on location in Italy.","fast-paced, well acted and beautifully filmed in the Blue Ridge Mountains"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]