[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fil/filte/filter__us_1.mp3","phonsUS":"/ˈfɪltər/","level":"C1","meanings":[{"def":"a device containing paper, sand, chemicals, etc. that a liquid or gas is passed through in order to remove any materials that are not wanted","examples":["an air/oil filter","a coffee/water filter","filter paper for the coffee machine","He smokes cigarettes without filters."],"opposite":"","synonyms":""},{"def":"a device that allows only particular types of light or sound to pass through it","examples":["The camera has an anti-glare filter."],"opposite":"","synonyms":""},{"def":"a program that processes information to leave out the types that are not wanted, or that stops particular types of electronic information, email, etc. from being sent to a computer","examples":["Spam filters block out almost all threats."],"opposite":"","synonyms":""},{"def":"a light on a set of traffic lights showing that traffic can turn left (or right) while traffic that wants to go straight ahead or turn right (or left) must wait","examples":["a filter lane"],"opposite":"","synonyms":""},{"def":"a tool on digital cameras, photo apps, etc. that allows you to change the appearance of an image","examples":["The software allows you to apply filters, remove blemishes and add doodles or text to your images."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["filter out","filter tip","filter tips","filter something"]},{"pos":"verb","level":"C1","meanings":[{"def":"to pass liquid, light, etc. through a special device, especially to remove something that is not wanted","examples":["All drinking water must be filtered.","Use a sun block that filters UVA effectively.","(figurative) My secretary is very good at filtering my calls (= making sure that calls that I do not want do not get through)."],"opposite":"","synonyms":""},{"def":"to use a special program to check the content of emails or websites before they are sent to your computer","examples":[],"opposite":"","synonyms":""},{"def":"to move slowly in a particular direction","examples":["The doors opened and people started filtering through."],"opposite":"","synonyms":""},{"def":"to slowly become known","examples":["More details about the crash are filtering through."],"opposite":"","synonyms":""},{"def":"to come into a place slowly or in small amounts","examples":["Sunlight filtered in through the curtains."],"opposite":"","synonyms":""},{"def":"to turn left (or right) at traffic lights while other vehicles wanting to go straight ahead or turn right (or left) must wait","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["filter out"],"related":[]}]