[{"pos":"adverb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fin/final/finally__us_2.mp3","phonsUS":"/ˈfaɪnəli/","level":"A2","meanings":[{"def":"after a long time, especially when there has been some difficulty or delay","examples":["The performance finally started half an hour late.","The law was finally passed in May 2019.","I finally managed to get her attention.","Are you finally going to tell me why I’m here?","When they finally arrived it was well past midnight.","Two years of hard work and waiting were finally over.","Here, finally, we come to the heart of the problem.","Finally ready, they all set off."],"opposite":"","synonyms":""},{"def":"used to introduce the last in a list of things","examples":["And finally, I would like to thank you all for coming here today.","Finally, stir in the fruit and walnuts.","This study has the following aims: first, to investigate how international students in the UK use humour; second, to examine how jokes can help to establish social relationships; and third, to explore the role that humour plays in helping overseas students adjust to life in the UK.","Let us begin by identifying some of the popular joke genres in the UK.","Next, let us turn to/Next, let us consider the question of gender differences in the use of humour.","Finally/Lastly, let us briefly examine the role of humour in defining a nation’s culture.","This diagram illustrates the process of paper-making./This diagram shows how paper is made.","First/First of all, logs are delivered to a paper mill, where the bark is removed and the wood is cut into small chips.","Next/Second, the wood chips are pulped, either using chemicals or in a pulping machine.","Pulping breaks down the internal structure of the wood and enables/allows the natural oils to be removed.","Once/After the wood has been pulped, the pulp is bleached in order to remove impurities. /…is bleached so that impurities can be removed.","The next stage is to feed the pulp into the paper machine, where it is mixed with water and then poured onto a wire conveyor belt.","As the pulp travels along the conveyor belt, the water drains away. This causes the solid material to sink to the bottom, forming a layer of paper.","At this point the new paper is still wet, so it is passed between large heated rollers, which press out the remaining water and simultaneously dry the paper/…dry the paper at the same time.","The final stage is to wind the paper onto large rolls./Finally, the paper is wound onto large rolls."],"opposite":"","synonyms":""},{"def":"in a way that ends all discussion about something","examples":["The matter was not finally settled until later.","A Home Office spokesman said nothing had been finally decided upon."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]