[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fin/finan/finance__us_1_rr.mp3","phonsUS":"/ˈfaɪnæns/","level":"B2","meanings":[{"def":"money used to run a business, an activity or a project","examples":["The project will only go ahead if they can raise the necessary finance.","to arrange/secure finance","finance for something Finance for education comes from taxpayers.","Several banks are providing finance for the housing programme.","She struggled to get the necessary finance for her training.","You may require bridging finance until the sale of your own property is completed.","the availability of bank finance for small businesses","the finance available to local government","the need to obtain additional finance"],"opposite":"","synonyms":""},{"def":"the activity of managing money, especially by a government or commercial organization","examples":["the Minister of Finance","the finance director/department/committee","She's got a diploma in banking and finance.","the world of high finance (= finance involving large companies or countries)","an expert in public/personal/corporate finance","a finance company","Local government finance officers found the tax very difficult to administer.","The banking and finance sector was booming.","the world of high finance","Please send all invoices to the finance department.","that most emotive of personal finance issues—taxation","The bank offers advice and guidance on personal finance."],"opposite":"","synonyms":""},{"def":"the money available to a person, an organization or a country; the way this money is managed","examples":["government/public/personal finances","They were unable to manage their finances.","It's about time you sorted out your finances.","Moving house put a severe strain on our finances.","The firm’s finances are basically sound.","Our family finances are not very healthy at the moment.","The company was under pressure to get its finances in order.","The company's finances are looking a bit shaky.","Their finances are in a mess.","They are not sure how they will raise the finances to go on the trip.","We don't have the finances to go on holiday this year.","We don't have the finances to throw a big party.","how to plan your finances for a comfortable retirement"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["finance company","UK Export Finance","finance house","finance companies"]},{"pos":"verb","level":"B2","meanings":[{"def":"to provide money for a project","examples":["finance something He took a job to finance his stay in Germany.","The building project will be financed by the government.","be financed through something The research is financed through government grants.","be financed with something Today just 10% of car purchases are financed with loans.","The new roads will be financed privately.","The project was financed jointly by the British and French governments.","the £37 million needed to finance the redevelopment","the introduction of a properly financed dog warden scheme","Apparently he committed the offences to finance his drug addiction.","The money was used to finance the takeover of three rival companies."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]