[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fin/final/final__us_2.mp3","phonsUS":"/ˈfaɪnl/","level":"A1","meanings":[{"def":"being or happening at the end of a series of events, actions, statements, etc.","examples":["his final act as party leader","Jamie is in his final year at Stirling University.","the final week/day/minutes of something","The referee blew the final whistle.","The project is in its final stages.","The final round of voting takes place on Sunday.","They find each other in the final chapter of the book.","I'd like to return to the final point you made.","This diagram illustrates the process of paper-making./This diagram shows how paper is made.","First/First of all, logs are delivered to a paper mill, where the bark is removed and the wood is cut into small chips.","Next/Second, the wood chips are pulped, either using chemicals or in a pulping machine.","Pulping breaks down the internal structure of the wood and enables/allows the natural oils to be removed.","Once/After the wood has been pulped, the pulp is bleached in order to remove impurities. /…is bleached so that impurities can be removed.","The next stage is to feed the pulp into the paper machine, where it is mixed with water and then poured onto a wire conveyor belt.","As the pulp travels along the conveyor belt, the water drains away. This causes the solid material to sink to the bottom, forming a layer of paper.","At this point the new paper is still wet, so it is passed between large heated rollers, which press out the remaining water and simultaneously dry the paper/…dry the paper at the same time.","The final stage is to wind the paper onto large rolls./Finally, the paper is wound onto large rolls.","His final act as president was to pardon his predecessor.","Space is the final frontier for us to explore.","The factory deals with final assembly and testing.","The orchestra performs its final concert of the season tomorrow.","The plane was making its final descent so we had to fasten our seat belts.","The referee gave him a final warning.","The scene was set for the final showdown."],"opposite":"","synonyms":""},{"def":"being the result of a particular process","examples":["I think you will be satisfied with the final product.","The final election results have not been announced.","No one could have predicted the final outcome.","The panel will complete its work with a final report."],"opposite":"","synonyms":""},{"def":"that cannot be argued with or changed","examples":["The judge's decision is final.","Who has the final say around here?","I'll give you $500 for it, and that's my final offer!","I'm not coming, and that's final! (= I will not change my mind)"],"opposite":"","synonyms":""},{"def":"used to say what is most important after everything has been discussed, or considered","examples":["In the final analysis, it's a matter of personal choice."],"opposite":"","synonyms":""},{"def":"the last in a series of bad events, etc. that makes it impossible for you to accept a situation any longer","examples":[],"opposite":"","synonyms":""},{"def":"the last comment or decision about something","examples":["He always has to have the last word in any argument.","I’m willing to wait one more week, and that’s my final word on the subject.","The Chairman always has the last word on financial decisions."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in the final/last analysis","def":"used to say what is most important after everything has been discussed, or considered","examples":["In the final analysis, it's a matter of personal choice."]},{"idiom":"the last/final straw | the straw that breaks the camel’s back","def":"the last in a series of bad events, etc. that makes it impossible for you to accept a situation any longer","examples":[]},{"idiom":"the last/final word (on something)","def":"the last comment or decision about something","examples":["He always has to have the last word in any argument.","I’m willing to wait one more week, and that’s my final word on the subject.","The Chairman always has the last word on financial decisions."]}],"phrasal":[],"related":["cup final","Final Four","semi-final","final clause","quarter-final","Cup Final","final clauses","the last/final straw","in the final/last analysis","down to the last, smallest, final, etc. something"]},{"pos":"noun","level":"A2","meanings":[{"def":"the last of a series of games or competitions, in which the winner is decided","examples":["She reached the final of the 100m hurdles.","The players met in last year's final.","The winner of each contest goes through to the grand final.","The victory secured them a place in the final.","final against somebody a nail-biting final against last year's victor","He got through to the grand final of the competition.","They will now go through to the final.","If we play well, we hope to make it to the final.","Scotland met Wales in the final at Twickenham.","Who is in the men's final?","She will go through to the final with Robbins.","The winners will go on to the regional final on August 5."],"opposite":"","synonyms":""},{"def":"a series of games or performances that make up the last stage of a competition","examples":["the 2022 World Cup Finals","the regional/national finals","She has qualified for the Olympic finals.","They got into the finals of a singing competition.","It has the first time that two countries had hosted the finals between them.","The country will stage next year's World Cup Finals."],"opposite":"","synonyms":""},{"def":"the last exams taken by university students at the end of their final year","examples":["to sit/take your finals"],"opposite":"","synonyms":""},{"def":"an exam taken by school, university or college students at the end of a semester or quarter, usually in a topic that they will not study again","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]