[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fin/find_/find__us_1.mp3","phonsUS":"/faɪnd/","level":"A1","meanings":[{"def":"to discover somebody/something unexpectedly or by chance","examples":["find somebody/something Look what I've found!","We've found a great new restaurant near the office.","A man out walking his dog found the body in a ditch.","find somebody/something + adj. A whale was found washed up on the shore.","They found a car abandoned on top of the cliff.","I've found a really good healthy eating blog.","She found a beautiful shell on the beach.","If you found £20 in the street, would you hand it in?","I think I've found a friend.","It's so good when you find someone you can talk to.","We went out hoping to find something to eat.","Police found weapons in the house.","Coins found at the site are thought to be from Anglo-Saxon times.","Letters found among his belongings may hold a clue.","She made the sculpture with materials found near her home.","He seemed to have a knack of finding women to look after him.","I never expected to find love at this point in my life.","I didn't expect to come home and find him gone."],"opposite":"","synonyms":""},{"def":"to get back something/somebody that was lost after searching for it/them","examples":["find somebody/something I can't find my keys.","I thought I'd lost my wallet but I found it under my desk.","I wanted to talk to him but he was nowhere to be found.","find something for somebody Can you find my bag for me?","find somebody something Can you find me my bag?","find somebody/something + adj. The child was eventually found safe and well.","I'm trying to find my glasses.","I eventually found them under the bed.","She found the remote control down the back of the sofa.","Found it! I've been looking for this for weeks!","Can you help me find my dog?","A reward is offered for whoever finds him.","Josh found my earring for me.","I'll find you your coat.","The search party found no trace of the missing climbers.","He went through the drawers but found nothing.","He was found by police the following morning.","His body was found after three days of searching.","They don't expect to find him alive."],"opposite":"","synonyms":""},{"def":"to discover something/somebody by searching, studying or thinking carefully","examples":["find something/somebody They found no evidence to support this claim.","We found a way out.","I managed to find a solution to the problem.","Our website is the place to find answers to all your questions.","He's struggling to find work.","Scientists are still trying to find a cure for cancer.","I'm having trouble finding anything new to say on this subject.","Have they found anyone to replace her yet?","It's hard to find a babysitter.","find something for somebody I'll find that information for you.","find somebody something I'll find you that information.","His father found him a job.","They're trying to find a place to stay.","Can you find a hotel for me?","Can you find me a hotel?","We found some evidence of harmful effects.","Scientists have found fresh evidence to suggest that a huge explosion led to the death of the dinosaurs.","No links were found between the two cases.","Students are given ten questions and have one minute to find the answers.","The beetles have found a warm place to live.","At last we've found a home.","He needs to find a doctor willing to treat him.","Her friends wanted to find her a husband.","She had to find a valid excuse for leaving the room.","We need to find a useful role for the volunteers in the campaign.","We'll have to find an alternative.","Police are confident of finding the killers.","A window was broken and we think we've found the culprit.","The doctor couldn't find anything wrong with him.","Considerable variation was found in the terms offered by different banks.","Can you find a use for this old table?","He sometimes struggles to find the right words.","I can't find anything good to say about it."],"opposite":"","synonyms":""},{"def":"to discover that something is true after you have tried it, tested it or experienced it","examples":["find (that)… I find (that) it pays to be honest.","A study found that green tea could be beneficial.","You'll find your opinions change as you get older.","find somebody/something + adj. We found the beds very comfortable.","find somebody/something + noun They found him a plausible witness.","find somebody/something to be/do something They found him to be charming.","Researchers found this to be the most effective method.","Her blood was found to contain poison.","If you are found to have lied, you can be charged.","it is found that… It was found that her blood contained poison.","The report found that 30% of the firms studied had failed within a year.","The survey found over 80% of women had dieted in the past year.","People usually find their symptoms go away after a few days.","Readers will find the maps in the appendix very useful.","Here are some tips which I hope you'll find helpful.","Hopefully we'll find the ground a bit firmer today.","I found some parts of his argument hard to understand.","We found the whole thing a farce.","A poll six months ago found the opposite to be true.","The sample was found to contain asbestos.","The results were found to vary.","It was found that older people were more likely to agree.","If it is found that he's been lying, then of course that will change everything.","If he is found to have been lying, then of course that will change everything."],"opposite":"","synonyms":""},{"def":"to have a particular feeling or opinion about something","examples":["find something + adj. You may find it hard to accept your illness.","You may find your illness hard to accept.","Do women find it more difficult to ask for a rise?","I found the book very interesting.","find something + noun She finds it a strain to meet new people.","She finds meeting new people a strain.","I find it interesting that they don't get on.","You're lucky if you do a job you find interesting.","Do women find asking for a rise more difficult?","I find it amazing that they're still together.","He knows that women find him attractive.","Some people find tall buildings beautiful; others hate them.","I find the whole subject fascinating.","We apologise if you found any of these comments offensive.","The news report contains images that some viewers may find disturbing.","She didn't find the joke very funny.","The company found it necessary to hire more people.","Do you find it acceptable that these children were left on their own?","Don't you find it odd that she didn't say anything?","I found it a nuisance to have to change my plans at the last minute.","I don't find anything wrong in him employing his relatives."],"opposite":"","synonyms":"regard"},{"def":"used to say that something exists, grows, etc. somewhere","examples":["be found + adv./prep. These flowers are found only in Africa.","Further details can be found on our website.","find something/somebody + adv./prep. You'll find this style of architecture all over the town.","Find us at www.oup.com.","These pests can be found in almost every garden.","Folacin is a B vitamin found in many vegetables.","The college offers cultural events not normally found in such a rural area.","This is over 100 times the amount of chlorine found in drinking water.","Marbling is the small flecks of fat found within meat.","You will find all this information on our website.","Early in the season you will find aphids on the upper leaves.","The white clay found at Meissen was used to make fine china.","The condition is most typically found among women over 50.","At this time of year you will generally find her in the garden.","At this time of year she is generally to be found in the garden.","It is rare that you find a cable snapping for no reason.","You don't tend to find many fresh food markets here."],"opposite":"","synonyms":""},{"def":"to discover somebody/something/yourself doing something or in a particular situation, especially when this is unexpected","examples":["find somebody/something/yourself + adv./prep. She woke up and found herself in a hospital bed.","I found the house in a mess.","find somebody/something/yourself + adj. We came home and found him asleep on the sofa.","I found myself forced to act.","find somebody/something/yourself doing something He looked up to find her watching him.","I suddenly found myself running down the street.","find (that)… She was surprised to find that everyone had left.","I found myself in a dilemma.","The institutions in which these people often found themselves were very harsh.","We arrived to find the room full of people.","They found the building completely deserted.","We find ourselves unable to reach a decision.","She was found dead in her bed.","I found everyone else already waiting.","They were surprised to find birds nesting in the roof.","I found him in the kitchen chopping vegetables.","I found him going through my stuff.","I found myself wondering why.","She found herself feeling slightly annoyed.","I was disappointed to find that they had left already."],"opposite":"","synonyms":""},{"def":"to have something available so that you can use it","examples":["I keep meaning to write, but never seem to find (the) time.","How are we going to find £10  000 for a car?"],"opposite":"","synonyms":""},{"def":"to show a quality in yourself, usually with an effort","examples":["I found the courage to speak."],"opposite":"","synonyms":""},{"def":"to arrive at something naturally; to reach something/somebody","examples":["Water will always find its own level.","Most of the money finds its way to the people who need it.","The criticism found its mark (= had the effect intended).","I hope this letter finds you in good health."],"opposite":"","synonyms":""},{"def":"to make a particular decision in a court case","examples":["find somebody + adj. The jury found him guilty.","How do you find the accused?","find in somebody’s favour The court found in her favour."],"opposite":"","synonyms":""},{"def":"with free food and accommodation in addition to your wages","examples":[],"opposite":"","synonyms":""},{"def":"to look for and discover mistakes in somebody/something; to complain about somebody/something","examples":["My mother did nothing but find fault with my manners.","She was always finding fault with his manners."],"opposite":"","synonyms":""},{"def":"to become able to act independently and with confidence","examples":["I only recently joined the firm so I'm still finding my feet."],"opposite":"","synonyms":""},{"def":"to be able or willing to do something","examples":["Can you find it in your heart to forgive her?","He couldn't find it in himself to trust anyone again."],"opposite":"","synonyms":""},{"def":"to meet somebody who is equal to or even better than you in strength, skill or intelligence","examples":["He thought he could beat anyone at chess but he’s met his match in Peter.","I think he's finally met his match in Lisa.","She knew she had met her match and tried to retreat."],"opposite":"","synonyms":""},{"def":"to be able to speak or express your opinion","examples":[],"opposite":"","synonyms":""},{"def":"to discover the right route (to a place)","examples":["I hope you can find your way home."],"opposite":"","synonyms":""},{"def":"to come to a place or a situation by chance or without intending to","examples":["He eventually found his way into acting."],"opposite":"","synonyms":""},{"def":"impossible for anyone to find or see","examples":["I wanted to talk to him but he was nowhere to be found.","The children were nowhere to be seen.","A peace settlement is nowhere in sight (= is not likely in the near future)."],"opposite":"","synonyms":""},{"def":"to accept somebody as they are without expecting them to behave in a special way or have special qualities","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"all found","def":"with free food and accommodation in addition to your wages","examples":[]},{"idiom":"find fault (with somebody/something)","def":"to look for and discover mistakes in somebody/something; to complain about somebody/something","examples":["My mother did nothing but find fault with my manners.","She was always finding fault with his manners."]},{"idiom":"find your feet","def":"to become able to act independently and with confidence","examples":["I only recently joined the firm so I'm still finding my feet."]},{"idiom":"find it in your heart/yourself to do something","def":"to be able or willing to do something","examples":["Can you find it in your heart to forgive her?","He couldn't find it in himself to trust anyone again."]},{"idiom":"find/meet your match (in somebody)","def":"to meet somebody who is equal to or even better than you in strength, skill or intelligence","examples":["He thought he could beat anyone at chess but he’s met his match in Peter.","I think he's finally met his match in Lisa.","She knew she had met her match and tried to retreat."]},{"idiom":"find your voice/tongue","def":"to be able to speak or express your opinion","examples":[]},{"idiom":"find your way (to…)","def":"to discover the right route (to a place)","examples":["I hope you can find your way home."]},{"idiom":"find your/its way (to/into…)","def":"to come to a place or a situation by chance or without intending to","examples":["He eventually found his way into acting."]},{"idiom":"nowhere to be found/seen | nowhere in sight","def":"impossible for anyone to find or see","examples":["I wanted to talk to him but he was nowhere to be found.","The children were nowhere to be seen.","A peace settlement is nowhere in sight (= is not likely in the near future)."]},{"idiom":"take somebody as you find them","def":"to accept somebody as they are without expecting them to behave in a special way or have special qualities","examples":[]}],"phrasal":["find against","find for","find out"],"related":["find for","find out","find against","find for somebody","find somebody out","find against somebody","find out (about something/somebody) | find out something (about something/somebody)","(find, etc.) a/the middle way","find fault (with somebody/something)","know/learn/find something to your cost"]},{"pos":"noun","level":"","meanings":[{"def":"a thing or person that has been found, especially one that is interesting, valuable or useful; the act of finding a thing or person like this","examples":["This is an important archaeological find.","Our new babysitter is a real find.","He made his most spectacular finds in the Valley of the Kings.","A lucky find is telling us a lot about life 10 000 years ago.","I reported my find to the landowner.","Stray finds are more commonly discovered than whole new sites.","The letters were a real find and James went on to publish two volumes of them.","To date the site has yielded many interesting finds.","prehistoric finds made in an unexplored cave"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]