[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fin/finis/finish__us_1.mp3","phonsUS":"/ˈfɪnɪʃ/","level":"A1","meanings":[{"def":"to stop doing something or making something because it is complete","examples":["finish (something) Haven't you finished your homework yet?","She finished law school last year.","You only get points if you finish the race.","I thought you'd never finish!","We've just finished the project.","finish what… Let me just finish what I'm doing.","finish doing something Be quiet! He hasn't finished speaking.","finish by doing something He finished by telling us about his trip to Spain.","+ speech ‘And that was all,’ she finished.","‘I had no idea…’ I finished lamely.","She had just finished dressing when the telephone rang.","Peter finished Jane's sentence for her.","I’ll just finish the chapter then I’ll come."],"opposite":"","synonyms":""},{"def":"to come to an end; to bring something to an end","examples":["The play finished at 10.30.","finish with something The symphony finishes with a flourish.","The evening finished with a few songs.","finish something A cup of coffee finished the meal perfectly.","I’m afraid time is running out/​we’re running out of time, so we'll have to make this the final question.","We've only got a couple of minutes left, so can we summarize what we've agreed?","I'd like to close the session with a few final remarks…","We'll have to leave it there, but thank you all very much for your input.","Well, that's all we have time for today, but we'll meet again on Tuesday.","I'd like to thank you all for coming and for a very productive meeting."],"opposite":"","synonyms":""},{"def":"to eat, drink or use what remains of something","examples":["finish something I quickly finished my tea.","finish something off He finished off his drink with one large gulp.","finish something up We might as well finish up the cake.","We might as well finish up the cake—there isn't much left.","We'll go out after you've finished your dinner."],"opposite":"","synonyms":""},{"def":"to be in a particular state or position at the end of a race or a competition","examples":["+ adj. She was delighted to finish second.","+ adv./prep. He finished 12 seconds outside the world record.","finish something + adv./prep. The team finished the season in ninth position.","finish something + adj. The dollar finished the day slightly down."],"opposite":"","synonyms":""},{"def":"to make somebody so tired or impatient that they cannot do any more","examples":["finish somebody off Climbing that hill really finished me off.","finish somebody A lecture from my parents now would just finish me."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["finish off","finish up","finish with"],"related":["finish up","finish off","finish with","photo finish","blanket finish","grandstand finish","finish line","finish up…","finish with somebody","finish with something","finish (up) with something","finish something","finish somebody/something","a fight to the finish","fight to the death/finish"]},{"pos":"noun","level":"A2","meanings":[{"def":"the last part or the end of something","examples":["It was a close finish as they had predicted.","They won in the end but it was a tight finish.","finish to something a dramatic finish to the race","The story was a lie from start to finish.","to the finish I want to see the job through to the finish.","at the finish Several runners needed medical attention at the finish.","He won a hard uphill finish at the recent Tour de Suisse.","Her car suffered from gearbox trouble, but she was still in at the finish.","It was the perfect finish to a wonderful day.","The rules of the game were changed to provide a more exciting finish for the television audience.","The runners came around the bend for a sprint finish in the home straight.","They fought bravely right to the finish.","He led the race from start to finish."],"opposite":"","synonyms":""},{"def":"the position in which a person or team finishes a competition","examples":["a second-/third-/fourth-place finish","The team are aiming for a top-five finish.","Last month in Canada she had her first podium finish.","His best finish was 11th in the Hungarian Grand Prix.","The team had another last-place finish."],"opposite":"","synonyms":""},{"def":"the last layer of paint, polish, etc. that is put onto the surface of something; the condition of the surface","examples":["a gloss/matt finish","furniture available in a range of finishes","to apply extra coats of finish","a guitar with a natural wood finish","a door handle with a brass finish","With our new tool for putting up wallpaper you can get a perfect finish every time.","This paint has a gloss finish.","The walls have a faux finish that mimics old plaster walls.","The wall has been painted to match the finish of the original.","The wall and floor finishes are all of the highest standard.","The steel roof has been coloured to match the finish of the original wrought iron.","Sand the wood to a fine finish using steel wool.","Make sure the surface is clean and smooth before the finish is applied.","How did you achieve that finish on the wood?"],"opposite":"","synonyms":""},{"def":"the final details that are added to something to make it complete","examples":["The bows will give a feminine finish to the curtains.","This trim really does give the garment a professional finish."],"opposite":"","synonyms":""},{"def":"a sports competition, election, etc. between sides that are so equal in ability that they continue fighting very hard until the end","examples":["Six teams are bitter rivals in what will be a fight to the finish.","If the polls are wrong and it's a fight to the finish, the result may not be known until all the votes have been counted."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a fight to the finish","def":"a sports competition, election, etc. between sides that are so equal in ability that they continue fighting very hard until the end","examples":["Six teams are bitter rivals in what will be a fight to the finish.","If the polls are wrong and it's a fight to the finish, the result may not be known until all the votes have been counted."]}],"phrasal":[],"related":[]}]