[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fir/fire_/fire__us_1.mp3","phonsUS":"/ˈfaɪər/","level":"A1","meanings":[{"def":"the flames, light and heat, and often smoke, that are produced when something burns","examples":["Most animals are afraid of fire.","When did people start to cook with fire?","The sky was filled with fire and smoke.","She takes the theme of the four elements: earth, air, fire and water.","The sun is a ball of fire.","a column of fire","Things changed forever when our early ancestors discovered fire."],"opposite":"","synonyms":""},{"def":"flames that are out of control and destroy buildings, trees, etc.","examples":["Several youths had set fire to the police car (= had made it start burning).","on fire The car was on fire.","A candle had set the curtains on fire.","These thatched roofs frequently catch fire (= start to burn).","Forest fires raged all over Australia.","Five people died in a house fire.","Fires were breaking out everywhere.","A fire had started in the kitchen.","He was accused of deliberately starting a fire.","Fire can spread very quickly.","The fire burned for three days before it was finally contained.","The warehouse was destroyed by fire.","It took two hours to put out the fire (= stop it burning).","Fire crews arrived and began to fight the flames.","We have to comply with fire safety regulations.","It took several days to bring the forest fires under control.","The sprinkler system came on and doused the fire.","The fire licked the roof of the house.","The fire gutted the building, leaving just a charred shell.","the ruins of an old factory, gutted by fire","The fire had spread to the east wing of the house.","Fire engulfed the building.","Fire ripped through the tower block.","In 1925 a disastrous fire swept through the museum.","The entire village was consumed by fire.","The factory was destroyed in a fire started by arsonists.","Investigators are trying to establish the cause of the fire.","The building suffered extensive fire damage.","Strong winds fanned the fire.","Someone had set fire to her car.","In 2017, the fire season started with a huge fire in New Mexico.","Firefighters battled the fire for several hours.","He joined the crowds of men and women fighting the fire.","Groups of rioters attacked and set the police headquarters on fire.","A missile ignited a fire that burned for three days.","A lantern was knocked over and the barn caught fire.","A fire broke out in the mail room.","Fire erupted in the laundry room.","Foam-filled couches are a serious fire hazard.","fire code violations","legislation related to fire safety","We had to evacuate the building for a fire drill.","information about fire prevention"],"opposite":"","synonyms":""},{"def":"a pile of burning fuel, such as wood or coal, used for cooking food or heating a room","examples":["They cook on an open fire.","a log/coal/wood fire","Sam had lit a fire to welcome us home.","to make/build a fire","Come and get warm by the fire.","We sat in front of a roaring fire.","A fire roaring in the hearth added warmth to the room.","We sat round the fire and told stories.","The cat was curled up near the fire.","Although it was summer a fire burned in the great stone hearth.","The fire was blazing merrily.","Kim had managed to kindle a little fire of dry grass.","On cold nights we stoked up the fire to a blaze.","Put some more wood on the fire.","She fed the fire with the branches next to her.","The fire smoked instead of burning properly.","The fire was beginning to die down.","The interior was only lit by the golden glow of the fire.","We had plenty of dry wood, so the fire lit easily.","When we go on safari we like to cook on an open fire.","Who's going to build the fire?","Do you know how to make a fire?"],"opposite":"","synonyms":""},{"def":"a piece of equipment for heating a room","examples":["a gas/an electric fire","Shall I put the fire on?","There's a small gas fire under the mantelpiece.","She used a match to light the gas fire.","He had a fire plugged in next to his desk.","Is the fire still on?","Don't forget to turn the fire off before you come to bed."],"opposite":"","synonyms":""},{"def":"shots from guns","examples":["The gunmen opened fire on (= started shooting at) the police.","under fire Their vehicle came under fire (= was being shot at).","The men were under heavy fire (= being shot at many times).","He was hit by enemy fire.","a burst of machine-gun fire","artillery/rocket/mortar fire","to return fire (= to fire back at somebody who is shooting at you)","He ordered his men to hold their fire (= not to shoot).","Protesters exchanged fire with the guards (= they shot at each other).","A young girl was in the line of fire (= between the person shooting and what he/she was shooting at).","I’ll give you covering fire while you try to escape.","A few soldiers were sent out to draw (= attract ) the enemy's fire.","Enemy fire continued to rain down.","As they ran, they heard artiillery fire.","The vehicle was full of holes from small arms fire.","We came under heavy anti-aircraft fire.","He ordered his men to cease fire.","The commandos pushed forward under the covering fire of their artillery.","The troops opened fire on the crowd.","They were told to hold their fire until the enemy came closer.","Unfortunately he was in the line of fire and got shot.","We were under constant fire from enemy snipers.","She returned fire from behind the low wall."],"opposite":"","synonyms":""},{"def":"strong criticism","examples":["She directed her fire against the new education policy.","under fire The health minister has come under fire from all sides.","The EU came under fire from the US over its biotech policy.","The minister of transport came under fire for forcing increases in rail fares."],"opposite":"","synonyms":""},{"def":"very strong emotion, especially anger or enthusiasm","examples":["Her eyes were full of fire.","The fire seemed to die in him when his wife died.","Something of the old fire had returned to their rivalry.","Frustrated ambitions can fuel the fire of anger and resentment."],"opposite":"","synonyms":""},{"def":"a person who is full of energy and enthusiasm","examples":[],"opposite":"","synonyms":""},{"def":"a difficult introduction to a new job or activity","examples":[],"opposite":"","synonyms":""},{"def":"to make somebody direct their anger, criticism, etc. at you, so that others do not have to face it","examples":[],"opposite":"","synonyms":""},{"def":"to use similar methods in a fight or an argument to those your opponent is using","examples":[],"opposite":"","synonyms":""},{"def":"a very strong desire to achieve something","examples":["You need fire in your belly if you want to make it in the music business."],"opposite":"","synonyms":""},{"def":"to become friends quickly and have a very friendly relationship","examples":[],"opposite":"","synonyms":""},{"def":"to delay or be delayed in taking action","examples":["The project had hung fire for several years for lack of funds."],"opposite":"","synonyms":""},{"def":"to be involved in several activities or areas of business at the same time, hoping that at least one will be successful","examples":[],"opposite":"","synonyms":""},{"def":"if something bad is being said about somebody/something, it usually has some truth in it","examples":[],"opposite":"","synonyms":""},{"def":"giving you a painful burning feeling","examples":["He couldn't breathe. His chest was on fire."],"opposite":"","synonyms":""},{"def":"to be doing really well at something","examples":["Keep it up. You're on fire!"],"opposite":"","synonyms":""},{"def":"from a bad situation to one that is worse","examples":[],"opposite":"","synonyms":""},{"def":"to act in a way that is not sensible and take dangerous risks","examples":[],"opposite":"","synonyms":""},{"def":"to be very successful and admired by other people","examples":["He's never going to set the world on fire with his paintings."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a ball of energy/fire","def":"a person who is full of energy and enthusiasm","examples":[]},{"idiom":"a baptism of fire","def":"a difficult introduction to a new job or activity","examples":[]},{"idiom":"draw somebody’s fire","def":"to make somebody direct their anger, criticism, etc. at you, so that others do not have to face it","examples":[]},{"idiom":"fight fire with fire","def":"to use similar methods in a fight or an argument to those your opponent is using","examples":[]},{"idiom":"fire in the/your belly","def":"a very strong desire to achieve something","examples":["You need fire in your belly if you want to make it in the music business."]},{"idiom":"get on like a house on fire","def":"to become friends quickly and have a very friendly relationship","examples":[]},{"idiom":"hang/hold fire","def":"to delay or be delayed in taking action","examples":["The project had hung fire for several years for lack of funds."]},{"idiom":"have several, etc. irons in the fire","def":"to be involved in several activities or areas of business at the same time, hoping that at least one will be successful","examples":[]},{"idiom":"(there is) no smoke without fire","def":"if something bad is being said about somebody/something, it usually has some truth in it","examples":[]},{"idiom":"on fire","def":"giving you a painful burning feeling","examples":["He couldn't breathe. His chest was on fire.","Keep it up. You're on fire!"]},{"idiom":"out of the frying pan into the fire","def":"from a bad situation to one that is worse","examples":[]},{"idiom":"play with fire","def":"to act in a way that is not sensible and take dangerous risks","examples":[]},{"idiom":"set the world on fire","def":"to be very successful and admired by other people","examples":["He's never going to set the world on fire with his paintings."]}],"phrasal":[],"related":["fire ant","fire off","fire up","bush fire","fire away","fire door","fire hose","fire line","fire sale","fire trap","sure-fire","fire alarm","fire chief","fire drill","fire-eater","fire engine","fire escape","fire-raiser","fire screen"]},{"pos":"verb","level":"B1","meanings":[{"def":"to shoot bullets, etc. from a gun or other weapon","examples":["The officer ordered his men to fire.","fire on somebody/something Soldiers fired on the crowd.","fire something to fire missiles/rockets/bullets","They ran away as soon as the first shot was fired.","fire something into something He fired the gun into the air.","fire into something He fired into the air.","fire at somebody/something She fired at her attacker.","fire something at somebody/something She fired an arrow at the target.","Missiles were fired at the enemy.","A dense volley of missiles was fired directly at the ship.","He grabbed the shotgun, ready to fire if anyone entered.","He ordered the troops to fire over the heads of the crowd.","She fired a revolver at her attacker.","She fired blindly into the mass of shadows.","The police fired on protesters in the city centre.","Whitlock purposely fired wide.","Soldiers fired on the crowd, killing several people.","The soldiers appeared to fire indiscriminately into the crowd."],"opposite":"","synonyms":""},{"def":"to shoot bullets out","examples":["We heard the sound of guns firing.","fire something A starter's pistol fires only blanks."],"opposite":"","synonyms":""},{"def":"to force somebody to leave their job","examples":["fire somebody We had to fire him for dishonesty.","He was responsible for hiring and firing staff.","fire somebody from something She got fired from her first job."],"opposite":"","synonyms":""},{"def":"to make somebody feel very excited about something or interested in something","examples":["fire somebody with something The talk had fired her with enthusiasm for the project.","fire something The stories fired his imagination","The speaker knew how to fire the blood.","His imagination had been fired by the film."],"opposite":"","synonyms":""},{"def":"when an engine fires, an electrical spark is produced that makes the fuel burn and the engine start to work","examples":[],"opposite":"","synonyms":""},{"def":"using the fuel mentioned in order to operate","examples":["gas-fired central heating"],"opposite":"","synonyms":""},{"def":"to heat a clay object to make it hard and strong","examples":["to fire pottery","to fire bricks in a kiln"],"opposite":"","synonyms":""},{"def":"to ask somebody a lot of questions one after another or make a lot of comments very quickly","examples":["The room was full of journalists, all firing questions at them."],"opposite":"","synonyms":""},{"def":"using all your energy to do something; working as well as possible","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"fire questions, insults, etc. at somebody","def":"to ask somebody a lot of questions one after another or make a lot of comments very quickly","examples":["The room was full of journalists, all firing questions at them."]},{"idiom":"working/firing on all cylinders","def":"using all your energy to do something; working as well as possible","examples":[]}],"phrasal":["fire away","fire off","fire up"],"related":[]}]