[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fix/fix__/fix__us_1.mp3","phonsUS":"/fɪks/","level":"A2","meanings":[{"def":"to repair or correct something","examples":["The car won't start—can you fix it?","I've fixed the problem.","Businesses and government have spent billions of dollars to find and fix the bug.","We need to get the TV fixed.","If you suspect that you have a fuel leak have it fixed as soon as possible.","We're not moving in until the heating's fixed.","Mommy, can you fix my toy?","Don't imagine that the law can fix everything.","She tried to fix things between them, but nothing worked.","The company had a bad image that needed fixing.","We're trying to fix the cash flow problem by reducing costs."],"opposite":"","synonyms":""},{"def":"to decide on a date, a time, an amount, etc. for something","examples":["fix something Has the date of the next meeting been fixed?","Their prices are fixed until the end of the year (= will not change before then).","fix something for something A second trial date was fixed for 7th December.","fix something at something They fixed the rent at £200 a week.","Crop prices were fixed at $ 1.98 per bushel for corn.","The dates have to be fixed well in advance.","Their departure was fixed for 14 August."],"opposite":"","synonyms":""},{"def":"to arrange or organize something","examples":["fix something I'll fix a meeting.","fix something up You have to fix visits up in advance with the museum.","fix something up for somebody Just give me a list of your friends, and I'll fix things up for them.","fix something with somebody (informal) Don't worry, I'll fix it with Sarah.","fix up (for somebody) to do something I’ve fixed up (for us) to go to the theatre next week.","We'll go tomorrow then. Will you fix it with the others?","I've fixed up for you to see the doctor tomorrow."],"opposite":"","synonyms":""},{"def":"to put something in a place so that it will not move","examples":["to fix a shelf to the wall","to fix a post in the ground","Play equipment such as swings and climbing frames should be securely fixed and well maintained.","(figurative) He noted every detail so as to fix the scene in his mind.","Fix the bars in position with the screws provided.","The handrail can be fixed directly to the wall."],"opposite":"","synonyms":""},{"def":"to discover or say the exact position, time, etc. of something","examples":["We can fix the ship's exact position at the time the fire broke out."],"opposite":"","synonyms":""},{"def":"to provide or prepare something, especially food","examples":["fix somebody/yourself something Can I fix you a drink?","I'm just going to fix myself some breakfast.","fix something for somebody/yourself Can I fix a drink for you?","fix something I'll fix supper."],"opposite":"","synonyms":""},{"def":"to make something such as your hair or face neat and attractive","examples":["I'll fix my hair and then I'll be ready."],"opposite":"","synonyms":""},{"def":"to arrange the result of something in a way that is not honest or fair","examples":["I'm sure the race was fixed."],"opposite":"","synonyms":""},{"def":"to punish somebody who has harmed you and stop them doing you any more harm","examples":["Don't worry—I'll fix him."],"opposite":"","synonyms":""},{"def":"to treat film for cameras, etc. with a chemical so that the colours do not change or become less bright","examples":[],"opposite":"","synonyms":""},{"def":"to make an animal unable to have young by means of an operation","examples":[],"opposite":"","synonyms":""},{"def":"to intend to do something","examples":["We're not fixing to go there anytime soon."],"opposite":"","synonyms":""},{"def":"to look directly at somebody for a long time","examples":["He fixed her with an angry stare."],"opposite":"","synonyms":""},{"def":"used to say that if something works well enough, it should not be changed","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be fixing to do something","def":"to intend to do something","examples":["We're not fixing to go there anytime soon."]},{"idiom":"fix somebody with a look, stare, gaze, etc.","def":"to look directly at somebody for a long time","examples":["He fixed her with an angry stare."]},{"idiom":"if it ain’t broke, don’t fix it","def":"used to say that if something works well enough, it should not be changed","examples":[]}],"phrasal":["fix on","fix up"],"related":["fix on","fix up","fix something","fix on somebody/something","fix somebody up (with somebody)","fix somebody up (with something)","fix (something) on somebody/something","if it ain’t broke, don’t fix it"]},{"pos":"noun","level":"B2","meanings":[{"def":"a solution to a problem, especially an easy or temporary one","examples":["Luckily there is an easy fix.","a short-term/temporary/permanent fix","fix for something There is no quick fix for the steel industry.","There had to be a technological fix for the problem.","The new software incorporates many bug fixes and product improvements.","This is nothing other than a short-term political fix."],"opposite":"","synonyms":""},{"def":"an amount of something that you need and want frequently, especially an illegal drug such as heroin","examples":["to get yourself a fix","I need a fix of coffee before I can face the day.","He was like a heroin junkie needing his next fix.","I need my caffeine fix!"],"opposite":"","synonyms":""},{"def":"a difficult situation","examples":["in a fix We've got ourselves in a fix about this.","How did you get into such a fix?","I was in a fix.","I lent her the money to get her out of a fix.","The power cut put us in a fix because we had invited people to dinner."],"opposite":"","synonyms":""},{"def":"the act of finding the position of a ship or an aircraft","examples":["They managed to get a fix on the yacht's position."],"opposite":"","synonyms":""},{"def":"an act of understanding something","examples":["He tried to get a fix on the young man's motives, but he just couldn't understand him."],"opposite":"","synonyms":""},{"def":"a thing that is dishonestly arranged; a trick","examples":["Her promotion was a fix, I'm sure!"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]