[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fla/flash/flash__us_1.mp3","phonsUS":"/flæʃ/","level":"B2","meanings":[{"def":"a sudden bright light that shines for a moment and then disappears","examples":["a flash of lightning","Flashes of light were followed by an explosion.","There was a blinding flash and the whole building shuddered.","The flashes from the guns illuminated the sky."],"opposite":"","synonyms":""},{"def":"the act of shining a light on something, especially as a signal","examples":["The lighthouse gives out four flashes every 15 seconds.","Below them they saw torch flashes from locals which signalled V for Victory."],"opposite":"","synonyms":""},{"def":"a piece of equipment that produces a bright light for a very short time, used for taking photographs indoors, when it is dark, etc.; the use of this when taking a photograph","examples":["a camera with a built-in flash","I'll need flash for this shot.","flash photography","The tour guide asked people to turn off the flash on their cameras.","I don't think the picture will come out in this light. Try using the flash.","I took it with flash.","The flash didn't go off."],"opposite":"","synonyms":""},{"def":"the sudden appearance for a short time of something bright","examples":["a flash of white teeth","On the horizon, she saw a flash of silver—the sea!","We caught a flash of white in the bushes."],"opposite":"","synonyms":""},{"def":"a particular idea or feeling that suddenly comes into your mind or shows in your face","examples":["a flash of brilliance/insight/inspiration","He caught the flash of anger in her eyes.","When she looked at me, I caught a flash of recognition in her eyes.","‘Did you really win first prize?’ he said with a flash of genuine admiration.","He felt a brief flash of jealousy.","She had a sudden flash of inspiration.","a rare flash of humour"],"opposite":"","synonyms":""},{"def":"a short item of important news that is broadcast on radio or television, often interrupting a programme","examples":[],"opposite":"","synonyms":""},{"def":"a band or small piece of cloth worn on a military uniform to show a person’s rank","examples":[],"opposite":"","synonyms":""},{"def":"a band of colour or writing across a book, pack, etc.","examples":[],"opposite":"","synonyms":""},{"def":"a program that creates moving images for websites","examples":[],"opposite":"","synonyms":""},{"def":"a sudden success that lasts only a short time and is not likely to be repeated","examples":["He needed to prove that his success was not just a flash in the pan."],"opposite":"","synonyms":""},{"def":"very quickly and suddenly","examples":["The weekend seemed to be over in a flash.","The answer came to me like a flash."],"opposite":"","synonyms":""},{"def":"very quickly","examples":["Quick as a flash she was at his side."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a flash in the pan","def":"a sudden success that lasts only a short time and is not likely to be repeated","examples":["He needed to prove that his success was not just a flash in the pan."]},{"idiom":"in/like a flash","def":"very quickly and suddenly","examples":["The weekend seemed to be over in a flash.","The answer came to me like a flash."]},{"idiom":"(as) quick as a flash","def":"very quickly","examples":["Quick as a flash she was at his side."]}],"phrasal":[],"related":["flash by","flash on","flash mob","flash back","flash card","flash drive","flash flood","flash past","flash sale","flash around","flash-forward","flash memory","flash mobber","flash mobbing","hot flash","flash cards","flash mobs"]},{"pos":"verb","level":"B2","meanings":[{"def":"to shine very brightly for a short time; to make something shine in this way","examples":["Lightning flashed in the distance.","the flashing blue lights of a police car","Start crossing when the green WALK sign starts to flash.","Cameras flashed as showbiz celebrities strolled up the red carpet.","+ adv./prep. A neon sign flashed on and off above the door.","It was only the sun, flashing briefly on her bleached hair.","flash something The guide flashed a light into the cave."],"opposite":"","synonyms":""},{"def":"to use a light to give somebody a signal","examples":["flash something at somebody Red lights flashed a warning at them.","Why is that driver flashing his lights at us?","flash something The cars in the oncoming lane started flashing their headlights to warn us there was an accident ahead.","flash somebody something Red lights flashed them a warning.","flash somebody She flashed me because I was driving slowly.","flash at somebody Why is that driver flashing at us?"],"opposite":"","synonyms":""},{"def":"to show something to somebody quickly","examples":["He flashed his pass at the security officer."],"opposite":"","synonyms":""},{"def":"to move or pass very quickly","examples":["The countryside flashed past the train windows.","A look of terror flashed across his face.","Signs announcing the different airport terminals were flashing by."],"opposite":"","synonyms":""},{"def":"to come into your mind suddenly","examples":["A terrible thought flashed through my mind."],"opposite":"","synonyms":""},{"def":"to appear on a television screen, computer screen, etc. for a short time; to make something do this","examples":["A message was flashing on the screen.","flash (something) (up) His name was flashed up on the screen."],"opposite":"","synonyms":""},{"def":"to send information quickly by radio, computer, etc.","examples":["News of their triumph was flashed around the world."],"opposite":"","synonyms":""},{"def":"to show a strong emotion suddenly and quickly","examples":["Her eyes flashed with anger.","Fear flashed in his eyes."],"opposite":"","synonyms":""},{"def":"to show the sexual organs in public","examples":[],"opposite":"","synonyms":""},{"def":"to smile, look, etc. at somebody suddenly and quickly","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"flash somebody a smile, look, etc.","def":"to smile, look, etc. at somebody suddenly and quickly","examples":[]}],"phrasal":["flash around","flash back","flash by","flash on","flash past"],"related":[]},{"pos":"adjective","level":"","meanings":[{"def":"attracting attention by being large or expensive, or by having expensive clothes, etc.","examples":["a flash car","He's very flash, isn't he?","He always was a bit of a flash dresser."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]