[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fla/flavo/flavour__us_1.mp3","phonsUS":"/ˈfleɪvər/","level":"B2","meanings":[{"def":"how food or drink tastes","examples":["The tomatoes give extra flavour to the sauce.","in flavour It is stronger in flavour than other Dutch cheeses.","vegetables that are fresh and full of flavour","Salt is a common flavour enhancer."],"opposite":"","synonyms":""},{"def":"a particular type of taste","examples":["This yogurt comes in ten different flavours.","a wine with a delicate fruit flavour","Coffee takes on a flavour all of its own when enjoyed with freshly cooked pastry.","It has a very mild flavour.","The lemon juice brings out the natural fruit flavours.","a dish with a strong spicy flavour","a herb that adds a characteristic flavour to a range of dishes","Delicate herbs keep their flavour better when frozen.","Enjoy the flavour of fresh fish."],"opposite":"","synonyms":""},{"def":"a substance added to food or drink to give it a particular taste","examples":[],"opposite":"","synonyms":""},{"def":"a particular quality or atmosphere","examples":["the distinctive flavour of South Florida","The film retains much of the book's exotic flavour.","Foreign visitors help to give a truly international flavour to the occasion.","The children experienced the flavour of medieval life.","The intervention of the authorities gave union struggles a decidedly political flavour.","The music festival has taken on a distinctly German flavour.","a TV show with a Mexican flavour"],"opposite":"","synonyms":""},{"def":"an idea of what something is like","examples":["I have tried to convey something of the flavour of the argument.","The following extract gives a flavour of the poet’s later works.","She rotated around the departments to get a flavour of all aspects of the business."],"opposite":"","synonyms":""},{"def":"a particular type of something, especially computer software","examples":[],"opposite":"","synonyms":""},{"def":"a person or thing that is very popular at a particular time","examples":["Environmental issues are no longer the flavour of the month.","I’m not exactly flavour of the month around here at the moment."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"flavour of the month","def":"a person or thing that is very popular at a particular time","examples":["Environmental issues are no longer the flavour of the month.","I’m not exactly flavour of the month around here at the moment."]}],"phrasal":[],"related":["flavour enhancer","flavour enhancers"]},{"pos":"verb","level":"","meanings":[{"def":"to add something to food or drink to give it more taste or a particular taste","examples":["This dish is flavoured with basil and garlic."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]