[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fli/fligh/flight__us_1.mp3","phonsUS":"/flaɪt/","level":"A1","meanings":[{"def":"a journey made by air, especially in a plane","examples":["a smooth/comfortable/bumpy flight","a domestic/an international flight","a transatlantic flight","The first prize is a return flight to Delhi.","China's first manned space flight","a hot-air balloon flight","flight (from A) (to B) We met on a flight from London to Paris.","It is vital that people get up and walk about if they are on a long-haul flight.","Did you have a good flight?","I hope you enjoy the flight.","If you need to change a flight, the fee is $100.","Please refrain from smoking during the flight.","The Wright Brothers made their first flight in the Kitty Hawk in 1903.","The aircraft made its maiden flight in January 2000.","The flight recorder should help to establish why the plane suddenly crashed.","The flight time from Heathrow to Marseilles is less than two hours.","The outbound flight was smooth but the return flight was held up by six hours.","The snow was severe enough to disrupt flight operations.","They have persuaded the authorities to divert the flight path of the military jets away from their town.","This will be the last flight of the vintage aircraft before it is installed in the museum.","She made several training flights in the glider.","(figurative) a flight into the unknown"],"opposite":"","synonyms":""},{"def":"a plane making a particular journey","examples":["We're booked on the same flight.","If we leave now, I can catch the earlier flight.","After a few phone calls he boarded a flight to Bangkok.","Flight BA 4793 is now boarding at Gate 17.","They've cancelled my flight!","flight (to A) (from B) At present there is no direct flight to Egypt from Namibia.","flight to A They took a commercial flight to Vicenza, Italy.","flight for A She took a flight for Los Angeles.","flight out of B I had an early morning flight out of Stockholm.","flight between A and B All flights between New York and Washington have been cancelled due to fog.","mercy/relief flights (= planes taking help to countries where there is a war)","All flights have been grounded for security reasons.","I'm on the first flight to Milan in the morning.","She flew into London on the last flight from Frankfurt.","She was accused of planting the bomb that blew up flight 217.","The UN has suspended relief flights because of shelling around the airport.","The flight was diverted to Delhi because of a bomb scare.","The team has chartered a special flight for their fans.","We arrived at the airport just in time to make our flight.","Hurry or you'll miss your flight.","We need your time of arrival and flight number.","a daily non-stop flight between Hong Kong and New York"],"opposite":"","synonyms":""},{"def":"the act of flying","examples":["the age of supersonic flight","in flight The bird is easily recognized in flight (= when it is flying) by the black band at the end of its tail.","the stresses the body endures in space flight","flight safety","Barn owls are capable of flight at 56 days.","Bats are the only mammals to have wings and to achieve sustained flight.","The wings vibrate during flight.","They watched the young eagles take flight.","Don't get into the line of flight of the bees—you'd be sure to get stung.","a flock of geese in flight","the enormous costs of manned space flight"],"opposite":"","synonyms":""},{"def":"the movement or direction of an object as it travels through the air","examples":["the flight of a ball"],"opposite":"","synonyms":""},{"def":"a series of steps between two floors or levels","examples":["She fell down a flight of stairs/steps and hurt her back."],"opposite":"","synonyms":""},{"def":"the act of running away from a dangerous or difficult situation","examples":["flight (of somebody) (from somebody/something) the flight of refugees from the advancing forces","a flight from harsh reality","in flight from something The main character is a journalist in flight from a failed marriage.","Left-wing opposition leaders, in flight from persecution, went across the border.","The story tells of his flight to safety.","a headlong flight from danger","The army was defeated and the king put to flight."],"opposite":"","synonyms":""},{"def":"an idea or a statement that shows a lot of imagination but is not practical or sensible","examples":["This idea was one of my wilder flights of fancy."],"opposite":"","synonyms":""},{"def":"a group of birds or aircraft flying together","examples":["a flight of geese","They flew in two flights of three aircraft.","an aircraft of the Queen’s flight"],"opposite":"","synonyms":""},{"def":"among the best of a particular group","examples":["This is the team’s first season back in the top flight for more than 60 years."],"opposite":"","synonyms":""},{"def":"to force somebody to run away","examples":["The enemy was quickly put to flight."],"opposite":"","synonyms":""},{"def":"to run away","examples":["The gang took flight when they heard the police car.","As soon as they detected the cheetah it took flight."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in the first/top flight","def":"among the best of a particular group","examples":["This is the team’s first season back in the top flight for more than 60 years."]},{"idiom":"put somebody to flight","def":"to force somebody to run away","examples":["The enemy was quickly put to flight."]},{"idiom":"take flight","def":"to run away","examples":["The gang took flight when they heard the police car.","As soon as they detected the cheetah it took flight."]}],"phrasal":[],"related":["in-flight","flight crew","flight deck","flight path","flight suit","test flight","top-flight","flight jacket","flight shame","white flight","charter flight","flight attendant","flight lieutenant","flight officer","flight recorder","flight sergeant","flight simulator","scheduled flight"]},{"pos":"verb","level":"","meanings":[{"def":"to kick, hit or throw a ball through the air with skill","examples":["He equalized with a beautifully flighted shot."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]