[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/flo/float/float__us_1.mp3","phonsUS":"/fləʊt/","level":"B2","meanings":[{"def":"to move slowly on water or in the air","examples":["A group of swans floated by.","The smell of new bread floated up from the kitchen.","Beautiful music came floating out of the window.","The boats were floating gently down the river.","Add the gnocchi and cook until they float to the surface.","(figurative) People seem to float in and out of my life.","A few small clouds floated across the sky.","Her voice seemed to float on the water as gently as a slight mist.","In the dream my feet leave the ground and I start to float upwards.","(figurative) An idea suddenly floated into my mind."],"opposite":"","synonyms":""},{"def":"to stay on or near the surface of a liquid and not sink","examples":["Wood floats.","Much of the bay is covered by floating sea ice.","float in something She relaxed, floating gently in the water.","float on something A plastic bag was floating on the water.","We tried to make a raft but it wouldn't float.","Vast masses of frogspawn floated just beneath the surface."],"opposite":"","synonyms":""},{"def":"to make something move on or near the surface of a liquid","examples":["float something There wasn't enough water to float the ship.","float something + adv./prep. They float the logs down the river to the towns."],"opposite":"","synonyms":""},{"def":"to walk or move in a smooth and easy way","examples":["She floated down the steps to greet us.","The couple floated across the dance floor."],"opposite":"","synonyms":""},{"def":"to suggest an idea or a plan for other people to consider","examples":["They floated the idea of increased taxes on alcohol."],"opposite":"","synonyms":""},{"def":"to sell shares in a company or business to the public for the first time","examples":["The company was floated on the stock market in 2014.","Shares were floated at 585p."],"opposite":"","synonyms":""},{"def":"if a government floats its country’s money or allows it to float, it allows its value to change freely according to the value of the money of other countries","examples":["The government decided to allow the peso to float freely."],"opposite":"","synonyms":""},{"def":"to be what somebody likes","examples":["You can listen to whatever kind of music floats your boat."],"opposite":"","synonyms":""},{"def":"to feel very happy","examples":["Most couples feel they are walking on air on their wedding day."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"float somebody’s boat","def":"to be what somebody likes","examples":["You can listen to whatever kind of music floats your boat."]},{"idiom":"float/walk on air","def":"to feel very happy","examples":["Most couples feel they are walking on air on their wedding day."]}],"phrasal":["float about","float around"],"related":["e-float","float about","milk float","float around","float/walk on air","float somebody’s boat"]},{"pos":"noun","level":"","meanings":[{"def":"a large vehicle on which people dressed in special costumes are carried in a festival","examples":["a carnival float"],"opposite":"","synonyms":""},{"def":"a small light object attached to a fishing line that stays on the surface of the water and moves when a fish has been caught","examples":["float fishing"],"opposite":"","synonyms":""},{"def":"a light object that floats in the water and is held by a person who is learning to swim","examples":[],"opposite":"","synonyms":""},{"def":"a drink with ice cream floating in it","examples":["a Coke float"],"opposite":"","synonyms":""},{"def":"a sum of money consisting of coins and notes of low value that is given to somebody before they start selling things so that they can give customers change","examples":[],"opposite":"","synonyms":""},{"def":"the process of selling shares in a company to the public for the first time in order to raise money","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]