[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/flo/flood/flood__us_1.mp3","phonsUS":"/flʌd/","level":"B1","meanings":[{"def":"a large amount of water covering an area that is usually dry","examples":["The heavy rain has caused floods in many parts of the country.","There have been delays to filming as a result of the floods.","Police have issued flood warnings for Nevada.","Much had been done in recent years to improve flood defences.","The insurance does not cover flood damage to gates, hedges or fences.","an appeal to help flood victims","the Thames flood barrier","in flood The river is in flood (= has more water in it than normal and has caused a flood).","No one knew that the flood was coming.","The flood caused widespread destruction.","The floods are slowly subsiding.","This summer the region was struck by devastating floods.","The building was evacuated as flood water filled the basement."],"opposite":"","synonyms":""},{"def":"a very large number of things or people that appear at the same time","examples":["a flood of complaints","We are unable to compete with a flood of cheap food imports.","The child was in floods of tears (= crying a lot).","New spam-blocking software should help stem (= stop) the flood.","There has been a flood of tributes on social media from fans.","A fundraising page has been set up to help support the family and it has received a flood of donations.","Writing about St John's brings back a flood of nostalgic memories.","They took on temporary workers in anticipation of a flood of calls.","She was inundated by floods of fan mail.","Authorities are struggling to cope with the flood of refugees.","A great flood of anger washed through him.","Conversation returned, a trickle breaking into a flood."],"opposite":"","synonyms":""},{"def":"the great flood that covered the world in the Bible story","examples":["before the Flood (= a very long time ago)"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["flood out","flash flood","flood tide","flood tides","flood somebody"]},{"pos":"verb","level":"B1","meanings":[{"def":"if a place floods or something floods it, it becomes filled or covered with water","examples":["The cellar floods whenever it rains heavily.","flood something If the pipe bursts it could flood the whole house.","be flooded with something The station was flooded with water and mud following heavy rain.","The area near the river is liable to flood.","The village had been badly flooded."],"opposite":"","synonyms":""},{"def":"to become so full that it spreads out onto the land around it","examples":["When the Ganges floods, it causes considerable damage.","flood something The river flooded the valley."],"opposite":"","synonyms":""},{"def":"to arrive or go somewhere in large numbers","examples":["The home fans flooded onto the pitch at the finish.","Texts and tweets came flooding in from all over the country.","The crowd was flooding out onto the track.","Refugees continue to flood into neighbouring countries.","Millions of poverty-stricken people will flood south in search of jobs."],"opposite":"","synonyms":""},{"def":"to send something somewhere in large numbers","examples":["be flooded with something The office was flooded with applications for the job.","We’ve been flooded with complaints."],"opposite":"","synonyms":""},{"def":"to become or make something become available in a place in large numbers","examples":["flood something Cheap imported goods are flooding the market.","flood something with something A man who planned to flood Britain with cocaine was jailed for 15 years."],"opposite":"","synonyms":""},{"def":"to affect somebody suddenly and strongly","examples":["+ adv./prep. A great sense of relief flooded over him.","Memories of her childhood came flooding back.","flood somebody with something The words flooded him with self-pity."],"opposite":"","synonyms":""},{"def":"to spread suddenly into something; to cover something","examples":["+ adv./prep. She drew the curtains and the sunlight flooded in.","flood something She looked away as the colour flooded her cheeks.","be flooded with something The room was flooded with evening light."],"opposite":"","synonyms":""},{"def":"if an engine floods or if you flood it, it becomes so full of petrol that it will not start","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["flood out"],"related":[]}]