[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/flo/flour/flourish__us_1.mp3","phonsUS":"/ˈflɜːrɪʃ/","level":"C1","meanings":[{"def":"to develop quickly and become successful or common","examples":["Few businesses are flourishing in the present economic climate.","The arts began to flourish at that time.","There was a flourishing black market.","The company has continued to flourish over the years.","His international career has flourished under captain James Murray.","Olten is a lively and flourishing town.","The town still flourishes as a fishing port.","Their relationship flourished for forty years.","This tradition of singing is flourishing."],"opposite":"","synonyms":""},{"def":"to grow well; to be healthy and happy","examples":["These plants flourish in a damp climate.","(especially British English) I'm glad to hear you're all flourishing.","I hope the grandchildren are flourishing."],"opposite":"","synonyms":""},{"def":"to wave something around in a way that makes people look at it","examples":["He rushed into the room flourishing the newspaper."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"","meanings":[{"def":"an exaggerated movement that you make when you want somebody to notice you","examples":["He opened the door for her with a flourish.","With a final flourish she laid down her pen."],"opposite":"","synonyms":""},{"def":"an impressive act or way of doing something","examples":["The season ended with a flourish for Kane, when he scored in the final minute of the match."],"opposite":"","synonyms":""},{"def":"a detail or decoration that is used in speech or writing","examples":["a speech full of rhetorical flourishes","His writing is plain and direct, with no stylistic flourishes."],"opposite":"","synonyms":""},{"def":"a curved line that is used as decoration, especially in writing","examples":["Her signature was a complicated affair of practised flourishes."],"opposite":"","synonyms":""},{"def":"a loud short piece of music that is usually played to announce an important person or event","examples":["a flourish of trumpets"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]