[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/flo/flow_/flow__us_1.mp3","phonsUS":"/fləʊ/","level":"B1","meanings":[{"def":"the steady and continuous movement of something/somebody in one direction","examples":["the flow of an electric current","flow (of something) (from something) She tried to stop the flow of blood from the wound.","flow (of something) to something Exercise increases blood flow to the brain.","flow (of something) into something an endless flow of refugees into the country","flow (of something) through something a steady flow of traffic through the city","to improve traffic flow (= make it move faster)","to control the direction of flow","Cut back surrounding vegetation to increase light and air flow.","First cut off the water flow from the boiler.","Changes in the flow of patients have reduced the number of beds available.","Squeeze the tube of sealant slowly to obtain an even flow.","The flow rate was measured at 9.5 gallons per second.","The main flow of water has been diverted to a new course.","They have to swim against the flow of the river.","An uninterrupted flow of traffic prevented us from getting to the other side.","The flow of adrenalin can help the mind to react quickly in a moment of stress.","The whole operation depends on a steady flow of electricity.","There was a swift flow of air through the room."],"opposite":"","synonyms":""},{"def":"the continuous production or supply of something","examples":["to encourage the free flow of information","efforts to stem the flow of illegal drugs","We are looking to improve data flow by up to 50%.","flow of something to something the flow of goods and services to remote areas","The continual bombing disrupted the flow of supplies to the ground troops.","The system provides a continuous flow of information to the market.","We like to allow a free flow of ideas in our company.","the flow of data through the system","the outward flow of investment from the country","to encourage the flow of revenue into the country","to maintain an even flow of work through the department","They extended the raids in an attempt to interrupt the flow of men and supplies to the enemy lines."],"opposite":"","synonyms":""},{"def":"continuous talk by somebody","examples":["You've interrupted my flow—I can't remember what I was saying.","He kept up a flow of chatter.","As usual, Tom was in full flow (= talking confidently in a way that is hard to interrupt)."],"opposite":"","synonyms":""},{"def":"the way that words, ideas or themes are linked together in speech, writing or music","examples":["Too many examples can interrupt the smooth flow of the text.","I found it hard to follow the flow of the argument.","I liked the concerto for its natural flow."],"opposite":"","synonyms":""},{"def":"the movement of the sea towards the land","examples":["the ebb and flow of the tide"],"opposite":"","synonyms":""},{"def":"the repeated, often regular, movement from one state to another; the repeated change in level, numbers or amount","examples":["the ebb and flow of the seasons","She sat in silence enjoying the ebb and flow of conversation.","He had known her long enough to recognize the ebb and flow of her moods.","the natural ebb and flow of water","We see a constant ebb and flow of jobs."],"opposite":"","synonyms":""},{"def":"to be relaxed and not worry about what you should do","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the ebb and flow (of something/somebody)","def":"the repeated, often regular, movement from one state to another; the repeated change in level, numbers or amount","examples":["the ebb and flow of the seasons","She sat in silence enjoying the ebb and flow of conversation.","He had known her long enough to recognize the ebb and flow of her moods.","the natural ebb and flow of water","We see a constant ebb and flow of jobs."]},{"idiom":"go with the flow","def":"to be relaxed and not worry about what you should do","examples":[]}],"phrasal":[],"related":["flow-on","cash flow","flow from","flow chart","Scapa Flow","flow-ons","flow charts","flow diagram","flow from something","the ebb and flow (of something/somebody)"]},{"pos":"verb","level":"B1","meanings":[{"def":"to move steadily and continuously in one direction","examples":["She lost control and the tears began to flow.","+ adv./prep. It's here that the river flows down into the ocean.","Blood flowed from a cut on her head.","This can prevent air from flowing freely to the lungs.","the electric currents flowing through the cables","a fast-flowing stream","The Wei River flows east.","Blood was still flowing from the wound.","The river flows quite fast here.","a small stream that flowed down the hillside","to get blood flowing to the brain","It's here that the river flows down into the ocean.","He lost control and the tears began to flow.","The current flowing in a circuit is measured by connecting an ammeter.","(figurative) One day seemed to flow into the next."],"opposite":"","synonyms":""},{"def":"to move or pass continuously from one place or person to another, especially in large numbers or amounts","examples":["New orders are finally starting to flow.","+ adv./prep. Constant streams of traffic flowed past.","Election results flowed in throughout the night.","They examined the way in which information flowed between the firm’s 300 employees.","Imported food aid continued to flow in.","Information flows continuously through the network.","The best thing is when ideas flow in both directions."],"opposite":"","synonyms":""},{"def":"to develop or be produced in an easy and natural way","examples":["Conversation flowed freely throughout the meal.","We hope that the debate on this issue will continue to flow.","In a good production of the play, the action and the words flow naturally.","The songs flow seamlessly into one another."],"opposite":"","synonyms":""},{"def":"to be available easily and in large amounts","examples":["It was obvious that money flowed freely in their family.","The party got livelier as the drink began to flow.","Wine and beer flowed freely."],"opposite":"","synonyms":""},{"def":"to be felt strongly by somebody","examples":["Fear and excitement suddenly flowed over me.","He envied the affection that flowed between the boy and the old man."],"opposite":"","synonyms":""},{"def":"to hang loosely and freely","examples":["Her hair flowed down over her shoulders.","long flowing skirts","Her long hair flowed in the wind as she ran."],"opposite":"","synonyms":""},{"def":"to come in towards the land","examples":["The sea ebbed and flowed."],"opposite":"ebb","synonyms":""}],"idioms":[],"phrasal":["flow from"],"related":[]}]