[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/foc/focus/focus__us_1.mp3","phonsUS":"/ˈfəʊkəs/","level":"A2","meanings":[{"def":"to give attention, effort, etc. to one particular subject, situation or person rather than another","examples":["She was distracted and finding it hard to focus.","focus on/upon somebody/something The discussion focused on three main issues.","Each exercise focuses on a different grammar point.","focus + adv./prep. He had artistic interests but his teachers encouraged him to focus elsewhere.","The essay seems too narrowly focused.","focus something Music and crafts can help focus small children's energies.","focus something on/upon somebody/something The visit helped to focus world attention on the plight of the refugees.","(figurative) All eyes are focused on the presidential elections at the moment.","(figurative) The event will focus the spotlight on younger athletes.","focus something + adv./prep. We need to decide where to focus our efforts.","Come on, try to focus.","Children with ADHD find it difficult to focus and concentrate.","Degree courses have traditionally focused on the established great writers of the past.","They plan to divest declining businesses and focus on growth areas.","You might choose to focus on a particular aspect of the nineteenth century.","Meetings focused on the development of the curriculum.","He inevitably focused on his own concerns, with only a passing query about Jeff.","Much recent concern has been focused upon sea level rises.","The exhibition is focused primarily upon architecture.","The exhibition primarily focuses upon architecture.","Schools should not focus exclusively on exam results.","The department undertakes highly focused research.","The study was criticized for being too narrowly focused.","My own research is focused on classical traditions.","We have focused our resources on developing new products.","Think of some questions that will help focus the discussion.","This should help focus your attention.","I was finding it hard to focus my mind properly.","Perhaps your family is where you should focus your attention.","Where do you really wish to focus your time and energy?","Much of the debate was focused around the issue of inequality.","He made a promise to his father and is determined to live his entire life focused towards that goal.","A hate crime is abuse focused towards a specific person or group on grounds of race, religion, etc.","You need to focus closely on the matter at hand.","At the moment, aid agencies are focusing their efforts on women and children.","The attention of the news media was firmly focused on the elections.","Our activity is mainly focused on responding to emergencies."],"opposite":"","synonyms":""},{"def":"to adapt or be changed so that things can be seen clearly; to change something so that you can see things clearly","examples":["It took a few moments for her eyes to focus in the dark.","focus on somebody/something Let your eyes focus on objects that are further away from you.","In this scene, the camera focuses on the actor's face.","focus something ‘Look at me,’ he says, focusing the camera.","focus something on somebody/something He focused his blue eyes on her.","I quickly focused the camera on the children.","focus something + adv./prep. My gaze was focused elsewhere at the time.","She blinked and tried to focus.","The eye will automatically focus on the small group in the foreground.","She could feel his eyes focusing on her.","She could feel his eyes focused on her.","He struggled to focus his eyes in the dimness.","A newborn baby cannot focus its eyes.","My eyes are focused on the horizon.","Ten TV cameras were focused on the stage.","She likes to focus her camera on the unusual and the surreal.","So much of good film-making is just knowing where to focus your camera."],"opposite":"","synonyms":""},{"def":"to aim light onto a particular point using a lens","examples":["focus something A laser focuses a beam of light.","focus something on something She used her glasses to focus the sun's rays on the twigs and spark a fire."],"opposite":"","synonyms":""},{"def":"to shine on somebody/something","examples":["Suddenly a spotlight focused on us."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["focus group","soft focus","focus puller","focus groups","focus pullers","depth of focus"]},{"pos":"noun","level":"A2","meanings":[{"def":"the thing or person that people are most interested in; the act of paying special attention to something and making people interested in it","examples":["focus of something It was the main focus of attention at the meeting.","The primary focus of the book is practical teaching techniques.","He decided to make colour the central focus of his work.","focus for something His comments provided a focus for debate.","focus on something We shall maintain our focus on the needs of the customer.","In today's lecture the focus will be on tax structures within the European Union.","The incident brought the problem of violence in schools into sharp focus.","The film loses focus near the end.","He began to shift his focus towards writing for the theatre.","What we need now is a change of focus (= to look at things in a different way).","The article does not seem to have any clear focus.","Cities have always acted as the principal focus of political life.","His research interest is the environment, with a focus on the economics of climate change.","Let's take the focus off her personal life and look at what she's achieved.","I found the focus of the debate too narrow.","A narrow focus on profits neglects the human angle.","In her new book, she broadens her focus to include the entire history of Ireland.","I've directed my focus towards developing my skills.","Our primary focus this term will be on group work.","The company's main focus is cheese.","The film maintains an intense focus on the two central characters.","She became a focus for all his anger.","The focus has now shifted towards the problem of long-term unemployment.","The legal team tried to switch the focus onto the victim.","The problem with your plan is that it doesn't have a clear focus.","The question of compensation comes into focus.","The restructuring is designed to give a sharper focus on key markets.","We've lost focus on the real objective: to save lives.","The story loses focus a bit at the end.","He was restless and lacked focus.","We need to bring some discipline and focus to our efforts."],"opposite":"","synonyms":""},{"def":"a point or distance at which the outline of an object is clearly seen by the eye or through a lens","examples":["out of focus Some parts of the photograph are out of focus (= blurred rather than clearly seen).","into focus When I got glasses, suddenly the whole world came into focus.","in focus The binoculars were not in focus (= were not showing things clearly).","Her eyes lost focus and she fainted.","His photographs are badly out of focus.","The figure in the film comes in and out of focus.","He deliberately let his eyes go out of focus.","If you look at it for a while the image comes into focus.","Suddenly her face snaps into focus.","They're not very good photos, but at least they're in focus.","Try to get their faces in focus.","If you set the image to full screen you sometimes lose the focus.","He explains how to set up the camera and how to adjust the focus."],"opposite":"","synonyms":""},{"def":"a point at which waves of light, sound, etc. meet after reflection or refraction; the point from which waves of light, sound, etc. seem to come","examples":[],"opposite":"","synonyms":""},{"def":"the point at which an earthquake starts to happen","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]