[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fol/fold_/fold__us_1.mp3","phonsUS":"/fəʊld/","level":"B1","meanings":[{"def":"to bend something, especially paper or cloth, so that one part lies on top of another part","examples":["fold something First, fold the paper in half/in two.","The bird folded its wings.","a pile of neatly folded clothes","fold something up He folded the map up and put it in his pocket.","fold something down The blankets had been folded down.","fold something back Don't fold back pages to mark your place in a book.","fold something over Fold the dough over on top of itself.","He carefully folded the typed sheets and replaced them in the envelope.","I folded up the clothes and put them away."],"opposite":"unfold","synonyms":""},{"def":"to bend something so that it becomes smaller or flatter and can be stored or carried more easily; to bend or be able to bend in this way","examples":["fold something away The bed can be folded away during the day.","fold something down The central back seat can be folded down to provide a useful tray.","fold something up She folds up the wheelchair and stows it in the trunk.","fold up The table folds up when not in use.","fold away The table folds away when not in use.","fold down a TV screen that folds down from the ceiling","fold out The settee folds out into a comfortable bed.","+ adj. The ironing board folds flat for easy storage.","(figurative) When she heard the news, her legs just folded under her (= she fell)."],"opposite":"","synonyms":""},{"def":"to wrap something around somebody/something","examples":["fold A in B She gently folded the baby in a blanket.","fold B around/round/over A She folded a blanket around the baby."],"opposite":"","synonyms":""},{"def":"to close because it is not successful","examples":["The new musical folded after only twenty performances.","Her fan club has folded.","His business folded and his wife left him."],"opposite":"","synonyms":""},{"def":"to put one of your arms over the other one and hold them against your body","examples":["He stood watching her with his arms folded across his chest.","She folded her arms and stared at him."],"opposite":"","synonyms":""},{"def":"to bring or hold your hands together","examples":["She kept her hands folded in her lap."],"opposite":"","synonyms":""},{"def":"to put your arms around somebody and hold them against your body","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"fold your arms","def":"to put one of your arms over the other one and hold them against your body","examples":["He stood watching her with his arms folded across his chest.","She folded her arms and stared at him."]},{"idiom":"fold your hands","def":"to bring or hold your hands together","examples":["She kept her hands folded in her lap."]},{"idiom":"fold somebody in your arms","def":"to put your arms around somebody and hold them against your body","examples":[]}],"phrasal":["fold in","fold into"],"related":["-fold","fold in","fold-out","fold-up","fold into","above-the-fold","below-the-fold","the fold","fold something","fold your arms","above/below the fold","fold somebody in your arms"]},{"pos":"suffix","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/_/_fo/_fold/_fold_1_us_1.mp3","level":"","meanings":[{"def":"multiplied by; having the number of parts mentioned","examples":["to increase tenfold"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"B2","meanings":[{"def":"a part of something, especially cloth, that is folded or hangs as if it had been folded","examples":["the folds of her dress","loose folds of skin","She hid the note in a fold in her robe.","The fabric fell in soft folds.","the heavy folds of his cloak"],"opposite":"","synonyms":""},{"def":"a mark or line made by folding something, or showing where something should be folded","examples":["Why is the place I want to find always on the fold of the map?"],"opposite":"","synonyms":""},{"def":"an area in a field surrounded by a fence or wall where animals, especially sheep, are kept for safety","examples":[],"opposite":"","synonyms":""},{"def":"a group of people who share the same ideas or beliefs","examples":["He called on former Republican voters to return to the fold.","She was determined to draw Matthew back into the family fold.","The country is now firmly back in the international fold.","She understood it would be a tough fight to bring the seat back into the Democratic party fold.","Many Protestants feared King Charles wanted to restore England to the Catholic fold."],"opposite":"","synonyms":""},{"def":"a curve or bend in the line of the layers of rock in the earth’s crust","examples":[],"opposite":"","synonyms":""},{"def":"a hollow place among hills or mountains","examples":["It was a solitary spot in a fold between two hills.","a fold in the land","The troops were hidden by the deep folds of the ground."],"opposite":"","synonyms":""},{"def":"in/not in a position where you see it first, for example in the top/bottom part of a newspaper page or web page","examples":["Your ad will be placed above the fold for prominent exposure.","The images all appeared below the fold."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"above/below the fold","def":"in/not in a position where you see it first, for example in the top/bottom part of a newspaper page or web page","examples":["Your ad will be placed above the fold for prominent exposure.","The images all appeared below the fold."]}],"phrasal":[],"related":[]}]