[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fol/follo/following__us_1.mp3","phonsUS":"/ˈfɑːləʊɪŋ/","level":"A2","meanings":[{"def":"that is/are going to be mentioned next","examples":["Answer the following questions.","The following article was written in 2017.","This study has the following aims: first, to investigate how international students in the UK use humour; second, to examine how jokes can help to establish social relationships; and third, to explore the role that humour plays in helping overseas students adjust to life in the UK.","Let us begin by identifying some of the popular joke genres in the UK.","Next, let us turn to/Next, let us consider the question of gender differences in the use of humour.","Finally/Lastly, let us briefly examine the role of humour in defining a nation’s culture."],"opposite":"","synonyms":""},{"def":"next in time","examples":["the following afternoon/month/year/week","They arrived on Monday evening and we got there the following day.","In the following nights, Lucy slept poorly."],"opposite":"","synonyms":""},{"def":"a wind blowing in the same direction as a ship or other vehicle that helps it move faster","examples":["With a generous following wind, we sped across the lake.","(figurative) With a bit of luck and a following wind, the project will be completed on schedule."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a following wind","def":"a wind blowing in the same direction as a ship or other vehicle that helps it move faster","examples":["With a generous following wind, we sped across the lake.","(figurative) With a bit of luck and a following wind, the project will be completed on schedule."]}],"phrasal":[],"related":["the following"]},{"pos":"noun","level":"B1","meanings":[{"def":"the thing or things that you will mention next; the person or people that you will mention next","examples":["The following is a summary of events.","The following have been chosen to take part: Watts, Hodges and Lennox.","Your report must include the following: the artist's name and the title of the song."],"opposite":"","synonyms":""},{"def":"a group of supporters","examples":["The band has a huge following in Italy.","to attract a loyal/devoted following","following among somebody The series enjoys a cult following among young people.","Top of the range Scotches attract a fanatical following among whisky buffs.","The programme has gained a loyal following among teachers."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"preposition","level":"B2","meanings":[{"def":"after or as a result of a particular event","examples":["He took charge of the family business following his father's death."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]