[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fol/follo/follow__us_1.mp3","phonsUS":"/ˈfɑːləʊ/","level":"A1","meanings":[{"def":"to come or go after or behind somebody/something","examples":["follow somebody/something Follow me please.","follow somebody + adv./prep. He followed her into the house.","They were followed down the street by a bunch of photographers.","Wherever she led, they followed.","Sam walked in, with the rest of the boys following closely behind.","The dog followed obediently at her heels.","Follow me please. I'll show you the way.","She followed blindly, stumbling over stones in her path.","She beckoned him to follow her.","Johnson finished first, closely followed by Stevens and Higgins.","As Jackie walked up the aisle, her mother followed close behind."],"opposite":"","synonyms":""},{"def":"to come or go after or behind somebody in order to watch where they go and what they do","examples":["I think we're being followed.","Police followed the car along Station Road where it mounted the kerb again.","As she walked home, she had the feeling she was being followed."],"opposite":"","synonyms":""},{"def":"to come after something/somebody else in time or order; to happen as a result of something else","examples":["follow (something/somebody) I remember little of the days that followed the accident.","A period of unrest followed the president's resignation.","The first two classes are followed by a break of ten minutes.","The main course was followed by fresh fruit.","to follow I'll have soup and fish to follow.","A detailed news report will follow shortly.","There follows… There followed a short silence.","as follows… The opening hours are as follows…","follow on from something A new proposal followed on from the discussions.","the workers' revolts that followed in the wake of the student uprising","The first mailing was followed by a postcard reminder to all who received the survey.","Periods of great creativity were followed by years in which he composed nothing.","Edward was followed in 1553 by Elizabeth's Catholic half-sister Mary."],"opposite":"","synonyms":""},{"def":"to do something after something else","examples":["follow something with something Give your contact details and follow this with a brief profile of yourself.","follow something up with something They follow up their March show with four UK dates next month.","Follow your treatment with plenty of rest.","He followed these novels with three volumes of autobiography."],"opposite":"","synonyms":""},{"def":"to accept advice, instructions, etc. and do what you have been told or shown to do","examples":["to follow rules/procedures/guidelines","They said they were just following orders.","He has trouble following simple instructions.","Why didn't you follow my advice?","Turn right and follow signs to Dundee.","I never follow a recipe completely.","He followed a strict diet.","Follow the instructions very carefully.","I didn't really follow the recipe.","Read the label and follow the directions for use.","Leave the M4 at junction 11, then follow the signs.","When we tried to follow a sign directing us right into Greater Bridgewater Street, we found the road was closed."],"opposite":"","synonyms":""},{"def":"to accept somebody/something as a guide, a leader or an example; to copy somebody/something","examples":["follow (somebody/something) I encourage others to follow our example.","The Senate is expected to follow the lead of the House.","We believe it is in our best interests to follow the path of economic openness and growth.","The movie follows the book faithfully.","They followed the teachings of Buddha.","He always followed the latest fashions (= dressed in fashionable clothes).","Where one airline leads, others follow.","follow somebody into something Laura followed her mother into the medical profession (= became a doctor like her mother).","Banks are expected to follow the building societies in raising mortgage rates.","It wasn't in his nature to follow blindly.","How do your feel your writing follows in the tradition of the South?","slavishly following the views of his teachers","I don't want you to follow my example and rush into marriage.","Following the example of Barcelona, greater emphasis is now given to public spaces.","He ordered a glass of champagne, and we followed his lead.","He leads by example and the others follow.","Marc is following a path laid down by his father."],"opposite":"","synonyms":""},{"def":"to click on a link in a website","examples":["Follow the links to sign up for the webinar."],"opposite":"","synonyms":""},{"def":"to go along a road, path, etc.","examples":["Follow this road until you get to the school, then turn left."],"opposite":"","synonyms":""},{"def":"to go in the same direction as something or parallel to something","examples":["The lane follows the edge of a wood for about a mile."],"opposite":"","synonyms":""},{"def":"to be the logical result of something","examples":["follow from something I don't see how that follows from what you've just said.","follow on from something Several conclusions follow on from his statement.","it follows that… If a = b and b = c it follows that a = c.","It does not necessarily follow that sleep loss would cause these symptoms."],"opposite":"","synonyms":""},{"def":"to understand an explanation or the meaning of something","examples":["Sorry, I don't follow.","follow somebody Do you follow me?","follow something I couldn't really follow his argument.","The plot is almost impossible to follow.","to be easy/difficult/hard to follow","Sorry, I don't follow you.","His argument was difficult to follow.","I don’t understand the instructions.","Doctors still don’t understand much about the disease.","‘It opens like this.’ ‘Oh, I see.’","Oh yes, I see what you mean.","She didn’t get the joke.","I don’t get you.","Sorry—I don’t quite follow.","The plot is almost impossible to follow.","They failed to grasp the importance of his words.","The concept of infinity is almost impossible for the human mind to comprehend."],"opposite":"","synonyms":"understand"},{"def":"to watch or listen to somebody/something very carefully","examples":["The children were following every word of the story intently.","Her eyes followed him everywhere (= she was looking at him all the time)."],"opposite":"","synonyms":""},{"def":"to take an active interest in something and be aware of what is happening; to support a sports team","examples":["We've been following this story for months.","Have you been following the basketball championships?","Millions of people followed the trial on TV.","In his leisure time he follows West Ham United.","They say it takes dedication to follow a football team week-in, week-out for eight months of the season.","Will this be a big shock to people who follow events closely in Washington?"],"opposite":"","synonyms":""},{"def":"to choose to regularly receive messages from a person, company, etc. using a social media service","examples":["I don’t follow many celebrities on Twitter any more."],"opposite":"","synonyms":""},{"def":"to be about the life or development of somebody/something","examples":["The novel follows the fortunes of a village community in Scotland."],"opposite":"","synonyms":""},{"def":"to develop or happen in a particular way","examples":["The day followed the usual pattern."],"opposite":"","synonyms":""},{"def":"to do the same job, have the same style of life, etc. as somebody else, especially somebody in your family","examples":["She works in television, following in her father's footsteps.","He wanted to follow in his mother's footsteps and be a ballroom dancer."],"opposite":"","synonyms":""},{"def":"to be guided by your sense of smell","examples":[],"opposite":"","synonyms":""},{"def":"to go straight forward","examples":["The garage is a mile ahead up the hill—just follow your nose."],"opposite":"","synonyms":""},{"def":"to act according to what seems right or reasonable, rather than following any particular rules","examples":[],"opposite":"","synonyms":""},{"def":"to play a card of the same suit that has just been played","examples":[],"opposite":"","synonyms":""},{"def":"to act or behave in the way that somebody else has just done","examples":[],"opposite":"","synonyms":""},{"def":"a person or event that is so good or successful at something that it will be difficult for anyone/anything else coming after them to be as good or successful","examples":["She has been an excellent principal and will be a hard act to follow.","Their contribution will prove a tough act to follow."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"follow in somebody’s footsteps","def":"to do the same job, have the same style of life, etc. as somebody else, especially somebody in your family","examples":["She works in television, following in her father's footsteps.","He wanted to follow in his mother's footsteps and be a ballroom dancer."]},{"idiom":"follow your nose","def":"to be guided by your sense of smell","examples":["The garage is a mile ahead up the hill—just follow your nose."]},{"idiom":"follow suit","def":"to play a card of the same suit that has just been played","examples":[]},{"idiom":"a hard/tough act to follow","def":"a person or event that is so good or successful at something that it will be difficult for anyone/anything else coming after them to be as good or successful","examples":["She has been an excellent principal and will be a hard act to follow.","Their contribution will prove a tough act to follow."]}],"phrasal":["follow about","follow around","follow on","follow on from","follow through","follow up"],"related":["follow on","follow-on","follow up","follow-up","follow about","follow around","follow on from","follow through","follow-through","follow-my-leader","follow-the-leader","follow-ons","follow-ups","follow somebody around","follow somebody about"]}]