[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/foo/food_/food__us_1.mp3","phonsUS":"/fuːd/","level":"A1","meanings":[{"def":"things that people or animals eat","examples":["Pat had prepared food and drink for the work party.","to grow/cook/serve/eat food","Do you like Italian food?","Demand for organic food has been growing fast.","Families that eat together consume healthier food.","the food industry","People worry about food safety (= if food is safe to eat).","steps to protect the nation's food supply","Global food shortages and crop failures would have a devastating effect.","baby food (= prepared especially for babies)","cat/dog/pet food (= for a cat/dog/pet to eat)","You should eat more fresh foods.","The store specializes in frozen foods.","After three days without food, the men were close to starvation.","Always take great care when handling food.","Bears store food for the winter.","Blend the egg yolks, lemon juice and herbs in a food processor.","Does the food taste good?","EU food policy","Essential oils can be bought from most good health food shops","Everyone has the right to adequate food and clean water.","Farmers are not producing enough food for the country's growing population.","Food and water were running out.","Food is short here, and people go hungry.","Fruit is an important food source for bats.","Gina had prepared food and drink for the work party.","He obviously enjoys good food.","He put out food for the birds.","His doctor warned him to reduce his daily food intake.","I am trying to cut my weekly food bill by one third.","Keep food fresher for longer with our new sealable containers.","Lack of proper food led to much illness among seamen.","Most mammals use their sense of smell to find food.","Peasants were encouraged to grow basic food crops such as beans and corn.","Plankton is at the bottom of the marine food chain.","Please cut up the food for your baby sister.","She fed her baby on wholesome food.","She had had no food for two days.","She told the kids not to gulp down their food.","Stop playing with your food like a baby!","Taste the food and tell me what you think.","Thanks to international aid, the town had been supplied with food for nine months.","The UN has been issuing emergency food supplies to the refugees.","The centre offers food and accommodation for students.","The city was under siege and began to run short of food.","The country intends to increase its share of the European food market.","The female eagle broods and the male hunts for food.","The fish market is a ready food supply for seabirds.","There has been a food scare over salmonella in eggs.","There was a smell of food from the kitchen","They sat down at the restaurant table and immediately ordered their food.","Who's doing the food for the party?","a restaurant that serves good healthy food","animals that are killed for food","the amount of food that an average family consumes in a week","the food court at the shopping mall","Food shortages have led to famine in many parts of the country.","Healthy food can and should be delicious","Ice cream is my comfort food of choice.","shortages of food","Britain's first organic food market","the characteristic taste of our food","The Dordogne region is famous for its food and wine.","It's is important to get plenty of exercise and to eat the right foods.","Avoid rich foods like pastries.","Campaigners are challenging the safety of genetically-modified foods.","Retail prices of staple foods remain unchanged.","She is trying to cut down on fatty foods.","Try to eat a variety of foods that contain protein.","lower fat alternatives to everyday foods"],"opposite":"","synonyms":""},{"def":"an idea that makes you think seriously and carefully","examples":["The programme certainly provides plenty of food for thought."],"opposite":"","synonyms":""},{"def":"not wanting to eat anything","examples":["He's been off his food all week."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"food for thought","def":"an idea that makes you think seriously and carefully","examples":["The programme certainly provides plenty of food for thought."]},{"idiom":"off your food","def":"not wanting to eat anything","examples":["He's been off his food all week."]}],"phrasal":[],"related":["food web","fast food","food bank","food hall","food mile","junk food","slow food","soul food","finger food","food chain","food court","food group","food pantry","food stamp","health food","comfort food","food science","food security","convenience food","food insecurity"]}]