[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/foo/footb/football__us_4.mp3","phonsUS":"/ˈfʊtbɔːl/","level":"A1","meanings":[{"def":"a game played by two teams of 11 players, using a round ball that players kick up and down the playing field. Teams try to kick the ball into the other team’s goal.","examples":["The kids were outside playing football.","The team played some impressive football.","We settled down to watch the football on TV.","On Saturday we went to a football match.","a Premier League football team","a football player","I'm not a big football fan.","This was the best game of football I have seen all season.","Young Italians follow football like we follow the royal family.","Join Radio 5 for all the top football action.","Obscene football chants stop people taking their children to matches.","The Dutch team impressed the fans with their classy one-touch football.","The World Cup is fascinating for its clash of football cultures.","The football world was rocked by the scandal.","The government is trying to tackle violence on the football terraces.","The police say the players' behaviour is a matter for the football authorities."],"opposite":"","synonyms":""},{"def":"a game played by two teams of 11 players, using an oval ball which players kick, throw, or carry. Teams try to put the ball over the other team’s line.","examples":["He played football for Iowa State University.","We often go to football games together.","a football player/coach","a football field/stadium"],"opposite":"","synonyms":""},{"def":"a form of football played in Canada, similar to American football, but with twelve players on each team","examples":[],"opposite":"","synonyms":""},{"def":"a large round or oval ball made of leather or plastic and filled with air","examples":["As a child he was always kicking a football."],"opposite":"","synonyms":""},{"def":"an issue or a problem that frequently causes people to disagree or argue","examples":["Healthcare should not become a political football."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["flag football","football boot","American football","Canadian football","fantasy football","football pools","Gaelic football","table football","touch football","Association football","Football League","Monday Night Football","Football Association","National Football League","American Football Conference","National Football Conference","Scottish Professional Football League","football club"]}]