[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/for/force/force__us_1.mp3","phonsUS":"/fɔːrs/","level":"B1","meanings":[{"def":"violent physical action used to obtain or achieve something","examples":["The release of the hostages could not be achieved without the use of force.","If persuasion doesn't work, they use force.","The government has relied on brute force to respond to public discontent.","by force The rioters were taken away by force.","The empire was held together by military force.","plans to seize power by force of arms (= by military force)","The regulations allow the use of force if necessary.","The country's attempts to meet force with force led to the outbreak of war.","Police were accused of using excessive force.","The ultimatum contained the threat of military force.","We will achieve much more by persuasion than by brute force."],"opposite":"","synonyms":""},{"def":"physical strength, especially as shown when something hits something else","examples":["the force of the explosion/impact","The shopping centre took the full force of the blast.","You have to apply some force to move the lever.","with force She hits the ball with amazing force for someone so small.","He staggered backwards from the force of the blow.","The force of the explosion hurled bodies into the air.","The waves were breaking against the rocks with great force.","A thick wall shielded us from the force of the wind."],"opposite":"","synonyms":""},{"def":"the strong effect or influence of something","examples":["They realized the force of her argument.","a leader who inspired others with the force of his personality","by force of something He controlled himself by sheer force of will.","with force Grant drove the point home with considerable force.","She spoke with force and deliberation.","I felt the full force of her criticism.","She used her sheer force of personality to keep the family together.","Suddenly it came home to me with tremendous force that this was my last chance.","The emotional force of the songs derives from their universal themes."],"opposite":"","synonyms":""},{"def":"a person or thing that has a lot of power or influence","examples":["the forces of good/evil","They believe that market forces should determine prices.","Ron is the driving force (= the person who has the most influence) behind the project.","She's a force to be reckoned with (= a person who has a lot of power and influence and should therefore be treated seriously).","a force for something a force for good/evil","The expansion of higher education should be a powerful force for change.","He was finally defeated by forces beyond his control.","Social media has become a major force in political campaigns.","The idea of the West remains a powerful force in American culture.","She was seen as a potentially disruptive force within the party.","The play portrays a marriage torn apart by external forces.","Though officially retired, she remains the creative force behind the design business.","Many social and economic forces contributed to this trend.","the combined forces of MI5 and Scotland Yard"],"opposite":"","synonyms":""},{"def":"the authority of something","examples":["The court ruled that these standards have force in English law.","The contract was not signed and has no binding force.","the force of something These guidelines do not have the force of law.","The culprits must expect to face the full force of the law."],"opposite":"","synonyms":""},{"def":"a group of people who have been organized for a particular purpose","examples":["a member of the sales force","She has attracted a force of passionate young individuals who are committed to the organization."],"opposite":"","synonyms":""},{"def":"a trained and organized group of police, soldiers or other military personnel","examples":["Rebel forces now control most of the capital.","Government forces captured the rebel positions.","coalition/allied forces","a peacekeeping force","He called on the local population to rise up against the occupying forces.","American special forces pride themselves on their elite status.","The government deployed military forces to attack terrorist strongholds.","The British were ordered to withdraw their forces immediately.","Allied ground forces would move in rapidly.","Allied forces were able to advance to the capital.","a token force of only 300 men","These elite forces are the best equipped and trained in the world.","UN forces operating in the region","More troops have been called in to support the coalition forces there.","a UN deadline for the withdrawal of forces","A large expeditionary force was assembled."],"opposite":"","synonyms":""},{"def":"the army, navy and air force","examples":["life in the forces","Daisy intends to join the forces when she leaves school this summer."],"opposite":"","synonyms":""},{"def":"the weapons and soldiers that an army, etc. has, considered as things that may be used","examples":["strategic nuclear forces.","The government is negotiating cuts to nuclear forces."],"opposite":"","synonyms":""},{"def":"the police force","examples":["He joined the force twenty years ago."],"opposite":"","synonyms":""},{"def":"an effect that causes things to move in a particular way","examples":["The moon exerts a force on the earth.","the force of gravity","the sun's magnetic force","Because of the increased mass, more force is needed to accelerate the object.","Deep internal forces cause movements of the earth's crust.","The forces of expansion are balanced by forces of contraction.","lateral forces acting on the car's suspension","the attractive and repulsive forces between individual particles"],"opposite":"","synonyms":""},{"def":"a unit for measuring the strength of the wind on the Beaufort scale","examples":["a force 9 gale","a gale force wind","The wind was increasing to gale force.","hurricane-force winds"],"opposite":"","synonyms":""},{"def":"to cause a law, rule, etc. to start being used","examples":["They are hoping to bring the new legislation into force before the end of the year."],"opposite":"","synonyms":""},{"def":"to start being used","examples":["When do the new regulations come into force?","The new law comes into force as from midnight tomorrow."],"opposite":"","synonyms":""},{"def":"if you do something from or out of force of habit, you do it without thinking about it and in a particular way because you have always done it that way in the past","examples":["It's force of habit that gets me out of bed at 6.15 each morning."],"opposite":"","synonyms":""},{"def":"a person with a very strong personality who is full of energy, very determined and difficult for others to resist","examples":["Gerard is a force of nature, continually pursuing his target when everyone else is ready to give up."],"opposite":"","synonyms":""},{"def":"the power of the wind, rain, etc., especially when it causes damage or harm","examples":["They were fighting a losing battle against the forces of nature."],"opposite":"","synonyms":""},{"def":"in large numbers","examples":["Protesters turned out in force."],"opposite":"","synonyms":""},{"def":"being used","examples":["The new regulations are now in force.","Several archaic laws are still in force.","Some laws relating to obsolete customs are still in force."],"opposite":"","synonyms":""},{"def":"to work together in order to achieve a shared aim","examples":["The two firms joined forces to win the contract.","The two companies have joined forces to form a new consortium."],"opposite":"","synonyms":""},{"def":"a person or group that no longer has any power or influence","examples":["The opposition party is now a spent political force."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"bring something into force","def":"to cause a law, rule, etc. to start being used","examples":["They are hoping to bring the new legislation into force before the end of the year."]},{"idiom":"come/enter into force","def":"to start being used","examples":["When do the new regulations come into force?","The new law comes into force as from midnight tomorrow."]},{"idiom":"force of habit","def":"if you do something from or out of force of habit, you do it without thinking about it and in a particular way because you have always done it that way in the past","examples":["It's force of habit that gets me out of bed at 6.15 each morning."]},{"idiom":"a force of nature","def":"a person with a very strong personality who is full of energy, very determined and difficult for others to resist","examples":["Gerard is a force of nature, continually pursuing his target when everyone else is ready to give up."]},{"idiom":"the forces of nature","def":"the power of the wind, rain, etc., especially when it causes damage or harm","examples":["They were fighting a losing battle against the forces of nature."]},{"idiom":"in force","def":"in large numbers","examples":["Protesters turned out in force.","The new regulations are now in force.","Several archaic laws are still in force.","Some laws relating to obsolete customs are still in force."]},{"idiom":"join/combine forces (with somebody)","def":"to work together in order to achieve a shared aim","examples":["The two firms joined forces to win the contract.","The two companies have joined forces to form a new consortium."]},{"idiom":"a spent force","def":"a person or group that no longer has any power or influence","examples":["The opposition party is now a spent political force."]}],"phrasal":[],"related":["force on","air force","force-out","Delta Force","force back","force down","force-feed","force field","force play","force upon","life force","task force","weak force","force majeure","labour force","police force","strike force","strong force","Air Force One"]},{"pos":"verb","level":"B1","meanings":[{"def":"to make somebody do something that they do not want to do","examples":["be forced into doing something The President was forced into resigning.","be forced to do something The President was forced to resign.","I was forced to take a taxi because the last bus had left.","Massoud was forced to flee for his life.","force somebody/yourself to do something She forced herself to be polite to them.","be forced into something He was forced into exile with his family.","force somebody into something Ill health forced him into early retirement.","be forced out of something Residents were forced out of their homes.","force somebody out of something The high cost of insurance is forcing some out of business.","force somebody He didn't force me—I wanted to go.","force yourself (informal, humorous) ‘I shouldn't really have any more.’ ‘Go on—force yourself!’","force something Public pressure eventually forced a change in the government's position.","young girls who are forced into marriage","In 1919 his family was forced to leave Russia because of the Revolution.","He has been forced to admit that he lied.","The uprising forced the government to be less authoritarian.","Companies are forced to make decisions based on resource allocation.","Injury forced her to retire from the game.","He's really just an ordinary guy forced by circumstance to confront the evil that lurks within many of us."],"opposite":"","synonyms":""},{"def":"to use physical strength to move somebody/something into a particular position","examples":["force something to force a lock/window/door (= to break it open using force)","Someone had tried to force (an) entry (= to enter the building using force).","force something + adv./prep. She forced her way through the crowd of reporters.","He tried to force a copy of his book into my hand.","force something + adj. The door had been forced open.","After waiting for some minutes they decided to force the door.","We had to force the lock.","He forced the lid of his suitcase shut.","I managed to force him backwards."],"opposite":"","synonyms":""},{"def":"to make something happen, especially before other people are ready","examples":["force something He was in a position where he had to force a decision.","force something + adv./prep. Building a new road here will force house prices down."],"opposite":"","synonyms":""},{"def":"to make yourself smile, laugh, etc. rather than doing it naturally","examples":["She managed to force a smile."],"opposite":"","synonyms":""},{"def":"to make fruit, plants, etc. grow or develop faster than normal by keeping them in special conditions","examples":["forced rhubarb","(figurative) It is unwise to force a child's talent."],"opposite":"","synonyms":""},{"def":"to try to force somebody to listen to and accept your opinions in a way that they find annoying","examples":["People are sick of having advertising rammed down their throats."],"opposite":"","synonyms":""},{"def":"to make somebody do something that they do not want to do or make them do it sooner than they had intended","examples":["They decided to strike to force the management’s hand."],"opposite":"","synonyms":""},{"def":"to do something to make people take a decision quickly","examples":[],"opposite":"","synonyms":""},{"def":"to run very fast in a race in order to make the other people taking part run faster","examples":[],"opposite":"","synonyms":""},{"def":"to make somebody do something faster than they want to","examples":["The demonstrations have succeeded in forcing the pace of change."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"force/thrust/ram something down somebody’s throat","def":"to try to force somebody to listen to and accept your opinions in a way that they find annoying","examples":["People are sick of having advertising rammed down their throats."]},{"idiom":"force somebody’s hand","def":"to make somebody do something that they do not want to do or make them do it sooner than they had intended","examples":["They decided to strike to force the management’s hand."]},{"idiom":"force the issue","def":"to do something to make people take a decision quickly","examples":[]},{"idiom":"force the pace","def":"to run very fast in a race in order to make the other people taking part run faster","examples":["The demonstrations have succeeded in forcing the pace of change."]}],"phrasal":["force back","force down","force on","force out of","force upon"],"related":[]}]