[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/for/forec/forecast__us_1.mp3","phonsUS":"/ˈfɔːrkæst/","level":"B2","meanings":[{"def":"a statement about what will happen in the future, based on information that is available now","examples":["The sales forecasts are encouraging.","It is difficult to make long-term forecasts for a fast-growing industry.","The forecast said there would be sunny intervals and showers.","The shipping forecast gave warnings of gales.","Forecasts about the economy are often misleading.","Some forecasts suggest that the increase in heart disease will continue for some time.","The government has issued a pessimistic economic forecast.","The interest rate is in line with the forecast.","This week the company is expected to raise its revenue forecast.","a short-term forecast of the UK economy","It is too early to make firm forecasts about demand."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["shipping forecast","weather forecast"]},{"pos":"verb","level":"B2","meanings":[{"def":"to say what you think will happen in the future based on information that you have now","examples":["forecast something Experts are forecasting a recovery in the economy.","Snow is forecast for tomorrow.","It is difficult to forecast the demand for the new train service.","forecast something to do something Temperatures were forecast to reach 40°C.","forecast that… The report forecasts that prices will rise by 3% next month.","forecast how, what, etc… It is difficult to forecast how the markets will react.","By 2050, one in six people on the planet will be aged 65 or over.","The number of people globally aged 65 and over is expected/likely to more than double by 2050.","Experts have predicted/forecast that the over-65s will make up 17 per cent of the global population by 2050.","World population is set to reach 9.8 billion by 2050.","Net migration into Britain over the last decade was higher than expected.","Overall population growth in Britain has been in line with predictions.","a result that was widely forecast","higher costs than those originally forecast"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]