[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/for/fork_/fork__us_1.mp3","phonsUS":"/fɔːrk/","level":"A2","meanings":[{"def":"a tool with a handle and three or four sharp points (called prongs), used for picking up and eating food","examples":["to eat with a knife and fork","with a fork Mash the mixture with a fork.","He put the knives and forks on the table.","She impaled a piece of meat on her fork."],"opposite":"","synonyms":""},{"def":"a garden tool with a long or short handle and three or four sharp metal points, used for digging","examples":[],"opposite":"","synonyms":""},{"def":"a place where a road, river, etc. divides into two parts; either of these two parts","examples":["Take the right fork.","Shortly before dusk they reached a fork and took the left-hand track.","fork in something Bear left at the fork in the road."],"opposite":"","synonyms":""},{"def":"a thing that is like a fork in shape, with two or more long parts","examples":["a jagged fork of lightning","a monkey sitting in the fork of the tree"],"opposite":"","synonyms":""},{"def":"either of two metal supporting pieces into which a wheel on a bicycle or motorcycle is fitted","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["fork out","tuning fork","toasting fork","fork out (for something) | fork out something (for something)","fork out (for something) | fork out something (on something)"]},{"pos":"verb","level":"","meanings":[{"def":"to divide into two parts that lead in different directions","examples":["The path forks at the bottom of the hill.","The road forks right after the bridge."],"opposite":"","synonyms":""},{"def":"to turn left or right where a road, etc. divides into two","examples":["Fork right after the bridge."],"opposite":"","synonyms":""},{"def":"to move, carry or dig something using a fork","examples":["Clear the soil of weeds and fork in plenty of compost.","He forked a piece of meat into his mouth.","Fork over the ground before planting."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["fork out"],"related":[]}]