[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/for/forma/formal__us_1.mp3","phonsUS":"/ˈfɔːrml/","level":"A2","meanings":[{"def":"very correct and suitable for official or important occasions","examples":["ladies in formal evening wear","The dinner was a formal affair.","He kept the tone of the letter formal and businesslike.","His manner was stiffly formal.","Her words sounded oddly formal.","The greeting was polite, almost formal.","He insisted on formal dress for dinner.","Howard has a rather formal way of speaking.","In those days, tutors were formal and distant.","She has a very formal manner, which can seem unfriendly."],"opposite":"informal","synonyms":""},{"def":"official; following an agreed or official way of doing things","examples":["formal legal processes","to make a formal complaint","There has been no formal announcement of her resignation yet.","There followed a formal request for military aid.","Formal diplomatic relations between the two countries were re-established in December.","It is time to put these arrangements on a slightly more formal basis.","On receipt of a formal complaint the inspectorate is required to investigate.","Once the loan has been approved we'll send a formal agreement for you to sign.","The government has lodged a formal diplomatic protest about the decision.","The organization is not a formal political party.","The two governments announced their formal acceptance of the scheme."],"opposite":"","synonyms":""},{"def":"received in a school, college or university, with lessons, exams, etc., rather than gained just through practical experience","examples":["He has no formal teaching qualifications.","Young children are beginning their formal education as early as four years old.","Inness received little formal artistic training."],"opposite":"","synonyms":""},{"def":"connected with the way something is done rather than what is done","examples":["Getting approval for the plan is a purely formal matter; nobody will seriously oppose it.","The monarch retains largely formal duties.","Critics have concentrated too much on the formal elements of her poetry, without really looking at what it is saying."],"opposite":"","synonyms":""},{"def":"arranged in a regular manner, according to a clear, exact plan","examples":["delightful formal gardens, with terraced lawns and an avenue of trees","Large French doors on the first floor open out onto a formal garden."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]