[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/for/form_/form__us_1.mp3","phonsUS":"/fɔːrm/","level":"A1","meanings":[{"def":"a type or variety of something","examples":["all the millions of different life forms on the planet today","form of something forms of transport/government/entertainment","one of the most common forms of cancer","Swimming is one of the best forms of exercise.","Along with talking and singing, drawing must be the oldest form of communication.","There are various forms of transport available.","We need to look for an alternative form of energy.","In its purest form, the substance is highly explosive.","Strikes are the most common form of industrial protest.","a virulent form of flu","an early form of bicycle","an extreme form of socialism","various forms of surveillance","one of the most primitive forms of life on earth","Theirs is an extreme form of religious fundamentalism."],"opposite":"","synonyms":""},{"def":"a way of writing or saying a word that shows, for example, if it is plural or in a particular tense","examples":["the infinitive form of the verb"],"opposite":"","synonyms":""},{"def":"the particular way something is, seems, looks or is presented","examples":["The disease can take several different forms.","The training programme takes the form of a series of workshops.","We need to come to some form of agreement.","in the form of somebody/something Help in the form of money will be very welcome.","Help arrived in the form of two police officers.","in… form Most political questions involve morality in some form or other.","We prefer applications in electronic form.","Many collections of his cartoons appeared in book form.","Success can come in many forms.","I'm opposed to censorship in any shape or form.","The document was edited before being circulated in its final form.","The results of the survey are shown below in tabular form.","These costs were passed on to the tenants in the form of higher rents.","The company will not tolerate discrimination in any shape or form.","The data is stored in digital form."],"opposite":"","synonyms":""},{"def":"an official document containing questions and spaces for answers","examples":["an application/entry/order form","(especially British English) to fill in a form","(especially North American English) to fill out a form","I filled in/out a form on their website.","to complete a form","We asked them to read and sign consent forms.","(British English) a booking form","(North American English) a reservation form","Please complete the application form and return it to us.","Please fill out the online form on our website.","Do you have your booking form?","I had to fill in several order forms.","The form asks for details of all previous addresses.","There were a lot of official forms to fill out.","This is a standard form sent to all applicants.","It was a long and complicated form."],"opposite":"","synonyms":""},{"def":"the shape of somebody/something; a person or thing of which only the shape can be seen","examples":["The human form has changed little over the last 30 000 years.","Two weeks later the moth will emerge in its adult form.","They made out a shadowy form in front of them.","a god who could take on human form","a mythical creature that could change its form","Her slender form and graceful movements entranced him."],"opposite":"","synonyms":""},{"def":"the arrangement of parts in a whole, especially in a work of art or piece of writing","examples":["Shape and form are of greater importance to me than colour.","In a novel, form and content are equally important.","the structure of the building/​human body","the social structure of society","the grammatical structures of a language","a salary structure","The report provides a framework for further research.","As a photographer, shape and form were more important to him than colour.","recent changes in the composition of the workforce","ships of steel construction","This is a trend which threatens the very fabric of society.","Henry James is considered to be a master of literary form.","The form of the poem is of great significance.","What is the relationship between form and meaning in the painting?"],"opposite":"","synonyms":"structure"},{"def":"how fit and healthy somebody is; the state of being fit and healthy","examples":["in… form After six months' training the whole team is in superb form.","in form I really need to get back in form.","out of form The horse was clearly out of form.","Barcelona are the team in form.","She was in fine form for the tournament.","The team entered the tournament in top form.","The team was out of form and did not play as well as expected."],"opposite":"","synonyms":""},{"def":"how well somebody/something is performing; the fact that somebody/something is performing well","examples":["Midfielder Elliott has shown disappointing form recently.","She signalled her return to form with a convincing victory.","on form (British English) He's right on form (= performing well) as a crazy science teacher in his latest movie.","on… form The whole team was on good form and deserved the win.","On current/present form the party is heading for another election victory.","in… form She was in great form (= happy and cheerful and full of energy) at the wedding party.","He'll be a difficult opponent to beat; he's really on form today.","Yesterday's game saw him back on form.","Her recent illness possibly explains why she was off form in this race.","On his present form it seems likely that he will win the match.","She urgently needs to find her form.","The team is hoping that it can maintain its current form."],"opposite":"","synonyms":""},{"def":"the usual way of doing something","examples":["What's the form when you apply for a research grant?","conventional social forms","True to form (= as he usually does) he arrived an hour late.","Partners of employees are invited as a matter of form (= because that is the usual way things are done)."],"opposite":"","synonyms":""},{"def":"the way of doing things that is socially acceptable/not socially acceptable","examples":["When I was a boy it was always considered bad form to talk about food or money.","Good form dictated that she should dress more casually in the country."],"opposite":"","synonyms":""},{"def":"a class in a school","examples":["Who's your form teacher?"],"opposite":"","synonyms":""},{"def":"a student in the form mentioned at school","examples":["a third-former"],"opposite":"","synonyms":""},{"def":"of any type","examples":["I don't approve of violence in any shape or form.","I can't stand insects in any shape or form.","I do not condone bullying in any way, shape or form."],"opposite":"","synonyms":""},{"def":"to gradually form into a particular shape; to gradually develop","examples":["In her body a new life was taking form."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in any (way,) shape or form","def":"of any type","examples":["I don't approve of violence in any shape or form.","I can't stand insects in any shape or form.","I do not condone bullying in any way, shape or form."]},{"idiom":"take form","def":"to gradually form into a particular shape; to gradually develop","examples":["In her body a new life was taking form."]}],"phrasal":[],"related":["art form","pro-form","re-form","base form","free form","free-form","I-9 form","life form","1040 form","W-2 form","bound form","form letter","order form","sixth form","form-fitting","ternary form","canonical form","combining form","sixth-form college"]},{"pos":"verb","level":"A1","meanings":[{"def":"to produce something in a particular way or make it have a particular shape","examples":["form something Bend the wire so that it forms a ‘V’.","Rearrange the letters to form a new word.","Games can help children learn to form letters.","Do you know how to form the past tense?","form something into something Form the dough into balls with your hands.","be formed from something The chain is formed from 136 links.","be formed of something The table was formed of two large slabs of stone."],"opposite":"","synonyms":""},{"def":"to move or arrange objects or people so that they are in a group with a particular shape; to become arranged in a group like this","examples":["form (somebody/something) First get students to form groups of four.","to form a line/queue/circle","Queues were already forming outside the theatre.","form up into something The teams formed up into lines.","form into something Everyone formed into a circle.","be formed (up) into something The regiment was formed into ranks on a nearby lane."],"opposite":"","synonyms":""},{"def":"to begin to exist and gradually develop into a particular shape; to make something begin to exist in a particular shape","examples":["Flowers appeared, but fruits failed to form.","Storm clouds are forming on the horizon.","be formed (by something) These hills were formed by glaciation.","a perfectly formed body"],"opposite":"","synonyms":""},{"def":"to start to exist and develop; to make something start to exist and develop","examples":["A plan formed in my head.","form something to form a relationship/bond/partnership with somebody/something","I formed many close friendships at college.","People can and do form emotional bonds with cats and dogs.","I didn't see enough of the play to form an opinion about it.","I formed the view that the only option was to cancel the project.","The plan came in a flash of inspiration, fully formed.","She makes her own clothes.","She made a good impression on the interviewer.","He did a beautiful drawing of a house.","Who’s doing the food for the party?","Scientists disagree about how the universe was created.","to develop new software","a factory that produces microchips","to generate electricity","Brainstorming is a good way of generating ideas.","Rearrange the letters to form a new word.","The chain is formed from 136 links."],"opposite":"","synonyms":"make"},{"def":"to start a group of people, such as an organization, a committee, etc.; to come together in a group of this kind","examples":["form something They hope to form the new government.","to form an alliance/a coalition/a committee","He formed a band with some friends from school.","a newly formed political party","I decided to form my own company.","The band formed in 2017.","Willing volunteers formed teams of helpers to carry everything in.","On September 27 a new coalition administration was formed.","Some of the insects will leave to form a new colony.","The anarchists started to form volunteer militias."],"opposite":"","synonyms":""},{"def":"to be something; to have a particular function or pattern","examples":["The castle forms the focal point of the city.","The survey formed part of a larger programme of research.","These drawings will form the basis of the exhibition.","This family forms the core of the film.","The trees form a natural protection from the sun's rays."],"opposite":"","synonyms":""},{"def":"to have an influence on the way that something develops","examples":["Positive and negative experiences form a child's character.","His outspoken remarks undoubtedly helped form popular opinion on the issue.","No other work of fiction has had such an influence in forming public attitudes."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]