[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/for/fortu/fortune__us_2.mp3","phonsUS":"/ˈfɔːrtʃən/","level":"B2","meanings":[{"def":"a large amount of money","examples":["He made a fortune in real estate.","Her father made his fortune selling electronics.","She inherited a share of the family fortune.","A car like that costs a small fortune (= a lot of money).","You don't have to spend a fortune to give your family tasty, healthy meals.","She is hoping her US debut will be the first step on the road to fame and fortune.","He amassed a fortune of nearly $2 billion.","She devoted a large part of her personal fortune to ensuring the company's survival.","That ring must be worth a fortune.","He built his fortune from breeding horses.","He has amassed a considerable fortune out of trading shares.","He lost his fortune in the crash of 1929.","Her aunt died and left her a fortune.","They sold their house at the right time and made a fortune on it."],"opposite":"","synonyms":""},{"def":"chance or luck, especially in the way it affects people’s lives","examples":["I have had the good fortune to work with some brilliant directors.","By a stroke of fortune he found work almost immediately.","Fortune smiled on me (= I had good luck).","A horseshoe nailed to your door is supposed to bring good fortune.","As good fortune would have it, a bus came along just when I needed it.","For once, fortune was on our side: the weather improved in time for the game."],"opposite":"","synonyms":""},{"def":"the good and bad things that happen to a person, family, country, etc.","examples":["The share price tends to follow the changing fortunes of the film industry.","the fortunes of war","The company suffered a great reversal of fortune when public taste changed.","The party still hopes to revive its flagging electoral fortunes.","The team had a dramatic reversal of fortunes in the second half.","a year of mixed fortunes for the company","fans who follow the fortunes of their chosen team"],"opposite":"","synonyms":""},{"def":"a person’s fate or future","examples":["She can tell your fortune by looking at the lines on your hand.","They went to have their fortunes read."],"opposite":"","synonyms":""},{"def":"something that you have, or have promised to do, that could cause trouble or worry in the future","examples":[],"opposite":"","synonyms":""},{"def":"to try to find a way to become rich, especially by going to another place","examples":["Many emigrated to Australia to seek their fortune."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a hostage to fortune","def":"something that you have, or have promised to do, that could cause trouble or worry in the future","examples":[]},{"idiom":"seek your fortune","def":"to try to find a way to become rich, especially by going to another place","examples":["Many emigrated to Australia to seek their fortune."]}],"phrasal":[],"related":["small fortune","fortune cookie","fortune hunter","fortune teller","Fortune 500","Wheel of Fortune","soldier of fortune","fortune cookies","fortune hunters","fortune tellers","soldiers of fortune"]}]