[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fou/found/foundation__us_1.mp3","phonsUS":"/faʊnˈdeɪʃn/","level":"B2","meanings":[{"def":"a principle, an idea or a fact that something is based on and that it grows from","examples":["Respect and friendship provide a solid foundation for marriage.","He laid the foundation of Japan's modern economy.","These stories have no foundation (= are not based on any facts).","without foundation The rumour is totally without foundation (= is not based on any facts).","This article will form the basis for our discussion.","Respect and friendship provide a solid foundation for marriage.","The rumour is totally without foundation (= is not based on any facts).","His arguments have a sound economic base.","Worship is the foundation of all the Church's activities.","He believes terrorism undermines the very foundations of our society.","We now have a firm foundation to build on.","This agreement laid a sound foundation for future cooperation between the two countries."],"opposite":"","synonyms":"basis"},{"def":"an organization that is established to provide money for a particular purpose, for example for scientific research or charity","examples":["The money will go to the San Francisco AIDS Foundation.","Many of the hospitals were originally established by religious foundations.","The research centre was set up by a charitable foundation.","a private foundation for sport and the arts"],"opposite":"","synonyms":""},{"def":"the act of starting a new institution or organization","examples":["The organization has grown enormously since its foundation in 1955.","She used the money to go towards the foundation of a special research group."],"opposite":"","synonyms":""},{"def":"a layer of stone, concrete, etc. that forms the solid underground base of a building","examples":["The builders are now beginning to lay the foundations of the new school.","The explosion shook the foundations of the houses nearby.","Footnotes are given at the bottom of each page.","I waited for them at the bottom of the hill.","The lamp has a heavy base.","to lay the foundations of the new school","At the foot of the stairs she turned to face him.","Concrete foundations have been laid.","The thunder seemed to shake the very foundations of the building.","They had dug too deep and undermined the foundations of the house."],"opposite":"","synonyms":"bottom"},{"def":"a skin-coloured cream that is put on the face under other make-up","examples":[],"opposite":"","synonyms":""},{"def":"to cause people to question their basic beliefs about something","examples":["This issue has shaken the foundations of French politics.","an event which rocked the foundations of British politics","The scandal rocked the legal establishment to its foundations."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"shake/rock the foundations of something | shake/rock something to its foundations","def":"to cause people to question their basic beliefs about something","examples":["This issue has shaken the foundations of French politics.","an event which rocked the foundations of British politics","The scandal rocked the legal establishment to its foundations."]}],"phrasal":[],"related":["foundation course","foundation stone","Rockefeller Foundation","Asian Dub Foundation","Ford Foundation","Work Foundation","PEN/Faulkner Foundation","foundation courses","foundation stones"]}]