[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fra/frame/frame__us_1.mp3","phonsUS":"/freɪm/","level":"B1","meanings":[{"def":"a strong border or structure of wood, metal, etc. that holds a picture, door, piece of glass, etc. in position","examples":["a picture/photo frame","aluminium window frames","I'm going to paint the door frame white.","She leaned against the frame of the door.","in a frame pictures in gold frames"],"opposite":"","synonyms":""},{"def":"the supporting structure of a piece of furniture, a building, a vehicle, etc. that gives it its shape","examples":["a bicycle frame","The bed frame is made of pine.","the frame of an aircraft/a car/a bicycle","In the 1920s, federal office buildings were typically built with steel frames encased in concrete or granite."],"opposite":"","synonyms":""},{"def":"a structure of plastic or metal that holds the lenses in a pair of glasses","examples":["gold-rimmed frames"],"opposite":"","synonyms":""},{"def":"the form or structure of a person or animal’s body","examples":["to have a small/slender/large frame","The bed was shorter than his six-foot frame.","She has quite a small frame.","a man with a lean, athletic frame"],"opposite":"","synonyms":""},{"def":"the general ideas or structure that form the background to something","examples":["in/within the frame of something In this course we hope to look at literature in the frame of its social and historical context."],"opposite":"","synonyms":""},{"def":"one of the single photographs that a film or video is made of","examples":[],"opposite":"","synonyms":""},{"def":"a single picture in a comic strip","examples":[],"opposite":"","synonyms":""},{"def":"one of the separate areas on an internet page that you can scroll through (= read by moving the text up or down)","examples":[],"opposite":"","synonyms":""},{"def":"a small wooden or metal frame covered with glass that you grow seeds or small plants in to protect them from cold weather","examples":[],"opposite":"","synonyms":""},{"def":"a single section of play in the game of snooker, etc., or in bowling","examples":["He won the first frame easily."],"opposite":"","synonyms":""},{"def":"be taking part/not taking part in something","examples":["We won our match, so we're still in the frame for the championship."],"opposite":"","synonyms":""},{"def":"to be wanted/not wanted by the police because you are/are not suspected of having committed a crime","examples":["He was always in the frame for the killing."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be in/out of the frame (for something)","def":"be taking part/not taking part in something","examples":["We won our match, so we're still in the frame for the championship.","He was always in the frame for the killing."]}],"phrasal":[],"related":["A-frame","frame-up","cold frame","frame house","frame tent","time frame","freeze-frame","walking frame","Zimmer frame™","A-frame tent","climbing frame","frame of mind","frame of reference","frame-ups","frame tents","frame houses"]},{"pos":"verb","level":"B1","meanings":[{"def":"to put or make a frame or border around something","examples":["be framed The photograph had been framed.","He was presented with a framed certificate.","(be) framed in something mirrors framed in silver and gold"],"opposite":"","synonyms":""},{"def":"to surround something/somebody in a way that makes an attractive image","examples":["frame something/somebody I like the way your hair frames your face.","(be) framed against something He stood there, head back, framed against the blue sky."],"opposite":"","synonyms":""},{"def":"to produce false evidence against an innocent person so that people think they are guilty","examples":["be framed He says he was framed.","(be) framed for something She found herself framed for murder."],"opposite":"","synonyms":""},{"def":"to create and develop something such as a plan, a system or a set of rules","examples":["Measures to secure oil production must be framed in the context of rising energy demands."],"opposite":"","synonyms":""},{"def":"to express something in a particular way","examples":["You'll have to be careful how you frame the question."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]