[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fra/franc/franchise__us_1.mp3","phonsUS":"/ˈfræntʃaɪz/","level":"C1","meanings":[{"def":"formal permission given by a company to somebody who wants to sell its goods or services in a particular area; formal permission given by a government to somebody who wants to operate a public service as a business","examples":["a franchise agreement/company","a catering/rail franchise","In the reorganization, Southern Television lost their franchise.","to operate a business under franchise","Catering in the schools is run on a franchise basis.","TV franchises will be auctioned to the highest bidder.","The company has just won a television franchise.","The diving school has acquired a franchise for scuba equipment.","The franchise was awarded to a French company.","the company that holds the franchise for the south-east of the country"],"opposite":"","synonyms":""},{"def":"a business or service run under franchise","examples":["They operate franchises in London and Paris.","He's got a job as manager of a burger franchise.","He runs a local pizza franchise."],"opposite":"","synonyms":""},{"def":"the right to vote in a country’s elections","examples":["universal adult franchise","The 1918 Reform Act extended the franchise to women over 30.","The franchise was later extended to all adults over eighteen.","He had to exercise the franchise on behalf of other council members.","It was decided that all men in the armed forces should qualify for the franchise."],"opposite":"","synonyms":""},{"def":"a set of films in which the same characters appear in related stories","examples":["Disney has successfully revived the ‘Star Wars’ franchise, with four films already released and more in the works."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["franchise player","franchise players"]},{"pos":"verb","level":"","meanings":[{"def":"to give or sell a franchise to somebody","examples":["be franchised (out) (to somebody/something) Catering has been franchised (out) to a private company.","franchised restaurants"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]