[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fre/freed/freedom__us_2.mp3","phonsUS":"/ˈfriːdəm/","level":"B2","meanings":[{"def":"the power or right to do or say what you want without anyone stopping you","examples":["to defend/protect academic freedom","Press freedom is under attack.","All groups enjoyed religious freedom.","As a society we value personal freedom and privacy.","freedom of something We just want freedom of choice.","Everyone has the right to freedom of expression.","freedom of conscience/thought/worship","The government continues to restrict freedom of movement.","Enjoy the freedom of the outdoors (= where you can do what you want).","rights and freedoms guaranteed by the constitution","freedom to do something complete freedom to do as you wish","freedom in doing something These proposals would give health authorities greater freedom in deciding how to spend their money.","Individual freedom should be balanced against the rights of the community.","Living without war is a fundamental freedom.","The new syllabus allows students greater freedom of choice.","The constitution guarantees freedom of the press.","This newspaper defends freedom of speech.","Branch managers have considerable freedom in running their offices.","I don't want to curtail my daughter's freedom.","I was enjoying the freedom of not having to go to work.","Teachers can exercise a measure of freedom in their choice of materials.","When she lost her job, she at first relished her new-found freedom.","There has been much talk about encouraging artistic freedom.","Publishers here enjoy comparative freedom to publish what they want.","The Official Secrets Act was amended to allow greater freedom of information.","The party claims it can bring freedom and democracy to the country.","The constitution contains guarantees of democratic rights and freedoms.","One of the most basic freedoms is the right to peace.","The women have won many new freedoms for themselves.","Thanks to the automobile, Americans soon had a freedom of movement previously unknown."],"opposite":"","synonyms":""},{"def":"the state of not being a prisoner or slave","examples":["He finally won his freedom after twenty years in jail.","Many slaves who gained their freedom lost it again after the war.","She laboured as a field hand and house servant until 1849, when she escaped to freedom in the North.","His inability to resist temptation would eventually cost him his freedom.","She is told she must write a confession in order to regain her freedom."],"opposite":"","synonyms":""},{"def":"the state of not being ruled by a foreign or cruel government","examples":["We believe in freedom and democracy.","He was a champion of Irish freedom."],"opposite":"","synonyms":""},{"def":"the state of being able to move easily","examples":["The skirt has a side split for freedom of movement.","freedom to do something Free-range hens have greater freedom to move about."],"opposite":"","synonyms":""},{"def":"the state of not being affected by the thing mentioned","examples":["All people should be guaranteed freedom from fear.","freedom from discrimination based on gender or ethnicity","freedom from pain and disease"],"opposite":"","synonyms":""},{"def":"permission to use something without limits","examples":["I was given the freedom of the whole house."],"opposite":"","synonyms":""},{"def":"the chance to change the way that something happens and influence decisions that are made","examples":["Small farmers have limited room for manoeuvre.","The economic conditions are restricting the bank's freedom of manoeuvre.","The government has very little room for manoeuvre on this issue."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"freedom of/room for manoeuvre","def":"the chance to change the way that something happens and influence decisions that are made","examples":["Small farmers have limited room for manoeuvre.","The economic conditions are restricting the bank's freedom of manoeuvre.","The government has very little room for manoeuvre on this issue."]}],"phrasal":[],"related":["freedom fighter","freedom riders","Medal of Freedom","freedom of speech","USA Freedom Corps","freedom of assembly","freedom of association","freedom of information","freedom of religion","freedom of the press","freedom of the city","Ulster Freedom Fighters","Presidential Medal of Freedom","Freedom of Information Act","freedom fighters","Freedom of Information Acts"]}]