[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fre/free_/free__us_1.mp3","phonsUS":"/friː/","level":"A1","meanings":[{"def":"without particular plans or arrangements; not busy","examples":["Are you free on Saturday? We're having a barbecue.","We try to keep Sundays free.","free for something If Sarah is free for lunch I'll take her out.","Keep Friday night free for my party.","What do you like to do in your free time (= when you are not working)?","Let's meet tomorrow. What time are you free?","Come over for dinner, if you're free.","Are you free for dinner on Thursday?","Are you free on 25th July? We're having a little get-together.","It's my birthday party a week on Friday, so keep it free.","I invited them, but they weren't free.","I had a couple of hours free so I went for a walk.","The morning is free for you to spend as you choose.","The next time I have a free day I'll come and see you.","We don't have any free weekends now until after Christmas.","I haven't had a free moment all day.","Let's do something tomorrow. I'm completely free all day.","Ask her to give me a call as soon as she's free.","I have to work until four, but after that I'm free."],"opposite":"","synonyms":""},{"def":"not being used","examples":["He held out his free hand and I took it.","Is this seat free?","The hospital needs to keep some beds free for emergencies.","The device allows you to talk on the phone with both hands free.","She has the phone on the left to keep her right hand free for writing.","There were no free tables, so we had to share.","You just find a free desk and go work at it.","None of the library computers were free.","Is the bathroom free?","Let me know when the shower is free.","Seats get taken as soon as they become free."],"opposite":"","synonyms":""},{"def":"costing nothing","examples":["Admission is free.","free software/tickets","We even offer a free web design service.","We''ll give you a fabulous free gift with each copy you buy.","free to somebody Use of the pool is free to members.","free for somebody Updates are free for registered users.","for free You can't expect people to work for free (= without payment).","The exhibition is free for children under ten.","The upgrade will be available free to existing customers.","Entrance is free for students.","Education should be free for everyone.","Parking is free after 6 pm.","Membership is free.","Shipping is free for orders over $50.","They get free medical care.","Subscribe to our free email newsletter.","We're giving away 100 free tickets to the final.","The game is available as a free download.","These are clean, green methods of harnessing free energy.","The website offers free legal advice to homeowners.","You get all this absolutely free.","Events are free but you have to reserve a place.","This attractive poster comes free with the magazine.","Responsible employers should provide these services free to staff.","We might be able to get some plants for free.","You can get all this information for free on the internet.","They might give you some stuff for free in exchange for mentioning them on your blog."],"opposite":"","synonyms":""},{"def":"not under the control or in the power of somebody else; able to do what you want","examples":["I have no ambitions other than to have a happy life and be free.","Students have a free choice of modules in their final year.","free to do something You are free to leave at any time.","The government wants to leave companies free to make their own decisions.","free from something The organization wants to remain free from government control.","free of something We want an independent state free of foreign interference.","‘Can I sit here?’ ‘Please, feel free (= of course you can).’","Feel free to email me if you have any questions.","After my divorce I felt free.","You have a completely free choice of topic for your essay.","Children should be free to choose their own friends.","You are free to express your opinion, of course.","The band split up, leaving her free to pursue solo projects.","You are free to come and go as you please.","Guests are free to wander around the grounds.","Feel free to contact us at any time.","It's just my advice—feel free to ignore it.","They should remain an independent agency free from outside influence.","I try to make my own decisions, free of any outside influences.","She was finally free of the constraints of her religious upbringing.","She is making her own art free from commercial pressure."],"opposite":"","synonyms":""},{"def":"not limited or controlled by anyone else","examples":["A true democracy needs free speech and a free press.","He called for free and fair elections.","They gave me free access to all the files.","We celebrate the role of the press in a free society.","In a free country you should be able to go wherever you want.","He opposes the free flow of goods and people into the country.","the free flow of ideas through society","the free movement of goods and capital","We could help the developing world by giving them free access to markets.","We want to be a free and democratic nation.","He tried to create an open and free atmosphere in the school.","Has the obsession with cheap food, brought about by free, unfettered competition, reached its limits?","Children need time for unorganized free play."],"opposite":"","synonyms":""},{"def":"not a prisoner or slave","examples":["He walked out of jail a free man.","The hostages were all set free.","The hacker is currently free on bail.","After twelve years in captivity, they were free.","His captors set him free.","It is worse to wrongly convict the innocent than to let the guilty go free.","He promised that some day the slaves would go free.","He had an alibi, so police had no choice but to let him walk free.","The killer remains free and at large.","She pleaded with them to let her free.","They declared the slaves free.","In ancient Rome it was possible for a slave to become a free man.","Free African-Americans were kidnapped from the North and sold into slavery.","We are a free people and we will not be enslaved."],"opposite":"","synonyms":""},{"def":"not tied up or in a cage","examples":["The researchers set the birds free.","free to do something Our livestock is free to roam.","animals roaming free across the plains","He subdues one of the wild horses and then allows it to go free.","She opened the cage and let the bird fly free.","The chickens are free to range across a wide area.","The sheep are free to graze all over the mountainside."],"opposite":"","synonyms":""},{"def":"clear; not blocked","examples":["Ensure there is a free flow of air around the machine.","the free movement of traffic","The grills allow free movement of air.","The roads are relatively free today.","The crowd parted, giving me a free path to the front.","The tube is free for water to move along.","Make sure the pipe is free of any obstruction."],"opposite":"","synonyms":""},{"def":"not containing or affected by something harmful or unpleasant","examples":["free from artificial colours and flavourings","Everyone deserves to live free from fear.","free of defects/problems/symptoms","Beef producers want their herds free of disease.","It was several weeks before he was completely free of pain.","We've managed to keep the garden free of weeds this year.","Animals on our farms are reared on diets free from GM feed.","Our staff have a right to work free from violence or threats.","a safe, loving home free of violence","a workplace free from pressure or bullying","The room was almost completely free of ornament.","Soundproofing can rarely make a space completely free of external noise.","The soil should be free from stones and large clods.","The picture is clear, free of any defects.","His tone was entirely free of irony.","The child should not return to school until he is entirely free from symptoms.","The text should be totally free of mistakes.","She is remarkably free of self-importance."],"opposite":"","synonyms":""},{"def":"without the thing mentioned","examples":["pure, additive-free ingredients","a trouble-free life","After six months of treatment he is cancer-free.","organic, chemical-free farming","Our baby foods are guaranteed GM-free.","healthy, disease-free animals","a virtually bacteria-free environment","Completely pain-free childbirth is a myth.","She is now symptom-free and can return to work.","He's managed to stay injury-free this season.","Holidays should be a relaxed, pressure-free time.","It's not a race, just a pressure-free stroll.","Wouldn't a totally stress-free life be boring?","I want her time here to be happy and stress-free.","a simple, hassle-free solution","an error-free copy","There's no such thing as problem-free insurance.","Her pregnancy was relatively problem-free.","They describe themselves as child-free."],"opposite":"","synonyms":""},{"def":"not attached to something; not stuck somewhere and unable to move","examples":["Pull gently on the free end of the rope.","She finally managed to pull herself free.","They tied him up but he managed to get free.","free from something They had to be cut free from their car after the accident.","free of something The boat had broken free of its moorings.","They swam free of the wreckage.","The wagon broke free from the train.","Edie tried to pull her hand free.","He pulled the sword free from the stone.","You jump on the free end of the board and dive in.","Tuck the free end away out of sight.","The ladder swung free from the cliff face.","The dog had broken free of its chain.","He managed to jump free of the car before it crashed.","She squirmed free of his grasp.","He struggled to get free, but the ropes held.","Some external parts of the car may flap around until eventually they work free and fall off."],"opposite":"","synonyms":""},{"def":"ready to give something, especially when it is not wanted","examples":["He's too free with his opinions."],"opposite":"","synonyms":""},{"def":"a free translation is not exact but gives the general meaning","examples":[],"opposite":"","synonyms":""},{"def":"to have done something successfully, especially when it was difficult","examples":["I could see the finish line and thought I was home free."],"opposite":"","synonyms":""},{"def":"informal; relaxed","examples":["Life was never going to be so free and easy again."],"opposite":"","synonyms":""},{"def":"if you give somebody a free pass or somebody gets a free pass, they are not punished for something bad they have done, or they are given permission to do something bad","examples":["This time he gets a free pass but if he does it again, he’ll be sent to jail.","Just because someone has expensive designer gear, it doesn't mean they have a free pass to be mean to my staff."],"opposite":"","synonyms":""},{"def":"to get, have, etc. the opportunity to do what you want to do and to make your own decisions","examples":["I was given a free hand in designing the syllabus."],"opposite":"","synonyms":""},{"def":"to get or take something without paying because somebody else is paying for it","examples":[],"opposite":"","synonyms":""},{"def":"to give somebody complete freedom of action; to allow a feeling to be expressed freely","examples":["The designer was given free rein.","The script allows full rein to her larger-than-life acting style.","When I paint I just give my imagination free rein."],"opposite":"","synonyms":""},{"def":"used as a reply when somebody suggests that you should not do something, or when somebody has asked permission or said they are going to do something","examples":["It's a free country; I'll say what I like!","Wear what you like. It's a free country.","‘It's a free country!’ he shouted. ‘I can do what I like!’"],"opposite":"","synonyms":""},{"def":"used to say that it is not possible to get something for nothing","examples":[],"opposite":"","synonyms":""},{"def":"to be allowed to leave court, etc., without receiving any punishment","examples":["She was acquitted and walked free from court."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be home and free","def":"to have done something successfully, especially when it was difficult","examples":["I could see the finish line and thought I was home free."]},{"idiom":"free and easy","def":"informal; relaxed","examples":["Life was never going to be so free and easy again."]},{"idiom":"(give somebody/get) a free pass","def":"if you give somebody a free pass or somebody gets a free pass, they are not punished for something bad they have done, or they are given permission to do something bad","examples":["This time he gets a free pass but if he does it again, he’ll be sent to jail.","Just because someone has expensive designer gear, it doesn't mean they have a free pass to be mean to my staff."]},{"idiom":"get, have, etc. a free hand","def":"to get, have, etc. the opportunity to do what you want to do and to make your own decisions","examples":["I was given a free hand in designing the syllabus."]},{"idiom":"get, take, etc. a free ride","def":"to get or take something without paying because somebody else is paying for it","examples":[]},{"idiom":"give/allow somebody/something free/full rein | give/allow free/full rein to something","def":"to give somebody complete freedom of action; to allow a feeling to be expressed freely","examples":["The designer was given free rein.","The script allows full rein to her larger-than-life acting style.","When I paint I just give my imagination free rein."]},{"idiom":"it’s a free country","def":"used as a reply when somebody suggests that you should not do something, or when somebody has asked permission or said they are going to do something","examples":["It's a free country; I'll say what I like!","Wear what you like. It's a free country.","‘It's a free country!’ he shouted. ‘I can do what I like!’"]},{"idiom":"there’s no such thing as a free lunch","def":"used to say that it is not possible to get something for nothing","examples":[]},{"idiom":"walk free","def":"to be allowed to leave court, etc., without receiving any punishment","examples":["She was acquitted and walked free from court."]}],"phrasal":[],"related":["fat-free","tax-free","Wee Free","duty-free","free fall","free form","free-form","free-from","free kick","free love","free port","free vote","free will","lead-free","post-free"]},{"pos":"adverb","level":"A2","meanings":[{"def":"without payment","examples":["Children under five travel free.","We will send you our booklet free of charge."],"opposite":"","synonyms":""},{"def":"in a way that is not tied but is able to move about","examples":["Attach the top and let the ends hang free.","He yanked the door hard, and at last it swung free.","Her long hair hung free down her back."],"opposite":"","synonyms":""},{"def":"to use something a lot, even though it does not belong to you","examples":["Does she know that you're making free with her belongings?"],"opposite":"","synonyms":""},{"def":"to be allowed to go where it likes; not tied to anything or kept in a cage","examples":["Horses should be able to run free on large plots of land."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"make free with something","def":"to use something a lot, even though it does not belong to you","examples":["Does she know that you're making free with her belongings?"]},{"idiom":"run free","def":"to be allowed to go where it likes; not tied to anything or kept in a cage","examples":["Horses should be able to run free on large plots of land."]}],"phrasal":[],"related":[]},{"pos":"verb","level":"B2","meanings":[{"def":"to allow somebody to leave prison or somewhere they have been kept against their will","examples":["free somebody The hijackers agreed to free a further ten hostages.","By the end of May nearly 100 of an estimated 2 000 political prisoners had been freed.","He drew up a new will that freed his slaves.","free somebody from something They succeeded in freeing their friends from prison.","The court ruled that he should be freed on bail of $50 000.","The woman was freed by the Appeal Court this morning.","They're launching a campaign to free the three men.","The starting point for emancipation was the freeing of children of slaves born after a certain date."],"opposite":"","synonyms":""},{"def":"to move somebody/something that is caught or fixed on something","examples":["free somebody/something/yourself She struggled to free herself.","A good kick finally freed the door.","free somebody/something/yourself from something Three people were freed from the wreckage.","He managed to free his arms from their bonds."],"opposite":"","synonyms":""},{"def":"to remove something that is unpleasant or not wanted from somebody/something","examples":["free somebody/something of somebody/something These exercises help free the body of tension.","The police are determined to free the town of violent crime.","free somebody/something from something The centre aims to free young people from dependency on drugs.","The system freed teachers from the constraints of the old curriculum.","If the tax is lifted the government will be freed from its obligation to buy goods from those countries.","Counselling may help you to free yourself from the past.","He had finally been freed of his responsibilities."],"opposite":"","synonyms":""},{"def":"to make somebody/something available for a particular purpose","examples":["free somebody/something (for something) We freed time each week for a project meeting.","free somebody/something up (for something) The government has promised to free up more resources for education."],"opposite":"","synonyms":""},{"def":"to give somebody the extra time to do something that they want to do","examples":["free somebody to do something Winning the prize freed him to paint full-time.","free somebody up (to do something) Using the content management software frees up staff."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]