[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fri/frien/friendship__us_2.mp3","phonsUS":"/ˈfrendʃɪp/","level":"B1","meanings":[{"def":"a relationship between friends","examples":["They formed a close friendship at college.","a lasting/lifelong friendship","to forge/develop/cultivate a friendship","friendship with somebody He seemed to have already struck up (= begun) a friendship with Jo.","friendship between A and B It's the story of an extraordinary friendship between a boy and a seal.","Friendships need time to develop.","He finds it difficult to make lasting friendships.","He's keen on cultivating his friendship with the Edwards family.","Her mother did not approve of her friendship with Ahmed.","How can you let such a silly incident ruin your friendship?","It was a period of her life when she made some lifelong friendships.","It will be a pleasure to renew our friendship.","Their affair had started out as an innocent friendship.","Their quarrel meant the end of a beautiful friendship.","friendships formed while she was at college"],"opposite":"","synonyms":""},{"def":"the feeling or relationship that friends have; the state of being friends","examples":["Your friendship is very important to me.","a conference to promote international friendship","friendship for somebody It was largely out of friendship for him that I agreed to come to Turin.","He extended the hand of friendship towards his former enemy.","He was jealous of the friendship between his wife and daughters.","In a gesture of friendship she invited them to her wedding.","Please accept this gift as a token of our friendship.","We hope the spirit of friendship and cooperation between our countries will remain strong.","They made vows of eternal friendship to each other.","She offended them by turning down their offer of friendship.","The ties of friendship between us will never be broken.","He betrayed our friendship by revealing my secret to his cousin.","We cemented our friendship with a beer."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]