[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fue/fuel_/fuel__us_1_rr.mp3","phonsUS":"/ˈfjuːəl/","level":"B1","meanings":[{"def":"any material that produces heat or power, usually when it is burnt","examples":["diesel/jet/rocket fuel","Most of the houses are heated with solid fuel (= wood, coal, etc.).","The plant reprocesses spent fuel from nuclear power stations.","The car has a 65-litre fuel tank.","a car with high fuel consumption","New engine designs are improving fuel efficiency.","We aim to cut emissions and boost fuel economy.","We use fuel oil to heat our house.","steadily rising fuel prices","Domestic fuel bills are set to rise again in the autumn.","The power plant burns sugar cane as fuel.","What sort of fuel does the car run on?","A tax on carbon-producing fuels such as coal and oil was proposed.","Make sure you don't run out of fuel."],"opposite":"","synonyms":""},{"def":"a thing that is said or done that makes something, especially an argument, continue or get worse","examples":["The new information adds fuel to the debate over safety procedures.","The revelations gave new fuel to angry opponents of the proposed law.","His remarks simply added fuel to the fire/flames of her rage."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["fuel rod","fuel cell","fossil fuel","fuel poverty","nuclear fuel","alternative fuel","fuel injection","fuel rods","diesel fuel","fuel cells"]},{"pos":"verb","level":"B2","meanings":[{"def":"to supply something with material that can be burnt to produce heat or power","examples":["Uranium is used to fuel nuclear plants.","oil-fuelled power stations","Most electric plants in California are fuelled by natural gas."],"opposite":"","synonyms":""},{"def":"to put petrol into a vehicle","examples":["The helicopter was already fuelled (up) and ready to go."],"opposite":"","synonyms":""},{"def":"to increase something; to make something stronger","examples":["to fuel rumours/fears/suspicions","Yesterday's meeting is likely to fuel further speculation about a takeover.","Higher salaries helped to fuel inflation.","Crime is soaring fuelled by an influx of drugs.","His absence has fuelled rumours of a split within the party.","The consumer boom had been fuelled by a credit-led economy."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]