[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fun/funct/function__us_4.mp3","phonsUS":"/ˈfʌŋkʃn/","level":"B1","meanings":[{"def":"a special activity or purpose of a person or thing","examples":["The club serves a useful function as a meeting place.","to fulfil/perform a function","What is your function in the department?","bodily functions (= for example eating, sex, using the toilet)","The function of the heart is to pump blood through the body.","This design aims for harmony of form and function.","Fortunately, his head injuries left his bodily functions unimpaired.","The committee has a dual function, both advisory and regulatory.","Within two weeks of quitting smoking, your lung function can improve as much as 30%"],"opposite":"","synonyms":""},{"def":"a social event or official ceremony","examples":["The hall provided a venue for weddings and other functions.","The couple attended a charity function in aid of cancer research.","There are numerous functions in aid of charity.","He and his wife were guests of honour at a function held by the society last weekend.","The reception will be held in the hotel's function room."],"opposite":"","synonyms":""},{"def":"a quantity whose value depends on the varying values of others. In the statement 2x=y, y is a function of x.","examples":["(figurative) Salary is a function of age and experience."],"opposite":"","synonyms":""},{"def":"a part of a program, etc. that performs a basic operation","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["function as","function key","function word","function keys","function words","function as somebody/something"]},{"pos":"verb","level":"B2","meanings":[{"def":"to work in the correct way","examples":["We now have a functioning shower.","+ adv./prep. Despite the power cuts, the hospital continued to function normally.","Many children can't function effectively in large classes.","(humorous) I can't function properly without a coffee.","All the instruments were functioning normally.","Can we devise a system in which judges function independently of party politics?","My brain could barely function through the pain.","Problems arise when the body's immune system is not functioning adequately.","The bombs continued to fall, but somehow the city still functioned.","The group has now become a fully functioning political organization.","The organization functions primarily through volunteer efforts.","This model does not describe accurately the way a market economy actually functions.","When nutrients are in short supply the body cannot function normally.","a system in which judges function independently of politics"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["function as"],"related":[]}]