[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fun/fund_/fund__us_1.mp3","phonsUS":"/fʌnd/","level":"B2","meanings":[{"def":"an amount of money that has been saved or has been made available for a particular purpose","examples":["a disaster relief fund","the company’s pension fund","the International Monetary Fund","in a fund There is currently over $200 000 in the fund.","The fund was invested in a range of state bonds.","The newspaper launched an appeal fund for victims of the disaster.","They don't want to draw on the fund unless they have to.","They set up an investment fund to provide money for their retirement.","a benevolent fund for retired actors","She made a donation to the local cancer relief fund."],"opposite":"","synonyms":""},{"def":"money that is available to be spent","examples":["government/federal funds","The hospital is trying to raise funds for a new kidney machine.","to provide/use funds for something","More funds should be allocated to housing.","The project has been cancelled because of lack of funds.","I'm short of funds at the moment—can I pay you back next week?","Clients can withdraw funds without any notice.","Funds from the event will support the work of the hospice.","Funds will be made available to ensure the provision of hospital services.","It will be a challenge to raise campaign funds for the election.","Most of the funds are spent on software.","The current account offers savers instant access to funds.","The funds are earmarked for the health sector.","The government is to channel more funds into local development schemes.","The school is appealing for funds to invest in new equipment.","There are only limited funds available.","They voted to withhold funds from any organization which didn't sign the agreement.","We have insufficient funds to pay for the building work.","the flow of funds between various economic sectors"],"opposite":"","synonyms":""},{"def":"a company that manages money for people by investing it; the money managed by such a company","examples":["Any extra money that James saves should go into a money market fund.","She is a fund manager for an Asian bank.","Fund management companies are focusing on more specialized products.","I would look to a good corporate bond fund as the economy rebounds.","A venture capitalist is a professional investor who manages a fund and is looking for suitable investments.","Over the past two decades, index funds have outperformed some 88% of managed funds."],"opposite":"","synonyms":""},{"def":"an amount or a supply of something","examples":["a fund of knowledge"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["hedge fund","mutual fund","slush fund","social fund","trust fund","fund manager","Art Fund","International Monetary Fund","National Art Collections Fund","United Negro College Fund","National Heritage Memorial Fund","fund managers","tracker fund","United Nations Children’s Fund"]},{"pos":"verb","level":"B2","meanings":[{"def":"to provide money for something, usually something official","examples":["Who is funding this research?","to fund a project/study/scheme","It's a government-funded programme for young offenders.","publicly funded healthcare","a federally funded housing project","The museum is privately funded.","The festival is funded by a grant from the Arts Council.","It is important that these training placements are fully funded.","This money will help to fund administration costs.","She used the stolen money to fund her extravagant lifestyle.","Drug companies and the government will jointly fund the necessary medical research.","Infrastructure projects are centrally funded.","The venture is funded entirely by its board of directors.","a new, fully funded training scheme","a plan jointly funded by central and local government"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]