[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/f/fut/futur/future__us_2.mp3","phonsUS":"/ˈfjuːtʃər/","level":"A1","meanings":[{"def":"the time that will come after the present or the events that will happen then","examples":["We need to plan for the future.","in the future The movie is set in the future.","at some point/time in the future","I don't expect any of these things to happen in the near future (= soon).","Things will continue as they are for the foreseeable future.","the immediate/not-too-distant/long-term/distant future","Nobody can predict the future.","What does the future hold?","of the future What will the cities of the future look like?","Kevin talked about his hopes for the future.","Do you think that you will work together again at some point in the future?","All of us need to embrace the future.","Don't think too much about past troubles—look to the future.","In her speech, the director outlined her vision for the future.","The film offers a dark vision of the future.","Nothing will change for the indefinite future.","The possibility of travel to other solar systems still lies in the distant future.","The stars of the future are competing in the world junior athletics championships this month.","Trying to forecast the far future is a problematic exercise.","What are your plans for the future?"],"opposite":"","synonyms":""},{"def":"what will happen to somebody/something at a later time","examples":["The company faces a very uncertain future.","We must seize the opportunity to shape our future.","This deal could secure the futures of 2  000 employees.","to decide/determine the future of somebody/something","Recent events throw doubt on the president’s political future.","After being dropped from the team the young defender is considering his future.","She decided to invest in her future by taking a course.","We want to create a better future for everyone.","You need to take time to plan your future.","the right to determine their own future in a democratic fashion","united by our common history and our shared future","He felt his entire future was at risk.","The sale secured his financial future.","A question mark hangs over the future of the company after shares plunged to a record low.","He forecasts a dire future for the industry.","It's your responsibility to safeguard your own financial future.","Her future is uncertain."],"opposite":"","synonyms":""},{"def":"the possibility of being successful or surviving at a later time","examples":["They have a bright future ahead of them.","I can't see any future in this relationship.","There's no future in mining in this country.","Children are the future of this country (= the country's future depends on children).","He could see no future in his job.","She has a very promising future as a musician.","She has a great future ahead of her."],"opposite":"","synonyms":""},{"def":"goods or shares that are bought at agreed prices but that will be delivered and paid for at a later time","examples":["oil futures","the futures market"],"opposite":"","synonyms":""},{"def":"the form of a verb that expresses what will happen after the present","examples":[],"opposite":"","synonyms":""},{"def":"for/in the period of time when you can predict what is going to happen, based on the present circumstances","examples":["The statue will remain in the museum for the foreseeable future.","It's unlikely that the hospital will be closed in the foreseeable future (= soon)."],"opposite":"","synonyms":""},{"def":"from now on","examples":["Please be more careful in future.","In future, make sure the door is never left unlocked.","In future, employees will park their vehicles away from the works entrance.","In future, please contact me first."],"opposite":"","synonyms":""},{"def":"not a long time in the future but fairly soon","examples":["I hope we’ll see each other again in the not too distant future.","In the not too distant future, we may witness the cloning of human beings.","We will be moving house in the not too distant future."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"for/in the foreseeable future","def":"for/in the period of time when you can predict what is going to happen, based on the present circumstances","examples":["The statue will remain in the museum for the foreseeable future.","It's unlikely that the hospital will be closed in the foreseeable future (= soon)."]},{"idiom":"in future","def":"from now on","examples":["Please be more careful in future.","In future, make sure the door is never left unlocked.","In future, employees will park their vehicles away from the works entrance.","In future, please contact me first."]},{"idiom":"in the not too distant future","def":"not a long time in the future but fairly soon","examples":["I hope we’ll see each other again in the not too distant future.","In the not too distant future, we may witness the cloning of human beings.","We will be moving house in the not too distant future."]}],"phrasal":[],"related":["future-proof","Back to the Future","future perfect","future-proofs","future-proofing","future-proofed","the future perfect tense","in the not too distant future","for/in the foreseeable future"]},{"pos":"adjective","level":"A2","meanings":[{"def":"taking place or existing at a time after the present","examples":["The land will remain untouched for future generations to enjoy.","The reasons for the decision will be announced at a future date.","future developments in artificial intelligence","present and future trends in industry","the ability to anticipate possible future events","She told us about her future plans.","He met his future wife at law school.","I wrote down the name of the hotel for future reference (= because it might be useful in the future)."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]