[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/gai/gain_/gain__us_1.mp3","phonsUS":"/ɡeɪn/","level":"B2","meanings":[{"def":"to obtain or win something, especially something that you need or want","examples":["gain something They managed to gain access to secret files.","How did the thieves gain entry?","The country gained its independence ten years ago.","The party gained over 50 per cent of the vote.","Police officers quickly gained control of the situation.","Labour finally gained power in 1997.","I gained an insight into the work of a journalist.","He has gained a reputation for unpredictable behaviour.","gain somebody something Her unusual talent gained her worldwide recognition.","We managed to gain entry through a back window.","Protesters tried to gain access to the palace.","His ideas gradually gained acceptance.","Husbands and wives of British nationals do not automatically gain citizenship."],"opposite":"","synonyms":""},{"def":"to obtain an advantage or benefit from something or from doing something","examples":["gain something The firm is hoping to gain an advantage over its competitors.","gain something by/from something What do you hope to gain by this?","gain something by/from doing something There is nothing to be gained from delaying the decision.","gain (by/from something) Consumers have gained from the increased competition.","If the proposal goes ahead, we all stand to gain.","I don't think there's anything to be gained from this course of action.","Consumers have certainly gained from the increased competition in the telecommunications industry.","The industry will gain enormously from the new proposals.","We all gained a lot from the experience.","Why not give it a go? You have nothing to lose and everything to gain."],"opposite":"","synonyms":""},{"def":"to gradually get more of something","examples":["As you gain experience, you will grow in confidence.","I've gained weight recently.","The campaign continues to gain momentum.","to gain understanding/knowledge","He has gained support from major figures in the industry.","to gain popularity/acceptance","She has gained confidence since the World Championships.","The economic recovery will soon gain traction."],"opposite":"","synonyms":""},{"def":"to go too fast (by a particular amount of time)","examples":["My watch gains two minutes every 24 hours."],"opposite":"lose","synonyms":""},{"def":"to increase in value","examples":["gain something The shares gained 14p to 262p.","gain against something The euro gained against the dollar again today."],"opposite":"","synonyms":""},{"def":"to reach a place, usually after a lot of effort","examples":["At last she gained the shelter of the forest.","Heavy fighting began as they gained the river."],"opposite":"","synonyms":""},{"def":"to become more powerful or successful","examples":["Sterling continues to gain ground against the dollar."],"opposite":"","synonyms":""},{"def":"to delay something so that you can have more time to make a decision, deal with a problem, etc.","examples":[],"opposite":"","synonyms":""},{"def":"used to say that you have to take risks if you want to achieve things and be successful","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"gain ground","def":"to become more powerful or successful","examples":["Sterling continues to gain ground against the dollar."]},{"idiom":"gain time","def":"to delay something so that you can have more time to make a decision, deal with a problem, etc.","examples":[]},{"idiom":"nothing ventured, nothing gained","def":"used to say that you have to take risks if you want to achieve things and be successful","examples":[]}],"phrasal":["gain in","gain on"],"related":["gain in","gain on","capital gain","gain in something","gain on somebody/something","no pain, no gain","gain, get, have, etc. the upper hand","gain/make up ground (on somebody/something)"]},{"pos":"noun","level":"B2","meanings":[{"def":"an increase in the amount of something, especially in wealth or weight","examples":["The opposition made unexpected gains in the last election.","There is still scope for efficiency gains.","Regular exercise helps prevent weight gain.","gain from something a £3 000 gain from our investment","gain of something The party had a net gain of nine seats on the local council.","gain in something significant gains in crop yield","£3.9 million gains from the sale of stock","Last year there was only a modest gain in earnings.","August showed a gain of 144 000 jobs.","She tucked her ill-gotten gains into her purse and left.","She was most upset by her recent weight gain.","The party has made solid gains in all areas of the country.","There will be no financial gain for mothers from this new system.","This change in the tax system will mean big gains for some companies.","The far right made huge electoral gains.","There is little scope for productivity gains.","Better workplace design can bring real gains in productivity."],"opposite":"","synonyms":""},{"def":"an advantage or improvement","examples":["Our loss is their gain.","gain in something These policies have resulted in great gains in public health.","War and poverty have reversed previous gains in children's health.","He is already reaping political gains."],"opposite":"","synonyms":""},{"def":"financial profit","examples":["He only seems to be interested in personal gain.","Financial gain was never her motivation.","for gain It's amazing what some people will do for gain.","They sold the company purely for short-term gain.","They were found to have used the investments for their private gain.","Volunteers give their time without seeking any monetary gain."],"opposite":"","synonyms":""},{"def":"used to say that you need to suffer if you want to achieve something","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"no pain, no gain","def":"used to say that you need to suffer if you want to achieve something","examples":[]}],"phrasal":[],"related":[]}]