[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/gap/gap__/gap__us_1.mp3","phonsUS":"/ɡæp/","level":"A2","meanings":[{"def":"a space where something is missing","examples":["Extra funding is needed to plug the gap.","gap in something Fill the gaps in these sentences.","There are huge gaps in their knowledge.","His death left an enormous gap in my life.","There were several gaps in my education.","We think we've identified a gap in the market (= a business opportunity to make or sell something that is not yet available).","Her appointment will fill the gap created when the marketing manager left.","legislation to close a gap in the law","serious gaps in our understanding of the disease"],"opposite":"","synonyms":""},{"def":"a space between two things or in the middle of something, especially because there is a part missing","examples":["There should be a six-inch gap at the bottom.","gap in something a gap in a hedge","gap between A and B Leave a gap between your car and the next.","through a gap I managed to squeeze through the gap.","A rabbit darted through a gap in the fence.","Position the tiles, leaving a narrow gap between the edges.","Seal the gaps around the windows with a sealant.","an awkward gap between the bed and the door","I spotted a gap in the cars and went for it."],"opposite":"","synonyms":""},{"def":"a period of time when something stops, or between two events","examples":["gap in something a gap in the conversation","gap between A and B He wrote his first novel in the gap between school and university.","gap of something They met again after a gap of twenty years.","There’s a big age gap between them (= a big difference in their ages).","Ads are just there to fill the gaps between quiz shows.","She returned to teaching after a twelve-year gap.","a job to fill the gap between high school and college","a gap in his career"],"opposite":"","synonyms":""},{"def":"a difference that separates people, or their opinions, situation, etc.","examples":["A huge gap has opened up between expectations and what is deliverable.","The only way to close this gap is to innovate.","gap between A and B the gap between rich and poor","the gap between theory and practice","to bridge the gap between urban and rural communities","The crisis was largely due to a wide gap between supply and demand.","He realized how narrow the gap was that separated him from his pagan ancestors.","the knowledge gap between doctor and patient","the unbridgeable gap between the two cultures","Progress could be jeopardized by a growing gap between the haves and the have-nots."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Gap","gap year","pay gap","wage gap","gap-toothed","gender gap","Cumberland Gap","generation gap","gap years","trade gap","bridge the gap/gulf/divide (between A and B)"]}]