[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/gen/gende/gender__us_1.mp3","phonsUS":"/ˈdʒendər/","level":"B2","meanings":[{"def":"the fact of being male or female, especially when considered with reference to social and cultural differences, rather than differences in biology; members of a particular gender as a group","examples":["issues of class, race and gender","traditional concepts of gender","Levels of physical activity did not differ between genders.","The film has something for people of all ages, genders and backgrounds.","gender differences/relations/roles/equality","She examines the interplay between changing gender divisions and urban change.","The government is working on tackling gender inequalities in employment.","My daughter prefers to see a woman doctor.","They have a male nanny for their kids.","a female racing driver","Everyone needs to feel he is loved.","Does everybody know what they want?","Somebody’s left their coat here.","I hope nobody’s forgotten to bring their passport with them.","When a guest arrives, they check in and we show them to their room.","Everyone knows what’s best for him- or herself.","If in doubt, ask your doctor. He/​she can give you more information.","A baby cries when he or she is tired","Babies cry when they are tired.","I want to share with you that I am trans, and my pronouns are ‘they’ and ‘them’."],"opposite":"","synonyms":""},{"def":"each of the classes (masculine, feminine and sometimes neuter) into which nouns, pronouns and adjectives are divided; the division of nouns, pronouns and adjectives into these different genders. Different genders may have different endings, etc.","examples":["In French the adjective must agree with the noun in number and gender."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["gender gap","gender bender","gender binary","gender-fluid","gender reveal","third gender","gender dysphoria","gender expression","gender identity","gender-neutral","gender-specific","gender studies","gender reassignment","gender benders","the gender binary","gender reassignments"]}]