[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/ges/gestu/gesture__us_1_rr.mp3","phonsUS":"/ˈdʒestʃər/","level":"B2","meanings":[{"def":"a movement that you make with your hands, your head or your face to show a particular meaning","examples":["He made a rude gesture at the driver of the other car.","She finished what she had to say with a gesture of despair.","They communicated entirely by gesture.","He responded with a vague gesture in the direction of the beach.","He waved his arms in a melodramatic gesture.","Expression and gesture are both forms of non-verbal communication.","She waved us away with an impatient gesture.","He made an obscene gesture with his hand.","I stopped him with a slight gesture.","She opened her arms out wide in a gesture of helplessness."],"opposite":"","synonyms":""},{"def":"something that you do or say to show a particular feeling or intention","examples":["They sent some flowers as a gesture of sympathy to the parents of the child.","It was a nice gesture (= it was kind) to invite his wife too.","We do not accept responsibility but we will refund the money as a gesture of goodwill.","His speech was at least a gesture towards improving relations between the two countries.","The government has made a gesture towards public opinion (= has tried to do something that the public will like).","His gift was a gesture of friendship.","Several hostages were released as a goodwill gesture.","The invasion attempt was intended as a political gesture against his opponents.","The president's speech was seen as a conciliatory gesture towards former enemies.","a bold gesture of reconciliation","Words and empty gestures are not enough—we demand action!","a token gesture of their good intentions","In a dramatic gesture, the prime minister refused to attend the meeting."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to move your hands, head, face, etc. as a way of expressing what you mean or want","examples":["+ adv./prep. ‘I see you read a lot,’ he said, gesturing at the wall of books.","gesture to somebody (to do something) He gestured to the guards and they withdrew.","gesture for somebody to do something She gestured for them to come in.","gesture (to somebody) (that)… He gestured (to me) that it was time to go.","They gestured that I should follow.","He gestured around the room, lost for words.","He gestured vaguely towards the house.","Anne gestured at the rain that was falling outside.","Davis gestured to the waiter.","She gestured at him to step back.","He gestured abruptly for Virginia to get in the car."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]