[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/giv/give_/give__us_1.mp3","phonsUS":"/ɡɪv/","level":"A1","meanings":[{"def":"to hand something to somebody so that they can look at it, use it or keep it for a time","examples":["give something to somebody Give the letter to your mother when you've read it.","She gave her ticket to the woman at the check-in desk.","give somebody something Give your mother the letter.","They were all given a box to carry."],"opposite":"","synonyms":""},{"def":"to hand something to somebody as a present; to allow somebody to have something as a present","examples":["give somebody something What are you giving your father for his birthday?","She was given a huge bunch of flowers.","Did you give the waiter a tip?","give something to somebody She gave a couple of pounds to the beggar.","give (something) We all agreed not to give presents this year.","They say it's better to give than to receive."],"opposite":"","synonyms":""},{"def":"to provide somebody with something","examples":["give somebody something They were all thirsty so I gave them a drink.","Give me your name and address.","We've been given a 2 per cent pay increase.","I was hoping you would give me a job.","He was given a new heart in a five-hour operation.","Give me some time to decide.","We should at least give him the opportunity to explain why he did this.","This should give you some idea of the extent of the problem.","Can you give us some sense of exactly what is at stake here?","We'll give you all the help we can.","She wants a job that gives her more responsibility.","Can I give you a ride to the station?","I'll give you (= allow you to have) ten minutes to prepare your answer.","Don't give me any of that backchat (= don't be rude).","give something to somebody He gives Italian lessons to his colleagues.","The reforms should give a better chance to the less able children.","give something She gave some helpful advice.","She gives the impression of being very busy.","I was asked to give evidence at the trial.","She gave me some medicine that sent me off to sleep.","Let me give you a word of advice.","The dark glasses gave him an air of mystery.","This shampoo will give your hair a nice healthy sheen.","We want to give you the best possible care.","They couldn't give me any more information.","He just left. He wouldn't give a reason.","The police did not give any details of the attack."],"opposite":"","synonyms":""},{"def":"to pay money to a charity, etc., to help people","examples":["We need your help—please give generously.","give to something They both gave regularly to charity.","give something I gave a small donation.","give something to something A lot of people give money to good causes."],"opposite":"","synonyms":""},{"def":"to pay in order to have or do something","examples":["give somebody something I'll give you £100 and not a penny more!","give somebody something for something How much will you give me for the car?","give something I'd give anything to see him again.","give something for something I gave £50 for the lot."],"opposite":"","synonyms":""},{"def":"used with a noun to describe a particular action, giving the same meaning as the related verb","examples":["give something She gave a shrug of her shoulders (= shrugged).","He turned to us and gave a big smile (= smiled broadly).","She looked up from her work and gave a yawn (= yawned).","He gave a loud cry (= cried out loudly) and fell to the floor.","Her work has given pleasure to (= pleased) millions of readers.","give somebody something He gave her a kiss (= kissed her).","I have to admit that the news gave us a shock (= shocked us).","He gave me a suspicious look (= looked at me suspiciously)."],"opposite":"","synonyms":""},{"def":"to produce a particular feeling in somebody","examples":["All that driving has given me a headache.","Go for a walk. It'll give you an appetite."],"opposite":"","synonyms":""},{"def":"to make a phone call to somebody","examples":["Give me a call tomorrow.","(British English) I'll give you a ring."],"opposite":"","synonyms":""},{"def":"to judge somebody/something to be of a particular standard","examples":["give somebody/something sth She had given the assignment an A.","I give it ten out of ten for originality.","give something He virtually never gives a grade of less than C.","give something to somebody/something I gave top marks to her essay."],"opposite":"","synonyms":""},{"def":"to pass an illness onto somebody and make them ill","examples":["give somebody something You've given me your cold.","give something to somebody She'd given the bug to all her colleagues."],"opposite":"","synonyms":""},{"def":"to make somebody suffer a particular punishment","examples":["give somebody something The judge gave him a nine-month suspended sentence.","give something to somebody We discussed what punishment should be given to the boys."],"opposite":"","synonyms":""},{"def":"if you give a party, you organize it and invite people","examples":["We're giving a party to celebrate our silver wedding."],"opposite":"","synonyms":""},{"def":"to perform something in public","examples":["give something He gave a rousing performance of the Bob Marley song.","She gave a reading from her latest volume of poetry.","The President will be giving a press conference this afternoon.","give something to somebody She gave a fine speech to the waiting crowd."],"opposite":"","synonyms":""},{"def":"to use time, energy, etc. for somebody/something","examples":["give somebody/something sth I gave the matter a lot of thought.","give something to somebody/something I gave a lot of thought to the matter.","The government has given top priority to reforming the tax system."],"opposite":"","synonyms":""},{"def":"to predict that something will last a particular length of time","examples":["That marriage won't last. I'll give them two years at the outside."],"opposite":"","synonyms":""},{"def":"to say that a player or the ball is in a particular position or that a goal has been scored","examples":["give somebody/something + adj. The umpire gave the ball out.","give something The ref gave the goal."],"opposite":"","synonyms":""},{"def":"to bend or stretch under pressure","examples":["The branch began to give under his weight.","(figurative) We can't go on like this—something's got to give."],"opposite":"","synonyms":""},{"def":"to agree to change your mind or give up some of your demands","examples":["You're going to have to give a little."],"opposite":"","synonyms":""},{"def":"used to tell somebody that you do not accept what they say","examples":["‘I didn't have time to do it.’ ‘Oh, don't give me that!’"],"opposite":"","synonyms":""},{"def":"to be willing, in a relationship, to accept what somebody else wants and to give up some of what you want","examples":["You're going to have to learn to give and take."],"opposite":"","synonyms":""},{"def":"to react with equal force when somebody attacks or criticizes you","examples":["She can give as good as she gets."],"opposite":"","synonyms":""},{"def":"to show your approval of somebody by clapping your hands","examples":["Give it up for Ed Sheeran!"],"opposite":"","synonyms":""},{"def":"used to say that you prefer a particular thing or person to the one that has just been mentioned","examples":["We don't go out much. Give me a quiet night in front of the TV any day!"],"opposite":"","synonyms":""},{"def":"if something is correct give or take a particular amount, it is approximately correct","examples":["It'll take about three weeks, give or take a day or so."],"opposite":"","synonyms":""},{"def":"to make somebody believe/understand something","examples":["I was given to understand that she had resigned."],"opposite":"","synonyms":""},{"def":"to severely punish or criticize somebody for doing something wrong","examples":["My son was rude to my friends so I gave him what for."],"opposite":"","synonyms":""},{"def":"used to ask people to drink a toast to somebody","examples":["Ladies and gentlemen, I give you Geoff Ogilby!"],"opposite":"","synonyms":""},{"def":"used when you are admitting that something is true","examples":[],"opposite":"","synonyms":""},{"def":"what is happening?; what is the news?","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"don’t give me that","def":"used to tell somebody that you do not accept what they say","examples":["‘I didn't have time to do it.’ ‘Oh, don't give me that!’"]},{"idiom":"give and take","def":"to be willing, in a relationship, to accept what somebody else wants and to give up some of what you want","examples":["You're going to have to learn to give and take."]},{"idiom":"give as good as you get","def":"to react with equal force when somebody attacks or criticizes you","examples":["She can give as good as she gets."]},{"idiom":"give it up (for somebody)","def":"to show your approval of somebody by clapping your hands","examples":["Give it up for Ed Sheeran!"]},{"idiom":"give me something/somebody (any day/time)","def":"used to say that you prefer a particular thing or person to the one that has just been mentioned","examples":["We don't go out much. Give me a quiet night in front of the TV any day!"]},{"idiom":"give or take (something)","def":"if something is correct give or take a particular amount, it is approximately correct","examples":["It'll take about three weeks, give or take a day or so."]},{"idiom":"give somebody to believe/understand (that)…","def":"to make somebody believe/understand something","examples":["I was given to understand that she had resigned."]},{"idiom":"give somebody what for","def":"to severely punish or criticize somebody for doing something wrong","examples":["My son was rude to my friends so I gave him what for."]},{"idiom":"I give you…","def":"used to ask people to drink a toast to somebody","examples":["Ladies and gentlemen, I give you Geoff Ogilby!"]},{"idiom":"I/I’ll give you that","def":"used when you are admitting that something is true","examples":[]},{"idiom":"what gives?","def":"what is happening?; what is the news?","examples":[]}],"phrasal":["give away","give back","give in","give off","give onto","give on to","give out","give over","give over to","give up","give up on","give yourself over to","give yourself up to"],"related":["give in","give off","give out","give up","give away","give back","give onto","give over","give on to","give up on","give over to","give yourself up to","give yourself over to","give way","give way to","give somebody up"]},{"pos":"noun","level":"","meanings":[{"def":"the ability of something to bend or stretch under pressure","examples":["The shoes may seem tight at first, but the leather has plenty of give in it."],"opposite":"","synonyms":""},{"def":"the quality of being willing to accept what somebody else wants and give up some of what you want","examples":["If the dispute is to be resolved there must be some give and take.","Marriage is a give-and-take relationship."],"opposite":"","synonyms":""},{"def":"an exchange of words or ideas","examples":["to encourage a lively give and take"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"give and take","def":"the quality of being willing to accept what somebody else wants and give up some of what you want","examples":["If the dispute is to be resolved there must be some give and take.","Marriage is a give-and-take relationship.","to encourage a lively give and take"]}],"phrasal":[],"related":[]}]