[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/gli/glimp/glimpse__us_1.mp3","phonsUS":"/ɡlɪmps/","level":"C1","meanings":[{"def":"a sight of somebody/something for a very short time, when you do not see the person or thing completely","examples":["glimpse (of somebody/something) He caught a glimpse of her in the crowd.","I came up on deck to get my first glimpse of the island.","Fans crowded the street outside waiting for a glimpse of their hero.","glimpse at somebody/something I just got a glimpse at the baby, but she was very cute.","Here, have a look at this.","She stole a glance at her watch.","She felt embarrassed under his steady gaze.","She gave the officer a blank stare and shrugged her shoulders.","He caught a glimpse of her in the crowd.","She fixed her questioner with a hostile glare.","She looked for him but couldn’t see him in the crowd.","He could see (that) she had been crying.","I’ve just spotted a mistake on the front cover.","She caught sight of a car in the distance.","He caught a glimpse of himself in the mirror.","He’d glimpsed her through the window as he passed.","Later we caught our first glimpse of the sea.","They caught occasional glimpses of great birds circling.","This was my first tantalizing glimpse of the islands.","Thousands of people had gathered, hoping to catch a glimpse of the Queen.","We got just a brief glimpse of the car as it rushed by.","We only had a fleeting glimpse of the sun all day."],"opposite":"","synonyms":"look"},{"def":"a short experience of something that helps you to understand it","examples":["glimpse (of something) The programme gives us a rare glimpse of a great artist at work.","glimpse into something Take a glimpse into the future of rail travel.","glimpse at something The exhibition offers a fascinating glimpse at life beneath the waves.","She got a glimpse of a very different way of life.","That smile afforded her a brief glimpse of the other side of Adam Burns.","This scene may give a rare glimpse of Charles's personal style as king."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to see somebody/something for a moment, but not very clearly","examples":["He'd glimpsed her through the window as he passed.","Anne is glimpsed briefly at the beginning of the film."],"opposite":"","synonyms":""},{"def":"to start to understand something","examples":["Suddenly she glimpsed the truth about her sister."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]