[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/glo/glory/glory__us_1.mp3","phonsUS":"/ˈɡlɔːri/","level":"C1","meanings":[{"def":"great success that brings somebody praise and honour and makes them famous","examples":["Olympic glory in the 100 metres","I do all the work and he gets all the glory.","She wanted to enjoy her moment of glory.","He came home a rich man, covered in glory.","He covered himself in glory and came home a rich man.","His moment of glory came when he won the Olympic downhill skiing event.","I didn't want to steal her glory, so I stayed in the background.","It was 19-year-old David Hagan who stole the points and the glory with a brilliant goal in the closing minutes of the game.","The force behind all Peter's reforms was the greater glory of the Russian state.","They are driven by a craving for personal glory.","Victory brought them glory, fame and riches.","young soldiers eager to win military glory"],"opposite":"","synonyms":""},{"def":"praise and worship of God","examples":["‘Glory to God in the highest’","They built many churches, great and small, to the glory of God."],"opposite":"","synonyms":""},{"def":"great beauty","examples":["The city was spread out beneath us in all its glory.","The house has now been restored to its former glory.","Seeing the Rockies in all their glory was an awesome experience.","The 18th-century building has been restored to its former glory.","You cannot appreciate the bridge's full glory by going over it; it is best viewed from below."],"opposite":"","synonyms":""},{"def":"something that is beautiful, impressive, or deserves praise","examples":["The temple is one of the glories of ancient Greece.","Her long black hair is her crowning glory (= most impressive feature).","The city's crowning glory is its Gothic cathedral."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["glory in","Old Glory","glory days","morning glory","reflected glory","Knickerbocker Glory","Land of Hope and Glory","Power and the Glory","glory in something"]},{"pos":"verb","level":"","meanings":[],"idioms":[],"phrasal":["glory in"],"related":[]}]