[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/goa/goal_/goal__us_1.mp3","phonsUS":"/ɡəʊl/","level":"A2","meanings":[{"def":"a frame with a net into which players must kick or hit the ball in order to score a point","examples":["He headed the ball into an open goal (= one that had nobody defending it).","in goal Nicky Roberts was outstanding in goal (= as goalkeeper).","The goalkeeper was injured so a defender had to go in goal."],"opposite":"","synonyms":""},{"def":"the act of kicking or hitting the ball into the goal; a point that is scored for this","examples":["She scored twenty goals in her first season.","United conceded two goals in the first half.","Liverpool won by three goals to one.","The winning goal came in the 71st minute.","a penalty goal","his first goal for Spain","Visconti scored one goal himself and made two for Lupo.","They scored three goals against the home team.","The second goal came from a penalty.","The referee disallowed the goal.","The fans were annoyed that the team gave away such a soft goal.","The equalizing goal came from Cole.","Despite letting in a goal, our girls did not let up and we held on for a well-deserved tie."],"opposite":"","synonyms":""},{"def":"something that you hope to achieve","examples":["to achieve/accomplish/reach a goal","My job is to help businesses meet their goals.","You need to set yourself some long-term goals.","Their goal was to eradicate malaria.","Their primary goal is to make a profit.","Our ultimate goal must be the preservation of the environment.","toward/towards a goal We are all working towards a common goal.","Set yourself targets that you can reasonably hope to achieve.","attainment targets in schools","What is the main objective of this project?","He continued to pursue his goal of becoming an actor.","The object is to educate people about road safety.","He joined the society for political ends.","That’s only OK if you believe that the end justifies the means (= bad methods of doing something are acceptable if the final result is good).","It is important to have explicit goals.","Our immediate goal is to earn enough money to keep the business going.","The prison service pursues the twin goals of the punishment and rehabilitation of offenders.","They have set themselves some ambitious goals.","their goal of providing free university education for everyone","He continued to pursue his goal of becoming a photographer.","The company has set itself some long-term organizational goals."],"opposite":"","synonyms":"target"}],"idioms":[],"phrasal":[],"related":["own goal","drop goal","goal area","goal kick","goal line","field goal","golden goal","goal poacher","goal difference","in-goal area","goal areas","goal kicks","goal lines","goal poachers","goal differences","in-goal areas"]}]