[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/gov/gover/government__us_1_rr.mp3","phonsUS":"/ˈɡʌvərnmənt/","level":"A2","meanings":[{"def":"the group of people who are responsible for controlling a country or a state","examples":["to lead/form a government","She has resigned from the Government.","The Government has/have been considering further tax cuts.","The government announced further austerity measures.","This legislation was passed under the last Conservative government.","EU national governments","the Nebraska state government","Ontario's new provincial government","The country still has an interim government.","the governments of many European countries","This was a decision taken by the government of the day.","the three branches of the US government","Foreign governments have been consulted about this decision.","government officials/ministers/employees","a government spokesman","a government department/agency","government policies/regulations","government spending/funding","A new government was formed in September of that year.","A puppet government was installed as the occupying forces withdrew.","According to government sources, two people died in the incident.","On May 23 a coalition government took office.","The former minister was relieved of his post in last month's extensive government reshuffle.","The government announced the cancellation of the dam project.","The group aims to overthrow the military government.","The hospital has been hit by government cuts.","The present government was elected last year.","The president dissolved the assembly and swore in an interim government.","The president has been meeting members of the French government.","The report on world poverty calls for urgent action from Western governments.","The socialists won 42% of the seats and formed a minority government.","This crisis could bring down the British government.","a national emergency that could cause the government to fall","a new government headed by a former military leader","calls for government intervention in the dispute","measures that were introduced under the last government","the country's new Communist government","Similar measures are being considered by the governments of El Salvador and Panama.","The Prime Minister was keen to emphasize his government's commitment to the agreement.","The government has been considering further tax cuts.","The interests of the state should not be confused with the interests of the government of the day.","There are bound to be cuts in government expenditure.","It is time we had a change of government."],"opposite":"","synonyms":""},{"def":"a particular system or method of controlling a country","examples":["Democratic government has now replaced military rule.","communist/totalitarian government","a federal system of government","The law empowers federal government to set standards which apply to all states.","We believe in low taxation and small government."],"opposite":"","synonyms":""},{"def":"the activity or the manner of controlling a country","examples":["We need strong government to take the country through this crisis.","The army retained a strong role in the government of the country.","in government At that time the Democrats were in government.","The two men got into a heated debate about the government of the disputed province.","a problem facing whichever party is in government","The Nationalists had been in government for most of the 1980s."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["big government","local government","self-government","central government","federal government","minority government","student government","government health warning","Her Majesty's Government","Scottish Government","government and binding theory","Commonwealth Heads of Government Meeting","Ministry of Housing, Communities and Local Government","Her Majesty’s Government","Government Communications Headquarters","Government Publishing Office"]}]