[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/gra/grab_/grab__us_1.mp3","phonsUS":"/ɡræb/","level":"B2","meanings":[{"def":"to take or hold somebody/something with your hand suddenly or roughly","examples":["grab somebody/something She grabbed his arm as he got up to leave.","She grabbed the child's hand and ran.","He grabbed hold of me and wouldn't let go.","He grabbed her around the throat and squeezed.","Someone grabbed me from behind.","grab somebody/something by something He grabbed Tom by the collar and dragged him outside.","grab something from somebody/something Jim grabbed a cake from the plate.","Don't grab—there's plenty for everyone.","He grabbed hold of a handrail to save himself from falling.","Somebody tried to grab her handbag from her."],"opposite":"","synonyms":""},{"def":"to try to take hold of something","examples":["grab at something She grabbed at the branch, missed and fell.","I grabbed at his arm as he ran past.","grab for something Kate grabbed for the robber's gun."],"opposite":"","synonyms":""},{"def":"to take advantage of an opportunity to do or have something","examples":["grab something This was my big chance and I grabbed it with both hands.","grab at something He'll grab at any excuse to avoid doing the dishes.","He'll grab at any excuse to avoid hard work."],"opposite":"","synonyms":""},{"def":"to have or take something quickly, especially because you are in a hurry","examples":["Let's grab a sandwich before we go.","I'll grab a bite to eat in town.","Grab a cab and get over here.","I managed to grab a couple of hours' sleep on the plane.","Grab a seat, I won't keep you a moment."],"opposite":"","synonyms":""},{"def":"to take something for yourself, especially in a selfish or greedy way","examples":["By the time we arrived, someone had grabbed all the good seats.","She's always trying to grab the limelight."],"opposite":"","synonyms":""},{"def":"to get somebody’s attention","examples":["I'll see if I can grab the waitress and get the bill.","Glasgow’s drugs problem has grabbed the headlines tonight (= been published as an important story in the newspapers).","The play grabs the audience’s attention from the very start."],"opposite":"","synonyms":""},{"def":"to take a picture from a television or video film, or from a computer screen, and store it as an image on a computer","examples":["You can use this keyboard shortcut to grab part of the screen."],"opposite":"","synonyms":""},{"def":"used to ask somebody whether they are interested in something or in doing something","examples":["How does the idea of a trip to Rome grab you?"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"how does… grab you?","def":"used to ask somebody whether they are interested in something or in doing something","examples":["How does the idea of a trip to Rome grab you?"]}],"phrasal":[],"related":["grab bag","land grab","power grab","smash-and-grab","grab bags","grab/hit/make the headlines","catch/get/grab some rays","catch, get, grab, take, etc. (a) hold of somebody/something"]},{"pos":"noun","level":"","meanings":[{"def":"a sudden attempt to take or hold somebody/something","examples":["He made a grab for her bag.","As the car swung round the corner, she held on to the grab handle to steady herself."],"opposite":"","synonyms":""},{"def":"a picture taken from a television or video film, or from a computer screen, stored as an image on a computer","examples":["a frame grab from CCTV","I posted the screen grab on Twitter."],"opposite":"","synonyms":""},{"def":"a piece of equipment that lifts and holds goods, for example the equipment that hangs from a crane","examples":[],"opposite":"","synonyms":""},{"def":"available for anyone who is interested","examples":["There are £25 000 worth of prizes up for grabs in our competition!"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"up for grabs","def":"available for anyone who is interested","examples":["There are £25 000 worth of prizes up for grabs in our competition!"]}],"phrasal":[],"related":[]}]