[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/gra/grade/grade__us_1.mp3","phonsUS":"/ɡreɪd/","level":"B1","meanings":[{"def":"a mark given in an exam or for a piece of school work","examples":["(British English) She got good grades in her exams.","(North American English) She got good grades on her exams.","70 per cent of students achieved Grade C or above.","an A-grade essay","I need to improve my grades.","She got a failing grade for that assignment.","The oral exam constitutes 10 per cent of the final grade.","The proportion of students getting A grades is up."],"opposite":"","synonyms":""},{"def":"(in the US school system) one of the levels in a school with children of similar age","examples":["Sam is in (the) second grade.","He skipped a grade so he finished high school early.","My son will be starting third grade this fall.","He moved up three grades in just a year.","These topics are suitable for seventh grade."],"opposite":"","synonyms":""},{"def":"the quality of a particular product or material","examples":["All the materials used were of the highest grade.","a piece of high grade building land","low grade steel","Grade A beef","a piece of top grade beef"],"opposite":"","synonyms":""},{"def":"a level of ability or rank that somebody has in an organization","examples":["salary/pay grades (= levels of pay)","She's still only on a secretarial grade.","She was offered a job at a lower grade.","The majority of staff are on the same grade.","large pay increases for senior grades","the people on management grades","The higher grades within the organization usually get bigger pay rises."],"opposite":"","synonyms":""},{"def":"how serious an illness is","examples":["low/high grade fever"],"opposite":"","synonyms":""},{"def":"a slope on a road or railway; the degree to which the ground slopes","examples":["The hill has a grade of 25 per cent.","We hiked up a short steep grade."],"opposite":"","synonyms":""},{"def":"a level of exam in musical skill","examples":["grade 6 piano"],"opposite":"","synonyms":""},{"def":"to reach the necessary standard; to succeed","examples":["About 10 per cent of trainees fail to make the grade."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"make the grade","def":"to reach the necessary standard; to succeed","examples":["About 10 per cent of trainees fail to make the grade."]}],"phrasal":[],"related":["O grade","low-grade","high-grade","grade school","grade crossing","ordinary grade","Standard Grade","grade point average","grade schools"]},{"pos":"verb","level":"B2","meanings":[{"def":"to give a grade to a student or to a piece of their written work","examples":["grade somebody/something I spent all weekend grading papers.","grade somebody/something + noun The best students are graded A.","I don't think he graded our essays fairly.","Who grades the students?"],"opposite":"","synonyms":""},{"def":"to arrange people or things in groups according to their ability, quality, size, etc.","examples":["be graded (by/according to something) The containers are graded according to size.","be graded from… to… Eggs are graded from small to extra large.","Responses were graded from 1 (very satisfied) to 5 (not at all satisfied).","be graded (as) something Ten beaches were graded as acceptable.","be graded for something The grammar exercises are graded for difficulty.","The containers are graded by size.","The timber is graded according to its thickness.","a series of modern stories carefully graded for beginner to intermediate students","finely graded nuances of language","The attacks were graded as mild, moderate or severe.","The gems are then graded by quality."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]