[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/gra/grain/grain__us_1.mp3","phonsUS":"/ɡreɪn/","level":"B1","meanings":[{"def":"the small hard seeds of food plants such as wheat, rice, etc.; a single seed of such a plant","examples":["Russia sold 12 million tons of grain abroad last year.","America’s grain exports","The journal reports that eating whole grains protects against diabetes.","grain of something a few grains of rice","Grain production has been falling in recent years.","There were just a few grains of corn left.","The government intends to import only five per cent of the country's grain.","The peasants had ceased to sow grain."],"opposite":"","synonyms":""},{"def":"a small hard piece of particular substances","examples":["a grain of salt/sand/sugar","I got a grain of sand in my eye."],"opposite":"","synonyms":""},{"def":"a very small amount","examples":["There isn't a grain of truth in those rumours.","If he had a grain of sensitivity he wouldn't have asked her about her divorce."],"opposite":"","synonyms":""},{"def":"a small unit of weight, equal to 0.00143 of a pound or 0.0648 of a gram, used for example for weighing medicines","examples":["The analysis showed a few grains of arsenic in the solution."],"opposite":"","synonyms":""},{"def":"the natural direction of lines in wood, cloth, etc. or of layers of rock; the pattern of lines that you can see","examples":["along/across the grain to cut a piece of wood along/across the grain","This wood has a beautiful natural grain."],"opposite":"","synonyms":""},{"def":"how rough or smooth a surface feels","examples":["wood of coarse/fine grain"],"opposite":"","synonyms":""},{"def":"to be or do something different from what is normal or natural","examples":["It really goes against the grain to have to work on a Sunday."],"opposite":"","synonyms":""},{"def":"used to warn somebody not to believe something completely","examples":["If I were you, I'd take everything he says with a grain of salt."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be/go against the grain","def":"to be or do something different from what is normal or natural","examples":["It really goes against the grain to have to work on a Sunday."]},{"idiom":"take something with a grain of salt","def":"used to warn somebody not to believe something completely","examples":["If I were you, I'd take everything he says with a grain of salt."]}],"phrasal":[],"related":["grain elevator","grain elevators","take something with a grain of salt"]}]