[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/gra/grasp/grasp__us_1.mp3","phonsUS":"/ɡræsp/","level":"C1","meanings":[{"def":"to take a strong hold of somebody/something","examples":["He grasped my hand and shook it warmly.","Kay grasped him by the wrist.","She was holding a large box.","I held the baby gently in my arms.","Hold on and don’t let go until I say so.","Survivors clung to pieces of floating debris.","She stood there, the flowers still clutched in her hand.","He felt himself slipping and clutched at a branch.","Grip the rope as tightly as you can.","He grasped my hand and shook it warmly.","They clasped hands (= held each other’s hands).","She clasped the children in her arms.","Hang on tight. We’re off!","Her hands were grasping at his coat.","She grasped him tightly by the wrist.","She grasped hold of the banister to support herself.","He grasped the pan by its handle."],"opposite":"","synonyms":"hold"},{"def":"to understand something completely","examples":["grasp something They failed to grasp the importance of his words.","grasp how, why, etc… She was unable to grasp how to do it.","grasp that… It took him some time to grasp that he was now a public figure.","I don’t understand the instructions.","Doctors still don’t understand much about the disease.","‘It opens like this.’ ‘Oh, I see.’","Oh yes, I see what you mean.","She didn’t get the joke.","I don’t get you.","Sorry—I don’t quite follow.","The plot is almost impossible to follow.","They failed to grasp the importance of his words.","The concept of infinity is almost impossible for the human mind to comprehend.","It's a difficult concept for children to understand/​grasp.","By this time, engineers understood/​had grasped the basic principles of aerodynamics.","a means by which students can more easily grasp the basics of science","Some of these concepts are very difficult to grasp.","She failed to grasp the significance of these facts.","I hadn't really grasped what they were talking about.","He was quick to grasp the basic principles.","He had not fully grasped the fact that he was the one who would pay for all this."],"opposite":"","synonyms":"understand"},{"def":"to take an opportunity without hesitating and use it","examples":["I grasped the opportunity to work abroad."],"opposite":"","synonyms":""},{"def":"to try all possible means to find a solution or some hope in a difficult or unpleasant situation, even though this seems very unlikely","examples":["I know I’m just clutching at straws here, but is it possible that the doctors are wrong?"],"opposite":"","synonyms":""},{"def":"to deal with a difficult situation without hesitating","examples":["The government now has the opportunity to grasp the nettle of prison reform."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"clutch/grasp at straws","def":"to try all possible means to find a solution or some hope in a difficult or unpleasant situation, even though this seems very unlikely","examples":["I know I’m just clutching at straws here, but is it possible that the doctors are wrong?"]},{"idiom":"grasp the nettle","def":"to deal with a difficult situation without hesitating","examples":["The government now has the opportunity to grasp the nettle of prison reform."]}],"phrasal":["grasp at"],"related":["grasp at","grasp at something","clutch/grasp at straws"]},{"pos":"noun","level":"C1","meanings":[{"def":"a strong hold of somebody/something or control over somebody/something","examples":["I grabbed him, but he slipped from my grasp.","She felt a firm grasp on her arm.","Don't let the situation escape from your grasp.","As soon as he relaxed his grasp on the rope, it was pulled out of his hands.","He kept the letter firmly in his grasp.","He slipped out of our grasp.","She kicked the gun out of his grasp.","She wrenched the bottle from his grasp.","The key was on a high shelf, just beyond her grasp.","The robber tried to free the case from her grasp.","The company continues to maintain its grasp on the business computer market."],"opposite":"","synonyms":""},{"def":"a person’s understanding of a subject or of difficult facts","examples":["He has a good grasp of German grammar.","beyond somebody's grasp These complex formulae are beyond the grasp of the average pupil.","As the drugs took hold, her grasp of reality began to slip slowly away.","Such complicated instructions are beyond the grasp of most of our students.","She has an excellent grasp of English grammar.","Make sure you have a good grasp of the facts before attempting to argue your case.","He had a limited grasp of the wider political issues.","a poor grasp of mathematics","Working with native speakers helped me get a good grasp of the language.","We have no intuitive grasp of the immensity of time.","These ideas are all beyond his grasp.","The task was beyond the intellectual grasp of some of the students."],"opposite":"","synonyms":""},{"def":"the ability to get or achieve something","examples":["within somebody's grasp Success was within her grasp.","Just when victory seemed within grasp, the referee blew his whistle."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]