[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/gra/grate/grateful__us_1.mp3","phonsUS":"/ˈɡreɪtfl/","level":"B1","meanings":[{"def":"feeling or showing thanks because somebody has done something kind for you or has done as you asked","examples":["Thank you for doing this. I really am so grateful.","grateful to somebody We are very grateful to all those who contributed.","grateful for something She said she was grateful for the support shown by the community.","grateful to somebody for something I am extremely grateful to all the teachers for their help.","grateful to do something She seems to think I should be grateful to have a job at all.","grateful (that…) He was grateful that she didn't tell his parents about the incident.","Grateful thanks are due to the following people for their help…","Kate gave him a grateful smile.","Thank you very much. It's very kind of you./You really shouldn't have.","Thank you so much for coming. It was really nice to see you.","I'm very grateful.","I do appreciate your help.","That's all right.","Don't mention it.","No problem.","My pleasure.","I'm glad I could help.","I am more than grateful for their generous response.","I'll be forever grateful for your help.","I'm eternally grateful that we managed to go there before the war.","I'm immensely grateful to you for your support.","I'm just grateful the injury is not as bad as we'd feared.","We are deeply grateful to you and your family.","Rebecca gave him a grateful look."],"opposite":"","synonyms":""},{"def":"used to make a request, especially in a letter or in a formal situation","examples":["I would be grateful if you could send the completed form back as soon as possible.","I would be most grateful if you would keep this matter confidential.","grateful for something We would be grateful for any information you can give us."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Grateful Dead","be grateful/thankful for small mercies"]}]