[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/gri/grid_/grid__us_1.mp3","phonsUS":"/ɡrɪd/","level":"C1","meanings":[{"def":"a pattern of straight lines, usually crossing each other to form squares","examples":["New York’s grid of streets","The artist drew a set of grid lines over the area to be painted.","We superimposed a grid over the image.","the Manhattan street grid"],"opposite":"","synonyms":""},{"def":"a frame of metal or wooden bars that are parallel or cross each other","examples":[],"opposite":"","synonyms":""},{"def":"a pattern of squares on a map that are marked with letters or numbers to help you find the exact position of a place","examples":["The grid reference is C8.","An Ordnance Survey grid reference gives the position of a place to within 100 metres.","Each of the grid squares on the map is equal to one square kilometre.","The grid lines on the map run north-south."],"opposite":"","synonyms":""},{"def":"a system of electric wires or pipes carrying gas, for sending power over a large area","examples":["the national grid (= the electricity supply in a country)","the development of the country’s electricity grid","Power can be fed from wind generators into the electricity grid system."],"opposite":"","synonyms":""},{"def":"a pattern of lines marking the starting positions for the racing cars","examples":["The 20-year-old didn't get the best of starts off the grid."],"opposite":"","synonyms":""},{"def":"a number of computers that are linked together using the internet so that they can share power, data, etc. in order to work on difficult problems","examples":[],"opposite":"","synonyms":""},{"def":"not using the public supplies of electricity, gas, water, etc.","examples":["The mountain cabin is entirely off the grid.","You can produce your own power and live off the grid."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"off the grid","def":"not using the public supplies of electricity, gas, water, etc.","examples":["The mountain cabin is entirely off the grid.","You can produce your own power and live off the grid."]}],"phrasal":[],"related":["off-grid","cattle grid","national grid","starting grid","off-the-grid","National Grid for Learning"]}]