[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/gri/grip_/grip__us_1.mp3","phonsUS":"/ɡrɪp/","level":"C1","meanings":[{"def":"an act of holding somebody/something tightly; a particular way of doing this","examples":["Keep a tight grip on the rope.","to loosen/release/relax your grip","She tried to get a grip on the icy rock.","The climber slipped and lost her grip.","She struggled from his grip.","Try adjusting your grip on the racket.","He finally broke her grip and escaped.","He still had a firm grip on my arm.","Her upper arms were seized in an iron grip.","His grip slackened and she tore herself away.","Hold the microphone in a firm grip.","Keep a secure grip on the rope at all times.","Robert tightened his grip on her shoulder.","She felt his grip tighten painfully on her wrist.","She relaxed her grip on the door frame.","She slipped and lost her grip of the rope.","She was powerless in his iron grip.","Taking a tight grip on the hook, he began to pull it closer.","(figurative) Winter still held them in its iron grip."],"opposite":"","synonyms":""},{"def":"control or power over somebody/something","examples":["The home team took a firm grip on the game.","We need to tighten the grip we have on the market.","The Prime Minister needs to keep a tight grip on his party.","We need to keep a tight grip on costs.","They managed to strengthen their grip on the southern part of the country.","The Church does not have a strong grip on the population."],"opposite":"","synonyms":""},{"def":"an understanding of something","examples":["I couldn't get a grip on what was going on.","You need to keep a good grip on reality in this job.","The government does not seem to have a very firm grip on the economy.","She has a tenuous grip on reality."],"opposite":"","synonyms":""},{"def":"the ability of something to move over a surface without slipping","examples":["These tyres give the bus better grip in slippery conditions.","This type of sole gives a good grip on snow and ice."],"opposite":"","synonyms":""},{"def":"a part of something that has a special surface so that it can be held without the hands slipping","examples":["the grip on a golf club"],"opposite":"","synonyms":""},{"def":"a small thin piece of metal or plastic folded in the middle, used by women for holding their hair in place","examples":[],"opposite":"","synonyms":""},{"def":"a person who prepares and moves the cameras, and sometimes the lighting equipment, when a film is being made","examples":[],"opposite":"","synonyms":""},{"def":"a large soft bag, used when travelling","examples":[],"opposite":"","synonyms":""},{"def":"to begin to understand and deal with something difficult","examples":["I'm slowly getting to grips with the language.","They have so far failed to come to grips with the ecological problems."],"opposite":"","synonyms":""},{"def":"to improve your behaviour or control your emotions after being afraid, upset or angry","examples":["I have to take a grip on myself, he told himself firmly.","(informal) Get a grip! (= make an effort to control your emotions)"],"opposite":"","synonyms":""},{"def":"experiencing something unpleasant that cannot be stopped","examples":["a country in the grip of recession"],"opposite":"","synonyms":""},{"def":"to become unable to understand or control a situation","examples":["Sometimes I feel I'm losing my grip."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"come/get to grips with something","def":"to begin to understand and deal with something difficult","examples":["I'm slowly getting to grips with the language.","They have so far failed to come to grips with the ecological problems."]},{"idiom":"get/take a grip (on yourself)","def":"to improve your behaviour or control your emotions after being afraid, upset or angry","examples":["I have to take a grip on myself, he told himself firmly.","(informal) Get a grip! (= make an effort to control your emotions)"]},{"idiom":"in the grip of something","def":"experiencing something unpleasant that cannot be stopped","examples":["a country in the grip of recession"]},{"idiom":"lose your grip (on something)","def":"to become unable to understand or control a situation","examples":["Sometimes I feel I'm losing my grip."]}],"phrasal":[],"related":["key grip"]},{"pos":"verb","level":"C1","meanings":[{"def":"to hold something tightly","examples":["grip something ‘Please don't go,’ he said, gripping her arm.","grip on to something She gripped on to the railing with both hands.","She was holding a large box.","I held the baby gently in my arms.","Hold on and don’t let go until I say so.","Survivors clung to pieces of floating debris.","She stood there, the flowers still clutched in her hand.","He felt himself slipping and clutched at a branch.","Grip the rope as tightly as you can.","He grasped my hand and shook it warmly.","They clasped hands (= held each other’s hands).","She clasped the children in her arms.","Hang on tight. We’re off!","She gripped hard at the arms of her chair.","Grip the rope as tightly as you can."],"opposite":"","synonyms":"hold"},{"def":"to interest or have a strong effect on somebody; to hold somebody’s attention","examples":["The book grips you from start to finish.","I was totally gripped by the story.","The campaign gripped people's imagination.","The atmosphere of the World Cup gripped the nation."],"opposite":"","synonyms":""},{"def":"to have a powerful effect on somebody/something","examples":["I was gripped by a feeling of panic.","A sudden fear gripped me.","Terrorism has gripped the country for the past two years."],"opposite":"","synonyms":""},{"def":"to hold onto or to move over a surface without slipping","examples":["tyres that grip the road"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]