[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/gro/group/group__us_1.mp3","phonsUS":"/ɡruːp/","level":"A1","meanings":[{"def":"a number of people or things that are together in the same place or that are connected in some way","examples":["group of somebody/something a group of people/students/friends","A group of us are going to the theatre this evening.","a group of islands in the Indian ocean","English is a member of the Germanic group of languages.","in groups People were standing around in small groups.","as a group The gorillas go foraging for food as a group.","The proportion of single-parent families varies between different income groups.","Members of some ethnic groups say that the law is discriminatory.","Disabled drivers are an ever-growing minority group.","Minority groups are entitled to equal protection under the law.","She has a very wide group of friends.","The animals live in family groups of 10–20 individuals.","The president met with a select group of senior ministers.","Within a group, each individual had a definite status.","a group of young mothers","A large group of people had collected outside the building.","On the hillside was a little group of houses.","Students were sitting around in groups on the grass."],"opposite":"","synonyms":""},{"def":"a number of people who work or do something together or share particular beliefs","examples":["The residents formed a community action group.","I've joined a writing group.","a research/study/discussion group","a human rights group","a militant/rebel/terrorist group","Other members of the group agree.","group of somebody She leads a group of scientists at the Medical Research Centre.","in a group There are fifteen of us in the group.","to work in groups","into groups The students were divided into groups of four.","Classes will involve both individual and group activities.","Only group members are allowed to vote.","She asked her students to get into groups of four.","The strangers who came together for the course soon became a cohesive group.","We divided the class into small groups.","a discussion group that meets once a month","I divided the class into groups of four.","It costs $20 to join the group.","She goes to a drama group every Saturday.","She worked with groups of college students who had literacy problems.","The college has a small but active women's group.","They formed a small group that was later to grow into a major protest movement.","We have set up a self-help group for victims of crime.","The move was condemned by human rights groups.","Environmental groups were delighted with the tone of the report."],"opposite":"","synonyms":""},{"def":"a number of companies that are owned by the same person or organization","examples":["This acquisition will make them the largest newspaper group in the world.","The Burton group announced its quarterly figures yesterday.","Our group sales director attended the conference in Munich this year."],"opposite":"","synonyms":""},{"def":"a number of musicians who perform together, especially to play pop music","examples":["She sings in a rock group.","The group formed back in 1992.","The group has split up and re-formed several times with different musicians.","He left the group last year to pursue a solo career."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["in-group","age group","group hug","out-group","blood group","book group","buzz group","focus group","food group","group work","peer group","user group","action group","ginger group","group captain","group therapy","reading group","support group","advocacy group"]},{"pos":"verb","level":"SYMBOL","meanings":[{"def":"to gather into a group; to make somebody/something form a group","examples":["group somebody/something/yourself (round/around somebody/something) The children grouped themselves around their teacher.","Most of the houses were grouped around the church.","group round/around somebody/something We all grouped around the tree for a photograph.","They sat grouped around the fire.","group (somebody/something) together The colleges grouped together to offer a wider range of courses."],"opposite":"","synonyms":""},{"def":"to divide people or things into groups of people or things that are similar in some way","examples":["group somebody/something (together) (by something) The books are grouped together by subject.","group somebody/something + adv./prep. Contestants were grouped according to age and ability.","The proteins have been grouped into five different classes.","The children were grouped by age.","Eggs were grouped according to colour and size.","The names were grouped under four different headings.","These stories can be loosely grouped into three types.","Works in the exhibition are grouped thematically.","Topics for the second year can be grouped under three headings.","The England team was grouped with Uruguay and Holland."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]