[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/gro/grow_/grow__us_1.mp3","phonsUS":"/ɡrəʊ/","level":"A1","meanings":[{"def":"to increase in size, number, strength or quality","examples":["The sector is growing at a phenomenal rate.","The performance improved as their confidence grew.","Opposition to the latest proposals is growing steadily.","The market is growing rapidly.","Sales are growing fast.","The business has grown exponentially over the past ten years.","Fears are growing for the safety of a teenager who disappeared a week ago.","grow by something The economy is growing by roughly 2 per cent a year.","The company profits grew by 5 per cent last year.","grow in something The family has grown in size recently.","This approach is growing in popularity.","She is growing in confidence all the time.","grow from something Her media empire grew from quite small beginnings.","grow to something That number will grow to two billion users in 2025.","grow from something to something The city's population has grown from about 50 000 to over a million in 20 years.","+ adj. to grow larger/stronger","The company is growing bigger all the time.","The awful jokes made us all groan.","He let out a groan of pain.","The business has grown hugely in the last ten years.","Although he's a grown man, he'll always be our little boy.","Profits are expected to grow by 10 per cent next year.","She continued to grow in confidence","The Chinese economy has grown at a record pace.","Well before a billionth of a second had elapsed the universe started to grow exponentially."],"opposite":"","synonyms":""},{"def":"to become bigger or taller and develop into an adult","examples":["You've grown since the last time I saw you!","The puppies grow quickly during the first six months.","+ noun Nick's grown almost an inch in the last month.","+ adj. to grow bigger/taller/older"],"opposite":"","synonyms":""},{"def":"to exist and develop in a particular place; to make plants grow","examples":["The region is too dry for plants to grow.","Tomatoes grow best in direct sunlight.","grow to something These roses grow to a height of 6 feet.","grow from something This is a tree that grows well from cuttings.","grow something The land is used to grow crops.","We need to grow our food more efficiently.","I didn't know they grew rice in France.","The plants were grown in controlled conditions.","grow something from something I grew all these flowers from one packet of seeds.","the nettles that grew thickly around the house","organically grown produce","an attractive plant which is very hardy and easy to grow","The tree grew from a small acorn.","Small acorns grow into great oak trees.","A rose had been allowed to grow unchecked up one of the walls.","As the island subsided the reef grew upwards and outwards."],"opposite":"","synonyms":""},{"def":"to become longer; to allow something to become longer by not cutting it","examples":["I've decided to let my hair grow.","grow something I've decided to grow my hair.","I didn't recognize him—he's grown a beard."],"opposite":"","synonyms":""},{"def":"to begin to have a particular quality or feeling over a period of time","examples":["He had grown old and fat.","They were growing tired of her unreasonable behaviour.","My eyes soon grew accustomed to the darkness.","Mark and Jenny were growing closer every day.","As time went on he grew more and more impatient.","The skies grew dark and it began to rain.","She grew braver with time."],"opposite":"","synonyms":""},{"def":"to gradually begin to do something","examples":["I'm sure you'll grow to like her in time.","He grew to understand her reasons for leaving."],"opposite":"","synonyms":""},{"def":"to develop and improve particular qualities or skills","examples":["She continues to grow as an artist.","A secure background will help a child to grow emotionally."],"opposite":"","synonyms":""},{"def":"to increase the size, quality or number of something","examples":["We are trying to grow the business."],"opposite":"","synonyms":""},{"def":"used to say that when you are away from somebody that you love, you love them even more","examples":[],"opposite":"","synonyms":""},{"def":"something large and successful often begins in a very small way","examples":[],"opposite":"","synonyms":""},{"def":"used to tell somebody not to use something or spend money carelessly because you do not have a lot of it","examples":[],"opposite":"","synonyms":""},{"def":"to not delay in getting things done","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"absence makes the heart grow fonder","def":"used to say that when you are away from somebody that you love, you love them even more","examples":[]},{"idiom":"great/tall oaks from little acorns grow","def":"something large and successful often begins in a very small way","examples":[]},{"idiom":"it/money doesn’t grow on trees","def":"used to tell somebody not to use something or spend money carelessly because you do not have a lot of it","examples":[]},{"idiom":"not let the grass grow under your feet","def":"to not delay in getting things done","examples":[]}],"phrasal":["grow apart","grow away from","grow back","grow into","grow on","grow out","grow out of","grow up"],"related":["grow on","grow-op","grow out","grow up","grow back","grow into","grow apart","grow out of","grow away from","Green Grow the Rushes O","grow operation","grow on somebody","grow into something","grow something","grow away from somebody","grow out of something","grow apart (from somebody)"]}]