[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/gro/growt/growth__us_1.mp3","phonsUS":"/ɡrəʊθ/","level":"B1","meanings":[{"def":"the process in people, animals or plants of growing physically, mentally or emotionally","examples":["Lack of water will stunt the plant's growth.","Remove dead leaves to encourage new growth.","nutrients for plant growth","a concern with personal (= mental and emotional) growth and development","It may be the most effective way to inhibit the growth of cancer cells","growth hormones (= that make somebody/something grow faster)","Give the plants a good pruning to encourage growth.","Lack of food had stunted his growth.","the excessive growth of algae in rivers"],"opposite":"","synonyms":""},{"def":"an increase in the size, amount or degree of something","examples":["The report links population growth with rural poverty.","revenue/earnings/sales/productivity growth","growth in something the rapid growth in violent crime","the growth in the number of older people in the UK","His book describes the growth of nationalism in Germany before the Second World War.","Recent years have seen a huge growth of interest in alternative medicine","the exponential growth in world population","the explosive growth of personal computers in the 1990s","new measures to control the growth of traffic on the roads","There was a rapid growth in the numbers of private cars.","The factory has achieved a steady growth in output."],"opposite":"","synonyms":""},{"def":"an increase in economic activity","examples":["policies aimed at sustaining economic growth","a period of slow growth","a disappointing year of little growth in Britain and America","strong/continued/future growth","The country is experiencing a period of high growth.","to stimulate/promote/drive growth","to experience/achieve growth","an annual growth rate of 10 per cent","growth forecasts/prospects/opportunities/patterns","markets with enormous growth potential","contrasting UK and Swedish growth strategies","The economy enjoyed the highest growth rate in Asia.","a vicious circle of low growth and low productivity","real GDP growth","Communications technology has proved to be a growth area."],"opposite":"","synonyms":""},{"def":"a mass of cells caused by a disease that forms on or inside a person, an animal or a plant","examples":["a malignant growth","He had a cancerous growth on his lung."],"opposite":"","synonyms":""},{"def":"something that has grown","examples":["The forest's dense growth provides nesting places for a wide variety of birds.","several days’ growth of beard","Prune the shrub heavily now and fresh green growths should appear in March and April."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["growth ring","growth mindset","growth rings","growth mindsets"]}]