[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/gua/guara/guarantee__us_1.mp3","phonsUS":"/ˌɡærənˈtiː/","level":"B2","meanings":[{"def":"to promise to do something; to promise something will happen","examples":["guarantee something Basic human rights, including freedom of speech, are now guaranteed.","They told aid workers to leave, saying they could not guarantee their safety.","I personally guarantee total and immediate support in all measures undertaken.","guarantee (that)… We cannot guarantee (that) our flights will never be delayed.","guarantee somebody something The ticket will guarantee you free entry.","guarantee to do something We guarantee to deliver your goods within a week."],"opposite":"","synonyms":""},{"def":"to give a written promise to replace or repair a product free if it goes wrong","examples":["All our electrical goods are fully guaranteed.","guarantee something against something This iron is guaranteed for a year against faulty workmanship."],"opposite":"","synonyms":""},{"def":"to make something certain to happen","examples":["guarantee something Tonight's victory guarantees the team's place in the final.","guarantee somebody something These days getting a degree doesn't guarantee you a job.","The process of training and qualification does not automatically guarantee you a job.","A degree does not automatically guarantee you a job.","The complicated electoral system effectively guarantees the president's re-election."],"opposite":"","synonyms":""},{"def":"to be certain that something will happen","examples":["You can guarantee (that) the children will start being naughty as soon as they have to go to bed.","The outcome is by no means guaranteed.","I can absolutely guarantee that you will enjoy the show."],"opposite":"","synonyms":""},{"def":"to agree to be legally responsible for something or for doing something, especially for paying back money that somebody else owes if they cannot pay it back themselves","examples":["guarantee something to guarantee a bank loan","guarantee to do something to guarantee to pay somebody’s debts","guarantee that… I guarantee that he will appear in court.","His father agreed to guarantee the bank loan."],"opposite":"","synonyms":""},{"def":"to be certain to have a particular result","examples":["If we try to keep it a secret, she's guaranteed to find out.","That kind of behaviour is guaranteed to make him angry.","The film is virtually guaranteed to do well at the box office.","It’s certain that they will agree.","They are certain to agree.","She’s sure to be picked for the team.","It’s sure to rain.","Is it definite that he’s leaving?","That kind of behaviour is guaranteed to make him angry."],"opposite":"","synonyms":"certain"}],"idioms":[{"idiom":"be guaranteed to do something","def":"to be certain to have a particular result","examples":["If we try to keep it a secret, she's guaranteed to find out.","That kind of behaviour is guaranteed to make him angry.","The film is virtually guaranteed to do well at the box office.","It’s certain that they will agree.","They are certain to agree.","She’s sure to be picked for the team.","It’s sure to rain.","Is it definite that he’s leaving?","That kind of behaviour is guaranteed to make him angry."]}],"phrasal":[],"related":["money-back guarantee","Export Credits Guarantee Department"]},{"pos":"noun","level":"B2","meanings":[{"def":"a formal promise that you will do something or that something will happen","examples":["They are demanding certain guarantees before they sign the treaty.","guarantee of something to give a guarantee of good behaviour","guarantee (that…) He gave me a guarantee that it would never happen again.","The country gives a constitutional guarantee of the rights of minorities.","The demonstrators were demanding guarantees for fair elections.","There was no guarantee against misuse of the king's power.","We didn't get any firm guarantee of a loan.","He received a guarantee that the documents would not be published.","The union wants cast-iron guarantees that there will be no job losses.","They insisted on having a written guarantee of good conduct from her."],"opposite":"","synonyms":""},{"def":"a written promise given by a company that something you buy will be replaced or repaired without payment if it goes wrong within a particular period","examples":["The television comes with a year's guarantee.","guarantee against something We provide a 5-year guarantee against rust.","under guarantee The watch is still under guarantee.","The car is still under guarantee, so you should be able to get it repaired free of charge.","The garage gives a year's guarantee for all repair work.","The window frames carry a 20-year guarantee against rot or decay."],"opposite":"","synonyms":""},{"def":"something that makes something else certain to happen","examples":["guarantee of something Career success is no guarantee of happiness.","guarantee of doing something Arriving early is no guarantee of getting a place.","guarantee (that…) There's no guarantee that she'll come (= she may not come)."],"opposite":"","synonyms":""},{"def":"money or something valuable that you give or promise to a bank, for example, to make sure that you will do what you have promised","examples":["We had to offer our house as a guarantee when getting the loan."],"opposite":"","synonyms":""},{"def":"a written promise to pay back money that somebody else owes, or do something that somebody else promised to do, if they cannot do it themselves","examples":["A close relative, usually a parent, can provide a guarantee for the loan."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]