[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/gua/guard/guard__us_1.mp3","phonsUS":"/ɡɑːrd/","level":"B1","meanings":[{"def":"a person, such as a soldier, a police officer or a prison officer, who protects a place or people, or prevents prisoners from escaping","examples":["prison/border guards","The building is protected by armed guards.","The prisoner slipped past the guards on the gate and escaped.","A guard was posted outside the building.","Guards had been posted all around the TV studio.","Guards patrolled the perimeter fence.","The border guard checked our papers before waving us through."],"opposite":"","synonyms":""},{"def":"the act or duty of protecting property, places or people from attack or danger; the act or duty of preventing prisoners from escaping","examples":["on guard a sentry on guard (= at his or her post, on duty)","to be on guard duty","under guard The escaped prisoner was brought back under armed guard.","The terrorist was kept under police guard.","Two sentries stood on guard.","The suspects were kept under police guard.","He fell asleep on guard duty.","He was doing guard duty at the entrance to the embassy.","Would you like me to keep guard of your room?","Two police officers kept guard over the burned-out building.","The prisoners were under close guard.","The accused was taken to court under armed guard.","Soldiers stood guard on the city gates.","Several police officers were on guard outside the factory.","He arrived under heavy guard."],"opposite":"","synonyms":""},{"def":"a group of people, such as soldiers or police officers, who protect somebody/something","examples":["the captain of the guard","the changing of the guard (= when one group replaces another)","The guard is/are being inspected today.","Fellow airmen provided a guard of honour at his wedding.","The president always travels with an armed guard.","Fellow soldiers from Corporal Smith's regiment formed a guard of honour at his wedding.","The guard was changed every two hours.","A group of tourists was watching the changing of the guard outside the palace.","It would only be a matter of minutes before the alarm was raised and the guard called out.","The coffin was accompanied by a guard of honour."],"opposite":"","synonyms":""},{"def":"(in the UK and some other countries) special regiments of soldiers whose original duty was to protect the king or queen","examples":["the Scots Guards","a Guards officer"],"opposite":"","synonyms":""},{"def":"something that covers a part of a person’s body or a dangerous part of a machine to prevent injury","examples":["All players wear helmets and face guards.","Ensure the guard is in place before operating the machine."],"opposite":"","synonyms":""},{"def":"conductor (= a person who is in charge of a train and travels with it, but does not drive it)","examples":[],"opposite":"","synonyms":""},{"def":"a position you take to defend yourself, especially in a sport such as boxing or fencing","examples":["to drop/keep up your guard","(figurative) In spite of the awkward questions the minister never let his guard fall for a moment.","Matt relaxed a little, dropping his guard.","No one can keep their guard up all the time."],"opposite":"","synonyms":""},{"def":"one of the two players on a basketball team who are mainly responsible for staying close to players of the other team to stop them from scoring","examples":[],"opposite":"","synonyms":""},{"def":"one of the two players on an American football team who play either side of the centre forward","examples":[],"opposite":"","synonyms":""},{"def":"to be very careful and prepared for something difficult or dangerous","examples":["He was always on his guard against moneymaking schemes."],"opposite":"","synonyms":""},{"def":"to stop being careful and preparing yourself for possible danger or difficulty","examples":["You can never drop your guard with a two-year-old.","Even when he's winning, he never drops his guard."],"opposite":"","synonyms":""},{"def":"to watch or protect somebody/something","examples":["Four soldiers stood guard over the coffin.","One of the men kept guard, while the other broke into the house."],"opposite":"","synonyms":""},{"def":"not careful or prepared for something difficult or dangerous","examples":["The lawyer’s apparently innocent question was designed to catch the witness off (his) guard.","He caught me completely off guard.","The question seemed to catch him off his guard."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be on your guard","def":"to be very careful and prepared for something difficult or dangerous","examples":["He was always on his guard against moneymaking schemes."]},{"idiom":"drop your guard","def":"to stop being careful and preparing yourself for possible danger or difficulty","examples":["You can never drop your guard with a two-year-old.","Even when he's winning, he never drops his guard."]},{"idiom":"mount/stand/keep guard (over somebody/something)","def":"to watch or protect somebody/something","examples":["Four soldiers stood guard over the coffin.","One of the men kept guard, while the other broke into the house."]},{"idiom":"off (your) guard","def":"not careful or prepared for something difficult or dangerous","examples":["The lawyer’s apparently innocent question was designed to catch the witness off (his) guard.","He caught me completely off guard.","The question seemed to catch him off his guard."]}],"phrasal":[],"related":["guard dog","color guard","guard rail","land guard","point guard","shin guard","advance guard","guard against","pulling guard","old guard","security guard","shooting guard","Home Guard","Changing the Guard","National Guard","Yeomen of the Guard","United States Coast Guard"]},{"pos":"verb","level":"B1","meanings":[{"def":"to protect property, places or people from attack or danger","examples":["Armed officers guarded the entrance.","The dog was guarding its owner's luggage.","political leaders guarded by the police","You can't get in; the whole place is guarded.","(figurative) The recipe is a closely guarded secret.","He was under instructions to guard the key with his life.","She jealously guarded her position of power.","The military base is closely guarded.","The mountain pass is well guarded.","a bird carefully guarding its eggs","pop stars who need to be guarded from their fans","strictly guarded privacy","tightly guarded privacy","Delegates at the conference were guarded by the police.","They guard the city against attack."],"opposite":"","synonyms":""},{"def":"to prevent prisoners from escaping","examples":["The prisoners were guarded by soldiers."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["guard against"],"related":[]}]