[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/gue/guess/guess__us_1.mp3","phonsUS":"/ɡes/","level":"A1","meanings":[{"def":"to try and give an answer or make a judgement about something without being sure of all the facts","examples":["I don't really know. I'm just guessing.","guess at something We can only guess at her reasons for leaving.","guess + adv. He guessed right/wrong.","guess (that)… I'd guess that she's about 30.","guess where, who, etc… Can you guess where I've been?","guess something Can you guess his age?","I think it's likely that these people know each other.","I imagine she's his wife.","They might/​may/​could be related.","I would think/​imagine/​guess they've been waiting for some time.","I guess that the car has broken down.","I think this has probably happened before.","It looks to me as though the woman is very angry.","Perhaps/​Probably/​Possibly/​It may be that/​Maybe there has been an accident.","I was only guessing at her age.","If you think I'm lying, well guess again.","That's not the answer. Guess again.","We can only guess how fast a dinosaur might have run.","What star sign are you? No, let me guess.","We can't begin to guess his reasons.","What did you get her for Christmas? Let me guess.","How old do you think I am? Go on, guess!"],"opposite":"","synonyms":""},{"def":"to find the right answer to a question or the truth without knowing all the facts","examples":["guess something She guessed the answer straight away.","guess what, where, etc… You'll never guess what she told me.","guess (that)… You would never guess (that) she had problems. She’s always so cheerful.","So it was Rob who broke the window? I might have guessed!","If I had to guess, I'd say she was the one responsible for this.","If you haven't already guessed, I'm going out with Steve.","It's not hard to guess where they went.","Jane had guessed wrong about who was responsible for the fire.","She guessed from his expression that he had not won.","You'll never guess who I saw yesterday!","an easily guessed password","I guessed from John's expression that something was badly wrong.","I guessed, rightly, that the keys would be under the doormat.","If you can guess my age, I'll buy you a drink!","It's not hard to guess who he's gone to see.","You'll never guess where they've gone.","You can probably guess how she reacted!","It's impossible to guess what they might have been feeling."],"opposite":"","synonyms":""},{"def":"used to show that you are going to say something surprising or exciting","examples":["Guess what! He's asked me out!","Guess who I've just seen!","Guess how long it took me to get here.","Guess who's here!"],"opposite":"","synonyms":""},{"def":"to suppose that something is true or likely","examples":["I guess (that) you’ll be looking for a new job now.","I guess I'm just lucky.","He didn't see me, I guess.","‘Are you ready to go?’ ‘Yeah, I guess so.’","‘They aren't coming, then?’ ‘I guess not.’","‘Do you really love her?’ ‘I guess so.’","‘Are you coming with us?’ ‘I guess so.’","‘Can I have another cookie?’ ‘I guess so, but that's the last one.’","I guess you're mad at me."],"opposite":"","synonyms":""},{"def":"to not tell somebody about your plans or what is going to happen next","examples":["It's the kind of book that keeps you guessing right to the end."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"keep somebody guessing","def":"to not tell somebody about your plans or what is going to happen next","examples":["It's the kind of book that keeps you guessing right to the end."]}],"phrasal":[],"related":["second-guess","miss your guess","an educated guess","anybody’s/anyone’s guess","your guess is as good as mine"]},{"pos":"noun","level":"A1","meanings":[{"def":"an attempt to give an answer or an opinion when you cannot be certain if you are right","examples":["(British English) to have/make a guess","(North American English) to take a guess","Go on! Have a guess!","If I might hazard a guess, I'd say she was about thirty.","Who do you think I saw yesterday? I'll give you three guesses.","They might be here by 3—but that's just a rough guess (= not exact).","guess at something But this is clearly just a wild guess (= not sensible or accurate) at what his motives could have been.","guess about something The article is based on guesses about what might happen in the future.","guess as to something the market's best guess as to the possible performance of the company","guess (that…) My guess is that we won't hear from him again.","at a guess At a guess, there were forty people at the party.","‘Where's Tom?’ ‘I'll give you three guesses!’","April is a safe guess for first deliveries.","At a guess, I'd say there's a problem with the fuel pump.","At a rough guess, I'd say we're about twenty miles from home.","He made a wild guess as to how much the piano might cost.","If you don't know the answer, have a guess.","What's your best guess on what's going to happen?","a guess based on your experience","It's probably about 300 kilometres away, but that's just a rough guess.","My guess is that not many people will turn out today."],"opposite":"","synonyms":""},{"def":"something that nobody can be certain about","examples":["What will happen next is anybody's guess."],"opposite":"","synonyms":""},{"def":"a guess that is based on some degree of knowledge, and is therefore likely to be correct","examples":["Let's make an educated guess.","As a vet, he could make an educated guess as to what was wrong with his stomach.","She could make an educated guess as to what was wrong with him."],"opposite":"","synonyms":""},{"def":"used to tell somebody that you do not know any more about a subject than the person that you are talking to does","examples":["‘Who's going to win?’ ‘Your guess is as good as mine.’"],"opposite":"","synonyms":""},{"def":"to make a mistake","examples":["Unless I miss my guess, your computer needs a new hard drive.","If you miss your guess, you lose 10 points."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"anybody’s/anyone’s guess","def":"something that nobody can be certain about","examples":["What will happen next is anybody's guess."]},{"idiom":"an educated guess","def":"a guess that is based on some degree of knowledge, and is therefore likely to be correct","examples":["Let's make an educated guess.","As a vet, he could make an educated guess as to what was wrong with his stomach.","She could make an educated guess as to what was wrong with him."]},{"idiom":"your guess is as good as mine","def":"used to tell somebody that you do not know any more about a subject than the person that you are talking to does","examples":["‘Who's going to win?’ ‘Your guess is as good as mine.’"]},{"idiom":"miss your guess","def":"to make a mistake","examples":["Unless I miss my guess, your computer needs a new hard drive.","If you miss your guess, you lose 10 points."]}],"phrasal":[],"related":[]}]