[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/gue/guest/guest__us_1.mp3","phonsUS":"/ɡest/","level":"A2","meanings":[{"def":"a person that you have invited to your house or to a particular event that you are paying for","examples":["They only use the dining room when they have guests.","She had invited six guests to dinner.","She felt that she had to entertain her guests.","There were more than 100 wedding guests.","as a guest I went to the theatre club as Helen's guest.","He was the guest of honour (= the most important person invited to an event).","Liz was not on the guest list.","We have guests staying this weekend.","She tactfully discouraged their uninvited guests from staying longer.","She was treated as an honoured guest.","The banquet was attended by 200 guests.","The best man and his assistants welcomed the reception guests as they arrived.","The best man welcomed the wedding guests as they arrived.","We were made to feel like unwanted guests in the country.","When we have guests, they usually sleep in the study.","You are always a welcome guest in our house.","You're the guest—you can choose what we watch.","He did his best to make the guests feel at home.","He was the ideal dinner party guest.","How many guests are coming tonight?","I got the feeling that this guest was particularly unwelcome.","She had invited over 100 guests.","Some of the wedding guests were staying in the hotel.","The guests gathered for dinner on the terrace.","Their names were not on the guest list."],"opposite":"","synonyms":""},{"def":"a person who is staying at a hotel, etc.","examples":["We have accommodation for 500 guests.","Guests should vacate their rooms by 10.30 a.m.","guests at the Grand Hotel"],"opposite":"","synonyms":""},{"def":"a customer in a restaurant","examples":["Restaurant guests can enjoy suberb views across the bay as they dine."],"opposite":"","synonyms":""},{"def":"a famous person or performer who takes part in a television show, concert or other entertainment","examples":["a guest star/artist","Our special guest tonight is…","He made a guest appearance on the show.","Guest artists from all over Europe will take part in the concert.","Movie star Matt Damon is one of the special guests on tonight's show.","Our next guest is a bona fide television star.","She made a rare guest appearance on the programme."],"opposite":"","synonyms":""},{"def":"a person who is invited to a particular place or organization, or to speak at a meeting","examples":["a guest speaker","as a guest The scientists are here as guests of our government.","The athlete was chief guest at the schools sports day.","Li was there as the guest of the President.","My father was the guest of honour at the dinner."],"opposite":"","synonyms":""},{"def":"used to give somebody permission to do something that they have asked to do","examples":["‘Do you mind if I open the window?’ ‘Be my guest.’"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be my guest","def":"used to give somebody permission to do something that they have asked to do","examples":["‘Do you mind if I open the window?’ ‘Be my guest.’"]}],"phrasal":[],"related":["guest beer","guest book","guest house","guest room","house guest","guest worker","paying guest","guest beers","guest books","guest rooms","guest houses","guest workers"]},{"pos":"verb","level":"","meanings":[{"def":"to take part in a television or radio show, a concert, a game, etc. as a visiting or temporary performer or player","examples":["She guested on several chat shows while visiting Britain.","He guested for Leeds United on Saturday."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]