[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/gui/guide/guideline__us_1.mp3","phonsUS":"/ˈɡaɪdlaɪn/","level":"B2","meanings":[{"def":"a set of rules or instructions that are given by an official organization telling you how to do something, especially something difficult","examples":["The government has drawn up guidelines on the treatment of the mentally ill.","A task force has formed to develop voluntary guidelines.","The US Supreme Court is reviewing sentencing guidelines.","The document gives clear guidelines on the use of pesticides.","The following guidelines were approved in October 1995.","The guidelines recommend that children under 12 avoid these foods.","The guidelines require this information to be made available to the public.","The minister is accused of allowing the company to breach guidelines on arms sales.","The organization has issued a set of guidelines for builders to follow.","Under federal guidelines, they must serve at least five years in prison.","We have to follow the safety guidelines laid down by the government.","Within clear guidelines, managers can use their budget to entertain clients.","detailed guidelines for doctors about how to deal with difficult patients","guidelines from the Department of Education","new EU guidelines on food hygiene"],"opposite":"","synonyms":""},{"def":"something that can be used to help you make a decision or form an opinion","examples":["The figures are a useful guideline when buying a house.","These prices are a guideline only.","As a general guideline, the service is not suitable for people with less than £20 000 to invest.","There are a number of useful guidelines that can be applied.","Use the job specifications as your guideline.","The same general guidelines on when to dress formally apply to both men and women.","The article suggests some guidelines for healthy eating.","It may help to have a few guidelines to follow."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]