[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/gui/guide/guide__us_1.mp3","phonsUS":"/ɡaɪd/","level":"A2","meanings":[{"def":"a person who shows other people the way to a place, especially somebody employed to show tourists around interesting places","examples":["Our tour guide showed us around the old town.","We hired a local guide to get us across the mountains."],"opposite":"","synonyms":""},{"def":"a person who advises you on how to live and behave","examples":["A guru is the spiritual guide of his students.","His elder sister had been his guide, counsellor and friend."],"opposite":"","synonyms":""},{"def":"a book, magazine, app, etc. that gives you information, help or instructions about something","examples":["Let's have a look at the TV guide and see what's on.","guide to something a Guide to Family Health","guide to doing something a step-by-step guide to creating your own website","guide for somebody/something study guides for mathematics and physics","an essential guide for every new parent","The book contains a quick reference guide to essential grammar at the back.","This book is the definitive guide to world cuisine.","a field guide to British birds","a survival guide for business managers","You can download a brief guide to getting started here."],"opposite":"","synonyms":""},{"def":"a book that gives information about a place for travellers or tourists","examples":["He has written a number of travel guides.","I consulted my guide as I walked around the cathedral.","guide to something a guide to Italy"],"opposite":"","synonyms":""},{"def":"something that gives you enough information to be able to make a decision about something or form an opinion","examples":["As a rough guide, allow half a cup of rice per person.","I let my feelings be my guide.","Remember, this chart is only a guide.","As a general guide, large dogs need more exercise than small ones.","Use the table below as a guide to how much detergent to use.","As a guide, the largest pie will feed twelve.","It should only be used as an approximate guide.","These figures should be taken as a rough guide.","These figures give a rough guide as to the sales we can expect."],"opposite":"","synonyms":""},{"def":"a member of an organization (called the Guides or the Girl Scouts) that is similar to the Scouts and that trains girls in practical skills and does a lot of activities with them, for example camping","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Guide","TV Guide","guide dog","audio guide","Girl Guide","Good Food Guide","Guide Dogs for the Blind Association","Hitchhiker's Guide to the Galaxy","guide dogs","Brownie Guide","Ranger (Guide)"]},{"pos":"verb","level":"A2","meanings":[{"def":"to show somebody the way to a place, often by going with them; to show somebody a place that you know well","examples":["guide somebody It's a dangerous route—you'll need someone to guide you.","guide somebody to something Sherpas guide climbers to the summit.","guide somebody through something She guided us through the busy streets.","guide somebody around something We were guided around the museums."],"opposite":"","synonyms":""},{"def":"to direct or influence somebody’s behaviour or the development of something","examples":["He was always guided by his religious beliefs.","The following principles guided the development of the project.","This book will serve to guide you in the fulfilment of a successful relationship."],"opposite":"","synonyms":""},{"def":"to explain something to somebody, especially something complicated or difficult","examples":["The health and safety officer will guide you through the safety procedures.","Olson does a good job guiding the reader through the complex issues involved.","Their teacher Phil Bailey carefully guides them through rehearsals.","They guide you expertly through the whole process.","He guided us through the intricacies of the divorce law.","He guided me in my research.","Schools were firmly guided on the details of the curriculum","a document guiding teachers on how to maintain discipline"],"opposite":"","synonyms":""},{"def":"to help somebody/something to move in a particular direction; to move something in a particular direction","examples":["She took her arm and guided her across the busy road.","He guided her hand to his face.","The nurse guided the needle into position.","He guided her up some stone steps.","He took her arm, gently guiding her.","She guided us through the busy streets.","(figurative) the information and data which help guide the affairs of the business","the ways in which young people are guided into employment"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]