[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/gui/guilt/guilty__us_2.mp3","phonsUS":"/ˈɡɪlti/","level":"B1","meanings":[{"def":"feeling ashamed because you have done something that you know is wrong or have not done something that you should have done","examples":["Matt and Chrissy both looked equally guilty.","John had a guilty look on his face.","I had a guilty conscience and could not sleep.","guilty about doing something I feel very guilty about leaving her.","guilty about something parents who feel guilty about the small amount of time they spend with their children","guilty that… I feel almost guilty that so many good things are happening to us.","I felt guilty about not visiting my parents more often.","She has a terribly guilty conscience about it.","She was looking rather guilty when I came into the room."],"opposite":"","synonyms":""},{"def":"having done something illegal; being responsible for something bad that has happened","examples":["He pleaded guilty to murder.","guilty of something The jury found the defendant not guilty of the offence.","She may be guilty of murder.","He was not guilty of the crime he had been put in prison for.","We've all been guilty of selfishness at some time in our lives.","the guilty party (= the person responsible for something bad happening)","The jury voted not guilty on all counts.","The accused is guilty on all counts.","Everyone thought he was guilty but there was no proof.","My lawyer urged me to plead guilty.","She was guilty of several crimes, including assault.","Under the UK judiciary system, everyone is innocent until proved guilty.","Who was the guilty party in the affair?","Anyone who supports terrorists is equally guilty of terrorist crimes.","Company directors may be deemed guilty of a crime if their company causes pollution.","He pleaded guilty to starting the fire.","He was found guilty of murder.","She was certainly guilty, but the police couldn't prove it.","She was guilty of fraud.","No one believed him guilty of this terrible crime."],"opposite":"innocent","synonyms":""},{"def":"something that you enjoy, even though you feel it is not really a good thing","examples":["Daytime TV is one of my guilty pleasures."],"opposite":"","synonyms":""},{"def":"a secret that somebody feels ashamed about","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a guilty pleasure","def":"something that you enjoy, even though you feel it is not really a good thing","examples":["Daytime TV is one of my guilty pleasures."]},{"idiom":"a guilty secret","def":"a secret that somebody feels ashamed about","examples":[]}],"phrasal":[],"related":[]}]