[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/g/gui/guilt/guilt__us_1.mp3","phonsUS":"/ɡɪlt/","level":"C1","meanings":[{"def":"the unhappy feelings caused by knowing or thinking that you have done something wrong","examples":["She had feelings of guilt about leaving her children and going to work.","Many survivors were left with a sense of guilt.","a guilt complex (= an exaggerated sense of guilt)","He had no feelings of guilt over what he had done.","I knew that the next day I would be consumed with guilt.","It helped him bear the guilt he felt.","Talking to her helped to assuage my guilt.","These actions are merely intended to assuage white liberal guilt.","They feel a sense of collective guilt for the Holocaust.","You needn't feel any guilt about me.","the burden of guilt that she carried with her","It's important to differentiate between a healthy conscience and a guilt complex."],"opposite":"","synonyms":""},{"def":"the fact that somebody has done something illegal","examples":["His guilt was proved beyond all doubt by the prosecution.","Do you think this statement amounts to an admission of guilt?","It might be difficult to prove his guilt.","Many of the accused would deny their guilt to the magistrates.","I took his silence as an admission of guilt."],"opposite":"innocence","synonyms":""},{"def":"blame or responsibility for doing something wrong or for something bad that has happened","examples":["The investigation will try to find out where the guilt for the disaster really lies.","There is no doubt as to where the guilt lies."],"opposite":"","synonyms":""},{"def":"things you say to somebody in order to make them feel guilty about something","examples":["Don't lay a guilt trip on your child about schoolwork.","She was trying to lay a guilt trip on me."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a guilt trip","def":"things you say to somebody in order to make them feel guilty about something","examples":["Don't lay a guilt trip on your child about schoolwork.","She was trying to lay a guilt trip on me."]}],"phrasal":[],"related":["guilt into","guilt into doing","guilt somebody into something","guilt somebody into doing something","be the picture of health, guilt, misery, etc."]},{"pos":"verb","level":"","meanings":[],"idioms":[],"phrasal":["guilt into","guilt into doing"],"related":[]}]