[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/han/hand_/hand__us_1.mp3","phonsUS":"/hænd/","level":"A1","meanings":[{"def":"the part of the body at the end of the arm, including the fingers and thumb","examples":["Ian placed a hand on her shoulder.","Keep both hands on the steering wheel at all times.","She had a large diamond on the ring finger of her left hand.","in your hand He was holding a large mug of coffee in his right hand.","Put your hand up if you know the answer.","She was on (her) hands and knees (= crawling on the floor) looking for an earring.","Couples strolled past holding hands.","She introduced us and we shook hands.","Give me your hand (= hold my hand) while we cross the road.","The crowd threw up their hands (= lifted them into the air) in dismay.","He killed the snake with his bare hands (= using only his hands).","a hand gesture/signal","a hand towel (= a small towel for drying your hands on)","a hand drill (= one that is used by turning a handle rather than powered by electricity)","I felt the bag to see what was in it.","She fingered the silk delicately.","Handle the fruit with care.","She rubbed her eyes wearily.","The cat loves being stroked.","He patted my arm and told me not to worry.","Someone was tapping lightly at the door.","I took his hand and squeezed it.","I grabbed his arm to stop myself from falling.","She snatched the letter out of my hand.","Her hands were clasped behind her head.","The child was clutching a doll in her hand.","Grasp the rope with both hands and pull.","He gripped his bag tightly and wouldn’t let go.","A strong hand reached out and caught hold of her arm.","Beth grasped the rope with both hands.","Clive ran a hand through his hair.","Eager hands reached out to help him.","He beat his hands on the steering wheel in frustration.","He clutched the cane in his clammy hand.","He grabbed my hand and motioned for me to follow him.","He had his hands clasped behind his head.","He lifted his hand to her face.","He offered a limp hand to shake.","He rubbed his hands together in satisfaction.","He sat with his head in his hands.","He shook Blake's hand as if they were long lost friends.","He slid his hands into his pockets.","He wiped his greasy hands on the front of his overalls.","Her busy hands had transformed the tiny room into a work of art.","Her hand flew to her mouth. ‘Oh no!’","Her hand ran over the surface, feeling the different textures.","Her hand shook as she lifted the glass to her lips.","His hand brushed against hers.","His hands clawed at the muddy earth.","His hands cupped her face.","Muriel's hand crept to her neck to hold her pearls.","Operate the gears with your left hand.","She filled our glasses with a generous hand.","She folds her hands in prayer.","She gestured to the window with an open hand.","She had a piece of paper in her hand.","She had large rings on both hands.","She held on to my hand as I tried to leave.","She held up her hand in farewell.","She pressed his hand. ‘I know, ’ she said softly.","She put her hands to her cheeks in embarrassment.","She shivered, rubbing her hands together fiercely.","She shrugged and spread her hands. ‘That's all I can tell you.’","She smiled and extended a hand in welcome.","She stood in the doorway, hands on hips.","She stood up and went over to him, her hands outstretched.","She studied the object in the palm of her hand.","Slowly Ruth withdrew her hand from his.","The rocks looked like they had been shaped by human hands.","We were all clapping our hands in time to the music.","With his free hand he took hold of the knife.","With a practised hand he motioned a waiter to bring a fresh pot of coffee.","A surgeon needs a good eye and a steady hand.","There's plenty of work for willing hands","Purée with a hand blender or food processor."],"opposite":"","synonyms":""},{"def":"using the hand or number of hands mentioned","examples":["a one-handed catch","left-handed scissors (= intended to be held in your left hand)"],"opposite":"","synonyms":""},{"def":"help in doing something","examples":["The neighbours are always willing to lend a hand.","hand with something Let me give you a hand with those bags (= help you to carry them).","Do you need a hand with those invoices?"],"opposite":"","synonyms":""},{"def":"the part or role that somebody/something plays in a particular situation; somebody’s influence in a situation","examples":["Early reports suggest the hand of rebel forces in the bombings.","Several of his colleagues had a hand in his downfall.","This appointment was an attempt to strengthen her hand in policy discussions."],"opposite":"","synonyms":""},{"def":"a part of a clock or watch that points to the numbers","examples":[],"opposite":"","synonyms":""},{"def":"a person who does physical work on a farm or in a factory","examples":["The farmer would bring in hired hands to help him harvest the crop."],"opposite":"","synonyms":""},{"def":"a sailor on a ship","examples":["All hands on deck!"],"opposite":"","synonyms":""},{"def":"by a person rather than a machine","examples":["hand-painted pottery","hand-knitted","This item should be hand-washed.","Mail for hand delivery is put in a separate tray."],"opposite":"","synonyms":""},{"def":"a set of playing cards given to one player in a game","examples":["to be dealt a good/bad hand","(figurative) She felt that life had dealt her a bad hand."],"opposite":"","synonyms":""},{"def":"one stage of a game of cards","examples":["I'll have to leave after this hand.","Who dealt the last hand?"],"opposite":"","synonyms":""},{"def":"a particular style of writing","examples":[],"opposite":"","synonyms":""},{"def":"a unit for measuring the height of a horse, equal to 4 inches or 10.16 centimetres","examples":[],"opposite":"","synonyms":""},{"def":"everyone helps or must help, especially in a difficult situation","examples":["There are 30 people coming to dinner tonight, so it's all hands on deck."],"opposite":"","synonyms":""},{"def":"close to you in time or distance","examples":["Help was at hand.","The property is ideally located with all local amenities close at hand."],"opposite":"","synonyms":""},{"def":"if you experience something at the hands of somebody, they are the cause of it","examples":["They suffered years of repression at the hands of the old regime."],"opposite":"","synonyms":""},{"def":"to show skill at making or doing things with your hands","examples":[],"opposite":"","synonyms":""},{"def":"to tie somebody’s hands and feet together so that they cannot move or escape","examples":[],"opposite":"","synonyms":""},{"def":"to prevent somebody from doing what they want by creating rules, limits, etc.","examples":[],"opposite":"","synonyms":""},{"def":"it is better to keep something that you already have than to risk losing it by trying to get much more","examples":[],"opposite":"","synonyms":""},{"def":"to harm somebody who has helped you or supported you","examples":[],"opposite":"","synonyms":""},{"def":"by a person rather than a machine","examples":["The fabric was painted by hand.","Delicate clothes should be washed by hand.","We can apply the power of computational tools in solving mathematical problems that cannot be solved by hand."],"opposite":"","synonyms":""},{"def":"if a letter is delivered by hand, it is delivered by the person who wrote it, or somebody who is sent by them, rather than by post","examples":[],"opposite":"","synonyms":""},{"def":"if you pay for goods and services cash in hand, you pay in cash, especially so that the person being paid can avoid paying tax on the amount","examples":["a cash-in-hand payment of £20"],"opposite":"","synonyms":""},{"def":"to pass to a different owner","examples":["The house has changed hands several times."],"opposite":"","synonyms":""},{"def":"near; in a place where somebody/something can be reached easily","examples":["There are good cafes and a restaurant close at hand."],"opposite":"","synonyms":""},{"def":"an influence that controls or limits something","examples":["We need to free business from the dead hand of bureaucracy."],"opposite":"","synonyms":""},{"def":"people who do not have enough to do often start to do wrong","examples":["She blamed the crimes on the local jobless teenagers. ‘The devil makes work for idle hands,’ she would say."],"opposite":"","synonyms":""},{"def":"to trust somebody and be willing to do what they say","examples":["She'll have them eating out of her hand in no time."],"opposite":"","synonyms":""},{"def":"to become controlled by somebody","examples":["The town fell into enemy hands.","We don't want this document falling into the wrong hands.","After the war, the hotel fell into the hands of an American consortium."],"opposite":"","synonyms":""},{"def":"strong control or discipline","examples":["Those children need a firm hand to make them behave."],"opposite":"","synonyms":""},{"def":"by experiencing, seeing, etc. something yourself rather than being told about it by somebody else","examples":["The President visited the area to see the devastation at first hand."],"opposite":"","synonyms":""},{"def":"to bring or hold your hands together","examples":["She kept her hands folded in her lap."],"opposite":"","synonyms":""},{"def":"to make somebody do something that they do not want to do or make them do it sooner than they had intended","examples":["They decided to strike to force the management’s hand."],"opposite":"","synonyms":""},{"def":"to get an advantage over somebody so that you are in control of a particular situation","examples":[],"opposite":"","synonyms":""},{"def":"to do physical work","examples":["He's not frightened of getting his hands dirty."],"opposite":"","synonyms":""},{"def":"to get, have, etc. the opportunity to do what you want to do and to make your own decisions","examples":["I was given a free hand in designing the syllabus."],"opposite":"","synonyms":""},{"def":"to show your approval of somebody by clapping your hands; to be applauded in this way","examples":["Ladies and gentlemen, let’s give a big hand to our special guests tonight."],"opposite":"","synonyms":""},{"def":"to help somebody","examples":[],"opposite":"","synonyms":""},{"def":"to ask somebody for something, especially money, in a very polite way that makes you seem less important","examples":["There’s no way he’ll go cap in hand to his brother."],"opposite":"","synonyms":""},{"def":"permission to marry somebody, especially a woman","examples":["He asked the general for his daughter's hand in marriage."],"opposite":"","synonyms":""},{"def":"working closely with somebody, especially in a secret and/or illegal way","examples":[],"opposite":"","synonyms":""},{"def":"if two people are hand in hand, they are holding each other’s hand","examples":["They walked through the park hand in hand."],"opposite":"","synonyms":""},{"def":"if two things go hand in hand, they are closely connected and one thing causes the other","examples":["Poverty and poor health often go hand in hand."],"opposite":"","synonyms":""},{"def":"easily and without any doubt","examples":["They won hands down.","It is hands down the best movie this year."],"opposite":"","synonyms":""},{"def":"used to tell somebody not to touch something/somebody","examples":["Get your hands off my wife!","Hey, hands off! That's my drink!","She warned her brother to keep his hands off her bag."],"opposite":"","synonyms":""},{"def":"used to tell a group of people to raise one hand in the air if they know the answer to a question, etc.","examples":["Hands up all those who want to go swimming."],"opposite":"","synonyms":""},{"def":"used by somebody who is threatening people with a gun to tell them to raise both hands in the air","examples":[],"opposite":"","synonyms":""},{"def":"to be responsible for somebody’s death","examples":["a dictator with the blood of thousands on his hands"],"opposite":"","synonyms":""},{"def":"to be very busy or too busy to do something else","examples":["She certainly has her hands full with four kids in the house."],"opposite":"","synonyms":""},{"def":"to be unable to do what you want to do because of rules, promises, etc.","examples":["I really wish I could help but my hands are tied."],"opposite":"","synonyms":""},{"def":"to have complete control or influence over somebody","examples":["Even before he plays a note, he has the audience in the palm of his hand."],"opposite":"","synonyms":""},{"def":"to have nothing to do or not be busy","examples":[],"opposite":"","synonyms":""},{"def":"to be in a position where you have power or control over somebody/something","examples":["She had the whip hand and it was useless to resist."],"opposite":"","synonyms":""},{"def":"a way of doing something or of treating people that is much stronger and less sensitive than it needs to be","examples":["the heavy hand of management"],"opposite":"","synonyms":""},{"def":"to give somebody support in a difficult situation","examples":["Do you want me to come along and hold your hand?"],"opposite":"","synonyms":""},{"def":"to admit that you have made a mistake or are responsible for something bad","examples":["I have to hold my hands up and admit that some of the problems have been all my own fault.","The solicitor confirmed that his clients were holding their hands up to the offences."],"opposite":"","synonyms":""},{"def":"being taken care of or dealt with by somebody that you think you can rely on","examples":["Can I leave these queries in your capable hands?","He retired feeling confident that his company was in safe hands."],"opposite":"","synonyms":""},{"def":"if you have time or money in hand, it is left and available to be used","examples":["We managed to redecorate the house and still have some savings in hand.","She completed the first part of the exam with over an hour in hand."],"opposite":"","synonyms":""},{"def":"if you have a particular situation in hand, you are in control of it","examples":["Don’t worry about the travel arrangements—everything is in hand."],"opposite":"","synonyms":""},{"def":"the job, question, etc. in hand is the one that you are dealing with","examples":["Please confine your comments to the topic in hand."],"opposite":"","synonyms":""},{"def":"if somebody works a week, month, etc. in hand, they are paid for the work a week, etc. after they have completed it","examples":[],"opposite":"","synonyms":""},{"def":"being taken care of or controlled by somebody","examples":["The matter is now in the hands of my lawyer.","At that time, the castle was in enemy hands."],"opposite":"","synonyms":""},{"def":"being taken care of well by somebody","examples":["I've left the kids in safe hands—with my parents.","Their problem was in the safe hands of the experts."],"opposite":"","synonyms":""},{"def":"if you use the words an iron fist/hand when describing the way that somebody behaves, you mean that they treat people severely. This treatment may be hidden behind a kind appearance (the velvet glove).","examples":["They promised that the army would strike with an iron fist at any resistance.","The iron hand in the velvet glove approach seems to work best with this age group."],"opposite":"","synonyms":""},{"def":"used to say that you are too busy to do anything else","examples":[],"opposite":"","synonyms":""},{"def":"if two people join hands, they hold each other’s hands","examples":[],"opposite":"","synonyms":""},{"def":"to work together in doing something","examples":["Education has been reluctant to join hands with business."],"opposite":"","synonyms":""},{"def":"to occasionally do something that you used to do a lot so that you do not lose your skill at it","examples":["She retired last year but still teaches the odd class to keep her hand in."],"opposite":"","synonyms":""},{"def":"to be very familiar with somebody/something","examples":["This is where I grew up. I know this area like the back of my hand."],"opposite":"","synonyms":""},{"def":"to catch somebody that you are annoyed with","examples":["Wait till I get my hands on him!"],"opposite":"","synonyms":""},{"def":"to find or get something","examples":["I know their address is here somewhere, but I can't lay my hands on it right now.","I desperately need to get my hands on some money by Monday."],"opposite":"","synonyms":""},{"def":"to spend all the money you earn on basic needs such as food without being able to save any money","examples":[],"opposite":"","synonyms":""},{"def":"to make/lose money very fast and in large quantities","examples":[],"opposite":"","synonyms":""},{"def":"used to say that a job is made easier if a lot of people help","examples":[],"opposite":"","synonyms":""},{"def":"to do no work","examples":["She hasn't done a hand's turn all week."],"opposite":"","synonyms":""},{"def":"to do nothing to help somebody","examples":["The children never lift a finger to help around the house."],"opposite":"","synonyms":""},{"def":"to hold out your hand for somebody to shake","examples":[],"opposite":"","synonyms":""},{"def":"no longer your responsibility","examples":[],"opposite":"","synonyms":""},{"def":"on both/all sides; in both/all directions","examples":["Mist curled from the water on either hand."],"opposite":"","synonyms":""},{"def":"available, especially to help","examples":["The emergency services were on hand with medical advice."],"opposite":"","synonyms":""},{"def":"if you have somebody/something on your hands, you are responsible for or have to deal with them/it","examples":["Let me take care of the invitations—you've enough on your hands with the caterers.","They’ll have a fight on their hands if they want to close down the school."],"opposite":"","synonyms":""},{"def":"used to introduce different points of view, ideas, etc., especially when they are opposites","examples":["On the one hand they'd love to have kids, but on the other, they don't want to give up their freedom.","This survey highlights a number of differences in the way that teenage boys and girls in the UK spend their free time.","One of the main differences between the girls and the boys who took part in the research was the way in which they use the internet.","Unlike the girls, who use the internet mainly to keep in touch with friends, the boys questioned in this survey tend to use the internet for playing computer games.","The girls differ from the boys in that they tend to spend more time keeping in touch with friends on the phone or on social networking websites.","Compared to the boys, the girls spend much more time chatting to friends on the phone.","On average the girls spend four hours a week chatting to friends on the phone. In contrast, very few of the boys spend more than five minutes a day talking to their friends in this way.","The boys prefer competitive sports and computer games, whereas/while the girls seem to enjoy more cooperative activities, such as shopping with friends.","When the girls go shopping, they mainly buy clothes and cosmetics. The boys, on the other hand, tend to purchase computer games or gadgets."],"opposite":"","synonyms":""},{"def":"difficult or impossible to control","examples":["Unemployment is getting out of hand."],"opposite":"","synonyms":""},{"def":"if you reject, etc. something out of hand, you do so immediately without thinking about it fully or listening to other people’s arguments","examples":["All our suggestions were dismissed out of hand."],"opposite":"","synonyms":""},{"def":"no longer your responsibility","examples":["I'm afraid the matter is now out of my hands."],"opposite":"","synonyms":""},{"def":"to fail to achieve success by judging your position to be stronger than it really is","examples":[],"opposite":"","synonyms":""},{"def":"a person who can do, or is doing, a job","examples":["We need an extra pair of hands if we're going to finish on time."],"opposite":"","synonyms":""},{"def":"to do exactly what an enemy, opponent, etc. wants so that they gain the advantage in a particular situation","examples":["If we get the police involved, we'll be playing right into the protesters' hands."],"opposite":"","synonyms":""},{"def":"to spend money or give it to somebody","examples":["I've heard he doesn't like putting his hand in his pocket."],"opposite":"","synonyms":""},{"def":"easily controlled or influenced by another person","examples":["She'll persuade him. He's like putty in her hands."],"opposite":"","synonyms":""},{"def":"to hit or threaten to hit somebody","examples":[],"opposite":"","synonyms":""},{"def":"a person that you can trust to do a job well","examples":["Colleagues regard him as a safe pair of hands."],"opposite":"","synonyms":""},{"def":"by being told about something by somebody else who has seen it or heard about it, not by experiencing, seeing, etc. it yourself","examples":["I'm fed up of hearing about these decisions third hand!"],"opposite":"","synonyms":""},{"def":"to make your plans or intentions known","examples":[],"opposite":"","synonyms":""},{"def":"a way of voting for or against something in which people raise their hands to vote","examples":["The vote was passed by a show of hands.","Let’s have a show of hands. Who’s in favour of the proposal?"],"opposite":"","synonyms":""},{"def":"to stop yourself from doing something; to prevent you from doing something","examples":["It was prudence, not logic, that stayed his hand."],"opposite":"","synonyms":""},{"def":"to make yourself do something that you are afraid of","examples":["Taking her courage in both hands, she opened the door and walked in."],"opposite":"","synonyms":""},{"def":"to deal with somebody in a strict way in order to improve their behaviour","examples":[],"opposite":"","synonyms":""},{"def":"to deal with a particular situation yourself because you are not happy with the way that others are dealing with it","examples":[],"opposite":"","synonyms":""},{"def":"to do something illegal in order to punish somebody for doing something wrong, instead of letting the police deal with them","examples":["After a series of burglaries in the area, the police are worried that residents might take the law into their own hands.","When police failed to arrest the suspect, local people took the law into their own hands and beat him up."],"opposite":"","synonyms":""},{"def":"to risk being killed","examples":["You take your life in your hands just crossing the road here."],"opposite":"","synonyms":""},{"def":"to stop doing something or taking part in something, especially because you are not successful","examples":[],"opposite":"","synonyms":""},{"def":"to raise both hands in the air to show that you are feeling annoyed or upset about something","examples":["We threw up our hands in despair at the scale of the problem."],"opposite":"","synonyms":""},{"def":"that you can reach or get easily","examples":["I'm afraid I don't have the latest figures to hand.","Keep a pen and paper to hand for details of this week’s competition."],"opposite":"","synonyms":""},{"def":"to do something such as an activity or a sport for the first time","examples":[],"opposite":"","synonyms":""},{"def":"to start doing something or be able to do something, especially when you do it well","examples":["Jim can turn his hand to most jobs around the house."],"opposite":"","synonyms":""},{"def":"to take care of somebody’s needs so well that they do not have to do anything for themselves","examples":["He seems to expect me to wait on him hand and foot."],"opposite":"","synonyms":""},{"def":"to refuse to be responsible for or involved with somebody/something","examples":["When her son was arrested again she washed her hands of him.","I’ve washed my hands of the whole sordid business."],"opposite":"","synonyms":""},{"def":"to win something very easily","examples":[],"opposite":"","synonyms":""},{"def":"to press somebody’s hand very hard when you shake hands","examples":[],"opposite":"","synonyms":""},{"def":"to hold your hands together, and twist and press them together in a way that shows you are anxious or upset, especially when you cannot change the situation","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"all hands on deck","def":"everyone helps or must help, especially in a difficult situation","examples":["There are 30 people coming to dinner tonight, so it's all hands on deck."]},{"idiom":"(close/near) at hand","def":"close to you in time or distance","examples":["Help was at hand.","The property is ideally located with all local amenities close at hand."]},{"idiom":"at the hands of somebody | at somebody’s hands","def":"if you experience something at the hands of somebody, they are the cause of it","examples":["They suffered years of repression at the hands of the old regime."]},{"idiom":"be good with your hands","def":"to show skill at making or doing things with your hands","examples":[]},{"idiom":"bind/tie somebody hand and foot","def":"to tie somebody’s hands and feet together so that they cannot move or escape","examples":[]},{"idiom":"a bird in the hand is worth two in the bush","def":"it is better to keep something that you already have than to risk losing it by trying to get much more","examples":[]},{"idiom":"bite the hand that feeds you","def":"to harm somebody who has helped you or supported you","examples":[]},{"idiom":"by hand","def":"by a person rather than a machine","examples":["The fabric was painted by hand.","Delicate clothes should be washed by hand.","We can apply the power of computational tools in solving mathematical problems that cannot be solved by hand."]},{"idiom":"cash in hand","def":"if you pay for goods and services cash in hand, you pay in cash, especially so that the person being paid can avoid paying tax on the amount","examples":["a cash-in-hand payment of £20"]},{"idiom":"change hands","def":"to pass to a different owner","examples":["The house has changed hands several times."]},{"idiom":"close at hand","def":"near; in a place where somebody/something can be reached easily","examples":["There are good cafes and a restaurant close at hand."]},{"idiom":"the dead hand of something","def":"an influence that controls or limits something","examples":["We need to free business from the dead hand of bureaucracy."]},{"idiom":"the devil makes work for idle hands","def":"people who do not have enough to do often start to do wrong","examples":["She blamed the crimes on the local jobless teenagers. ‘The devil makes work for idle hands,’ she would say."]},{"idiom":"eat out of your/somebody’s hand","def":"to trust somebody and be willing to do what they say","examples":["She'll have them eating out of her hand in no time."]},{"idiom":"fall into somebody’s hands/the hands of somebody","def":"to become controlled by somebody","examples":["The town fell into enemy hands.","We don't want this document falling into the wrong hands.","After the war, the hotel fell into the hands of an American consortium."]},{"idiom":"a firm hand","def":"strong control or discipline","examples":["Those children need a firm hand to make them behave."]},{"idiom":"(at) first hand","def":"by experiencing, seeing, etc. something yourself rather than being told about it by somebody else","examples":["The President visited the area to see the devastation at first hand."]},{"idiom":"fold your hands","def":"to bring or hold your hands together","examples":["She kept her hands folded in her lap."]},{"idiom":"force somebody’s hand","def":"to make somebody do something that they do not want to do or make them do it sooner than they had intended","examples":["They decided to strike to force the management’s hand."]},{"idiom":"gain, get, have, etc. the upper hand","def":"to get an advantage over somebody so that you are in control of a particular situation","examples":[]},{"idiom":"get your hands dirty","def":"to do physical work","examples":["He's not frightened of getting his hands dirty."]},{"idiom":"get, have, etc. a free hand","def":"to get, have, etc. the opportunity to do what you want to do and to make your own decisions","examples":["I was given a free hand in designing the syllabus."]},{"idiom":"give somebody/get a big hand","def":"to show your approval of somebody by clapping your hands; to be applauded in this way","examples":["Ladies and gentlemen, let’s give a big hand to our special guests tonight."]},{"idiom":"give/lend a helping hand","def":"to help somebody","examples":[]},{"idiom":"go cap in hand (to somebody)","def":"to ask somebody for something, especially money, in a very polite way that makes you seem less important","examples":["There’s no way he’ll go cap in hand to his brother."]},{"idiom":"somebody’s hand (in marriage)","def":"permission to marry somebody, especially a woman","examples":["He asked the general for his daughter's hand in marriage."]},{"idiom":"hand in glove (with somebody)","def":"working closely with somebody, especially in a secret and/or illegal way","examples":[]},{"idiom":"hand in hand","def":"if two people are hand in hand, they are holding each other’s hand","examples":["They walked through the park hand in hand.","Poverty and poor health often go hand in hand."]},{"idiom":"hands down","def":"easily and without any doubt","examples":["They won hands down.","It is hands down the best movie this year."]},{"idiom":"(get/take/keep your) hands off (something/somebody)","def":"used to tell somebody not to touch something/somebody","examples":["Get your hands off my wife!","Hey, hands off! That's my drink!","She warned her brother to keep his hands off her bag."]},{"idiom":"hands up!","def":"used to tell a group of people to raise one hand in the air if they know the answer to a question, etc.","examples":["Hands up all those who want to go swimming."]},{"idiom":"have somebody’s blood on your hands","def":"to be responsible for somebody’s death","examples":["a dictator with the blood of thousands on his hands"]},{"idiom":"have your hands full","def":"to be very busy or too busy to do something else","examples":["She certainly has her hands full with four kids in the house."]},{"idiom":"have your hands tied","def":"to be unable to do what you want to do because of rules, promises, etc.","examples":["I really wish I could help but my hands are tied."]},{"idiom":"have somebody in the palm of your hand","def":"to have complete control or influence over somebody","examples":["Even before he plays a note, he has the audience in the palm of his hand."]},{"idiom":"have time on your hands | have time to kill","def":"to have nothing to do or not be busy","examples":[]},{"idiom":"have/hold, etc. the whip hand (over somebody/something)","def":"to be in a position where you have power or control over somebody/something","examples":["She had the whip hand and it was useless to resist."]},{"idiom":"heavy hand","def":"a way of doing something or of treating people that is much stronger and less sensitive than it needs to be","examples":["the heavy hand of management"]},{"idiom":"hold somebody’s hand","def":"to give somebody support in a difficult situation","examples":["Do you want me to come along and hold your hand?"]},{"idiom":"hold/put your hands up (to something)","def":"to admit that you have made a mistake or are responsible for something bad","examples":["I have to hold my hands up and admit that some of the problems have been all my own fault.","The solicitor confirmed that his clients were holding their hands up to the offences."]},{"idiom":"in somebody’s capable, safe, etc. hands","def":"being taken care of or dealt with by somebody that you think you can rely on","examples":["Can I leave these queries in your capable hands?","He retired feeling confident that his company was in safe hands."]},{"idiom":"in hand","def":"if you have time or money in hand, it is left and available to be used","examples":["We managed to redecorate the house and still have some savings in hand.","She completed the first part of the exam with over an hour in hand.","Don’t worry about the travel arrangements—everything is in hand.","Please confine your comments to the topic in hand."]},{"idiom":"in the hands of somebody | in somebody’s hands","def":"being taken care of or controlled by somebody","examples":["The matter is now in the hands of my lawyer.","At that time, the castle was in enemy hands."]},{"idiom":"in safe hands | in the safe hands of somebody","def":"being taken care of well by somebody","examples":["I've left the kids in safe hands—with my parents.","Their problem was in the safe hands of the experts."]},{"idiom":"an iron fist/hand (in a velvet glove)","def":"if you use the words an iron fist/hand when describing the way that somebody behaves, you mean that they treat people severely. This treatment may be hidden behind a kind appearance (the velvet glove).","examples":["They promised that the army would strike with an iron fist at any resistance.","The iron hand in the velvet glove approach seems to work best with this age group."]},{"idiom":"I’ve only got one pair of hands","def":"used to say that you are too busy to do anything else","examples":[]},{"idiom":"join hands (with somebody)","def":"if two people join hands, they hold each other’s hands","examples":["Education has been reluctant to join hands with business."]},{"idiom":"keep your hand in","def":"to occasionally do something that you used to do a lot so that you do not lose your skill at it","examples":["She retired last year but still teaches the odd class to keep her hand in."]},{"idiom":"know somebody/something inside out | know somebody/something like the back of your hand","def":"to be very familiar with somebody/something","examples":["This is where I grew up. I know this area like the back of my hand."]},{"idiom":"lay/get your hands on somebody","def":"to catch somebody that you are annoyed with","examples":["Wait till I get my hands on him!"]},{"idiom":"lay/get your hands on something","def":"to find or get something","examples":["I know their address is here somewhere, but I can't lay my hands on it right now.","I desperately need to get my hands on some money by Monday."]},{"idiom":"live (from) hand to mouth","def":"to spend all the money you earn on basic needs such as food without being able to save any money","examples":[]},{"idiom":"make/lose money hand over fist","def":"to make/lose money very fast and in large quantities","examples":[]},{"idiom":"many hands make light work","def":"used to say that a job is made easier if a lot of people help","examples":[]},{"idiom":"not do a hand’s turn","def":"to do no work","examples":["She hasn't done a hand's turn all week."]},{"idiom":"not lift/raise a finger/hand (to do something)","def":"to do nothing to help somebody","examples":["The children never lift a finger to help around the house."]},{"idiom":"offer your hand","def":"to hold out your hand for somebody to shake","examples":[]},{"idiom":"off your hands","def":"no longer your responsibility","examples":[]},{"idiom":"on either/every hand","def":"on both/all sides; in both/all directions","examples":["Mist curled from the water on either hand."]},{"idiom":"on hand","def":"available, especially to help","examples":["The emergency services were on hand with medical advice."]},{"idiom":"on your hands","def":"if you have somebody/something on your hands, you are responsible for or have to deal with them/it","examples":["Let me take care of the invitations—you've enough on your hands with the caterers.","They’ll have a fight on their hands if they want to close down the school."]},{"idiom":"(on the one hand…) on the other (hand)…","def":"used to introduce different points of view, ideas, etc., especially when they are opposites","examples":["On the one hand they'd love to have kids, but on the other, they don't want to give up their freedom.","This survey highlights a number of differences in the way that teenage boys and girls in the UK spend their free time.","One of the main differences between the girls and the boys who took part in the research was the way in which they use the internet.","Unlike the girls, who use the internet mainly to keep in touch with friends, the boys questioned in this survey tend to use the internet for playing computer games.","The girls differ from the boys in that they tend to spend more time keeping in touch with friends on the phone or on social networking websites.","Compared to the boys, the girls spend much more time chatting to friends on the phone.","On average the girls spend four hours a week chatting to friends on the phone. In contrast, very few of the boys spend more than five minutes a day talking to their friends in this way.","The boys prefer competitive sports and computer games, whereas/while the girls seem to enjoy more cooperative activities, such as shopping with friends.","When the girls go shopping, they mainly buy clothes and cosmetics. The boys, on the other hand, tend to purchase computer games or gadgets."]},{"idiom":"out of hand","def":"difficult or impossible to control","examples":["Unemployment is getting out of hand.","All our suggestions were dismissed out of hand."]},{"idiom":"out of your hands","def":"no longer your responsibility","examples":["I'm afraid the matter is now out of my hands."]},{"idiom":"overplay your hand","def":"to fail to achieve success by judging your position to be stronger than it really is","examples":[]},{"idiom":"a pair of hands","def":"a person who can do, or is doing, a job","examples":["We need an extra pair of hands if we're going to finish on time."]},{"idiom":"play into somebody’s hands","def":"to do exactly what an enemy, opponent, etc. wants so that they gain the advantage in a particular situation","examples":["If we get the police involved, we'll be playing right into the protesters' hands."]},{"idiom":"put your hand in your pocket","def":"to spend money or give it to somebody","examples":["I've heard he doesn't like putting his hand in his pocket."]},{"idiom":"(like) putty in somebody’s hands","def":"easily controlled or influenced by another person","examples":["She'll persuade him. He's like putty in her hands."]},{"idiom":"raise a/your hand against/to somebody","def":"to hit or threaten to hit somebody","examples":[]},{"idiom":"a safe pair of hands","def":"a person that you can trust to do a job well","examples":["Colleagues regard him as a safe pair of hands."]},{"idiom":"(at) second, third, etc. hand","def":"by being told about something by somebody else who has seen it or heard about it, not by experiencing, seeing, etc. it yourself","examples":["I'm fed up of hearing about these decisions third hand!"]},{"idiom":"show your hand/cards","def":"to make your plans or intentions known","examples":[]},{"idiom":"a show of hands","def":"a way of voting for or against something in which people raise their hands to vote","examples":["The vote was passed by a show of hands.","Let’s have a show of hands. Who’s in favour of the proposal?"]},{"idiom":"stay your hand","def":"to stop yourself from doing something; to prevent you from doing something","examples":["It was prudence, not logic, that stayed his hand."]},{"idiom":"take your courage in both hands","def":"to make yourself do something that you are afraid of","examples":["Taking her courage in both hands, she opened the door and walked in."]},{"idiom":"take somebody in hand","def":"to deal with somebody in a strict way in order to improve their behaviour","examples":[]},{"idiom":"take something into your own hands","def":"to deal with a particular situation yourself because you are not happy with the way that others are dealing with it","examples":[]},{"idiom":"take the law into your own hands","def":"to do something illegal in order to punish somebody for doing something wrong, instead of letting the police deal with them","examples":["After a series of burglaries in the area, the police are worried that residents might take the law into their own hands.","When police failed to arrest the suspect, local people took the law into their own hands and beat him up."]},{"idiom":"take your life in your hands","def":"to risk being killed","examples":["You take your life in your hands just crossing the road here."]},{"idiom":"throw your hand in","def":"to stop doing something or taking part in something, especially because you are not successful","examples":[]},{"idiom":"throw up your hands","def":"to raise both hands in the air to show that you are feeling annoyed or upset about something","examples":["We threw up our hands in despair at the scale of the problem."]},{"idiom":"to hand","def":"that you can reach or get easily","examples":["I'm afraid I don't have the latest figures to hand.","Keep a pen and paper to hand for details of this week’s competition."]},{"idiom":"try your hand (at something)","def":"to do something such as an activity or a sport for the first time","examples":[]},{"idiom":"turn your hand to something","def":"to start doing something or be able to do something, especially when you do it well","examples":["Jim can turn his hand to most jobs around the house."]},{"idiom":"wait on somebody hand and foot","def":"to take care of somebody’s needs so well that they do not have to do anything for themselves","examples":["He seems to expect me to wait on him hand and foot."]},{"idiom":"wash your hands of somebody/something","def":"to refuse to be responsible for or involved with somebody/something","examples":["When her son was arrested again she washed her hands of him.","I’ve washed my hands of the whole sordid business."]},{"idiom":"win (something) hands down","def":"to win something very easily","examples":[]},{"idiom":"wring somebody’s hand","def":"to press somebody’s hand very hard when you shake hands","examples":[]},{"idiom":"wring your hands","def":"to hold your hands together, and twist and press them together in a way that shows you are anxious or upset, especially when you cannot change the situation","examples":[]}],"phrasal":[],"related":["dab hand","hand gel","hand-hot","hand in","hand off","hand on","hand out","hot hand","nap hand","old hand","glad-hand","hand back","hand down","hand over","hour hand","left-hand","field hand","first-hand"]},{"pos":"verb","level":"B1","meanings":[{"def":"to pass or give something to somebody","examples":["hand something to somebody She handed the letter to me.","hand somebody something She handed me the letter.","He grudgingly handed me the money.","He handed the book to Sally.","She wanted to hand the petition to the president personally."],"opposite":"","synonyms":""},{"def":"to allow somebody to have something, sometimes too easily","examples":["hand something to somebody Missed chances by United players handed a surprise victory to Stoke.","hand somebody something This decision effectively handed Burke control of the company."],"opposite":"","synonyms":""},{"def":"to give something to somebody without that person making any effort","examples":["Nobody's going to hand you success on a plate."],"opposite":"","synonyms":""},{"def":"used to say that somebody deserves praise for something","examples":["You've got to hand it to her—she's a great cook."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"hand something to somebody on a plate","def":"to give something to somebody without that person making any effort","examples":["Nobody's going to hand you success on a plate."]},{"idiom":"have (got) to hand it to somebody","def":"used to say that somebody deserves praise for something","examples":["You've got to hand it to her—she's a great cook."]}],"phrasal":["hand around","hand back","hand down","hand in","hand off","hand on","hand out","hand over","hand over to","hand round"],"related":[]}]