[{"pos":"adverb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/har/hardl/hardly__us_1.mp3","phonsUS":"/ˈhɑːrdli/","level":"B1","meanings":[{"def":"almost no; almost not; almost none","examples":["There's hardly any tea left.","Hardly anyone has bothered to reply.","She hardly ever calls me (= almost never).","We hardly know each other.","I had hardly seen my father since that day.","It hardly seems fair to put all the blame on him.","Hardly a day goes by without my thinking of her (= I think of her almost every day).","At the time, I hardly spoke any French.","There was hardly a cloud in the sky."],"opposite":"","synonyms":""},{"def":"used especially after ‘can’ or ‘could’ and before the main verb, to emphasize that it is difficult to do something","examples":["I can hardly keep my eyes open (= I'm almost falling asleep).","I could hardly believe it when I read the letter."],"opposite":"","synonyms":""},{"def":"used to suggest that something is unlikely or unreasonable or that somebody is silly for saying or doing something","examples":["He is hardly likely to admit he was wrong.","It's hardly surprising she was fired; she never did any work.","It's hardly the time to discuss it now.","You can hardly expect her to do it for free.","‘Couldn't you have just said no?’ ‘Well, hardly (= of course not), she's my wife's sister.’","He’s 24—hardly a baby.","I have to work hard today.","She has thought very hard about her future plans.","It was raining hard outside.","I hardly ever go to concerts.","I can hardly wait for my birthday.","I’ve been working hardly today.","She has thought very hardly about her future plans.","It was raining hardly outside."],"opposite":"","synonyms":""},{"def":"used to say that something has just begun, happened, etc.","examples":["We can't stop for coffee now, we've hardly started.","We had hardly sat down to supper when the phone rang.","(formal) Hardly had she spoken before she regretted it bitterly."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["I, they, etc. can’t wait/can hardly wait"]}]