[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/har/harve/harvest__us_1.mp3","phonsUS":"/ˈhɑːrvɪst/","level":"C1","meanings":[{"def":"the time of year when the crops are gathered in on a farm, etc.; the act of cutting and gathering crops","examples":["harvest time","Farmers are extremely busy during the harvest.","During the harvest they work from dawn to dusk.","Potatoes are normally sprayed after harvest."],"opposite":"","synonyms":""},{"def":"the crops, or the amount of crops, cut and gathered","examples":["the grain harvest","a good/bad harvest (= a lot of crops or few crops)","(figurative) The appeal produced a rich harvest of blankets, medicines and clothing.","Plum growers say they are expecting a bumper harvest (= a large amount of produce) this year.","The strawberry harvest failed because of the drought.","They were busy getting the harvest in.","a good harvest of potatoes","a series of poor harvests in the 1830s","(figurative) She returned from the conference with a rich harvest of knowledge."],"opposite":"","synonyms":""},{"def":"to benefit or suffer as a direct result of something that you have done","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"reap a/the harvest","def":"to benefit or suffer as a direct result of something that you have done","examples":[]}],"phrasal":[],"related":["harvest moon","harvest mouse","harvest festival","harvest moons","harvest mice"]},{"pos":"verb","level":"C1","meanings":[{"def":"to cut and gather a crop; to catch a number of animals or fish to eat","examples":["The nuts are ready to harvest in September.","In the US, more than 130 000 tons of live oysters are harvested each year.","Winter wheat is harvested in late July and early August."],"opposite":"","synonyms":""},{"def":"to collect cells or tissue from somebody’s body for use in medical experiments or operations","examples":["She had her eggs harvested and frozen for her own future use."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]