[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/hat/hate_/hate__us_1.mp3","phonsUS":"/heɪt/","level":"A1","meanings":[{"def":"to dislike somebody/something very much","examples":["hate somebody/yourself The two boys hated each other.","Sometimes I really hate him.","He was her most hated enemy.","hate something I hate spinach.","I really hate Monday mornings.","I hate the way she always criticizes me.","hate it… He hated it in France (= did not like the life there).","She's hating it at university.","hate it when… I hate it when people cry.","Don't you just hate it when everyone gets the joke except you?","hate it that… He hated it that she was right.","hate doing something She hates making mistakes.","I hate coming home late.","hate to do something He hated to be away from his family.","She's a person who hates to make mistakes.","I hate to see him suffering like this.","I hate to think what would have happened if you hadn't been there.","hate somebody/something doing something He hates anyone parking in his space.","hate somebody/something to do something I'd hate anything to happen to him.","She would have hated him to see how her hands shook.","hate for somebody/something to do something I'd hate for all this to go to waste.","hate somebody/yourself for something The country's police force was widely hated for its brutality.","hate somebody/yourself for doing something I hated myself for feeling jealous.","When children are taught to hate, the whole future of society is in danger.","Why are you wanting a new phone when your current one works perfectly well?","What shall we do tonight? I’m thinking bowling.","I’m loving the weather today!","I can’t stand his brother.","She couldn’t stand being kept waiting.","He despised himself for being so cowardly.","I can’t bear having cats in the house.","They loathe each other.","They absolutely detest each other.","He came to hate the town, with its narrow prejudices.","I absolutely hate cooking.","She hated the idea of moving to Scotland.","I hate it when you lose your temper like that.","He hates violence in any form.","He was beginning to hate his job.","I hate to think what would have happened if you hadn't been there.","I would hate him to think he wasn't welcome here.","She hated every moment of school.","I hate the fact that the rich can simply pay for better healthcare.","Don't you just hate people who are always right?","For a moment she almost hated him.","He hated me for standing up to him.","He was the teacher that we all loved to hate.","I hated him with a passion.","They were brought up to hate anyone of a different religion."],"opposite":"","synonyms":"hate"},{"def":"used when saying something that you would prefer not to have to say, or when politely asking to do something","examples":["I hate to say it, but I don't think their marriage will last.","I'd hate to say how many hours I've spent trying to fix my computer.","I hate to trouble you, but could I use your phone?"],"opposite":"","synonyms":""},{"def":"to dislike somebody very much","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"hate somebody’s guts","def":"to dislike somebody very much","examples":[]}],"phrasal":[],"related":["hate on","hate mail","hate crime","hate speech","love-hate relationship","hate crimes","somebody’s pet hate","hate on somebody","hate somebody’s guts","hate, be sick of, etc. the sight of somebody/something"]},{"pos":"noun","level":"B1","meanings":[{"def":"a very strong feeling of dislike for somebody","examples":["She gave him a look of real hate.","a strange relationship built on love and hate","hate for somebody/something She was full of hate for the people who had betrayed her.","a hate campaign (= cruel comments made about somebody over a period of time in order to damage their reputation)","Her deep hatred of her sister was obvious.","a cat’s hatred of water.","a look of pure hate","people filled with hate.","In her eyes he could see naked hate.","She became a hate figure for politicians on the left.","He had received racist hate mail.","His eyes were flashing with hate and anger.","I have so much hate for that man.","There were allegations of a hate campaign against the councillor."],"opposite":"","synonyms":""},{"def":"a person or thing that you hate","examples":["Plastic flowers have always been a particular hate of mine."],"opposite":"","synonyms":""},{"def":"something that you particularly dislike","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"somebody’s pet hate","def":"something that you particularly dislike","examples":[]}],"phrasal":[],"related":[]}]