[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/hea/head_/head__us_1.mp3","phonsUS":"/hed/","level":"A1","meanings":[{"def":"the part of the body on top of the neck containing the eyes, nose, mouth and brain","examples":["She nodded her head in agreement.","He shook his head in disbelief.","The boys hung their heads in shame.","She turned her head to look at him.","They bowed their heads in prayer.","She tilted her head back and closed her eyes.","to raise/lift/lower your head","He was shot in the head and died ten minutes later.","The driver suffered head injuries.","He still has a good head of hair (= a lot of hair).","a woman with a beautiful head of chestnut hair","He lay writhing on the ground, clutching his head in pain.","He put his head around the door.","He put his head in his hands, exasperated.","He scratched his head, not understanding a word.","He shaved his head and became a monk.","He threw his head back and laughed out loud.","Her head tilted to one side as she considered the question.","His head drooped and tears fell into his lap.","I banged my head on the door frame.","I'm normally asleep as soon as my head hits the pillow.","She declined with a brief shake of the head.","She jerked her head in the direction of the door.","She rested her head on his shoulder.","She sat with bowed head.","The ambassador dismissed him with a curt nod of the head.","The city gates were adorned with severed heads.","The soldiers were ordered to fire over the heads of the crowd.","The thunder burst with a grand crash above our heads."],"opposite":"","synonyms":""},{"def":"the mind or brain","examples":["I sometimes wonder what goes on in that head of yours.","I wish you'd use your head (= think carefully before doing or saying something).","The thought never entered my head.","His head was spinning (= he felt dizzy or confused) after only one drink.","in somebody's head I can't work it out in my head—I need a calculator.","She started hearing voices in her head.","into somebody's head Who's been putting such weird ideas into your head (= making you believe that)?","out of somebody's head I can't get that tune out of my head.","Try to put the exams out of your head (= stop thinking about them).","It was the first name that popped into my head.","It was an accident, said a voice inside his head.","I decided to go for a walk to clear my head.","He looked at me as if I needed my head examined.","Don't bother your pretty little head with things like that!","It never entered my head that he might be lying."],"opposite":"","synonyms":""},{"def":"the size of a person’s or animal’s head, used as a measurement of distance or height","examples":["She's a good head taller than her sister.","The favourite won by a short head (= a distance slightly less than the length of a horse's head)."],"opposite":"","synonyms":""},{"def":"a continuous pain in your head","examples":["I woke up with a really bad head this morning."],"opposite":"","synonyms":""},{"def":"the person in charge of a group of people or an organization","examples":["head of something the heads of government/state","She resigned as head of department.","I've asked the department head for an appointment.","a former head of the Hong Kong Stock Exchange","He is deputy head of the National Railway Museum.","the crowned heads (= the kings and queens) of Europe","I was head coach of a Little League basketball team in Pittsburgh.","the head gardener/chef/waiter","He is only the nominal head of the company.","The Queen is titular head of the Church of England.","The Bishop is head of the Church in Kenya."],"opposite":"","synonyms":""},{"def":"the person in charge of a school or college","examples":["I've been called in to see the Head.","the deputy head","I remember sitting outside the Head's office waiting to be called in.","She is deputy head of Greenlands Comprehensive, a struggling inner city school.","The minister has written to every secondary head in Scotland."],"opposite":"","synonyms":""},{"def":"the side of a coin that has a picture of the head of a person on it, used as one choice when a coin is tossed to decide something","examples":["I called heads and it came down tails."],"opposite":"","synonyms":""},{"def":"the end of a long narrow object that is larger or wider than the rest of it","examples":["the head of a nail"],"opposite":"","synonyms":""},{"def":"the top or highest part of something","examples":["at the head of the page","They finished the season at the head of their league."],"opposite":"","synonyms":""},{"def":"the place where a river begins","examples":[],"opposite":"","synonyms":""},{"def":"the most important seat at a table","examples":["The President sat at the head of the table."],"opposite":"","synonyms":""},{"def":"the position at the front of a line of people","examples":["The prince rode at the head of his regiment."],"opposite":"","synonyms":""},{"def":"the mass of leaves or flowers at the end of a stem","examples":["Remove the dead heads to encourage new growth."],"opposite":"","synonyms":""},{"def":"the mass of small bubbles on the top of a glass of beer","examples":[],"opposite":"","synonyms":""},{"def":"the part of a spot on your skin that contains a thick yellow liquid (= pus)","examples":[],"opposite":"","synonyms":""},{"def":"the component of a sound or video recording system that converts data on the disk or tape into digital electronic data (and the other way round)","examples":[],"opposite":"","synonyms":""},{"def":"used to say how many animals of a particular type are on a farm, in a herd, etc.","examples":["200 head of sheep"],"opposite":"","synonyms":""},{"def":"the pressure produced by steam in a small space","examples":["The old engine still manages to build up a good head of steam."],"opposite":"","synonyms":""},{"def":"oral sex (= using the mouth to give somebody sexual pleasure)","examples":["to give head"],"opposite":"","synonyms":""},{"def":"the central part of a phrase, which has the same grammatical function as the whole phrase. In the phrase ‘the tall man in a suit’, man is the head.","examples":[],"opposite":"","synonyms":""},{"def":"to force people to stop arguing and behave in a sensible way","examples":[],"opposite":"","synonyms":""},{"def":"to keep trying to do something that will never be successful","examples":["Trying to reason with them was like banging my head against a brick wall."],"opposite":"","synonyms":""},{"def":"to be much better than other people or things","examples":["His performance stood head and shoulders above the rest."],"opposite":"","synonyms":""},{"def":"to shout at somebody in an angry way, especially without reason","examples":[],"opposite":"","synonyms":""},{"def":"if you bring a situation to a head or if a situation comes to a head, you are forced to deal with it quickly because it suddenly becomes very bad","examples":["The chairman's resignation finally brought matters to a head.","The dispute finally came to a head in March that year.","Things came to a head when several of the nurses made a formal complaint."],"opposite":"","synonyms":""},{"def":"to refuse to admit that a problem exists or refuse to deal with it","examples":[],"opposite":"","synonyms":""},{"def":"to be unable to understand something","examples":["I couldn't make head nor tail of what he was saying."],"opposite":"","synonyms":""},{"def":"to make somebody feel confused, upset and/or annoyed","examples":["Shut up! You're doing my head in."],"opposite":"","synonyms":""},{"def":"to be able to do something very easily and without having to think too much","examples":[],"opposite":"","synonyms":""},{"def":"to make somebody remember something by repeating it a lot of times","examples":[],"opposite":"","synonyms":""},{"def":"covering your whole body","examples":["We were covered from head to foot in mud.","She was dressed from head to toe in red."],"opposite":"","synonyms":""},{"def":"to sleep","examples":["I managed to get my head down for an hour."],"opposite":"","synonyms":""},{"def":"to avoid attracting attention to yourself","examples":[],"opposite":"","synonyms":""},{"def":"to be able to understand or accept something","examples":["She's dead. I can't get my head round it yet."],"opposite":"","synonyms":""},{"def":"to start to understand or think something","examples":["When will you get it into your head that I don't want to discuss this any more!","For some reason she's got it into her head that I don't like her."],"opposite":"","synonyms":""},{"def":"to allow somebody to do what they want without trying to stop them","examples":[],"opposite":"","synonyms":""},{"def":"to give somebody hopes about something that may not be possible or likely; to make somebody act or think in an unreasonable way","examples":["Who's been putting ideas into his head?"],"opposite":"","synonyms":""},{"def":"to deal with somebody in a very direct and determined way","examples":["The company will be going head to head with the giant of the pharmaceuticals market."],"opposite":"","synonyms":""},{"def":"to make you feel drunk","examples":["That glass of wine has gone straight to my head."],"opposite":"","synonyms":""},{"def":"to make you feel too proud of yourself in a way that other people find annoying","examples":[],"opposite":"","synonyms":""},{"def":"to be aware of everything that is happening around you, even things that seem difficult or impossible to see","examples":["You can’t get away with anything in her class. She has eyes in the back of her head."],"opposite":"","synonyms":""},{"def":"to be a sensible person","examples":[],"opposite":"","synonyms":""},{"def":"to be good at something","examples":["to have a head for figures/business"],"opposite":"","synonyms":""},{"def":"if somebody does not have a head for heights, they feel nervous and think they are going to fall when they look down from a high place","examples":[],"opposite":"","synonyms":""},{"def":"to be reading","examples":["She always has her nose in a book."],"opposite":"","synonyms":""},{"def":"to be thinking about something that is not connected with what you are doing","examples":[],"opposite":"","synonyms":""},{"def":"to have ideas, plans, etc. that are not realistic","examples":[],"opposite":"","synonyms":""},{"def":"to be a sensible person","examples":[],"opposite":"","synonyms":""},{"def":"to have somewhere to live","examples":["Thanks to Bob’s generosity, I still have a roof over my head."],"opposite":"","synonyms":""},{"def":"for each person","examples":["The meal worked out at $20 a head."],"opposite":"","synonyms":""},{"def":"moving forwards or downwards with your head in front of the rest of your body","examples":["He fell head first down the stairs."],"opposite":"","synonyms":""},{"def":"without thinking carefully about something before acting","examples":["She got divorced and rushed head first into another marriage."],"opposite":"","synonyms":""},{"def":"your head feels as though it is going round and round and you cannot balance, especially because you are ill or confused or have had a shock; to make you feel like this","examples":["Her head was spinning from the pain.","His theories on economics are enough to make your head spin."],"opposite":"","synonyms":""},{"def":"loving somebody very much","examples":["He's fallen head over heels in love with his boss."],"opposite":"","synonyms":""},{"def":"used to ask somebody which side of a coin they think will be facing upwards when it is tossed in order to decide something by chance","examples":[],"opposite":"","synonyms":""},{"def":"used to say that some people will be punished because of something that has happened","examples":[],"opposite":"","synonyms":""},{"def":"to say something that is exactly right","examples":[],"opposite":"","synonyms":""},{"def":"to force somebody to do something that they do not want to do, by making threats","examples":[],"opposite":"","synonyms":""},{"def":"to be proud of or not feel ashamed about something that you have done","examples":["She managed to hold her head high and ignore what people were saying."],"opposite":"","synonyms":""},{"def":"used to threaten somebody that you will hit them","examples":[],"opposite":"","synonyms":""},{"def":"involved in something that is too difficult for you to deal with","examples":["After a week in the new job, I soon realized that I was in over my head."],"opposite":"","synonyms":""},{"def":"to remain calm in a difficult situation","examples":["She needed to keep a clear head if she was to remain in control."],"opposite":"","synonyms":""},{"def":"to deal with a difficult situation, especially one in which you have financial problems, and just manage to survive","examples":["I’m not sure how much longer we’ll be able to keep our heads above water."],"opposite":"","synonyms":""},{"def":"to avoid attracting attention to yourself","examples":["If I were you, I’d keep your head down for a couple of weeks."],"opposite":"","synonyms":""},{"def":"to laugh very loudly and for a long time","examples":[],"opposite":"","synonyms":""},{"def":"to laugh, etc. a lot and very loudly","examples":[],"opposite":"","synonyms":""},{"def":"to act according to what you feel rather than to what you think is sensible","examples":[],"opposite":"","synonyms":""},{"def":"in a bad mood; in an angry way","examples":["I should keep out of his way. He’s like a bear with a sore head this morning."],"opposite":"","synonyms":""},{"def":"to become unable to act in a calm or sensible way","examples":[],"opposite":"","synonyms":""},{"def":"to make somebody feel annoyed, anxious or upset","examples":["When they spend all this time on social media, they are seeing things that mess with their heads."],"opposite":"","synonyms":""},{"def":"to be crazy","examples":[],"opposite":"","synonyms":""},{"def":"to not spend time/effort on something, because it is not important or you are not interested in it","examples":[],"opposite":"","synonyms":""},{"def":"to not hurt somebody physically in any way","examples":[],"opposite":"","synonyms":""},{"def":"just guessing or using your memory, without taking time to think carefully or check the facts","examples":["I can't remember the name off the top of my head, but I can look it up for you."],"opposite":"","synonyms":""},{"def":"used to describe a young person who acts in a more sensible way than you would expect for a person of their age","examples":[],"opposite":"","synonyms":""},{"def":"used to tell somebody that they will have to accept any unpleasant results of something that they decide to do","examples":["Tell him the truth if you want to, but on your own head be it!"],"opposite":"","synonyms":""},{"def":"crazy","examples":[],"opposite":"","synonyms":""},{"def":"not knowing what you are saying or doing because of the effects of alcohol or drugs","examples":[],"opposite":"","synonyms":""},{"def":"too difficult or complicated for somebody to understand","examples":["A lot of the jokes went (= were) right over my head."],"opposite":"","synonyms":""},{"def":"to a higher position of authority than somebody","examples":["I couldn't help feeling jealous when she was promoted over my head.","I’m not happy that you went over my head to ask for this time off."],"opposite":"","synonyms":""},{"def":"an amount of money that is offered for capturing or killing somebody","examples":["Ever since he killed the gang’s leader, there has been a price on his head."],"opposite":"","synonyms":""},{"def":"to risk losing your job, damaging your reputation, etc. by doing or saying something","examples":["It's not a matter that I'm prepared to put my head on the block for."],"opposite":"","synonyms":""},{"def":"to think about or discuss something as a group","examples":[],"opposite":"","synonyms":""},{"def":"if something unpleasant rears its head or rears its ugly head, it appears or happens","examples":[],"opposite":"","synonyms":""},{"def":"to make you feel that you can still hear something","examples":["His warning was still ringing in my ears."],"opposite":"","synonyms":""},{"def":"to think hard in order to find an answer to something","examples":["Experts have been scratching their heads over the increase in teenage crime."],"opposite":"","synonyms":""},{"def":"to make people think about something in a completely different way","examples":[],"opposite":"","synonyms":""},{"def":"to be remembered for a long time","examples":["One of his paintings in particular sticks in my mind."],"opposite":"","synonyms":""},{"def":"to suddenly start thinking something, especially something that other people think is stupid","examples":[],"opposite":"","synonyms":""},{"def":"to suddenly decide to do something, especially something that other people think is stupid","examples":[],"opposite":"","synonyms":""},{"def":"a physical condition in which your head is painful or you cannot think clearly as a result of an illness or of drinking too much alcohol","examples":["You’re going to have a thick head in the morning!"],"opposite":"","synonyms":""},{"def":"to make a person feel too proud in a way that other people find annoying","examples":[],"opposite":"","synonyms":""},{"def":"used to say that two people can achieve more than one person working alone","examples":[],"opposite":"","synonyms":""},{"def":"used to tell somebody to think about something, especially when they have asked for your opinion or said something stupid","examples":["‘Why don't you want to see him again?’ ‘Oh, use your head!’"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"bang/knock your/their heads together","def":"to force people to stop arguing and behave in a sensible way","examples":[]},{"idiom":"be banging, etc. your head against a brick wall","def":"to keep trying to do something that will never be successful","examples":["Trying to reason with them was like banging my head against a brick wall."]},{"idiom":"be/stand head and shoulders above somebody/something","def":"to be much better than other people or things","examples":["His performance stood head and shoulders above the rest."]},{"idiom":"bite/snap somebody’s head off","def":"to shout at somebody in an angry way, especially without reason","examples":[]},{"idiom":"bring something to a head | come to a head","def":"if you bring a situation to a head or if a situation comes to a head, you are forced to deal with it quickly because it suddenly becomes very bad","examples":["The chairman's resignation finally brought matters to a head.","The dispute finally came to a head in March that year.","Things came to a head when several of the nurses made a formal complaint."]},{"idiom":"bury/hide your head in the sand","def":"to refuse to admit that a problem exists or refuse to deal with it","examples":[]},{"idiom":"can’t make head nor/or tail of something","def":"to be unable to understand something","examples":["I couldn't make head nor tail of what he was saying."]},{"idiom":"do somebody’s head in","def":"to make somebody feel confused, upset and/or annoyed","examples":["Shut up! You're doing my head in."]},{"idiom":"do something standing on your head","def":"to be able to do something very easily and without having to think too much","examples":[]},{"idiom":"drum something into somebody’s head","def":"to make somebody remember something by repeating it a lot of times","examples":[]},{"idiom":"from head to foot/toe","def":"covering your whole body","examples":["We were covered from head to foot in mud.","She was dressed from head to toe in red."]},{"idiom":"get your head down","def":"to sleep","examples":["I managed to get my head down for an hour."]},{"idiom":"get your head round something","def":"to be able to understand or accept something","examples":["She's dead. I can't get my head round it yet."]},{"idiom":"get it into your head (that…)","def":"to start to understand or think something","examples":["When will you get it into your head that I don't want to discuss this any more!","For some reason she's got it into her head that I don't like her."]},{"idiom":"give somebody their head","def":"to allow somebody to do what they want without trying to stop them","examples":[]},{"idiom":"give somebody ideas | put ideas into somebody’s head","def":"to give somebody hopes about something that may not be possible or likely; to make somebody act or think in an unreasonable way","examples":["Who's been putting ideas into his head?"]},{"idiom":"go head to head (with somebody)","def":"to deal with somebody in a very direct and determined way","examples":["The company will be going head to head with the giant of the pharmaceuticals market."]},{"idiom":"go to somebody’s head","def":"to make you feel drunk","examples":["That glass of wine has gone straight to my head."]},{"idiom":"have eyes in the back of your head","def":"to be aware of everything that is happening around you, even things that seem difficult or impossible to see","examples":["You can’t get away with anything in her class. She has eyes in the back of her head."]},{"idiom":"have a good head on your shoulders","def":"to be a sensible person","examples":[]},{"idiom":"have a head for something","def":"to be good at something","examples":["to have a head for figures/business"]},{"idiom":"have your head/nose in a book","def":"to be reading","examples":["She always has her nose in a book."]},{"idiom":"have your head in the clouds","def":"to be thinking about something that is not connected with what you are doing","examples":[]},{"idiom":"have your head screwed on (the right way)","def":"to be a sensible person","examples":[]},{"idiom":"have a roof over your head","def":"to have somewhere to live","examples":["Thanks to Bob’s generosity, I still have a roof over my head."]},{"idiom":"a/per head","def":"for each person","examples":["The meal worked out at $20 a head."]},{"idiom":"head first","def":"moving forwards or downwards with your head in front of the rest of your body","examples":["He fell head first down the stairs.","She got divorced and rushed head first into another marriage."]},{"idiom":"your head is spinning | make your head spin","def":"your head feels as though it is going round and round and you cannot balance, especially because you are ill or confused or have had a shock; to make you feel like this","examples":["Her head was spinning from the pain.","His theories on economics are enough to make your head spin."]},{"idiom":"head over heels in love","def":"loving somebody very much","examples":["He's fallen head over heels in love with his boss."]},{"idiom":"heads or tails?","def":"used to ask somebody which side of a coin they think will be facing upwards when it is tossed in order to decide something by chance","examples":[]},{"idiom":"heads will roll (for something)","def":"used to say that some people will be punished because of something that has happened","examples":[]},{"idiom":"hit the nail on the head","def":"to say something that is exactly right","examples":[]},{"idiom":"hold/put a gun to somebody’s head","def":"to force somebody to do something that they do not want to do, by making threats","examples":[]},{"idiom":"hold your head high | hold up your head","def":"to be proud of or not feel ashamed about something that you have done","examples":["She managed to hold her head high and ignore what people were saying."]},{"idiom":"I’ll knock your block/head off!","def":"used to threaten somebody that you will hit them","examples":[]},{"idiom":"in over your head","def":"involved in something that is too difficult for you to deal with","examples":["After a week in the new job, I soon realized that I was in over my head."]},{"idiom":"keep your head | keep a clear/cool head","def":"to remain calm in a difficult situation","examples":["She needed to keep a clear head if she was to remain in control."]},{"idiom":"keep your head above water","def":"to deal with a difficult situation, especially one in which you have financial problems, and just manage to survive","examples":["I’m not sure how much longer we’ll be able to keep our heads above water."]},{"idiom":"keep/get your head down","def":"to avoid attracting attention to yourself","examples":["If I were you, I’d keep your head down for a couple of weeks."]},{"idiom":"laugh your head off","def":"to laugh very loudly and for a long time","examples":[]},{"idiom":"laugh, scream, etc. your head off","def":"to laugh, etc. a lot and very loudly","examples":[]},{"idiom":"let your heart rule your head","def":"to act according to what you feel rather than to what you think is sensible","examples":[]},{"idiom":"like a bear with a sore head","def":"in a bad mood; in an angry way","examples":["I should keep out of his way. He’s like a bear with a sore head this morning."]},{"idiom":"lose your head","def":"to become unable to act in a calm or sensible way","examples":[]},{"idiom":"mess with somebody's head","def":"to make somebody feel annoyed, anxious or upset","examples":["When they spend all this time on social media, they are seeing things that mess with their heads."]},{"idiom":"need (to have) your head examined","def":"to be crazy","examples":[]},{"idiom":"not bother yourself/your head with/about something","def":"to not spend time/effort on something, because it is not important or you are not interested in it","examples":[]},{"idiom":"not harm/touch a hair of somebody’s head","def":"to not hurt somebody physically in any way","examples":[]},{"idiom":"off the top of your head","def":"just guessing or using your memory, without taking time to think carefully or check the facts","examples":["I can't remember the name off the top of my head, but I can look it up for you."]},{"idiom":"(have) an old head on young shoulders","def":"used to describe a young person who acts in a more sensible way than you would expect for a person of their age","examples":[]},{"idiom":"on your (own) head be it","def":"used to tell somebody that they will have to accept any unpleasant results of something that they decide to do","examples":["Tell him the truth if you want to, but on your own head be it!"]},{"idiom":"out of/off your head","def":"crazy","examples":[]},{"idiom":"over somebody’s head","def":"too difficult or complicated for somebody to understand","examples":["A lot of the jokes went (= were) right over my head.","I couldn't help feeling jealous when she was promoted over my head.","I’m not happy that you went over my head to ask for this time off."]},{"idiom":"a price on somebody’s head","def":"an amount of money that is offered for capturing or killing somebody","examples":["Ever since he killed the gang’s leader, there has been a price on his head."]},{"idiom":"put/lay your head/neck on the block","def":"to risk losing your job, damaging your reputation, etc. by doing or saying something","examples":["It's not a matter that I'm prepared to put my head on the block for."]},{"idiom":"put our/your/their heads together","def":"to think about or discuss something as a group","examples":[]},{"idiom":"something rears its (ugly) head","def":"if something unpleasant rears its head or rears its ugly head, it appears or happens","examples":[]},{"idiom":"ring in your ears/head","def":"to make you feel that you can still hear something","examples":["His warning was still ringing in my ears."]},{"idiom":"scratch your head (over something)","def":"to think hard in order to find an answer to something","examples":["Experts have been scratching their heads over the increase in teenage crime."]},{"idiom":"stand/turn something on its head","def":"to make people think about something in a completely different way","examples":[]},{"idiom":"stick in your head/mind","def":"to be remembered for a long time","examples":["One of his paintings in particular sticks in my mind."]},{"idiom":"take it into your head that…","def":"to suddenly start thinking something, especially something that other people think is stupid","examples":[]},{"idiom":"take it into your head to do something","def":"to suddenly decide to do something, especially something that other people think is stupid","examples":[]},{"idiom":"a thick head","def":"a physical condition in which your head is painful or you cannot think clearly as a result of an illness or of drinking too much alcohol","examples":["You’re going to have a thick head in the morning!"]},{"idiom":"turn somebody’s head","def":"to make a person feel too proud in a way that other people find annoying","examples":[]},{"idiom":"two heads are better than one","def":"used to say that two people can achieve more than one person working alone","examples":[]},{"idiom":"use your head","def":"used to tell somebody to think about something, especially when they have asked for your opinion or said something stupid","examples":["‘Why don't you want to see him again?’ ‘Oh, use your head!’"]}],"phrasal":[],"related":["-head","big-head","head boy","head off","head-on","head up","head girl","head rush","Beachy Head","cross head","Dunnet Head","head office","head start","head table","loose head","tight head","head-to-head"]},{"pos":"suffix","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/_/_he/_head/_head_1_us_3.mp3","level":"","meanings":[{"def":"(in nouns) a person who is very enthusiastic about a particular thing or is addicted to a particular drug","examples":["a gearhead","a crackhead","a smackhead","a pothead"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"B1","meanings":[{"def":"to move in a particular direction","examples":["Where are we heading?","Where are you two headed?","Let's head back home.","They woke early and headed off for breakfast.","She headed for the door.","We headed north.","Head towards the mall.","The boat was heading out to sea.","(figurative) Can you forecast where the economy is heading?","She stood up and headed toward the exit.","We headed straight back to school.","We headed west for two days."],"opposite":"","synonyms":""},{"def":"to lead or be in charge of something","examples":["She has been appointed to head the research team.","to head a committee/delegation","to head an investigation/inquiry","a terrorist group headed by a former army officer","He heads up the bank's corporate arm.","The committee will be headed jointly by two men.","The delegation will be headed by Lord Arthur.","Eight out of ten children came from a family headed by both natural parents.","He ended up heading a minority government."],"opposite":"","synonyms":""},{"def":"to be at the top of a list of names or at the front of a line of people","examples":["Italy heads the table after two games.","Orlando, Florida, heads the list of most popular summer destinations.","to head a march/procession"],"opposite":"","synonyms":""},{"def":"to put a word or words at the top of a page or section of a book as a title","examples":["be headed… The chapter was headed ‘My Early Life’."],"opposite":"","synonyms":""},{"def":"to hit a football with your head","examples":["Walsh headed the ball into an empty goal."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["be heading for","head off","head up"],"related":[]}]