[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/hea/healt/healthy__us_1.mp3","phonsUS":"/ˈhelθi/","level":"A1","meanings":[{"def":"having good health and not likely to become ill","examples":["a healthy child/baby/adult","The researchers then measured brain activity in two groups of healthy subjects.","a healthy animal/tree","Stay healthy by eating well and exercising regularly.","She was finally starting to look healthy again.","The newborn was perfectly healthy.","People are living longer and living healthier lives.","I’m not feeling very well.","Is he well enough to travel?","Are you feeling all right?","She says she’s OK now, and will be back at work tomorrow.","‘How are you?’ ‘Fine, thanks.’","Keep healthy by exercising regularly.","After a few weeks she was feeling stronger.","I go swimming every day in order to keep fit.","Her good diet had kept her healthy.","The rare disorder strikes apparently healthy boys between the ages of five and twelve.","Working in the open air has made him very healthy.","You look disgustingly healthy! How do you manage it?","a shampoo that keeps hair looking healthy","He says he's ill, but he looks perfectly healthy to me.","Here are ten tips for a healthy heart.","I feel much healthier since I gave up smoking.","She gave birth to a healthy boy.","The condition can affect otherwise healthy adults."],"opposite":"unhealthy","synonyms":"well"},{"def":"good for your health","examples":["a healthy diet/lifestyle","healthy eating/food/living","The farm provides a healthy work environment.","a new diet which is considered much healthier than previous ones","Many people today are adopting a healthy lifestyle.","More public awareness of healthy eating has made us think more about our diet."],"opposite":"unhealthy","synonyms":""},{"def":"showing that you are in good health","examples":["to have a healthy appetite"],"opposite":"","synonyms":""},{"def":"normal and sensible","examples":["The child showed a healthy curiosity.","She has a healthy respect for her rival's talents.","It's not healthy the way she clings to the past."],"opposite":"unhealthy","synonyms":""},{"def":"successful and working well","examples":["The economy is extremely healthy at the moment.","Your car doesn't sound very healthy."],"opposite":"","synonyms":""},{"def":"large and showing success","examples":["a healthy bank balance","a healthy profit"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]