[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/hea/heat_/heat__us_1.mp3","phonsUS":"/hiːt/","level":"A2","meanings":[{"def":"the quality of being hot","examples":["Heat rises.","He could feel the heat of the sun on his back.","Computers generate heat of their own.","The fire gave out a fierce heat.","Products which may be damaged by heat are stored in a separate area.","Heat flooded her cheeks."],"opposite":"","synonyms":""},{"def":"heat seen as a form of energy that is transferred from one object or substance to another as a result of a difference in temperature","examples":["Being a metal, aluminium readily conducts heat.","Darker surfaces absorb heat.","Combustion reactions give out heat."],"opposite":"","synonyms":""},{"def":"the level of temperature","examples":["Test the heat of the water before getting in.","Set the oven to a low/high/moderate heat.","Add the rice and reduce the heat.","Turn up the heat to caramelize the sugar.","a material that can withstand heats of up to 2 000°C"],"opposite":"","synonyms":""},{"def":"hot weather; the hot conditions in a building, vehicle, etc.","examples":["You should not go out in the heat of the day (= at the hottest time).","to suffer from the heat","the summer/afternoon/midday heat","The heat in the factory was unbearable.","in the heat They worked all afternoon in the intense heat.","The air shimmered in the midday heat.","Daily the heat grew.","I can't work in this heat.","We walked more than ten miles in the blistering heat.","the steamy heat of New York in summer","I think the heat is getting to all of us.","The thick walls retain the heat.","He tried to ignore the heat building up in the confined space.","She slumped to the ground suffering from heat exhaustion.","A heat haze shimmered above the fields."],"opposite":"","synonyms":""},{"def":"a source of heat, especially one that you cook food on","examples":["Return the pan to the heat and stir.","Simmer the soup for 10 minutes then remove from the heat.","over a… heat Place the roasting tray over a medium heat on your cooker or hob.","Chocolate should never be melted over direct heat.","Cook on a low heat for five minutes.","Make sure the pan is off the heat.","Simmer the sauce over a gentle heat."],"opposite":"","synonyms":""},{"def":"the process of supplying heat to a room or building; a system used to do this","examples":["The heat wasn't on and the house was freezing.","The house has electric heat.","They are afraid to turn the heat on because it's so expensive.","Andy had the heat on full blast in the car.","I turned the heat down several notches.","Our heat goes off at ten o'clock and comes on again at six.","The heat's on low.","They have their heat turned off during the morning.","It's important to switch off heat and light in unoccupied rooms.","These industries provide heat for our homes and fuel for our cars."],"opposite":"","synonyms":""},{"def":"a spicy quality in food that makes your mouth feel as if it is burning","examples":["Chilli peppers add taste and heat to food."],"opposite":"","synonyms":""},{"def":"strong feelings, especially of anger or excitement","examples":["‘No, I won't,’ he said with heat in his voice.","The chairman tried to take the heat out of the situation (= to make people calmer).","In the heat of the moment she forgot what she wanted to say (= because she was so angry or excited).","In the heat of the argument he said a lot of things he regretted later.","He stared at her, sudden heat in his eyes.","She spoke without heat."],"opposite":"","synonyms":""},{"def":"pressure on somebody to do or achieve something","examples":["The heat is on now that the election is only a week away.","United turned up the heat on their opponents with a second goal.","Can she take the heat of this level of competition?"],"opposite":"","synonyms":""},{"def":"one of a series of races or competitions, the winners of which then compete against each other in the next part of the competition","examples":["a qualifying heat","She won her heat.","He did well in the heats; hopefully he'll do as well in the final.","He fell in the first heat."],"opposite":"","synonyms":""},{"def":"to be ready to have sex and produce young","examples":[],"opposite":"","synonyms":""},{"def":"used to tell somebody to stop trying to do something if they find it too difficult, especially in order to suggest that they are less able than other people","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be on heat","def":"to be ready to have sex and produce young","examples":[]},{"idiom":"if you can’t stand the heat (get out of the kitchen)","def":"used to tell somebody to stop trying to do something if they find it too difficult, especially in order to suggest that they are less able than other people","examples":[]}],"phrasal":[],"related":["Heat","heat map","heat up","dead heat","heat pump","blood heat","heat index","white heat","heat capacity","heat-seeking","prickly heat","heat exchanger","heat exhaustion","heat lightning","heat-resistant","heat maps","heat pumps"]},{"pos":"verb","level":"A2","meanings":[{"def":"to make something hot or warm; to become hot or warm","examples":["heat (something) Heat the oil and add the onions.","The system produced enough energy to heat several thousand homes.","While the oven is heating, roll out the dough.","heat something through Check the lasagne is heated through before serving.","Heat the sauce gently for a few minutes.","Make sure the soup is well heated.","Metals expand when heated.","Water is heated by a gas burner and circulated through the pipes."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["heat up"],"related":[]},{"pos":"","level":"","meanings":[{"def":"a UK magazine published since 1999, that contains photographs and articles about famous people and their private lives. It also covers fashion and beauty, entertainment, etc.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]