[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/hei/heigh/height__us_1.mp3","phonsUS":"/haɪt/","level":"A2","meanings":[{"def":"the measurement of how tall a person or thing is","examples":["Height: 210 mm. Width: 57 mm. Length: 170 mm.","Please state your height and weight.","She is the same height as her sister.","to be of medium/average height","in height It is almost two metres in height.","height of somebody/something You can adjust the height of the chair.","The plant can reach a height of over six feet.","The table is available in several different heights.","The plants grow to a maximum height of 24 inches.","He is of medium height and slim build."],"opposite":"","synonyms":""},{"def":"the quality of being tall or high","examples":["The height of the mountain did not discourage them.","His great height was rather a handicap."],"opposite":"","synonyms":""},{"def":"a particular distance above the ground","examples":["The aircraft was gaining height.","at a height of something The plane flew at a height of 3 000 metres.","at… height to be at shoulder/chest/waist height","from a… height The stone was dropped from a great height.","The object had clearly fallen from a considerable height.","The plane was beginning to lose height.","Bring your hands to shoulder height.","The balloon reached a height of 20 000 feet.","The animal lives in lakes at a height of 6 000 feet above sea level."],"opposite":"","synonyms":""},{"def":"a high place or position","examples":["Brooklyn Heights","He doesn't have a head for heights (= is afraid of high places).","a fear of heights","from a height The pattern of the ancient fields is clearly visible from a height.","from the heights of something We looked out over the city from the heights of Edinburgh Castle.","The condor soars above the mountain heights.","They were the first expedition to scale the heights of Everest."],"opposite":"","synonyms":""},{"def":"the point when something is at its strongest or best","examples":["The fire reached its height around 2 a.m.","at its height The crisis was at its height in May.","at the height of something She is still at the height of her powers.","He is at the height of his career.","in the height of something I wouldn't go there in the height of summer.","during the height of something during the height of the Cold War"],"opposite":"","synonyms":""},{"def":"a better or greater level of something; a situation where something is very good","examples":["Their success had reached new heights.","He didn’t know it was possible to reach such heights of happiness.","She rose to undreamed-of heights of power and fame."],"opposite":"","synonyms":""},{"def":"an extreme example of a particular quality","examples":["It would be the height of folly (= very stupid) to change course now.","She was dressed in the height of fashion."],"opposite":"","synonyms":""},{"def":"an important or impressive position","examples":["She dreamed of reaching the dizzy heights of stardom.","They reached the dizzy heights of Number 11 in the charts."],"opposite":"","synonyms":""},{"def":"to stand straight and tall in order to show that you are determined, powerful or important","examples":["He drew himself up to his full height and glared at us."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the dizzy heights (of something)","def":"an important or impressive position","examples":["She dreamed of reaching the dizzy heights of stardom.","They reached the dizzy heights of Number 11 in the charts."]},{"idiom":"draw yourself up/rise to your full height","def":"to stand straight and tall in order to show that you are determined, powerful or important","examples":["He drew himself up to his full height and glared at us."]}],"phrasal":[],"related":["draw yourself up/rise to your full height"]}]