[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/hel/help_/help__us_1.mp3","phonsUS":"/help/","level":"A1","meanings":[{"def":"to make it easier or possible for somebody to do something by doing something for them or by giving them something that they need","examples":["What can I do to help?","I was only trying to help!","help with something He always helps with the housework.","help somebody They are trying their best to do a good job and help others.","help somebody with something Jo will help us with some of the organization.","help in doing something Following these steps will help in protecting our environment.","help somebody (to) do something Come and help me lift this box.","This charity aims to help people to help themselves.","The college's aim is to help students achieve their aspirations.","help (to) do something She helped organize the party.","Some history may help to explain why this is.","Could you possibly help me?","I wonder if you could give me a hand?","Would you mind opening the door for me?","I wonder if you'd mind taking a picture of us?","Could I ask you to keep an eye on my luggage for a moment?","Yes, of course.","I'm sorry, I'm in a hurry.","Sure.","Would you like me to help you with that?","Can I give you a hand?","Can I help you with that?","Shall I carry that for you?","Would it help if I spoke to Julie before you call her?","Let me take your bag.","If there's anything I can do (to help), let me know.","That's very kind/​nice/​generous/​thoughtful of you. Thank you.","It's all right, thank you. I can manage/​do it.","Thanks. That would be very helpful.","I'm afraid I can't help you.","My mother helps me a lot.","Talking to a counsellor helped her enormously.","The minimum wage is designed to help people in low-pay service industries.","Can you help me with my homework?","Many people inadvertently help thieves by leaving keys in full view.","He had actively helped many Jews to escape.","Lavender oil supposedly helps you sleep.","The exhibition helped her establish herself as an artist.","Therapy helped her overcome her fear.","We were given clues to help us solve the puzzle.","I need contacts that could help in finding a job.","We must all try and help each other.","Many people are willing to give their own time to help the community.","The students helped to raise £750 for the national appeal.","We're helping to create a healthier, better future for everyone."],"opposite":"","synonyms":""},{"def":"to improve a situation; to make it easier for something to happen","examples":["The support of our families has helped enormously.","it helps (doing something) It helped being able to talk about it.","it helps that… It certainly helped that her father is a duke!","help towards something The money raised will help towards (= partly pay for) the cost of organizing the championships.","help something It doesn't really help matters knowing that everyone is talking about us.","help (to) do something This should help to reduce the pain.","We need new measures to help fight terrorism.","His statement hardly helped his case.","The music really helps the scene work.","I thought a walk would help somehow.","Intense guilt won't necessarily help here.","The whole process was greatly helped by the widespread availability of computers.","Correct breathing helps to clear the mind and reduce tension.","The new service helped boost pre-tax profits by 10%.","The study of the present also helps to illuminate the past.","Think of some questions that will help focus the discussion.","Iron helps in the formation of red blood cells.","It helps immensely that he has cast good actors.","efforts to help bridge the gap between those who have access to the internet and those who don't"],"opposite":"","synonyms":""},{"def":"to help somebody move or do some other action by letting them lean on you, guiding them, etc.","examples":["She helped him to his feet.","We were helped ashore by local people.","He gently helped her back into the chair.","She helped the old man out of the car.","I helped her across the road."],"opposite":"","synonyms":""},{"def":"to give yourself/somebody food, drinks, etc.","examples":["help yourself If you want another drink, just help yourself.","help yourself/somebody to something Can I help you to some more salad?"],"opposite":"","synonyms":""},{"def":"to take something without permission","examples":["He'd been helping himself to the money in the cash register."],"opposite":"","synonyms":""},{"def":"used to say that it is impossible to prevent or avoid something","examples":["I can't help thinking he knows more than he has told us.","He can’t help being ugly.","She couldn't help but wonder what he was thinking.","It couldn't be helped (= there was no way of avoiding it and we must accept it).","He never does more work than he can help (= he does as little as possible).","I always end up having an argument with her, I don't know why, I just can't help it.","I couldn't help it if the bus was late (= it wasn't my fault).","She burst out laughing—she couldn't help herself (= couldn't stop herself).","She won’t be invited again, not if I can help it (= if I can do anything to prevent it)."],"opposite":"","synonyms":""},{"def":"to help somebody","examples":[],"opposite":"","synonyms":""},{"def":"used to say that you are afraid somebody will be in danger or that something bad will happen to them","examples":["God help us if this doesn't work."],"opposite":"","synonyms":""},{"def":"used to swear that what you are saying is true, especially in a court of law","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"somebody cannot help (doing) something | somebody cannot help but do something","def":"used to say that it is impossible to prevent or avoid something","examples":["I can't help thinking he knows more than he has told us.","He can’t help being ugly.","She couldn't help but wonder what he was thinking.","It couldn't be helped (= there was no way of avoiding it and we must accept it).","He never does more work than he can help (= he does as little as possible).","I always end up having an argument with her, I don't know why, I just can't help it.","I couldn't help it if the bus was late (= it wasn't my fault).","She burst out laughing—she couldn't help herself (= couldn't stop herself).","She won’t be invited again, not if I can help it (= if I can do anything to prevent it)."]},{"idiom":"give/lend a helping hand","def":"to help somebody","examples":[]},{"idiom":"God/Heaven help somebody","def":"used to say that you are afraid somebody will be in danger or that something bad will happen to them","examples":["God help us if this doesn't work."]},{"idiom":"so help me (God)","def":"used to swear that what you are saying is true, especially in a court of law","examples":[]}],"phrasal":["help off with","help on with","help out"],"related":["help out","help desk","home help","self-help","help off with","help on with","Help the Aged","the help","daily help","help desks","domestic help","help out | help somebody","help somebody off with something","help somebody on with something","so help me (God)","God/Heaven help somebody","there is no help for it"]},{"pos":"noun","level":"A1","meanings":[{"def":"the act of helping somebody to do something","examples":["Thank you for all your help.","to ask/call/appeal for help","The offer of help came too late.","help with something Do you need any help with that?","of help (to somebody) Can I be of any help to you?","with help from somebody/something With help from a parent, a child can do simple cooking.","with the help of somebody/something She recovered with the help of her family and friends.","He attended university with the help of a scholarship.","without the help of somebody/something None of this would have been possible without their help.","They have at last decided to enlist the help of experts.","They can usually manage by themselves, but occasionally need outside help.","He enlisted the help of a private detective in his search for the truth.","He rudely rejected her kind offer of help.","He'll need help with this homework.","He's too proud to accept help.","I really appreciate your help.","Police are appealing for help in catching the killers.","The homeless centre relies entirely on voluntary help.","The system is based on mutual help rather than on payment for services.","They had substantial help from farmers.","With a little help, I think I could fix the computer myself.","The college will no longer have to close, thanks to the help of private investment."],"opposite":"","synonyms":""},{"def":"the act of helping somebody who is in danger","examples":["Quick, get help!","She screamed for help.","His suicide attempt was really a cry for help.","Don't panic—help is at hand.","He lay injured for four hours before help arrived.","He ran to get help.","I heard a cry for help from inside the building.","I opened the window and called for help."],"opposite":"","synonyms":""},{"def":"advice, money, etc. that is given to somebody in order to solve their problems","examples":["professional/medical/financial help","I decided to seek legal help.","help in doing something The organization offers practical help in dealing with paperwork.","help with something You should qualify for help with the costs of running a car.","help for somebody The charity provides emergency help for refugees.","help from somebody Get help from someone who understands the legal side.","The training centre provides special help for the long-term unemployed.","Your advice was a great help to me.","Is there any extra help for disabled students?","Local teachers provided invaluable help in developing the material.","Some of the injured animals were beyond help and had to be destroyed.","Teachers have little time to give individual help to students.","The careers officer gives direct help as well as advice.","The family's request for help went unanswered.","The man was clearly in need of urgent medical help.","This is the first scheme to offer real help to working mothers."],"opposite":"","synonyms":""},{"def":"a function on a computer, phone, etc. that provides information on how to use the computer, phone, etc.","examples":["The online help is very good.","a help file/page/menu/screen"],"opposite":"","synonyms":""},{"def":"the fact of being useful","examples":["The map wasn't much help.","Was the information I gave you any help?","Just shouting at him isn't going to be a lot of help.","with the help of something I managed to understand it with the help of a dictionary.","of help (to somebody) The course they sent me on was of no help whatsoever!","We broke open the lock with the help of a hammer.","With the help of a ladder, neighbours were able to rescue the children from the blaze.","The manual is too technical to be of help to the inexperienced user."],"opposite":"","synonyms":""},{"def":"a person or thing that helps somebody","examples":["She was more of a hindrance than a help.","It's a great help having you around.","Your advice was a big help.","a help to somebody She's been a big help to her father.","(ironic) You're a great help, I must say!"],"opposite":"","synonyms":""},{"def":"the person or people employed by somebody to clean their house, etc.","examples":[],"opposite":"","synonyms":""},{"def":"it is not possible to avoid doing something that may harm somebody in some way","examples":["There's no help for it. We shall have to call the police."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"there is no help for it","def":"it is not possible to avoid doing something that may harm somebody in some way","examples":["There's no help for it. We shall have to call the police."]}],"phrasal":[],"related":[]},{"pos":"exclamation","level":"","meanings":[{"def":"used to call for help because you are in a dangerous situation","examples":["Help, I'm stuck!"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]