[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/her/hero_/hero__us_1_rr.mp3","phonsUS":"/ˈhɪrəʊ/","level":"A2","meanings":[{"def":"a person who is admired by many people for doing something brave or good","examples":["a war hero (= somebody who was very brave during a war)","a hero of the First World War","one of the country’s national heroes","His charity work has made him something of a local hero.","The Olympic team were given a hero's welcome on their return home.","Scientists like her are typically unsung heroes (= people who are not praised or famous but deserve to be).","He was hailed as a hero after the rescue.","Everyone played brilliantly, but Jones was the hero of the hour.","He returned home from the tournament a conquering hero.","He was hailed as a hero after the rescue.","He was one of the great football heroes of his day.","John was no hero—he stood back as his friends approached the two armed border guards.","O'Reilly enjoyed hero status based on his ability with a ball.","She was an unsung hero of the British film industry.","The fight to save the forest turned him into a local hero.","The song remembers the brave heroes who died for their country.","James Dean was a cult hero of the fifties."],"opposite":"","synonyms":""},{"def":"the main male character in a story, novel, film, etc.","examples":["The hero of the novel is a ten-year old boy.","action heroes like Bruce Willis","Being short and overweight, he was an unlikely romantic hero.","Don Quixote, the eponymous hero of the novel by Cervantes","Tired of playing the square-jawed hero, he sought out more challenging roles."],"opposite":"","synonyms":""},{"def":"a person that you admire because of a particular quality or skill that they have","examples":["my childhood hero","hero to somebody He became a hero to millions for his decision to oppose the government's reforms.","a chance to meet his hero","Jimi Hendrix was her guitar hero.","In this album she pays tribute to her musical heroes.","His father was a hero figure to him.","Einstein is the all-time hero of many scientists."],"opposite":"","synonyms":""},{"def":"a long bread roll split open along its length and filled with various types of food","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["anti-hero","folk hero","hero worship","hero-worship","hero-worships","hero-worshipped","hero-worshiped","hero-worshiping","hero-worshipping"]}]