[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/hig/highl/highlight__us_1.mp3","phonsUS":"/ˈhaɪlaɪt/","level":"B1","meanings":[{"def":"to emphasize something, especially so that people give it more attention","examples":["The report highlighted the importance of exercise to maintain a healthy body.","Students highlighted the need for better communication between staff.","to highlight the major problems/issues","This study highlights the fact that couples are keen to assist others.","This case emphasizes/highlights the importance of honest communication between managers and employees.","Effective communication skills are essential/crucial/vital.","It should be noted that this study considers only verbal communication. Non-verbal communication is not dealt with here.","It is important to remember that/An important point to remember is that non-verbal communication plays a key role in getting your message across.","Communication is not only about the words you use but also your body language and, especially/above all, the effectiveness with which you listen.","I would like to draw attention to the role of listening in effective communication.","Choose your words carefully: in particular, avoid confusing and ambiguous language.","Finally, and perhaps most importantly, you must learn to listen as well as to speak.","The incident has sadly only served to highlight the differences within the party.","He highlighted the case of Harry Farr, 25, who was executed for cowardice in 1916.","The earthquake highlighted the vulnerability of elevated highways.","The needs of these children were dramatically highlighted by the Child Poverty Action Group.","The peace talks merely highlighted the great gulf in understanding between the two sides.","These figures clearly highlight the difference in world living standards."],"opposite":"","synonyms":""},{"def":"to mark part of a text with a special coloured pen, or to mark an area on a computer screen, to emphasize it or make it easier to see","examples":["I've highlighted the important passages in yellow.","Highlight the section that you want to delete."],"opposite":"","synonyms":""},{"def":"to make some parts of your hair a lighter colour than the rest by using a chemical substance on them","examples":["I’m having my hair highlighted.","The shampoo is ideal for permed or highlighted hair."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"B1","meanings":[{"def":"the best, most interesting or most exciting part of something","examples":["One of the highlights of the trip was seeing the Taj Mahal.","The highlights of the match will be shown later this evening.","My dance class is the highlight of my week.","The highlight of the evening was a violin solo by five-year-old Mia.","Recorded highlights of the match will be shown later tonight.","The highlight of the week was Saturday's firework display.","The real highlight of the trip for me was the visit to the Tower of London.","streamed video highlights from today's news","The album's highlights include a jazz version of ‘Hungry Like the Wolf’."],"opposite":"","synonyms":""},{"def":"areas of hair that are lighter than the rest, usually because a chemical substance has been put on them","examples":["She’s had blonde highlights put into her hair."],"opposite":"","synonyms":""},{"def":"the light or bright part of a picture or photograph","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]