[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/hin/hint_/hint__us_1.mp3","phonsUS":"/hɪnt/","level":"C1","meanings":[{"def":"something that you say or do in an indirect way in order to show somebody what you are thinking","examples":["He gave a broad hint (= one that was obvious) that he was thinking of retiring.","Should I drop a hint (= give a hint) to Matt?","He resented any hint that he might be to blame.","He gave a broad hint that he was on the verge of leaving.","I dropped a few subtle hints about the payment being due.","Is that a hint to me to leave?","OK, I get the hint!","a hint from my boss about my absences from the office"],"opposite":"","synonyms":""},{"def":"something that suggests what will happen in the future","examples":["At the first hint of trouble, they left.","The opening scene gives us a hint of things to come.","There were early hints that their marriage might be in trouble.","At the first hint of trouble, I will call the police.","That was the first hint we had that things were going wrong."],"opposite":"","synonyms":""},{"def":"a small amount of something","examples":["a hint of a smile","There was more than a hint of sadness in his voice.","The walls were painted white with a hint of peach.","Gail searched his face for the slightest hint of regret.","Do I detect a hint of jealousy in your voice?","He showed not a hint of remorse.","Her voice betrayed a hint of uneasiness.","She felt the first hint of panic as the train pulled into the station.","The slightest hint of gossip upset her.","a dish with a strong hint of garlic","‘It won't take long,’ he persisted, without the slightest hint of apology.","There was a hint of amusement in his voice.","He vowed that no hint of scandal would ever be attached to him.","Her eyes held a hint of mockery."],"opposite":"","synonyms":""},{"def":"a small piece of practical information or advice","examples":["handy hints on saving money","The teacher’s book gives useful hints on how to develop reading skills.","It gives handy hints about what to buy at the local market.","The book gives some useful hints about how to plan your garden.","a book full of handy hints on painting and decorating"],"opposite":"","synonyms":""},{"def":"to understand what somebody wants you to do even though they tell you in an indirect way","examples":["I thought they'd never go—some people just can't take a hint.","Sarah hoped he'd take the hint and leave her alone.","Can't you take a hint and leave me alone?"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"take a/the hint","def":"to understand what somebody wants you to do even though they tell you in an indirect way","examples":["I thought they'd never go—some people just can't take a hint.","Sarah hoped he'd take the hint and leave her alone.","Can't you take a hint and leave me alone?"]}],"phrasal":[],"related":[]},{"pos":"verb","level":"C1","meanings":[{"def":"to suggest something in an indirect way","examples":["hint at something What are you hinting at?","hint (that)… They hinted (that) there might be more job losses.","+ speech ‘I might know something about it,’ he hinted.","He hinted strongly that he would be resigning soon.","She even hinted that she might resign.","She hinted darkly that all was not well.","The problems are only hinted at in the report."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]