[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/his/histo/history__us_2_rr.mp3","phonsUS":"/ˈhɪstri/","level":"A1","meanings":[{"def":"all the events that happened in the past","examples":["in history The battle was a turning point in human history.","one of the worst disasters in recent history","throughout history Many people throughout history have dreamt of a world without war.","a people with no sense of history","The area was inhabited long before the dawn of recorded history (= before people wrote about events).","These events changed the course of history.","This was her attempt to rewrite history with herself in the role of heroine.","At that time in history, women did just what they were expected to do.","History shows that New Zealand are almost unbeatable by British teams on their own turf.","History shows that high approval ratings are no guarantee of re-election.","She created a piece of history by winning her fourth title.","The debate about the origins of the universe has been going on throughout recorded history.","The team grabbed a slice of history here today.","The war has now faded into history.","There have been conflicts such as this throughout history.","This is a fascinating period of history.","the most extraordinary meeting in history","things that happened in recent history","It was one of the worst disasters in recent history."],"opposite":"","synonyms":""},{"def":"the past events connected with the development of a particular place, subject, etc.","examples":["the history of science/music/philosophy","She is an expert in the history of the United States.","The local history of the area is fascinating.","The museum traces the history of the slave trade.","The city has a rich and colourful history.","the official history of the Labour Party","the early history of the trade union movement","a building that is steeped in history","The town's history goes back to Roman times.","The history of this organization goes back many years.","The regiment traces its history back to 1803.","The country has suffered several invasions during its history.","the best player in the sport's history","the history of the world","The school traces its history back to 1865.","the history of Ireland/​democracy/​popular music","One of the puzzles of the history of science is why science never really took off in China."],"opposite":"","synonyms":""},{"def":"the study of past events, especially as a subject at school or university","examples":["a history professor/teacher","a history lesson/textbook","a degree in History","cultural/social/economic/political history","modern/ancient history","She's studying art history.","She studies history of art."],"opposite":"","synonyms":""},{"def":"a written or spoken account of real past events","examples":["She's writing a new history of Europe.","She went on to catalogue a long history of disasters.","the oral histories of ordinary people","Ours is the oldest written history in the world.","There is no true written history of the Pashtun in their own land."],"opposite":"","synonyms":""},{"def":"the set of facts that are known about somebody/something's past","examples":["I know nothing about his personal history.","The group has quite a history.","The doctor will need some details of your medical history."],"opposite":"","synonyms":""},{"def":"a record of something happening frequently in the past life of a person, family or place","examples":["He has a history of violent crime.","She has a long history of mental illness.","There is a history of heart disease in my family.","They have a history of trying to interfere.","The area has a history of subsidence problems."],"opposite":"","synonyms":""},{"def":"a record kept by a web browser of the web pages and other files it has been used to access","examples":["Clearing your browser history prevents websites from following and tracking your actions."],"opposite":"","synonyms":""},{"def":"a relationship between two people, groups, companies, etc. that started in the past and continued for a period of time, especially one involving bad or complicated feelings","examples":["Sure there's history between Anna Mae and me, like you said."],"opposite":"","synonyms":""},{"def":"a historical play","examples":["Shakespeare's comedies, histories and tragedies"],"opposite":"","synonyms":""},{"def":"to be dead or no longer important","examples":["Another mistake like that and you're history.","We won't talk about that—that's history.","That's past history now.","They had an affair once, but that's past history now."],"opposite":"","synonyms":""},{"def":"the record of great achievements in history","examples":["She has earned her place in the history books."],"opposite":"","synonyms":""},{"def":"used to say that things often happen later in the same way as before","examples":["Years later family history repeated itself with Eve’s daughters."],"opposite":"","synonyms":""},{"def":"to be or do something so important that it will be recorded in history","examples":["a discovery that made medical history","He will go down in history as a wise adviser and a kind man.","Neil Armstrong made history by being the first man to walk on the moon."],"opposite":"","synonyms":""},{"def":"used when you are telling a story to say that you do not need to tell the end of it, because everyone knows it already","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be history","def":"to be dead or no longer important","examples":["Another mistake like that and you're history.","We won't talk about that—that's history.","That's past history now.","They had an affair once, but that's past history now."]},{"idiom":"the history books","def":"the record of great achievements in history","examples":["She has earned her place in the history books."]},{"idiom":"history repeats itself","def":"used to say that things often happen later in the same way as before","examples":["Years later family history repeated itself with Eve’s daughters."]},{"idiom":"make history | go down in history","def":"to be or do something so important that it will be recorded in history","examples":["a discovery that made medical history","He will go down in history as a wise adviser and a kind man.","Neil Armstrong made history by being the first man to walk on the moon."]},{"idiom":"the rest is history","def":"used when you are telling a story to say that you do not need to tell the end of it, because everyone knows it already","examples":[]}],"phrasal":[],"related":["art history","case history","life history","oral history","ancient history","history-sheeter","natural history","Natural History Museum","history-sheeters","the history books"]}]