[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/hol/hold_/hold__us_1.mp3","phonsUS":"/həʊld/","level":"A2","meanings":[{"def":"to have somebody/something in your hand, arms, etc.","examples":["hold somebody/something She was holding a large box.","They were holding hands (= the right hand of one person holding the left hand of the other).","hold somebody/something + adv./prep. I held the mouse by its tail.","The girl held her father's hand tightly.","He was holding the baby in his arms.","The winning captain held the trophy in the air.","The lovers held each other close.","A man holding a map beckoned to me.","The person holding most cards when the time limit is reached is the winner.","People were holding banners and placards as they stood outside the building.","Each woman held a bottle in her hand.","The family made a circle, held hands, and bowed their heads.","It had started to rain, so several people held umbrellas over me.","They walked along the street, holding hands.","I held the baby gently in my arms.","He held her by the shoulders.","She was holding a large box.","I held the baby gently in my arms.","Hold on and don’t let go until I say so.","Survivors clung to pieces of floating debris.","She stood there, the flowers still clutched in her hand.","He felt himself slipping and clutched at a branch.","Grip the rope as tightly as you can.","He grasped my hand and shook it warmly.","They clasped hands (= held each other’s hands).","She clasped the children in her arms.","Hang on tight. We’re off!"],"opposite":"","synonyms":"hold"},{"def":"to put your hand on part of your body, usually because it hurts","examples":["hold something She groaned and held her head.","hold something + adv./prep. The prisoner held his head in his hands.","She started to dance, holding her hands rapturously to her chest."],"opposite":"","synonyms":""},{"def":"to keep somebody/something in a particular position","examples":["hold something + adv./prep. Hold your head up.","Hold this position for a count of 10.","The wood is held in position by a clamp.","People held handkerchiefs over their mouths.","I had to hold my stomach in (= pull the muscles flat) to zip up my jeans.","hold something + adj. I'll hold the door open for you."],"opposite":"","synonyms":""},{"def":"to support the weight of somebody/something","examples":["I don't think that branch will hold your weight.","She let him hold most of her weight as he led her upstairs.","Several pieces of wood joined together can hold more weight than just one piece."],"opposite":"","synonyms":""},{"def":"to have enough space for something/somebody; to contain something/somebody","examples":["This barrel holds 25 litres.","The plane holds about 300 passengers.","The inner box holds the cheese and has holes in it.","Each 180-litre container will hold up to three black bags of rubbish."],"opposite":"","synonyms":""},{"def":"to have or offer something; to be going to bring something","examples":["I don't know what the future holds.","This research holds the key to understanding life."],"opposite":"","synonyms":""},{"def":"to have a meeting, competition, conversation, etc.","examples":["Each month she holds a meeting with her entire staff.","The British Foreign Minister held talks with the leaders of the two countries.","He has already held discussions with Irish shareholders.","It's impossible to hold a conversation with all this noise.","The next conference will be held in Ohio.","The country is holding its first free elections for 20 years.","to hold an event/a party/a competition","The premiere was held in the Four Seasons Hotel.","The Lisburn Social Club is holding a special Mother's Day lunch next Sunday.","Special events are held annually as part of a fund-raising strategy.","The Prime Minister announced his intention to hold a referendum.","She held a garden party to celebrate the artist's 60th birthday.","The meeting will be held in the community centre."],"opposite":"","synonyms":""},{"def":"to have something you have gained or achieved","examples":["Who holds the world record for the long jump?","She held the title of world champion for three years."],"opposite":"","synonyms":""},{"def":"to have a particular job or position","examples":["How long has he held office?","Mrs Thatcher held the post of prime minister longer than anyone else last century.","Men still hold most positions of power in this country.","The company has held the advertising contract since 2005.","The professor will hold a seat on the advisory board.","Labour's John Taylor and Mary Smith both held seats in this constituency."],"opposite":"","synonyms":""},{"def":"to keep somebody and not allow them to leave","examples":["hold somebody Police are holding two men in connection with last Thursday's bank raid.","hold somebody + noun He was held prisoner for two years.","Eight people were held hostage for four months.","She was held captive in a castle.","She was arrested and held in custody in a police station."],"opposite":"","synonyms":""},{"def":"to keep somebody’s attention or interest","examples":["There wasn't much in the museum to hold my attention.","These discussions held little interest for Lucy."],"opposite":"","synonyms":""},{"def":"to keep something at the same level, rate, speed, etc.; to stay at the same level, rate, etc.","examples":["hold something (at something) Hold your speed at 70.","Interest rates have been held at 8% for a year now.","hold something to something They are trying to hold public spending to £300 billion.","hold at something The company's shares held at £3.47.","In trading today the dollar held steady against the yen."],"opposite":"","synonyms":""},{"def":"to keep something so that it can be used later","examples":["Employees do not have access to personal records held on computer.","Our solicitor holds our wills.","We can hold your reservation for three days."],"opposite":"","synonyms":""},{"def":"to wait until you can speak to the person you have phoned","examples":["That extension is busy right now. Can you hold?","hold the line She asked me to hold the line."],"opposite":"","synonyms":""},{"def":"to own or have something","examples":["Employees hold 30% of the shares.","He was born in South Africa but he holds a British passport.","Applicants must hold a full driving licence."],"opposite":"","synonyms":""},{"def":"to defend something against attack; to have control of something","examples":["The rebels held the radio station."],"opposite":"","synonyms":""},{"def":"to remain strong and safe or in position","examples":["They were afraid the dam wouldn't hold."],"opposite":"","synonyms":""},{"def":"to remain the same","examples":["How long will the fine weather hold?","If their luck holds, they could still win the championship."],"opposite":"","synonyms":""},{"def":"to have a belief or an opinion about somebody/something","examples":["hold something He holds strange views on education.","hold somebody/something + adv./prep./adj. She is held in high regard by her students (= they have a high opinion of her).","to be held in high esteem","He has very firmly held religious beliefs.","deeply held religious beliefs","privately held views","This view is not widely held."],"opposite":"","synonyms":""},{"def":"to consider that something is true","examples":["hold that… I still hold that the government's economic policies are mistaken.","hold somebody/something + adj. Parents will be held responsible for their children's behaviour.","be held to be something These vases are held to be the finest examples of Greek art."],"opposite":"","synonyms":""},{"def":"to be in close contact with the road and easy to control, especially when driven fast","examples":[],"opposite":"","synonyms":""},{"def":"to continue to move in a particular direction","examples":[],"opposite":"","synonyms":""},{"def":"to make a note continue for a particular time","examples":[],"opposite":"","synonyms":""},{"def":"be able to drink a reasonable amount of alcohol without becoming drunk","examples":["I can hold my drink as well as anyone."],"opposite":"","synonyms":""},{"def":"to win a game in which you are serving","examples":["hold (your) serve Zverev held serve to take the set.","Halep held to love."],"opposite":"","synonyms":""},{"def":"used to tell somebody to stop doing something or not to do something","examples":["Hold your fire! (= don't shoot)","Hold the front page! (= don't print it until a particular piece of news is available)","(North American English, informal) Give me a hot dog, but hold the (= don't give me any) mustard."],"opposite":"","synonyms":""},{"def":"to be true","examples":["The same argument does not hold good in every case."],"opposite":"","synonyms":""},{"def":"used to ask somebody to wait, or not to move","examples":["Hold it a second—I don't think everyone's arrived yet."],"opposite":"","synonyms":""},{"def":"to hold somebody/something very tightly because you are afraid","examples":[],"opposite":"","synonyms":""},{"def":"a person cannot be prevented from doing something","examples":["Once she gets on to the subject of politics there's no holding her."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"hold good","def":"to be true","examples":["The same argument does not hold good in every case."]},{"idiom":"hold it","def":"used to ask somebody to wait, or not to move","examples":["Hold it a second—I don't think everyone's arrived yet."]},{"idiom":"hold/hang on for/like grim death","def":"to hold somebody/something very tightly because you are afraid","examples":[]},{"idiom":"there is no holding somebody","def":"a person cannot be prevented from doing something","examples":["Once she gets on to the subject of politics there's no holding her."]}],"phrasal":["hold against","hold back","hold down","hold forth","hold in","hold off","hold on","hold onto","hold on to","hold out","hold out for","hold out on","hold over","hold to","hold together","hold up","hold with"],"related":["hold in","hold off","hold on","hold out","hold to","hold up","hold-up","hold back","hold down","hold onto","hold over","hold with","hold forth","hold against","hold on to","hold out on","hold together","scissor hold","hold out for"]},{"pos":"noun","level":"B2","meanings":[{"def":"the action of holding somebody/something; the way you are holding somebody/something","examples":["hold on somebody/something His hold on her arm tightened.","He lost his hold on the rock and was swept away by the tide.","Make sure you've got a steady hold on the camera.","She tried to keep hold of the child's hand.","He kept a firm hold on my hand.","He tightened his hold on her.","She finally released her hold on me."],"opposite":"","synonyms":""},{"def":"a particular way of holding somebody, especially in a fight or in a sport such as wrestling","examples":["in a hold He still had me in a tight hold.","The wrestler put his opponent into a head hold.","The exercise called for the recruits to get out of various holds."],"opposite":"","synonyms":""},{"def":"influence, power or control over somebody/something","examples":["He struggled to get a hold of his anger.","hold over somebody/something What she knew about his past gave her a hold over him.","hold on somebody/something This crisis had weakened his hold on power.","an attempt to break the hold of the Church","The allies lost their hold on the south of the country.","Her hold on power was now quite tenuous.","He still has a firm hold on the party.","He no longer had any hold over her."],"opposite":"","synonyms":""},{"def":"a place where you can put your hands or feet when climbing","examples":["in a hold She put her foot firmly in the hold and pulled herself up."],"opposite":"","synonyms":""},{"def":"the part of a ship or plane where the goods being carried are stored","examples":[],"opposite":"","synonyms":""},{"def":"to have or take somebody/something in your hands","examples":["He caught hold of her wrists so she couldn't get away.","Lee got hold of the dog by its collar.","Quick, grab a hold of that rope.","Gently, she took hold of the door handle and turned it.","Take hold of the handle and give it a hard pull.","She grabbed hold of a plate and smashed it."],"opposite":"","synonyms":""},{"def":"to contact or find somebody","examples":["Where have you been? I've been trying to get hold of you all day.","Eventually, we got hold of Dan in New York.","Do you know where I can get hold of a good plumber?"],"opposite":"","synonyms":""},{"def":"to find something that you want or need","examples":["I need to get hold of Tom's address.","It's almost impossible to get hold of tickets for the final.","The police do not know how the boy got hold of the knife.","How did the press get hold of the story?"],"opposite":"","synonyms":""},{"def":"to learn or understand something","examples":[],"opposite":"","synonyms":""},{"def":"to understand something in the wrong way","examples":[],"opposite":"","synonyms":""},{"def":"with no rules or limits on what somebody is allowed to do","examples":["There will be no holds barred in his interview with the president this evening."],"opposite":"","synonyms":""},{"def":"delayed until a later time or date","examples":["She put her career on hold to have a baby.","The project is on hold until more money is available.","The department has placed its plans on hold pending the results of the elections."],"opposite":"","synonyms":""},{"def":"if a person on the phone is put on hold, they have to wait until the person they want to talk to becomes free or has found out the information that is needed","examples":["(British English) I’ll just pop you on hold."],"opposite":"","synonyms":""},{"def":"to begin to have complete control over somebody/something; to become very strong","examples":["Panic took hold of him and he couldn't move.","They got out of the house just before the flames took hold.","It is best to treat the disease early before it takes a hold."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"catch, get, grab, take, etc. (a) hold of somebody/something","def":"to have or take somebody/something in your hands","examples":["He caught hold of her wrists so she couldn't get away.","Lee got hold of the dog by its collar.","Quick, grab a hold of that rope.","Gently, she took hold of the door handle and turned it.","Take hold of the handle and give it a hard pull.","She grabbed hold of a plate and smashed it."]},{"idiom":"get hold of somebody","def":"to contact or find somebody","examples":["Where have you been? I've been trying to get hold of you all day.","Eventually, we got hold of Dan in New York.","Do you know where I can get hold of a good plumber?"]},{"idiom":"get hold of something","def":"to find something that you want or need","examples":["I need to get hold of Tom's address.","It's almost impossible to get hold of tickets for the final.","The police do not know how the boy got hold of the knife.","How did the press get hold of the story?"]},{"idiom":"get (hold of) the wrong end of the stick","def":"to understand something in the wrong way","examples":[]},{"idiom":"no holds barred","def":"with no rules or limits on what somebody is allowed to do","examples":["There will be no holds barred in his interview with the president this evening."]},{"idiom":"on hold","def":"delayed until a later time or date","examples":["She put her career on hold to have a baby.","The project is on hold until more money is available.","The department has placed its plans on hold pending the results of the elections.","(British English) I’ll just pop you on hold."]},{"idiom":"take (a) hold","def":"to begin to have complete control over somebody/something; to become very strong","examples":["Panic took hold of him and he couldn't move.","They got out of the house just before the flames took hold.","It is best to treat the disease early before it takes a hold."]}],"phrasal":[],"related":[]}]