[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/hol/holid/holiday__us_1.mp3","phonsUS":"/ˈhɑːlədeɪ/","level":"A1","meanings":[{"def":"a period of time when you are not at work or school","examples":["the school/summer/Christmas holidays","She spent her holiday decorating the flat.","on holiday I'm afraid Mr Walsh is away on holiday this week.","The package includes 20 days' paid holiday a year.","holiday pay","a holiday job (= done by students during the school holidays)","I have three weeks' holiday a year.","I'm just trying to spread a little holiday cheer.","I'm taking the rest of my holiday in October.","It can be difficult to keep children occupied during the long summer holidays.","My aunt's coming to stay in the holidays.","She had a holiday job as a gardener when she was a student.","The centre is now closed for the Christmas holidays.","The roads will be busy on Monday as it's a holiday weekend.","You are entitled to 24 days' paid holiday per year.","How do you usually spend your holiday?","How many days' holiday do you get a year?","It's the school holidays at the moment.","My assistant is on holiday this week.","She doesn't get any paid holiday.","We're going away over the Christmas holidays.","What are you going to do during the summer holidays?","You are entitled to four weeks' annual holiday.","Your holiday entitlement is 25 days a year."],"opposite":"","synonyms":""},{"def":"a period of time spent travelling or resting away from home","examples":["a camping/skiing/walking holiday","an adventure holiday","a foreign/an overseas holiday","a family holiday","a two-week holiday in the sun","to have/take a holiday","on holiday They met while on holiday in Greece.","We went on holiday together last summer.","for your holiday(s) Where are you going for your holidays this year?","a holiday cottage/home","a holiday destination/resort","I haven’t had a decent holiday for years.","Have you booked your summer holiday yet?","I got ill and had to cancel my holiday.","I learned to windsurf on an activity holiday.","I really need a holiday!","This is your chance to win the holiday of a lifetime.","We had a disastrous camping holiday.","What would be your dream holiday?","All we could afford was a week's holiday at my parents' place.","Book your winter holiday now.","Have a fantastic holiday!","Have you ever been on a camping holiday?","He's never had a holiday abroad.","They met while on holiday in Spain.","Their holiday romance turned into a lasting relationship.","If you win, we'll send you on a holiday of a lifetime!","Package holidays are generally becoming less popular.","Try us first for your best family holiday ever!","We had to cancel our holiday at the last minute.","We supply everything you will need for your adventure holiday.","We're going on a skiing holiday in Austria.","Win a dream holiday to the Bahamas.","I've never been one for holiday romances.","The recession hit the package holiday business hard.","They also have a holiday home at the seaside.","It's a popular holiday destination.","I picked up a few holiday brochures on the way home.","Let's have a look at your holiday photos.","Make sure you have holiday insurance.","More and more people are taking foreign holidays.","She works as a holiday rep.","She works for a holiday company.","The neighbours are away on holiday.","The town is now a bustling holiday resort.","Choose from over 200 great holiday destinations!","a popular seaside holiday resort","You should take out holiday insurance before you leave.","We're going on holiday to France this summer.","The pool is open throughout the holiday season.","This holiday season was the worst in 25 years for retailers.","Denmark's islands are wonderful holiday destinations for cyclists, anglers and families."],"opposite":"","synonyms":""},{"def":"a day when most people do not go to work or school, especially because of a religious or national celebration","examples":["The president's birthday was declared a national holiday.","Today is a holiday in Wales."],"opposite":"","synonyms":""},{"def":"the time from late November to early January that includes Thanksgiving, Christmas, Hanukkah and New Year","examples":["Happy Holidays!","Thanksgiving is the traditional start of the holiday season for most Americans.","I get four weeks’ holiday/​vacation a year.","He’s on holiday/​vacation this week.","I like to take my holiday/​vacation in the winter.","the summer holidays/​vacation.","The school will be closed Monday because it’s a holiday","I go back a couple of times a year to celebrate the holidays with my family.","We always spend the holidays together."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["bank holiday","civic holiday","holiday camp","Holiday Inn™","legal holiday","busman’s holiday","Holiday","package holiday","public holiday","statutory holiday","August Bank Holiday","Spring Bank Holiday","Summer Bank Holiday","holiday camps"]},{"pos":"verb","level":"","meanings":[{"def":"to spend a holiday somewhere","examples":["She was holidaying with her family in Ireland.","We often holidayed together."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]