[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/hon/hones/honest__us_1.mp3","phonsUS":"/ˈɑːnɪst/","level":"B1","meanings":[{"def":"always telling the truth, and never stealing or cheating","examples":["an honest man/woman","They were honest, hard-working people, trying to farm on their own two feet."],"opposite":"dishonest","synonyms":""},{"def":"not hiding the truth about something","examples":["honest about something Are you being completely honest about your feelings?","honest with somebody Thank you for being so honest with me.","Give me your honest opinion.","He made an honest mistake and deserves a second chance.","He gave an honest answer to a difficult question.","We need to have more open and honest discussions about mental health.","The meeting was described as ‘a frank and honest exchange of views’.","To be honest (= what I really think is), it was one of the worst books I've ever read.","I'll be honest, I really don't agree with what she did.","Let's be honest, she's only interested in Mike because of his money.","The film has won accolades for being both brutally honest and very funny.","If I am perfectly honest, I wasn't expecting much from this album.","I just want the honest truth.","Thank you for being so honest with me.","To be frank with you, I think your son has little chance of passing the exam.","You’ll have to get used to his direct manner.","He was quite open about his reasons for leaving.","She was outspoken in her criticism of the plan.","I don’t think you’re being straight with me.","She has a reputation for blunt speaking.","a(n) honest/​frank admission of guilt","I’m a very open person.","To be perfectly honest, this was the worst film I've ever seen.","The president failed to give an intellectually honest answer.","I'll be honest, I've still got a soft spot in my heart for the guy.","The manager gave an honest appraisal of the team's failings.","To be quite honest with you, I don't think he's the right person for the job.","Let's be brutally honest about this: you don't have a hope of succeeding.","I don't think you've been altogether honest with me.","My parents were always completely honest with me.","She was totally open and honest about her feelings.","Try to be honest about how you feel.","Try to give an honest answer."],"opposite":"","synonyms":"honest"},{"def":"showing an honest mind or attitude","examples":["She's got an honest face.","She seems honest enough.","an honest mistake"],"opposite":"","synonyms":""},{"def":"earned or resulting from hard work","examples":["He hasn't done an honest day's work in his life.","It's quite a struggle to make an honest living.","She claimed she was just trying to earn an honest penny."],"opposite":"","synonyms":""},{"def":"used to emphasize that you are not lying","examples":["I didn't mean it, honest!"],"opposite":"","synonyms":""},{"def":"used to emphasize that what you are saying is true","examples":["Honest to God, Mary, I'm not joking."],"opposite":"","synonyms":""},{"def":"to marry a woman after having had a sexual relationship with her, especially if she is pregnant","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"honest!","def":"used to emphasize that you are not lying","examples":["I didn't mean it, honest!"]},{"idiom":"honest to God/goodness","def":"used to emphasize that what you are saying is true","examples":["Honest to God, Mary, I'm not joking."]},{"idiom":"make an honest woman of somebody","def":"to marry a woman after having had a sexual relationship with her, especially if she is pregnant","examples":[]}],"phrasal":[],"related":["honest broker","honest-to-goodness","honest brokers","to be honest","honest to God/goodness"]}]