[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/hop/hope_/hope__us_1.mp3","phonsUS":"/həʊp/","level":"A1","meanings":[{"def":"to want something to happen and think that it is possible","examples":["All we can do now is wait and hope.","‘Do you think it will rain?’ ‘I hope not.’","‘Will you be back before dark?’ ‘I hope so, yes.’","The exam went better than I’d dared hope.","I’ll see you next week, I hope.","hope for something We are hoping for good weather on Sunday.","hope (that)… I hope (that) you’re okay.","I just hope we can find the right person.","I can only hope there has been some mistake.","I sincerely hope that you will be successful.","Detectives are hoping (that) witnesses will come forward.","Let's hope we can find a parking space.","I hope and pray that he is released quickly.","it is hoped (that)… It is hoped that over £10 000 will be raised.","hope to do something She is hoping to win the gold medal.","We hope to arrive around two.","What had he hoped to achieve?","He secretly hoped that she wouldn't be home.","I hardly dared to hope the plan would succeed.","I only hope you're right.","They hoped desperately that their missing son would come home.","I certainly hope so."],"opposite":"","synonyms":""},{"def":"to intend to do something if possible","examples":["We're hoping to address all these issues."],"opposite":"","synonyms":""},{"def":"used to emphasize that you are telling the truth or will do what you promise","examples":["I saw him do it—cross my heart."],"opposite":"","synonyms":""},{"def":"to continue to hope for something although it is very unlikely to happen","examples":["She was hoping against hope that there’d been some mistake."],"opposite":"","synonyms":""},{"def":"to hope that something will happen successfully, especially where it seems likely that it will not","examples":["I’m just going to answer all the questions I can and hope for the best."],"opposite":"","synonyms":""},{"def":"used to say that you feel very strongly that something should/should not happen","examples":["‘Nobody blames you.’ ‘I should hope not!’"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"cross my heart (and hope to die)","def":"used to emphasize that you are telling the truth or will do what you promise","examples":["I saw him do it—cross my heart."]},{"idiom":"hope against hope (that…)","def":"to continue to hope for something although it is very unlikely to happen","examples":["She was hoping against hope that there’d been some mistake."]},{"idiom":"hope for the best","def":"to hope that something will happen successfully, especially where it seems likely that it will not","examples":["I’m just going to answer all the questions I can and hope for the best."]},{"idiom":"I should hope so/not | so I should hope","def":"used to say that you feel very strongly that something should/should not happen","examples":["‘Nobody blames you.’ ‘I should hope not!’"]}],"phrasal":[],"related":["Hope","hope chest","white hope","Project HOPE","great white hope","Land of Hope and Glory","hope chests","hope this helps","some hope!","hope for the best","hope springs eternal","be beyond hope (of something)","cross my heart (and hope to die)","where there’s life (, there’s hope)","not have a hope (in hell) (of doing something)","hold out little, etc. hope (of something/that…)","not hold out any, much, etc. hope (of something/that…)"]},{"pos":"noun","level":"A2","meanings":[{"def":"a feeling of wanting and expecting a particular thing to happen; something that you wish for","examples":["Don't lose hope—we'll find her.","She told me all her hopes and dreams.","hope for somebody/something They have high hopes for their children.","Hopes for the missing men are fading.","The Mexican president expressed hope for cooperation on trade.","hope of something There are hopes of a lasting peace.","hope of doing something They have given up hope of finding any more survivors.","Don't raise your hopes too high, or you may be disappointed.","I'll do what I can, but don't get your hopes up.","in the hope of doing something I called early in the hope of catching her before she went to work.","hope that… The situation is not good but we live in hope that it will improve.","It is my sincere hope that she will find happiness at last.","in the hope that… He asked her again in the vain hope that he could persuade her to come (= it was impossible).","in hopes that… (North American English) I am writing this letter in hopes that it will be forwarded to the editor.","Her dark eyes lit with sudden hope.","Hope faded after wrecked remains of the ship were washed onto the shore.","Her hopes of going to college came to nothing.","Hope flared up inside her.","I looked at her and felt a glimmer of hope.","I haven't yet found a flat, but I live in hope.","I didn't give up hope of being released.","He searched through her belongings in the hope of finding some information.","Hope remains that survivors will be found.","She felt weak and without hope.","The use of fish oil to treat cancer has brought fresh hope to millions of sufferers.","We now have good grounds for hope.","a feeling of considerable hope","His early hopes of freedom were now gone.","Hopes are high that a resolution to the conflict can be found.","Hopes of a peaceful end to the strike are now growing.","It is important to keep alive the hope that a peace settlement might be found.","It seemed a forlorn hope that we would find a taxi.","Peace is a distant hope in this war-torn region.","Political leaders do now entertain the hope that a settlement can be found.","The latest job figures have boosted hopes for the economy.","There was still a faint hope that they would accept the offer.","These figures kill off any lingering hopes of an early economic recovery.","This announcement has raised hopes that the crisis may be coming to an end.","We're trying to keep our hopes up.","keeping alive the hope that a peace settlement might be found","the treatment gave him renewed hope","young people who are full of hope for the future","It is my fervent hope that you will be able to take this project forward.","a bitter tale of disappointed hopes","He secretly cherished hopes that George would marry his daughter.","We have high hopes for the project.","Their main hopes rest on their new striker.","the team's championship hopes","I am writing to you in the hope that you can help me obtain some information."],"opposite":"","synonyms":""},{"def":"a reason to believe that something good may happen","examples":["The future is not without hope.","He wasn't trying to give her false hope.","hope of something There is now hope of a cure.","hope of doing something Most people have no hope of remembering 81 different passwords.","hope that… There is little hope that they will be found alive.","There is still a glimmer of hope.","She saw little hope of meeting the targets.","We have every hope of completing the project this year.","damaged beyond hope of repair","Maybe we can find some hope for humanity after all.","without any real hope of success","Under such circumstances, there is little hope of success.","Is there any hope that she may recover?"],"opposite":"","synonyms":""},{"def":"a person, a thing or a situation that will help you get what you want","examples":["He turned to her in despair and said, ‘You're my last hope.’","hope of/for something The operation was Kelly's only hope of survival.","She is Britain's brightest hope for a medal.","hope for somebody/something Privatization seems to offer the best hope for the industry.","He represents our best hope for a swimming medal.","Our one hope was that the hurricane would change direction.","Her only hope lay in escape.","He had one last hope to cling to."],"opposite":"","synonyms":""},{"def":"to be in a situation where no improvement is possible","examples":[],"opposite":"","synonyms":""},{"def":"to destroy somebody’s hopes by making what they were hoping for impossible","examples":["Hopes of a peaceful settlement have been dashed.","Her hopes were cruelly dashed when her parents refused to let her go."],"opposite":"","synonyms":""},{"def":"to offer little, etc. reason for believing that something will happen","examples":["The doctors did not hold out much hope for her recovery.","I don't hold out much hope of finding a buyer."],"opposite":"","synonyms":""},{"def":"people never stop hoping","examples":[],"opposite":"","synonyms":""},{"def":"to have no chance at all","examples":["She doesn't have a hope of winning.","You don't have a hope in hell of finding a job."],"opposite":"","synonyms":""},{"def":"to rely on somebody/something completely for success or help","examples":["The company is pinning its hopes on the new project.","She did not pin much faith on their chances of success.","He pinned all his hopes on getting that job."],"opposite":"","synonyms":""},{"def":"used to say that there is no chance at all that something will happen","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be beyond hope (of something)","def":"to be in a situation where no improvement is possible","examples":[]},{"idiom":"dash somebody’s hopes","def":"to destroy somebody’s hopes by making what they were hoping for impossible","examples":["Hopes of a peaceful settlement have been dashed.","Her hopes were cruelly dashed when her parents refused to let her go."]},{"idiom":"hold out little, etc. hope (of something/that…) | not hold out any, much, etc. hope (of something/that…)","def":"to offer little, etc. reason for believing that something will happen","examples":["The doctors did not hold out much hope for her recovery.","I don't hold out much hope of finding a buyer."]},{"idiom":"hope springs eternal","def":"people never stop hoping","examples":[]},{"idiom":"not have a hope (in hell) (of doing something)","def":"to have no chance at all","examples":["She doesn't have a hope of winning.","You don't have a hope in hell of finding a job."]},{"idiom":"pin (all) your hopes on somebody/something","def":"to rely on somebody/something completely for success or help","examples":["The company is pinning its hopes on the new project.","She did not pin much faith on their chances of success.","He pinned all his hopes on getting that job."]},{"idiom":"some hope!","def":"used to say that there is no chance at all that something will happen","examples":[]}],"phrasal":[],"related":[]}]