[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/hor/horro/horror__us_1_rr.mp3","phonsUS":"/ˈhɔːrər/","level":"B1","meanings":[{"def":"a feeling of great shock or fear","examples":["The thought of being left alone filled her with horror.","in horror People watched in horror as the plane crashed to the ground.","with horror She realized with horror that somebody had broken into her house.","to somebody's horror To his horror, he realized that he couldn't escape (= it upset him very much).","horror at something He expressed his horror at the idea that he was in some way to blame.","She recoiled in horror at the sight of an enormous spider.","horror at doing something She revealed her horror at discovering the truth about her husband.","Her eyes were wide with horror.","With a look of horror, he asked if the doctor thought he had cancer.","Anna recoiled in horror as the spider approached.","He realized with absolute horror that he no longer had the money.","Imagine my horror when I discovered I'd be working for my ex-wife.","She felt horror and pity at seeing Marcus so ill.","She raised her hands in mock horror when she saw my new haircut.","The possibility of meeting him again filled me with horror.","The thought of working nights fills me with abject horror.","To his horror, he saw a dead body lying beside the road.","There was a terrible look of horror on his face."],"opposite":"","synonyms":""},{"def":"a very unpleasant or frightening experience","examples":["an account of the horrors inflicted on the detainees","The UN has been slow to condemn the horrors being perpetrated by the regime.","the horrors of something the horrors of war","They will never recover mentally from the horrors of that day.","We heard from refugees of the horrors being perpetrated in the region.","You wouldn't believe the horrors they have suffered due to famine and disease.","He had witnessed horrors committed by the enemy.","He never experienced the full horrors of trench warfare.","I used to regard public speaking as the ultimate horror."],"opposite":"","synonyms":""},{"def":"the very unpleasant nature of something, especially when it shocks or frightens you","examples":["The full horror of the accident was beginning to become clear.","In his dreams he relives the horror of the attack.","Our report will reveal the true horror of conditions in the camps.","The horror of the situation overwhelmed him completely."],"opposite":"","synonyms":""},{"def":"a strong feeling of fear or of hating something","examples":["horror of something a horror of deep water","horror of doing something Most people have a horror of speaking in public.","She had a horror of pubs.","I'm trying to overcome my horror of insects."],"opposite":"","synonyms":""},{"def":"a type of book, film, etc. that is designed to frighten people","examples":["In this section you'll find horror and science fiction.","fans of classic horror","a horror film/movie/story","the horror genre"],"opposite":"","synonyms":""},{"def":"a child who behaves badly","examples":["Her son is a little horror."],"opposite":"","synonyms":""},{"def":"used to emphasize how bad a situation is","examples":["I stood up to speak and—horror of horrors—realized I had left my notes behind."],"opposite":"","synonyms":""},{"def":"used when you pretend to be shocked by something that is not really very serious or surprising","examples":["The article reports on a celebrity who—shock horror—has gained weight!"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"horror of horrors","def":"used to emphasize how bad a situation is","examples":["I stood up to speak and—horror of horrors—realized I had left my notes behind."]},{"idiom":"shock horror","def":"used when you pretend to be shocked by something that is not really very serious or surprising","examples":["The article reports on a celebrity who—shock horror—has gained weight!"]}],"phrasal":[],"related":["horror story","horror-struck","shock-horror","Rocky Horror Picture Show","horror-stricken"]}]