[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/hos/hospi/hospital__us_2.mp3","phonsUS":"/ˈhɑːspɪtl/","level":"A1","meanings":[{"def":"a large building where people who are ill or injured are given medical treatment and care","examples":["to/into (the) hospital (British English) He had to go to/into hospital for treatment.","(North American English) He had to go to/into the hospital for treatment.","I'm going to the hospital to visit my brother.","to be admitted to/into (the) hospital","Arrangements have been made for his admission to (the) hospital.","He's been taken to (the) hospital for tests.","The injured were rushed to (the) hospital in an ambulance.","to leave (the) hospital","to be discharged/released from (the) hospital","to visit a hospital","in (the) hospital He died in hospital.","He was treated in the hospital for burns.","I spent four days in hospital.","I was in the hospital for four days.","in a hospital She works in a hospital in New York.","out of (the) hospital She came out of the hospital this morning.","at a hospital Doctors at the hospital decided to keep her in overnight.","a private/local hospital","a psychiatric/mental hospital","a children's hospital","The procedure requires a two-to-three-night hospital stay.","There is an urgent need for more hospital beds.","hospital admissions","hospital staff","a hospital ward/room","hospital treatment/care","I had to go to hospital.","She spent two weeks in hospital","I had to go to the hospital.","She spent two weeks in the hospital.","He has been readmitted to hospital.","He is in hospital recovering from a heart operation.","He was taken to hospital as a precaution.","He's had to go into hospital rather suddenly.","How long will I have to stay in hospital?","I used to work as a cleaner in a hospital.","She works at the John Radcliffe Hospital.","We went to the hospital to visit my gran.","He was admitted to hospital complaining of chest pains.","She was discharged from hospital and allowed to go home.","There is a shortage of hospital beds."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["hospital pass","Chelsea Hospital","Christ's Hospital","cottage hospital","field hospital","General Hospital","Guy's Hospital","hospital corners","hospital trust","Papworth Hospital","Rampton Hospital","teaching hospital","community hospital","Maudsley Hospital","St Thomas's Hospital","King's College Hospital","Middlesex Hospital","Royal Free Hospital","St Bartholomew's Hospital","University College Hospital"]}]