[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/hos/host_/host__us_1.mp3","phonsUS":"/həʊst/","level":"B1","meanings":[{"def":"a person who invites guests to a meal, a party, etc. or who has people staying at their house","examples":["Ian, our host, introduced us to the other guests.","Sonja stayed with an Argentine host family."],"opposite":"","synonyms":""},{"def":"a country, a city or an organization that holds and arranges a special event","examples":["the host nation/country/city","host to somebody/something The college is playing host to a group of visiting Russian scientists.","The wonderful city of Melbourne is host to this event.","The host club is to be congratulated on its organization of the tournament.","The town is playing host to a film crew."],"opposite":"","synonyms":""},{"def":"a person who introduces a television or radio show, and talks to guests","examples":["a radio/TV host","The event will be opened by television host Bill Punter."],"opposite":"","synonyms":""},{"def":"an animal or a plant on which another animal or plant lives and feeds","examples":[],"opposite":"","synonyms":""},{"def":"a large number of people or things","examples":["a host of possibilities","Lavender oil can relieve a whole host of ailments."],"opposite":"","synonyms":""},{"def":"the main computer in a network that controls or supplies information to other computers that are connected to it","examples":["transferring files from the host to your local computer"],"opposite":"","synonyms":""},{"def":"the bread that is used in the Christian service of communion, after it has been blessed","examples":[],"opposite":"","synonyms":""},{"def":"to be a place where a particular plant, animal or feature is found","examples":["Australia is host to some of the world's most dangerous animals.","The acre of garden is host to a splendid bank of rhododendrons.","The park is host to a beautiful ornamental lake."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be/play host to something","def":"to be a place where a particular plant, animal or feature is found","examples":["Australia is host to some of the world's most dangerous animals.","The acre of garden is host to a splendid bank of rhododendrons.","The park is host to a beautiful ornamental lake."]}],"phrasal":[],"related":[]},{"pos":"verb","level":"B2","meanings":[{"def":"to organize an event to which others are invited and make all the arrangements for them","examples":["to host an event/a conference/a meeting","South Africa hosted the World Cup finals.","Birmingham is hosting a three-day conference on drugs.","The Arts Centre is hosting a folk festival this summer.","The country is very keen to host the Winter Olympics in six years' time.","The tournament is to be jointly hosted by India, Pakistan and Sri Lanka.","the city's bid to host the Olympic Games in the year 2008"],"opposite":"","synonyms":""},{"def":"to introduce a television or radio programme, a show, etc.","examples":["Charlie Rose will host tonight's show."],"opposite":"","synonyms":""},{"def":"to organize a party that you have invited guests to","examples":["to host a dinner","The President hosted a banquet in her honour.","Whose turn is it to host?"],"opposite":"","synonyms":""},{"def":"to store a website on a computer connected to the internet, usually in return for payment","examples":["a company that builds and hosts e-commerce sites"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]