[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/hot/hotel/hotel__us_2.mp3","phonsUS":"/həʊˈtel/","level":"A1","meanings":[{"def":"a building where people stay, usually for a short time, paying for their rooms and meals","examples":["a two-star/five-star, etc. hotel","a luxury/boutique hotel","a new resort hotel and conference centre","at/in a hotel We stayed in a friendly family-run hotel.","hotel rooms/guests","online hotel booking sites","The hotel features a beautiful dining room overlooking the lake.","The hotel is fully air-conditioned.","The hotel is situated in the heart of the city.","The hotel offers excellent facilities.","We checked into the hotel, then went for a walk along the beachfront.","We met at the hotel.","We're staying at a cheap hotel near the station.","We're staying in a two-star hotel in the centre of the city.","a family hotel with a playground for small children","a small country hotel","all the style and comfort that only the best hotels can provide","homeless families living in bed and breakfast hotels","He owns a big hotel chain.","I took a taxi back to my hotel.","I'll collect my bags and check out of the hotel.","It's a family-run hotel with a relaxed atmosphere.","It's a five-star hotel.","It's the poshest hotel I've ever stayed in.","Most of the jobs are in the hotel and catering industry.","She booked into a hotel near the conference centre.","The hotel is about five miles from here.","The trip includes two nights in a luxury hotel.","There is a shortage of hotel accommodation in the city.","This is a delightful hotel within easy reach of all amenities.","We arranged to meet in the foyer of the hotel.","We ended up in a seedy hotel next to the station.","We had dinner in the restaurant of a large hotel.","You can make phone calls from your hotel room."],"opposite":"","synonyms":""},{"def":"a pub","examples":[],"opposite":"","synonyms":""},{"def":"a restaurant","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["apartment hotel","Savoy Hotel","Hilton Hotel","Ritz Hotel"]}]