[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/hou/housi/housing__us_3.mp3","phonsUS":"/ˈhaʊzɪŋ/","level":"B2","meanings":[{"def":"houses, flats, etc. that people live in, especially when referring to their type, price or condition","examples":["rental/student housing","temporary/permanent housing","low-cost/cheap housing","There is an urgent need to build more affordable housing.","We must find a way to solve the city's housing crisis.","The study linked poor housing conditions to a variety of health problems.","How severe is the housing shortage in Hong Kong?","the housing market (= the activity of buying and selling houses, etc.)","The low interest rate has triggered a housing bubble (= a period of time when house prices increase quickly, but which is unlikely to last long).","Many health problems are made worse by inadequate housing.","Many new housing developments had sprung up around the city.","She receives a substantial housing allowance on top of her salary.","The aim of the scheme was to provide good low-cost housing for workers.","The area is dominated by terraced housing.","They provide good low-cost housing for workers.","Too many families are still living in substandard housing.","What happens when the housing boom finally slows?","The housing market has had a good year."],"opposite":"","synonyms":""},{"def":"the job of providing houses, flats, etc. for people to live in","examples":["Tenants may only keep pets with the written consent of the housing department.","They discussed how the council's housing policy could be changed to deal with the growing housing crisis."],"opposite":"","synonyms":""},{"def":"a hard cover that protects part of a machine","examples":["a car’s rear axle housing"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["housing benefit","housing estate","housing project","housing scheme","public housing","sheltered housing","social housing","affordable housing","housing association","Federal Housing Administration","Department of Housing and Urban Development","Ministry of Housing, Communities and Local Government","housing estates","housing projects","housing associations","housing development"]}]