[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/hum/humbl/humble__us_1.mp3","phonsUS":"/ˈhʌmbl/","level":"C1","meanings":[{"def":"showing you do not think that you are as important as other people","examples":["Be humble enough to learn from your mistakes.","my humble tribute to this great man","She was very humble and apologetic.","an amazing man who makes you feel quite humble","She felt humble and grateful but couldn't put her feelings into words.","She's a loving, kind and humble woman."],"opposite":"","synonyms":""},{"def":"used to suggest that you are not as important as other people, but in a way that is not sincere or not very serious","examples":["In my humble opinion, you were in the wrong.","My humble apologies. I did not understand."],"opposite":"","synonyms":""},{"def":"having a low rank or social position","examples":["a man of humble birth/origins","a humble occupation","the daughter of a humble shopkeeper","She was the daughter of a humble carpenter and a washerwoman.","He was a man who had risen from humble origins through hard work and good fortune.","He is intensely proud of his humble background.","He had worked his way up from humble beginnings.","a man of fairly humble origins"],"opposite":"","synonyms":""},{"def":"not large or special in any way","examples":["a humble farmhouse","The company has worked its way up from humble beginnings to become the market leader.","Most of us have never considered the humble potato as a precious gift from nature."],"opposite":"","synonyms":""},{"def":"to say and show that you are sorry for a mistake that you made","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"eat humble pie","def":"to say and show that you are sorry for a mistake that you made","examples":[]}],"phrasal":[],"related":["eat humble pie","in my humble opinion"]},{"pos":"verb","level":"","meanings":[{"def":"to make somebody feel that they are not as good or important as they thought they were","examples":["He was humbled by her generosity.","a humbling experience"],"opposite":"","synonyms":""},{"def":"to easily defeat an opponent, especially a strong or powerful one","examples":["be humbled The world champion was humbled last night in three rounds."],"opposite":"","synonyms":""},{"def":"to show that you are not too proud to ask for something, admit that you have been wrong, etc.","examples":["He refused to humble himself and ask her forgiveness."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]