[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/h/hun/hunt_/hunt__us_1.mp3","phonsUS":"/hʌnt/","level":"B1","meanings":[{"def":"to go after wild animals in order to catch or kill them for food, sport or to make money","examples":["Lions sometimes hunt alone.","hunt something Whales are still being hunted and killed in the Arctic.","hunt for something Cavemen had to hunt for their food.","They watched the bald eagles hunting for fish.","hunt something for something The animals are hunted for their fur.","Turtles are illegally hunted for their eggs, meat and shells.","Porpoises were still being actively hunted in Greenland.","The animals come out at night to hunt for mice and other small animals.","The whales were heavily hunted by British commercial whalers.","It is now illegal to hunt otters."],"opposite":"","synonyms":""},{"def":"to look for something that is difficult to find","examples":["hunt for something She is still hunting for a new job.","+ adv./prep. I've hunted everywhere but I can't find it.","After spending half an hour hunting through the boxes, he had still found nothing.","desperately hunting for a new job","I spent an hour hunting for all the documents.","She was hunting through her bag for her keys."],"opposite":"","synonyms":""},{"def":"to look for somebody in order to catch them or harm them","examples":["hunt somebody Police are hunting an escaped criminal.","Two police forces are still hunting the killer of three-year-old Lucy Black.","hunt for somebody Detectives are hunting for thieves who broke into a warehouse yesterday."],"opposite":"","synonyms":""},{"def":"(in the UK) to go after and kill foxes as a sport, riding horses and using dogs. Fox hunting with dogs has been illegal in England and Wales since 2005, but people still ride out with dogs following a scent trail, without an actual fox.","examples":["They hunt when they stay with friends in Ireland."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["hunt down","hunt out"],"related":["fox hunt","hunt out","job-hunt","hunt down","Hunt","witch-hunt","treasure hunt","hunt-and-peck","scavenger hunt","Easter egg hunt","National Hunt","have a dog in the race/hunt","hunt somebody","hunt something","be in the hunt"]},{"pos":"noun","level":"B2","meanings":[{"def":"an act of looking for somebody/something that is difficult to find","examples":["The hunt is on for a suitable candidate.","hunt for somebody/something Hundreds have joined a police hunt for the missing teenager.","on the hunt for somebody/something They have been on the hunt for a new chief executive since July.","brides-to-be on the hunt for the perfect wedding dress","a murder hunt (= to find the person who has killed somebody)","Detectives leading the hunt for the killer believe he may be in hiding.","Police are continuing their hunt for the arsonist.","Police forces in five counties are now involved in the murder hunt.","Police launched a nationwide hunt for the woman, amid fears for her safety.","The hunt for survivors has now been called off.","The hunt is on for potential employees with experience of electronic publishing.","The mountain rescue team is stepping up its hunt for the missing climbers."],"opposite":"","synonyms":""},{"def":"an act of going after wild animals to kill or capture them","examples":["a tiger/seal hunt"],"opposite":"","synonyms":""},{"def":"(in the UK) an event at which people ride horses and hunt foxes with dogs as a sport, illegal in Britain since 2005","examples":["There was always a hunt on Boxing Day.","a hunt meeting","clashes between hunt supporters and hunt saboteurs","She had never taken part in a fox hunt before.","Hunt followers deny the sport is cruel."],"opposite":"","synonyms":""},{"def":"(in the UK) a group of people who regularly hunt foxes as a sport. Since 2005, instead of a fox, they follow a specially laid scent trail.","examples":["There were several different hunts in the area."],"opposite":"","synonyms":""},{"def":"to have a chance of winning","examples":["The team are back in the hunt for the league title.","The Republican candidate is still in the hunt."],"opposite":"","synonyms":""},{"def":"to be involved in a situation so that you will gain or lose according to the result","examples":["I really don't have a dog in this fight, so I can just enjoy the game.","The employees have a dog in the hunt, so their views should be listened to."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be in the hunt","def":"to have a chance of winning","examples":["The team are back in the hunt for the league title.","The Republican candidate is still in the hunt."]},{"idiom":"have a dog in the fight","def":"to be involved in a situation so that you will gain or lose according to the result","examples":["I really don't have a dog in this fight, so I can just enjoy the game.","The employees have a dog in the hunt, so their views should be listened to."]}],"phrasal":[],"related":[]}]