[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/ide/ideal/ideal__us_2.mp3","phonsUS":"/aɪˈdiːəl/","level":"A2","meanings":[{"def":"perfect; most suitable","examples":["an ideal location/place","ideal for somebody/something This beach is ideal for children.","She's the ideal candidate for the job.","The trip to Paris will be an ideal opportunity to practise my French.","The prime minister admitted the current situation was ‘not ideal’ (= was bad).","It was not the ideal solution to the problem.","Harvesting is being done in less than ideal conditions.","The hotel's size makes it ideal for large conferences.","The houses are absolutely ideal for families with young children.","As a solution to the problem it was far from ideal.","His apartment would be an ideal place to stay.","This job would be absolutely ideal for someone with an interest in local history."],"opposite":"","synonyms":""},{"def":"existing only in your imagination or as an idea; not likely to be real","examples":["the search for ideal love"],"opposite":"","synonyms":""},{"def":"used to say that something is what you would like to happen or what should happen, but you know it cannot","examples":["In an ideal world we would be recycling and reusing everything.","In a perfect world no one would need to pay for healthcare.","In an ideal world, I'd like to work just three days a week."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in an ideal/a perfect world","def":"used to say that something is what you would like to happen or what should happen, but you know it cannot","examples":["In an ideal world we would be recycling and reusing everything.","In a perfect world no one would need to pay for healthcare.","In an ideal world, I'd like to work just three days a week."]}],"phrasal":[],"related":["Ideal Home","Ideal Home Show"]},{"pos":"noun","level":"B2","meanings":[{"def":"an idea or standard that seems perfect, and worth trying to achieve or obtain","examples":["He was accused of betraying his political ideals.","She found it hard to live up to his high ideals.","advancing the ideals of freedom and democracy","A journalist should always live up to the ideals of truth, decency and justice.","Platonic ideals of beauty","Sam was a real leader who had high moral ideals.","They still clung to the old ideals.","This is not an unattainable ideal.","We obviously share the same ideals.","romantic ideals of motherhood","the democratic ideals embodied in the charter","Democratic ideals include the principle that everyone should have a say in how they are governed.","Is true love an unattainable ideal?"],"opposite":"","synonyms":""},{"def":"a person or thing that you think is perfect","examples":["It's my ideal of what a family home should be.","This agreement falls far short of the ideal."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]