[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/ide/ident/identify__us_3.mp3","phonsUS":"/aɪˈdentɪfaɪ/","level":"A2","meanings":[{"def":"to recognize somebody/something and be able to say who or what they are","examples":["identify somebody/something She was able to identify her attacker.","Passengers were asked to identify their own suitcases before they were put on the plane.","identify yourself Many of those arrested refused to identify themselves (= would not say who they were).","identify somebody/something as somebody/something The bodies were identified as those of two suspected drug dealers.","identify somebody/something by something two species of waterbirds that can be identified by their distinctive beaks","All three structures dated to the third century and were tentatively identified as shrines.","Did you identify all the pictures correctly?","I could identify him easily if I saw him again.","Jaime successfully identified all 45 different species.","Most students failed to identify the quotation.","Ms. Wilson was publicly identified as a CIA operative.","The newspaper declined to identify the source of the allegations."],"opposite":"","synonyms":""},{"def":"to find or discover somebody/something","examples":["identify somebody/something First of all we must identify the problem areas.","Scientists have identified the gene responsible for the disease.","As yet they have not identified a buyer for the company.","to identify a need/factor/source/cause","identify what, which, etc… They are trying to identify what is wrong with the present system.","Business trends are rapidly identified by this system.","He has stepped up efforts to identify and acquire other small companies.","The new test will enable us to identify more accurately patients who are most at risk.","The researchers hope to identify ways to improve the treatment.","a computer program to automatically identify any query ending with a question mark","We have not yet clearly identified the source of the pollution.","Scientists have identified a link between diet and cancer."],"opposite":"","synonyms":""},{"def":"to make it possible to recognize who or what somebody/something is","examples":["In many cases, the clothes people wear identify them as belonging to a particular social class.","a serial number that uniquely identifies the disk"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["identify as","be identified with","identify with","identify yourself with"],"related":["identify as","identify with","self-identify","identify yourself with","identify as something","identify with somebody","identify somebody with something","identify something with something","identify yourself with somebody/something"]}]