[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/ide/ident/identity__us_1.mp3","phonsUS":"/aɪˈdentəti/","level":"B1","meanings":[{"def":"who or what somebody/something is","examples":["The police are trying to discover the identity of the killer.","to establish/reveal/confirm the identity of somebody/something","Their names have been changed for the purposes of this article to protect their identities.","Their identities were kept secret.","Do you have any proof of identity?","The thief used a false identity.","He falls in love with her but can't reveal his true identity.","Each object in the collection has a unique identity number.","She went through an identity crisis in her teens (= was not sure of who she was or of her place in society).","He changed his identity on his release from prison.","He felt that having a job gave him an identity.","He had not resolved his identity issue.","He refused to reveal the identity of his client.","He was discovered living under an assumed identity in South America.","Her voice was disguised to conceal her identity.","His identity was stolen and used to purchase goods from a catalogue.","It is important to know the identity and nature of the enemy.","Shanghai itself has multiple identities.","Someone in the administration leaked the identity of an undercover CIA agent.","The system will verify the identity of incoming visitors.","They didn't reveal her secret identity to her family members."],"opposite":"","synonyms":""},{"def":"the characteristics, feelings or beliefs that make people different from others","examples":["national/cultural/personal identity","ethnic/racial identity","The region's sense of identity remained strong.","a plan to strengthen the corporate identity of the company","identity as somebody/something Scotland has never lost its identity as a separate nation.","She was searching for a clearer conception of her identity as a writer.","His search for his cultural identity took him to where his parents were born.","Many minority groups are struggling to maintain their cultural identity.","The company forged its own identity by producing specialist vehicles.","These populations have managed to maintain distinct identities.","They are still struggling to establish their identity as a political party.","the ability to maintain a strong brand identity","The people have a strong sense of national identity.","the way in which African American writers have asserted their identity","They share a collective identity, united by an independent spirit.","an ethnic identity based on their common national ancestry"],"opposite":"","synonyms":""},{"def":"the state or feeling of being very similar to and able to understand somebody/something","examples":["The two companies started working together as a result of a clear identity of interests.","identity with somebody/something He feels a strong sense of identity with his fellow men.","identity between A and B There's a close identity between fans and their team."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["identity card","self-identity","gender identity","identity parade","identity politics","identity theft","identity thief","mistaken identity","identity cards","identity thefts","identity fraud","identity parades"]}]