[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/ide/ident/identification__us_1.mp3","phonsUS":"/aɪˌdentɪfɪˈkeɪʃn/","level":"C1","meanings":[{"def":"the process of showing, proving or recognizing who or what somebody/something is","examples":["The identification of the crash victims was a long and difficult task.","Accurate identification of these birds is difficult.","Each product has a number for easy identification.","The vehicle's identification number is stamped on the engine.","Biometric identification methods include fingerprints and facial recognition scanners.","Only one witness could make a positive identification.","The hospital had mixed up the patients' identification tags.","Eyewitness identification is not as reliable as we tend to believe.","My only means of identification was my cheque book.","Red and black wires are used to enable identification of specific circuits.","There is virtually no risk of mistaken identification in cases of date rape.","having their picture taken for identification purposes"],"opposite":"","synonyms":""},{"def":"the process of recognizing that something exists, or is important","examples":["The early identification of children with special educational needs is very important."],"opposite":"","synonyms":""},{"def":"official papers or a document that can prove who you are","examples":["Can I see some identification, please?","To vote, Florida law requires a photo identification with a signature.","Always carry some identification.","Do you have any identification?","One passenger couldn't provide identification.","The police checked their identification."],"opposite":"","synonyms":""},{"def":"a strong feeling of sympathy, understanding or support for somebody/something","examples":["her emotional identification with the play’s heroine","their increasing identification with the struggle for independence"],"opposite":"","synonyms":""},{"def":"the process of making a close connection between one person or thing and another","examples":["the voters’ identification of the Democrats with high taxes"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["identification card","self-identification","identification parade","identification parades"]}]