[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/ill/illus/illustration__us_2.mp3","phonsUS":"/ˌɪləˈstreɪʃn/","level":"B2","meanings":[{"def":"a drawing or picture in a book, magazine, for decoration or to explain something","examples":["50 full-colour illustrations","detailed illustrations of animals, birds and plants","illustration by somebody a volume of Chaucer with illustrations by Edward Burne-Jones","illustration for something He produced illustrations for children's books.","His illustrations have appeared in the pages of numerous publications.","The kite is assembled as shown in the illustration.","a wonderful book with full-page illustrations","the illustrations accompanying the text","the new Inca map, with a detailed illustration of ancient Machu Picchu","The illustration on page 10 shows the layout of the area."],"opposite":"","synonyms":""},{"def":"the process of illustrating something","examples":["the art of book illustration"],"opposite":"","synonyms":""},{"def":"a story, an event or an example that clearly shows the truth about something","examples":["The statistics are a clear illustration of the point I am trying to make.","as an illustration I use this case as an illustration.","Let me, by way of illustration, quote from one of her poems.","Can you give me an example of what you mean?","In some cases people have had to wait several weeks for an appointment.","The report highlights a number of instances of injustice.","The aquarium has some interesting specimens of unusual tropical fish.","The statistics are a clear illustration of the point I am trying to make.","Chicago serves as an illustration of the problems faced by such cities.","These figures are for illustration purposes only.","These events are a graphic illustration of the fact that their promises cannot be trusted.","It was a textbook illustration of the way the UN works.","Explain the policy of détente and provide some illustrations of how it worked in practice.","As an illustration of this point, I'm going to tell you a true story."],"opposite":"","synonyms":"example"}],"idioms":[],"phrasal":[],"related":[]}]