[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/ima/imagi/imagine__us_1.mp3","phonsUS":"/ɪˈmædʒɪn/","level":"A1","meanings":[{"def":"to form a picture in your mind of what something might be like","examples":["imagine something The house was just as she had imagined it.","Imagine my surprise when I opened the door to find him standing there.","I can't imagine life without the children now.","It's hard to imagine a more cynical political strategy.","imagine (that)… Close your eyes and imagine (that) you are in a forest.","imagine what, how, etc… Can you imagine what it must be like to lose your job after 20 years?","imagine doing something Imagine earning that much money!","She imagined walking into the office and handing in her resignation.","imagine somebody/something doing something I can just imagine him saying that!","imagine somebody/something to be/do something I had imagined her to be older than that.","imagine somebody/something/yourself (as) something He loved to imagine himself as the hero.","I find it difficult to imagine her a grandmother.","I can imagine him really angry.","(informal) ‘He was furious.’ ‘I can imagine.’","The house was just as she had imagined it.","We couldn’t think where you’d gone.","Just think—this time tomorrow we’ll be lying on a beach.","I can’t see her changing her mind.","His colleagues see him as a future director.","I don’t envisage working with him again.","They envision an equal society, free from poverty and disease.","Can you imagine a world free from the drudgery of work?","I can well imagine the atmosphere at home at this moment.","If I'm late home my mother always imagines the worst.","I can't even begin to imagine the horrors that they have been through.","I could clearly imagine the scene in the office.","It is difficult to imagine a world without money.","She could just imagine her mother's look of horror.","I had fondly imagined that riding a mule would be easy.","I'd like to imagine that she's safe and happy somewhere.","She had imagined that she'd get a warm welcome.","I started to imagine what he might say.","He hardly dared to imagine what else was going to be divulged.","Let us imagine what really might have happened.","She imagined walking onto the stage to huge applause.","I could hardly imagine living in such a remote and desolate spot.","I always imagined him following in his father's footsteps.","I can't actually imagine her falling for that trick.","The sight was disturbing as you can quite imagine.","There's more at stake here than you can possibly imagine."],"opposite":"","synonyms":"imagine"},{"def":"to believe something that is not true","examples":["imagine (that)… He’s always imagining (that) we’re talking about him behind his back.","imagine something There's nobody there. You're imagining things.","He was always keen to avenge insults, real or imagined.","She knew she was simply imagining things."],"opposite":"","synonyms":""},{"def":"to think that something is probably true","examples":["I think it's likely that these people know each other.","I imagine she's his wife.","They might/​may/​could be related.","I would think/​imagine/​guess they've been waiting for some time.","I guess that the car has broken down.","I think this has probably happened before.","It looks to me as though the woman is very angry.","Perhaps/​Probably/​Possibly/​It may be that/​Maybe there has been an accident.","‘Can we still buy tickets for the concert?’ ‘I imagine so.’","imagine (that)… I don’t imagine (that) they’ll refuse.","I don't imagine he'll get here now, do you?","You don't seriously imagine I'll agree to that?","I could almost imagine you were jealous.","You shouldn't imagine that he's anything but a ruthless man."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]