[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/imp/impac/impact__us_1.mp3","phonsUS":"/ˈɪmpækt/","level":"B1","meanings":[{"def":"the powerful effect that something has on somebody/something","examples":["a positive/a negative/an adverse impact","a significant/major/huge impact","to have/make an impact","impact of something to reduce/minimize the impact of something","the environmental impact of tourism","impact of doing something the economic impact of leaving the European Union","impact on somebody/something Her speech made a profound impact on everyone.","She has had a lasting impact on the lives of many of her students.","The project's impact on the environment should be minimal.","impact of something on somebody/something The report assesses the impact of the disease on mortality and population growth.","impact from something It is too early to notice any impact from the recent changes to the rules.","an environmental impact assessment","a victim impact statement","Businesses are beginning to feel the full impact of the recession.","social support to cushion the impact of unemployment","It is difficult to judge the potential impact of the changes on employment patterns.","Architecturally, these churches reflected the impact of the Renaissance.","Listening to the speech through an interpreter lessened its impact somewhat.","The film lacks the visceral impact of her previous work.","The initial impact of the reforms will be felt most keenly in primary schools.","The severest human impact on the dolphins has been the loss of habitat.","We are trying to minimize the impact of price rises on our customers.","We'll show you how to dress for maximum impact at the all-important audition.","You certainly made a big impact on Carter.","a high-impact message aimed at changing people's attitudes"],"opposite":"","synonyms":""},{"def":"the act of one object hitting another; the force with which this happens","examples":["craters made by meteorite impacts","The impact of the blow knocked Jack off balance.","impact on something A well-designed sports shoe should absorb the impact on the 28 bones in each foot.","on impact The bomb explodes on impact (= when it hits something).","The car is fitted with side impact bars (= to protect it from a blow from the side).","Air bags are designed to soften the impact for crash victims.","Impact occurred seconds after the pilot radioed for help.","The front coach of the train took the full impact of the crash."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["low-impact"]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/imp/impac/impact__us_2.mp3","phonsUS":"/ɪmˈpækt/","level":"B1","meanings":[{"def":"to have an effect on somebody/something","examples":["impact on/upon somebody/something Her father's death impacted greatly on her childhood years.","These restrictions will impact on all farmers in Ireland.","impact somebody/something environmental factors that may negatively impact children's development","The company's performance was impacted by the high value of the pound.","The border dispute could impact on the work of aid agencies.","The cuts will inevitably impact on service delivery.","They need to take into consideration that their actions directly impact other people."],"opposite":"","synonyms":""},{"def":"to hit something with great force","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]