[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/imp/impos/impossible__us_1.mp3","phonsUS":"/ɪmˈpɑːsəbl/","level":"A2","meanings":[{"def":"that cannot exist or be done; not possible","examples":["almost/virtually/nearly impossible","Only a year ago and this would have seemed impossible.","Getting any kind of decent job was proving impossible.","an impossible dream/goal","impossible for somebody Going downstairs would be impossible for him with his sprained ankle.","impossible to do The outcome is impossible to predict.","It's impossible to prove.","Cheap rental accommodation was impossible to find.","it is impossible to do something It's impossible to say which is the best.","It is impossible to tell whether it will actually work.","I find it impossible to lie to her.","it is impossible for somebody to do something It's impossible for me to be there before eight.","I'm really sorry. It's just impossible.","It's probably impossible to know whether such conversations took place.","Cooking for forty would be frankly impossible without my new assistant.","The high cost of childcare made returning to work economically impossible.","Darkness made it impossible to continue.","I found his offer impossible to resist.","It's impossible for me to say.","They are setting a standard that it is humanly impossible to meet.","It was well-nigh impossible for him to convince her that he was right."],"opposite":"possible","synonyms":""},{"def":"very difficult to deal with","examples":["I've been placed in an impossible position.","Honestly, you're impossible at times!","I find her impossible.","The situation is just impossible for us."],"opposite":"","synonyms":""},{"def":"a thing that is or seems impossible","examples":["to attempt the impossible"],"opposite":"","synonyms":""},{"def":"a difficult or impossible task","examples":["Many regard this task as mission impossible."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"mission impossible","def":"a difficult or impossible task","examples":["Many regard this task as mission impossible."]}],"phrasal":[],"related":["mission impossible","missions impossible"]}]