[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/imp/impor/important__us_1.mp3","phonsUS":"/ɪmˈpɔːrtnt/","level":"A1","meanings":[{"def":"having a great effect on people or things; of great value","examples":["an important issue/question/point/factor","We have an important decision to make.","Money played an important role in his life.","Listening is an important part of the job.","one of the most important collections of American art","The important thing is to keep trying.","important to somebody/something The centre is extremely important to many local people.","Banks are vitally important to the economy.","important for somebody/something Many chemicals are important for our health.","it is important to do something It is important to follow the manufacturer's instructions.","It is important to note that total government funding has increased.","It's important to remember that our figures are averages only.","it is important that… It is important that he attend every day.","(British English) It is important that he should attend every day.","it is important to somebody that… It's very important to me that you be there.","(British English) It's very important to me that you should be there.","it is important for somebody/something to do something It is important for him to attend every day.","This case emphasizes/highlights the importance of honest communication between managers and employees.","Effective communication skills are essential/crucial/vital.","It should be noted that this study considers only verbal communication. Non-verbal communication is not dealt with here.","It is important to remember that/An important point to remember is that non-verbal communication plays a key role in getting your message across.","Communication is not only about the words you use but also your body language and, especially/above all, the effectiveness with which you listen.","I would like to draw attention to the role of listening in effective communication.","Choose your words carefully: in particular, avoid confusing and ambiguous language.","Finally, and perhaps most importantly, you must learn to listen as well as to speak.","I have an important announcement to make.","Several factors make this painting uniquely important.","historically important buildings","Many disabled people do now hold important jobs in industry.","Someone left a message for you—it sounded important.","These ideas are considered enormously important.","These two factors are equally important.","This is most important: you must deliver the letter to Johnson himself.","Spending time with my children is important to me.","It's important for you to understand this.","The work of the intelligence services was crucially important to victory in the war.","The media are important in forming public perceptions."],"opposite":"","synonyms":""},{"def":"having great influence or authority","examples":["an important member of the team","He likes to feel important."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["all-important","self-important"]}]