[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/imp/impor/import__us_1.mp3","phonsUS":"/ˈɪmpɔːrt/","level":"B1","meanings":[{"def":"a product or service that is brought into one country from another","examples":["import from… food imports from abroad","import into/to… cheap imports into the United States","America has cut its oil imports from the Middle East by 73%.","Imports were valued at £516 million last month.","Special duties were imposed on imports into the republic.","The value of annual imports rose rapidly."],"opposite":"export","synonyms":""},{"def":"the act of bringing a product or service into one country from another","examples":["The report calls for a ban on the import of hazardous waste.","imports of oil","import duties/tariffs","import controls/restrictions/quotas","an import licence","A restricted import quota was set for meat products.","the UK's net imports of food","Most of their oil revenues are used to finance imports of consumer and capital goods."],"opposite":"export","synonyms":""},{"def":"importance","examples":["matters of great import"],"opposite":"","synonyms":""},{"def":"the meaning of something, especially when it is not immediately clear","examples":["It is difficult to understand the full import of this statement."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/imp/impor/import__us_2_rr.mp3","phonsUS":"/ɪmˈpɔːrt/","level":"B1","meanings":[{"def":"to bring a product, a service, an idea, etc. into one country from another","examples":["import something The country has to import most of its raw materials.","import something from… customs imported from the West","import something into/to… the cost of importing petroleum products into the country","import something (from…) (into/to…) goods imported from Japan into the US","The store's croissants are imported directly from France.","These dogs are illegally imported into the country."],"opposite":"","synonyms":""},{"def":"to get data from another program, changing its form so that the program you are using can read it","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]