[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/imp/impre/impression__us_1.mp3","phonsUS":"/ɪmˈpreʃn/","level":"B1","meanings":[{"def":"an idea, a feeling or an opinion that you get about somebody/something, or that somebody/something gives you","examples":["My first impression of him was favourable.","She gives the impression of being very busy.","impression that… I did not get the impression that they were unhappy about the situation.","I had the impression that it was all done in a hurry.","My impression is that there are still a lot of problems.","Try and smile. You don't want to give people the wrong impression (= that you are not friendly).","He does not want to give a false impression of progress.","If you want to create the right impression, I suggest you wear a suit.","Her performance did little to change my impression of her.","I got the distinct impression that you disliked her.","I had the wrong impression about him.","I must correct a false impression that I gave you just now.","It was difficult to avoid the impression that he was assisting them for selfish reasons.","She was trying to maintain the impression that she was in control.","The book leaves you with a distorted impression of politics.","The village gives a good impression of what a medieval city would have looked like.","There is a widespread impression that schooling needs to be improved."],"opposite":"","synonyms":""},{"def":"the effect that an experience or a person has on somebody/something","examples":["You'll have to play better than that if you really want to make an impression (= to make people admire you).","impression on somebody His trip to India made a strong impression on him.","My words made no impression on her.","The whole business left a lasting impression on Margaret.","The new player failed to make an immediate impression on the team.","I don't think this argument made any impression upon the brothers.","The events left an indelible impression on all those who witnessed them.","The stillness and silence leave a deep impression on visitors."],"opposite":"","synonyms":""},{"def":"a drawing showing what a person looks like or what a place or a building will look like in the future","examples":["This is an artist's impression of the new stadium."],"opposite":"","synonyms":""},{"def":"a clever or funny copy of the way a person acts or speaks","examples":["He did an impression of Tom Hanks.","She did her Marilyn Monroe impression."],"opposite":"","synonyms":""},{"def":"an appearance that may be false","examples":["Clever lighting creates an impression of space in a room."],"opposite":"","synonyms":""},{"def":"a mark that is left when an object is pressed hard into a surface","examples":["The dentist made an impression of his teeth.","The sealing wax bore the impression of a sailing ship."],"opposite":"","synonyms":""},{"def":"all the copies of a book that are printed at one time, with few or no changes to the contents since the last time the book was printed","examples":[],"opposite":"","synonyms":""},{"def":"believing, usually wrongly, that something is true or is happening","examples":["I was under the impression that the work had already been completed.","The soldiers scattered, under the impression that it was an enemy attack.","I was under the impression that you weren't coming until tomorrow.","Do you think (that) they’ll come?","Well, I like it. What do you think?","Police believe (that) the man may be armed.","We all felt (that) we were unlucky to lose.","I reckon (that) I’m going to get that job.","I was under the impression that the work had already been completed."],"opposite":"","synonyms":"think"}],"idioms":[{"idiom":"(be) under the impression that…","def":"believing, usually wrongly, that something is true or is happening","examples":["I was under the impression that the work had already been completed.","The soldiers scattered, under the impression that it was an enemy attack.","I was under the impression that you weren't coming until tomorrow.","Do you think (that) they’ll come?","Well, I like it. What do you think?","Police believe (that) the man may be armed.","We all felt (that) we were unlucky to lose.","I reckon (that) I’m going to get that job.","I was under the impression that the work had already been completed."]}],"phrasal":[],"related":[]}]