[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/imp/impro/improvement__us_1.mp3","phonsUS":"/ɪmˈpruːvmənt/","level":"B1","meanings":[{"def":"the act of making something better; the process of something becoming better","examples":["The economy has shown significant improvement over the past 9 months.","We expect to see further improvement over the coming year.","Sales figures continue to show signs of improvement.","There were areas that needed improvement.","improvement in something There is a need for continuous improvement in performance.","I think there is room for improvement in any organization.","No improvement was found after the tenth day of treatment.","The economy has experienced steady improvement.","The improvement work to houses will create jobs.","The new assessment system could pinpoint areas for improvement within the company.","The proposed road improvement scheme involves bypassing several villages.","We have an ambitious improvement plan for the property."],"opposite":"","synonyms":""},{"def":"a change in something that makes it better; something that is better than it was before","examples":["a significant/dramatic improvement","a slight/steady improvement","improvement in something There has been a marked improvement in the quality of teaching.","The work should lead to an improvement in water quality.","The decade saw vast improvements in cardiology techniques.","improvement to something We have made some mechanical improvements to the car.","improvement on something This is a great improvement on your previous work.","improvement over something The results are certainly an improvement over last year.","We need to make further improvements.","There have been significant improvements in construction safety in recent years.","He made a steady improvement and was released within 10 days of admission.","If suggested improvements are not carried out, we have the right to suspend the insurance cover.","Several improvements were made to the design during its production run.","The club will spend £300 000 on ground improvements.","The drug produced an improvement in all but one case.","The latest figures are a slight improvement over last year's results.","The new factory brought a huge improvement in working conditions.","The players have shown a marked improvement in recent weeks.","Wholesalers reported an improvement in sales for the third quarter.","With this exercise plan you will notice an enormous improvement in your stamina.","improvements to the bus service"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["home improvement","self-improvement"]}]