[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/imp/impro/improve__us_1.mp3","phonsUS":"/ɪmˈpruːv/","level":"A1","meanings":[{"def":"to become better than before; to make something/somebody better than before","examples":["Overall the situation has improved dramatically.","Things are improving every day.","You should see your score improve significantly.","Working conditions have greatly improved.","His quality of life has improved dramatically since the operation.","The doctor says she should continue to improve (= after an illness).","I hope my French will improve when I go to France.","improve something This vital service helps to improve the quality of life for people with cancer.","measures to improve public health","This was a much improved performance by the team.","The goal was to improve the efficiency of the department.","Engineers are working to improve this technology.","improve yourself He's a guy who wants to improve himself, to be the best.","The situation has improved dramatically during the last few months.","The company needs to improve performance in all these areas.","My father's mood had noticeably improved during the afternoon.","The weather should continue to improve over the weekend.","The economy had improved markedly.","They are trying to improve the working conditions in their factories.","I need to improve my French.","You can significantly improve your chances of getting a job by compiling a good CV.","We now offer a much improved service to our customers.","Workers need to be given an incentive to improve their performance.","Bringing the issue of pay into the debate did not improve matters.","They're introducing a vastly improved public transport system.","the new and improved version of the website"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["improve on","improve upon"],"related":["improve on","improve upon","improve on something","improve upon something","on the improve"]},{"pos":"noun","level":"","meanings":[{"def":"showing signs of improvement","examples":["The good news is that the weather is on the improve."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"on the improve","def":"showing signs of improvement","examples":["The good news is that the weather is on the improve."]}],"phrasal":[],"related":[]}]