[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/inc/incid/incident__us_1.mp3","phonsUS":"/ˈɪnsɪdənt/","level":"B2","meanings":[{"def":"something that happens, especially something unusual or unpleasant","examples":["His bad behaviour was just an isolated incident.","The most recent incident occurred last January.","She couldn't have been more than five years old when the incident happened.","One particular incident sticks in my mind.","incident with somebody/something The hot-headed tennis star became involved in an incident with the umpire.","He came to regret the whole incident.","He recalled a similar incident 14 months earlier.","He was asked to leave the club following an incident at a training camp.","He was asked whether he had ever experienced any incidents of discrimination.","She described the incident as outrageous.","She was never disciplined over the incident.","The incident sparked a riot which lasted three days.","The incident was extremely well handled.","The story is based on an actual incident.","They all laughed as he recounted the amusing incident."],"opposite":"","synonyms":""},{"def":"a serious or violent event, such as a crime, an accident or an attack","examples":["a violent/serious incident","There was a shooting incident near here last night.","She reported the incident to the police.","He said that the authorities would investigate the incident.","in an incident A 36-year-old man and a 25-year-old woman were stabbed in separate incidents.","without incident The demonstration passed off without incident.","incident with somebody/something It was an alleged incident with a cleaner in this hotel that led to his dismissal.","incident of something There had been a number of incidents of violence against staff.","After nearly falling twice, she managed to make it to the top of the cliff without further incident.","His back still hurts from an incident with a vacuum cleaner.","It is feared that the attack may not have been an isolated incident.","No major security incidents happened at the Olympic Games that year.","Saturday's incident illustrates the fragility of the peace in the country.","She received a serious jaw injury in an off-the-ball incident.","The group is believed to have been responsible for several terrorist incidents.","another terrorist incident involving aircraft","The patrol had covered 200 miles without incident.","The pedestrian who had nearly been run over reported the incident to the police.","The police said that two men had been arrested after the match in unrelated incidents.","Three soldiers were wounded in the incident.","The jury was satisfied that the incident had taken place."],"opposite":"","synonyms":""},{"def":"a disagreement between two countries, often involving military forces","examples":["a border/diplomatic incident","An error in the translation nearly caused a diplomatic incident.","Talks between the neighbouring countries were called off following a border incident."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["incident room","U-2 incident","incident rooms"]},{"pos":"adjective","level":"","meanings":[{"def":"touching or hitting a surface","examples":["The technology relies on a beam of incident light passing through a prism."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]