[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/inc/incre/increase__us_1_rr.mp3","phonsUS":"/ɪnˈkriːs/","level":"A2","meanings":[{"def":"to become greater in amount, number, value, etc.; to make something greater in amount, number, value, etc.","examples":["Costs have increased significantly.","to increase dramatically/substantially","The price of oil increased.","increase in something Oil increased in price.","increase by something The rate of inflation increased by 2 per cent.","increase from A to B The population has increased from 1.2 million to 1.8 million.","increase with something Disability increases with age (= the older somebody is, the more likely they are to be disabled).","increase something Sun exposure may increase the risk of skin cancer.","Our aim is to increase the number of women in the sport.","The company plans to significantly increase product availability over the next year.","increase something by something They've increased the price by 50 per cent.","increase something from A to B Last month the reward was increased from $20 000 to $40 000.","An increasing number of people live alone.","increasing levels of carbon dioxide in the earth’s atmosphere","This bar chart illustrates how many journeys people made on public transport over a three-month period.","This table compares bus, train, and taxi use between April and June.","The results are shown in the chart below.","In this pie chart, the survey results are broken down by age.","This pie chart breaks down the survey results by age.","As can be seen from these results, younger people use buses more than older people.","According to these figures, bus travel accounts for 60 per cent of public transport use.","From the data in the above graph, it is apparent that buses are the most widely used form of public transport.","Demand is expected to increase over the next decade.","Sales increased almost fourfold in this period.","The budget has increased by more than a third in the last year.","We need to increase productivity.","Progressively increase the intensity of the exercise over three weeks.","You can increase or decrease the font size."],"opposite":"decrease","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/inc/incre/increase__us_2.mp3","phonsUS":"/ˈɪŋkriːs/","level":"A2","meanings":[{"def":"a rise in the amount, number or value of something","examples":["price/tax/wage increases","Profits show a steady increase.","increase in something Last year the business saw a 3% increase in turnover.","a substantial increase in the number of products on the market","There has been a significant increase in oil prices.","The tax has resulted in a dramatic increase in rents.","increase of something an increase of 2p in the pound on income tax","increase on something The figure is a ten-fold increase on the earlier amount.","increase of something on something This is an increase of 12% on the previous year.","increase over something This represents a 14% increase over last year.","increase from something They report a massive increase from last year.","on the increase Homelessness is on the increase (= increasing).","The rate of increase is accelerating.","Student numbers in English language schools in this country increased from 66 000 in 2018 to just over 84 000 in 2019.","The number of students increased by almost 30 per cent compared with the previous year.","Student numbers shot up/increased dramatically in 2019.","The proportion of Spanish students rose sharply from 5 per cent in 2018 to 14 per cent in 2019.","There was a significant rise in student numbers in 2019.","The 2019 figure was 84 000, an increase of 28 per cent on the previous year.","The 2019 figure was 84 000, 28 per cent up on the previous year.","As the chart shows, this can partly be explained by a dramatic increase in students from Spain.","An increase in demand leads to an increase in price.","Sales of beef have experienced double-digit increases.","Some companies are predicting price increases of 30 per cent or more.","Intensive farming has brought about an increase in outbreaks of food poisoning.","Many parts of the country have experienced an increase in unemployment.","Their reputation has improved, bringing a corresponding increase in revenues.","The war resulted in a massive increase in government spending.","There has been an increase in demand for two-bedroom flats.","This year saw an increase in the number of job applicants.","The average increase in value last year was 4.3 per cent.","The company reported a 9.5 per cent increase in third quarter losses.","We achieved a small increase in profits of £3 257.","You would expect to observe an increase in births during peacetime.","The country is enjoying the biggest increase in business confidence for years.","The government has announced a modest increase in welfare benefits.","The figures show a sharp increase on last year's turnover."],"opposite":"decrease","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]