[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/ind/indep/independence__us_1.mp3","phonsUS":"/ˌɪndɪˈpendəns/","level":"B2","meanings":[{"def":"freedom from political control by other countries","examples":["Cuba gained independence from Spain in 1898.","Economic aid tends to undermine the national independence of Third-World countries.","Independence came to the British colonial territories in Africa in the late fifties and early sixties.","The army is committed to ensuring the independence of the country.","They have agreed to recognize the breakaway republic's independence.","the American War of Independence","An overwhelming majority voted in favour of independence for the region.","The tiny republic has taken another step towards independence.","There has been international recognition for the island's declaration of independence.","They were both supporters of the independence movement."],"opposite":"","synonyms":""},{"def":"the time when a country gains freedom from political control by another country","examples":["independence celebrations","the first elections since independence","Namibia became a full member of the UN at independence.","The drama is set in India at the time of independence.","Malaysia celebrates its independence day on 31st August.","The party have dominated since independence in 1980."],"opposite":"","synonyms":""},{"def":"the freedom to organize your own life, make your own decisions, etc. without needing help from other people","examples":["He values his independence.","a woman’s financial independence","Doing work experience gave me a sense of independence.","I didn't appreciate my new-found independence, but instead felt lonely.","Parents should encourage independence in their children.","She displayed independence in choosing a career different from that of her parents.","She doesn't want to lose her hard-won independence.","She had a fierce independence of spirit.","The car became a symbol of independence.","Young people have more independence these days.","Some people have questioned the independence of the inspectors.","The council's relative independence of the government means it can negotiate its own agreements.","The proposals are seen as a potential threat to judicial independence.","Conflicts of interest might compromise the auditor's independence."],"opposite":"dependence","synonyms":""}],"idioms":[],"phrasal":[],"related":["Independence","Independence Day","Independence Hall","Declaration of Independence","American Independence","United Kingdom Independence Party","the War of American Independence"]},{"pos":"","level":"","meanings":[{"def":"a US city in the state of Missouri. President Harry S Truman lived there, and his official library and museum can be visited. The international office of the Reorganized Church of Jesus Christ of Latter Day Saints is also there. In the 1830s and 1840s, people began their journeys west on the Santa Fe Trail and the Oregon Trail from Independence.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]