[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/ind/indep/independent__us_1.mp3","phonsUS":"/ˌɪndɪˈpendənt/","level":"A2","meanings":[{"def":"having its own government","examples":["an independent state/nation/country","the newly independent republics of Central Asia in the 1990s","Mozambique became independent in 1975.","In 1961 the country was declared independent.","independent from something The country became fully independent from France in 1960.","independent of something Adams urged Congress to declare the American colonies independent of Britain."],"opposite":"","synonyms":""},{"def":"confident and free to do things without needing help from other people","examples":["Going away to college has made me much more independent.","She's a very independent-minded young woman.","Many disabled people are fiercely independent.","independent of somebody/something Students should aim to become more independent of their teachers."],"opposite":"dependent","synonyms":""},{"def":"having or earning enough money so that you do not have to rely on somebody else for help","examples":["independent of somebody/something It was important to me to be financially independent of my parents.","a man of independent means (= with an income that he does not earn by working)"],"opposite":"dependent","synonyms":""},{"def":"done or given by somebody who is not involved in a situation and so is able to judge it fairly","examples":["an independent inquiry/review/investigation","an independent commission/body/panel","an independent adviser/consultant/expert","She went to a lawyer for some independent advice.","The auditing of a company's accounts is done by independent accountants."],"opposite":"","synonyms":""},{"def":"not connected with or influenced by something; not connected with each other","examples":["independent of somebody/something The police force should be independent of direct government control.","Two independent research bodies reached the same conclusions.","The results were obtained from four independent experiments.","This figure is essentially independent of population size.","His system rests upon two logically independent arguments.","Many local clans remain relatively independent.","They are two separate, mutually independent entities.","The Institute will quickly become a fully independent unit.","His company is a target for takeovers, but plans to stay independent.","The country has pursued an effectively independent line on military issues."],"opposite":"","synonyms":""},{"def":"supported by private money rather than government money","examples":["independent television","the independent sector"],"opposite":"","synonyms":""},{"def":"not employed or controlled by a company; not created by a big company","examples":["She was hired to do the work as an independent contractor.","Farmers operate as independent producers in the sense of working for themselves and running their own business.","a low-budget independent film"],"opposite":"","synonyms":""},{"def":"not representing or belonging to a particular political party","examples":["an independent candidate"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Independent","independent clause","independent school","independent variable","Independent Labour Party","Independent Press Standards Organisation","independent schools","independent variables","Independent Television","Independent Local Radio","Commonwealth of Independent States"]},{"pos":"noun","level":"","meanings":[{"def":"a member of parliament, candidate, etc. who does not belong to a particular political party","examples":["She's standing as an independent at the next election."],"opposite":"","synonyms":""},{"def":"a person who runs their own small business and is not employed or controlled by a company","examples":["It's getting tougher and tougher for independents in the music business."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]