[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/ind/indic/indication__us_1.mp3","phonsUS":"/ˌɪndɪˈkeɪʃn/","level":"B2","meanings":[{"def":"a remark or sign that shows that something is happening or what somebody is thinking or feeling","examples":["indication of something They gave no indication of how the work should be done.","indication of doing something He shows every indication (= clear signs) of wanting to accept the post.","indication that… There are clear indications that the economy is improving.","All the indications are that the deal will go ahead as planned.","Headaches may be a sign of stress.","They gave no indication as to how the work should be done.","Symptoms include a sore throat.","The rise in inflation was just one symptom of the poor state of the economy.","The dove is a universal symbol of peace.","the economic indicators","Chest pains can be a warning signal of heart problems.","All the indications are that she will make a full recovery.","Amid indications of growing disorder in the capital, the president is to make a speech on television tonight.","He gave his clearest indication yet that he will keep racing.","He has given ample indication of his intentions.","He was last night locked in talks over his future amid indications that he plans to resign.","His early successes gave some indication of his ability.","Indications show that at least 2 000 more businesses will go bankrupt before the end of the year.","It was a fair indication of what was to come.","Preliminary indications are that the tape is authentic.","She smiled, not giving the slightest indication of what had just happened.","The researchers say they can find no indication that television has harmful physical effects on children.","This is an indication to drivers who break the law that they will be punished"],"opposite":"","synonyms":"sign"},{"def":"a symptom that suggests that particular medical treatment is necessary","examples":["There was no clinical indication for such a test."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]