[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/ind/indic/indicate__us_1.mp3","phonsUS":"/ˈɪndɪkeɪt/","level":"B1","meanings":[{"def":"to show that something is true or exists","examples":["indicate something Initial tests indicate the presence of oxygen.","The survey data indicate a general satisfaction with the process.","He has declared support for women, but his actions have indicated otherwise.","indicate that… Research indicates that eating habits are changing fast.","These findings clearly indicate that the scheme has improved pedestrian safety.","The study/evidence/report indicates that…","Kingston-upon-Thames, as the name indicates, is situated on the banks of the Thames.","indicate how, what etc… Our results indicate how misleading it could be to rely on this method.","A yellowing of the skin indicates jaundice.","Record profits in the retail market indicate a boom in the economy.","The article claims that an increase in crime indicates a decline in moral standards."],"opposite":"","synonyms":""},{"def":"to be a sign of something; to show that something is possible or likely","examples":["indicate something A red sky at night often indicates fine weather the next day.","indicate that… Early results indicate that the government will be returned to power.","indicate to somebody that… These figures indicate to me that the company is in serious trouble.","Growth will be at a lower rate than previously indicated.","These facts would seem to indicate that the family was wealthy."],"opposite":"","synonyms":""},{"def":"to mention something, especially in an indirect way","examples":["indicate (to somebody) (that)… In his letter he indicated to us (that) he was willing to cooperate.","indicate something (to somebody) He indicated his willingness to cooperate.","indicate whether, when, etc… Has she indicated yet whether she would like to be involved?","to declare war","The painting was declared to be a forgery.","He has already stated his intention to run for election.","During our meeting, he indicated his willingness to cooperate.","They haven’t formally announced their engagement yet.","Has our flight been announced yet?","In a key speech, the Queen indicated that she was willing to pay tax.","As I've already indicated to you, what we do next depends on a number of factors."],"opposite":"","synonyms":"declare"},{"def":"to make somebody notice somebody/something, especially by pointing or moving your head","examples":["indicate somebody/something ‘What are they doing here?’ he asked, indicating her bags in the hallway.","indicate somebody/something to somebody She took out a map and indicated the quickest route to us.","indicate where, which, etc… He indicated where the furniture was to go.","indicate that… She indicated that I was to sit down."],"opposite":"","synonyms":""},{"def":"to represent information without using words","examples":["Arrows indicate the direction of flow.","The results are indicated in Table 2.","Symbols are used to indicate the facilities available at each hotel.","This sign usually indicates a pedestrian zone."],"opposite":"","synonyms":""},{"def":"to give information in writing","examples":["indicate something You are allowed 20  kg of baggage unless indicated otherwise on your ticket.","As indicated above, this chapter deals with the practical implications of the research.","indicate which, where, etc… Please indicate clearly which colour you require."],"opposite":"","synonyms":""},{"def":"to show a particular measurement","examples":["When the temperature gauge indicates 90°F or more, turn off the engine."],"opposite":"","synonyms":""},{"def":"to show that your vehicle is going to change direction, by using lights or your arm","examples":["Always indicate before moving into another lane.","indicate something He indicated left and then turned right.","indicate (that)… She indicated that she was turning right."],"opposite":"","synonyms":""},{"def":"to be necessary or recommended","examples":["be indicated A course of chemotherapy was indicated."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]