[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/inf/infec/infection__us_3.mp3","phonsUS":"/ɪnˈfekʃn/","level":"B2","meanings":[{"def":"the act or process of causing or getting a disease","examples":["to cause/prevent infection","Vaccination is essential to protect people exposed to hepatitis B infection.","The drugs slow down the progression of HIV infection.","Bacterial infection of the wound may occur.","to increase the risk of infection","The rate of infection is highest in the north-west of the country.","infection by something Birds are susceptible to infection by the virus.","infection with something Infection with malaria parasites may result in a wide variety of symptoms.","Taking vitamin C builds up your resistance to infection.","The urethra was the primary site of infection.","The virus affects the body's immune system so that it cannot fight infection.","We are trying to trace the source of infection.","infection from sewage water","infection of people by the virus","infection through unsafe sex","infection with bacteria","to protect the body from infection","The primary medical danger of rubella is the infection of pregnant women."],"opposite":"","synonyms":""},{"def":"an illness that is caused by bacteria or a virus and that affects one part of the body","examples":["an ear/a chest infection","a urinary tract/respiratory infection","a viral/bacterial infection","a media campaign to raise awareness about sexually transmitted infections","to cause an infection","Sneezing is the most common way of spreading an infection.","infection of something a fungal infection of the skin","He's been off work with a throat infection.","an infection that occurs in swans","They want to prevent the infection spreading to other parts of the body.","The infection is passed on through the horse feed.","The drug must be taken from the onset of the infection.","Almost all the sheep on the farm carried the infection.","Goats appear to be more susceptible to the infection than sheep.","He's suffering from an acute infection of the lower respiratory tract.","He's suffering from an acute lung infection.","Heavy lung infections may result in pneumonia.","If the primary infection is not treated further outbreaks may occur.","In acute infections of the urinary tract the patient may suffer severe pain.","Normally, white blood cells fight off and kill infections.","Over 90% of all new infections occur in the developing world.","She's always getting chest infections."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["cross-infection","yeast infection"]}]