[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/inf/influ/influence__us_1.mp3","phonsUS":"/ˈɪnfluəns/","level":"B1","meanings":[{"def":"the effect that somebody/something has on the way a person thinks or behaves or on the way that something works or develops","examples":["His early work shows the influence of Cézanne and Matisse.","influence on somebody/something He had considerable influence on younger sculptors.","Peer group members can exert a strong influence on each others' activities.","Such media pressure exercises influence on policymakers.","influence of somebody/something on somebody/something the influence of the climate on agricultural production","What exactly is the influence of social media on children?","The religious community wished to be independent of outside influence.","He had a profound influence on modern poets.","The king tried to bring his influence to bear on the parliament.","The legacy of Ancient Rome represented the overwhelming influence on Romanesque architecture.","There was no influence from outside.","They examined the influence of farm size on technology adoption.","This paper evaluates the relative influence of religions.","I think the whole place has a very calming influence.","The size of the plate has an influence on how much we eat.","The internet's influence is growing every day.","Children around the age of eight are especially vulnerable to the influence of television.","Spanish architecture shows Moorish influence."],"opposite":"","synonyms":""},{"def":"the power that somebody/something has to make somebody/something behave in a particular way","examples":["He worked his way into a position of power and influence in the city.","influence over somebody/something Her parents no longer have any real influence over her.","It was claimed that lobbyists had undue influence on the prime minister.","influence with somebody She could probably exert her influence with the manager and get you a job.","She needs to use her influence with her party colleagues.","under the influence of somebody/something He committed the crime under the influence of drugs.","The country is beginning to expand its sphere of influence.","Can you use your influence with the director to get me a part in the movie?","Drug cartels wielded enormous influence in the city.","She has a certain amount of influence in the way things are organized.","He used his influence with local officials to gain commercial advantages.","Her wealth gave her influence over affairs of state.","His political influence was waning.","Outdated prejudices still exert a powerful influence.","I have absolutely no influence over him.","It's easy to trace the influence she's exerted on contemporary artists.","Queen Isabella was urged to use her influence with the French monarch.","The unions have been able to extend their influence over all industries.","Their influence extended as far as China.","She tried to bring her influence to bear on the committee.","The court found that the bank exerted undue influence over Mrs Black in getting her to sign the contract.","The court was told that he was under the influence of alcohol when he committed the offence.","The town grew under the influence of colonialism.","The artists exerted a strong influence on a younger generation.","Much of his writing can be attributed to the influence of Freud.","She came under the influence of Sartre at this period.","the effects of peer influence on crime"],"opposite":"","synonyms":""},{"def":"a person or thing that affects the way a person behaves and thinks","examples":["She draws on her diverse cultural influences to express herself.","His first music teacher was a major influence in his life.","There seem to be several influences at work in (= affecting) his writing.","influence on somebody/something Those friends are a bad influence on her.","They said she was a bad influence on the other children.","a study of children exposed to different cultural influences","Who were your early influences?","There were a number of influences at work in Gaudí's architecture.","They were a major influence upon the development of the sport.","The band had many influences.","She's by far the biggest influence on my writing.","Parents often seek to shelter their children from outside influences","His uncle had been a formative influence from his earliest years.","He is a writer of Indian descent and draws upon diverse cultural influences.","The massive intellect of his mother had been a formative influence from his earliest years."],"opposite":"","synonyms":""},{"def":"having had too much alcohol to drink","examples":["She was charged with driving under the influence.","He was arrested for driving under the influence."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"under the influence","def":"having had too much alcohol to drink","examples":["She was charged with driving under the influence.","He was arrested for driving under the influence."]}],"phrasal":[],"related":["influence peddling","driving under the influence"]},{"pos":"verb","level":"B1","meanings":[{"def":"to have an effect on the way that somebody behaves or thinks, especially by giving them an example to follow","examples":["influence somebody/something His writings have influenced the lives of millions.","Her writing was strongly influenced by her Catholic upbringing.","His film is heavily influenced by other film-makers.","Don't let me influence you either way.","Do bird-watchers influence the behaviour of the birds they are watching?","I do not wish to influence your decision one way or the other.","influence how, whether, etc… The wording of questions can influence how people answer.","influence somebody to do something She was influenced to take up voluntary work by her teacher.","influence somebody in something Her parents tried to influence her in her choice of university.","The government refuses to be influenced by public opinion.","Research shows that most young smokers are influenced by their friends.","I don’t want to influence you. It must be your own decision.","She hopes her blog will influence opinion in the community.","Be aware of external factors which may unduly influence your judgement.","He was naive and easily influenced by his friends.","This book influenced her profoundly.","seeking to influence university appointments","At college she met the two people who most influenced her artistic career.","Attitudes are highly influenced by cultural background."],"opposite":"","synonyms":""},{"def":"to have an effect on a particular situation and the way that it develops","examples":["influence something A number of social factors influence life expectancy.","The local climate is influenced by the Gulf Stream.","Many factors can influence the taste of wine.","Minor party candidates can influence the outcome of elections.","They are a campaign group that seeks to influence government policy on health.","influence how, whether, etc… The speed at which you eat strongly influences how much you want to eat.","Understaffing can adversely influence the recovery of patients.","Pressure from industry bosses has directly influenced government policy.","We do not seek to influence the decision-making process.","actions that positively influence health"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]