[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/inf/infor/inform__us_1.mp3","phonsUS":"/ɪnˈfɔːrm/","level":"B2","meanings":[{"def":"to tell somebody about something, especially in an official way","examples":["inform somebody The government took this decision without consulting Parliament or informing the public.","Have the police been informed?","inform somebody of something Please inform us of any changes of address.","He went to inform them of his decision.","inform somebody about something The leaflet informs customers about healthy eating.","inform somebody that… I have been reliably informed (= somebody I trust has told me) that the couple will marry next year.","I am pleased to inform you that you have won first prize in this month’s competition.","inform somebody + speech ‘He's already left,’ she informed us.","inform somebody when, where, etc… I have not been informed when the ceremony will take place.","Inform me at once if there are any changes in her condition.","A notice informed the guests that formal dress was required.","I am not advising you. I am merely informing you of the situation.","I regret to inform you that you have been unsuccessful in your application.","Many people questioned whether patients were informed adequately of the risks.","Next time you decide to take some action, kindly inform me.","Students are clearly informed that drugs will not be tolerated.","The clinic is required to inform the patient about possible alternative treatments.","We will immediately inform you of any changes to the programme.","efforts to inform young people about the dangers of drugs","I am reliably informed that there are plans to close this school.","The newspaper had done little to its readers about the desperate poverty prevailing in New Orleans."],"opposite":"","synonyms":""},{"def":"to find out information about something","examples":["We need time to inform ourselves thoroughly of the problem."],"opposite":"","synonyms":""},{"def":"to have an influence on something","examples":["Religion informs every aspect of their lives.","These guidelines will be used to inform any future decisions."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["inform on"],"related":["inform on","inform on somebody"]}]