[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/inf/infor/information__us_1.mp3","phonsUS":"/ˌɪnfərˈmeɪʃn/","level":"A1","meanings":[{"def":"facts or details about somebody/something","examples":["a piece of information","What was your main source of information for your article?","The documents contain confidential personal information.","More detailed information is not yet available.","He refused to comment before he had seen all the relevant information.","We will need a little more background information.","to collect/gather/obtain/receive information","to give/share/pass on information","Your local council can provide information on sports facilities in your area.","information about somebody/something For more information about the project, click on the link below.","How can I get information about enrolling on the course?","information on somebody/something For further information on the diet, write to us at this address.","The guidelines are based on the latest scientific information.","Our information is that the police will shortly make an arrest.","for the information of somebody This leaflet is produced for the information of (= to inform) our customers.","according to somebody's information According to my information (= according to what I have been told) work was due to start last week.","You can go to the information desk for help.","Could you tell me the best way to get to Paddington station, please?","Do you happen to know whether Amy Brown works here?","I wonder whether/​if you can help me. I'm trying to find out which number to call for reservations.","The book is full of information on the construction of bridges.","At the moment we have very little information to go on.","Do you have the information I need?","Further information is available on request.","Have you dug up any further information on the suspect?","It is alleged that he gave false information to the tax authorities.","It was improper of the broker to withhold the information from the stock exchange.","James is able to retain an enormous amount of factual information in his head.","New information will be posted on the internet twice a month.","Portable computers are good for accessing information while on the move.","She didn't volunteer that information, and I didn't ask.","She let slip a few nuggets of information about herself.","Someone leaked information to the press.","The French and British police will exchange information on wanted criminals.","The internet allows us to share information with our distributors.","The information flows in both directions.","The leaflet provides contact information for your local branch.","The police are still questioning witnesses and gathering information.","The research has yielded a lot of information.","The two countries exchange information on wanted criminals.","The way you present the information is important.","There are legal constraints on the use of price-sensitive information.","They passed on the information about the crime to the police.","This is the information age and there's an insatiable appetite for data and speed.","a court order preventing an ex-employee from disclosing confidential information","a reward for information leading to an arrest","an interesting piece of information","an organization that collects and disseminates information about women in science","basic information like date of birth and phone number","database systems that process and store information","financial information concerning a company","general information about the company as a whole","information gained from research","information relating to the social background of the child","software that retrieves information from a variety of different sources","the difficulties of extracting information from government officials","the latest information on the situation in the Middle East","to improve the flow of information within the company","Do you have any information about local buses?","For further information, contact us at the above address.","He is accused of giving false information to the police.","Information is stored on their computerized databases.","Log onto our website for the most up-to-date information.","One piece of information was particularly interesting.","The information was passed on by the immigration service.","The meeting is really to exchange information.","This information is strictly confidential.","This letter is for information only.","We do not give out this information over the phone.","You will need to collect as much information as possible."],"opposite":"","synonyms":""},{"def":"a phone service that you can use to find out a person's phone number","examples":[],"opposite":"","synonyms":""},{"def":"data that is processed, stored or sent by a computer","examples":["Algorithms are essential to the way computers process information."],"opposite":"","synonyms":""},{"def":"what is represented by a particular arrangement or sequence of things","examples":["the transfer of genetic information from DNA to RNA"],"opposite":"","synonyms":""},{"def":"written on documents that are sent to somebody who needs to know the information in them but does not need to deal with them","examples":[],"opposite":"","synonyms":""},{"def":"used to tell somebody that they are wrong about something","examples":["For your information, I don't even have a car."],"opposite":"","synonyms":""},{"def":"a person, book, etc. that can give you a lot of information on a particular subject","examples":["This book is a mine of information on the Romans.","The internet can be a mine of information.","The questionnaire results proved to be a rich mine of empirical data."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"for your information","def":"written on documents that are sent to somebody who needs to know the information in them but does not need to deal with them","examples":["For your information, I don't even have a car."]},{"idiom":"a mine of information/data (about/on somebody/something)","def":"a person, book, etc. that can give you a lot of information on a particular subject","examples":["This book is a mine of information on the Romans.","The internet can be a mine of information.","The questionnaire results proved to be a rich mine of empirical data."]}],"phrasal":[],"related":["black information","information science","information theory","information security","information technology","freedom of information","Freedom of Information Act","Information Commissioner's Office","United States Information Agency","for your information","too much information","management information system","tourist information office","Freedom of Information Acts","a mine of information/data (about/on somebody/something)"]}]