[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/ing/ingre/ingredient__us_1.mp3","phonsUS":"/ɪnˈɡriːdiənt/","level":"B1","meanings":[{"def":"one of the things from which something is made, especially one of the foods that are used together to make a particular dish","examples":["Mix all the ingredients in a bowl.","Our skin cream contains only natural ingredients.","The only active ingredient in this medicine is aspirin.","Avocado is the main ingredient of the Mexican dish.","ingredient for something Coconut is a basic ingredient for many curries.","All food products should carry a list of ingredients on the packet.","Blend all the ingredients together in a bowl.","I only use natural ingredients.","It always pays to use the best ingredients when cooking.","Mix the marinade ingredients and pour over the goose.","Pour all of the ingredients into a blender.","The two drugs contain the same active ingredients.","Use a spoon to mix the dry ingredients.","a style which incorporated ingredients from the music of many different countries","salicylic acid, the active ingredient in aspirin","the chemical composition of the individual ingredients","the principal ingredient of smog"],"opposite":"","synonyms":""},{"def":"one of the things or qualities that are necessary to make something successful","examples":["It has all the ingredients of a good mystery story.","An effective exercise programme has three key ingredients—intensity, frequency and duration.","ingredient for something Determination is one of the essential ingredients for success.","The magic ingredient is love.","Tolerance is an essential ingredient for a happy marriage.","The little town has all the right ingredients for a murder mystery.","The Australian team had the added ingredient of perseverance.","Hard work is a vital ingredient for success.","Forecasting is a basic ingredient of business planning.","She hopes the change of career will supply the missing ingredient in her life—excitement."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]