[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/ini/initi/initial__us_1.mp3","phonsUS":"/ɪˈnɪʃl/","level":"B2","meanings":[{"def":"happening at the beginning; first","examples":["There is an initial payment of £60 followed by ten instalments of £25.","The government will make an initial investment of $ 4.7 billion in the company.","in the initial stages (= at the beginning) of the campaign","an initial phase/period","an initial assessment/investigation/report","My initial reaction was to decline the offer.","Her initial response was one of anger.","After some initial hesitation, teachers seem to have accepted the new system.","After the initial surprise I got to like the place.","By 1960 the initial optimism had evaporated.","His initial surge of euphoria was quickly followed by dismay.","Initial failure was followed by unexpected, if modest, success.","It is the initial preparation that takes the time.","My initial scepticism was replaced with respectful admiration.","When the initial shock had worn off, I got used to the situation.","the initial outlay","the initial planning"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["initial public offering","initial public offerings"]},{"pos":"noun","level":"","meanings":[{"def":"the first letter of a person’s first name","examples":["‘What initial is it, Mrs Owen?’ ‘It's J, J for Jane.’","When writing, if you use initials for a long name, make sure you spell out the name at least once."],"opposite":"","synonyms":""},{"def":"the first letters of all the names of a person or thing","examples":["John Fitzgerald Kennedy was often known by his initials JFK.","Just write your initials.","A stone over the door bears the initials ‘R.P.’, which stand for ‘Ralph Piggot’.","He carved his girlfriend's initials in the rock.","She's always been known by her initials.","The two authors have the same initials.","Now that she was chief executive officer, she could put the initials CEO after her name.","SC are the initials for Santa Catarina."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to mark or sign something with your initials","examples":["Please initial each page and sign in the space provided.","The agreement was finally initialled on May 8."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]