[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/ini/initi/initiative__us_1.mp3","phonsUS":"/ɪˈnɪʃətɪv/","level":"B2","meanings":[{"def":"a new plan for dealing with a particular problem or for achieving a particular purpose","examples":["a United Nations peace initiative","Most policy initiatives come from the White House.","to launch an initiative","The money was intended to support initiatives in bilingual education.","initiative to do something new initiatives to improve animal welfare","a government initiative to combat unemployment","initiative by somebody/something a joint initiative by the Scottish and UK governments","initiative for something an initiative for peace and human rights","Ten schools have been involved in the initiative.","The committee endorsed an initiative by the chairman to enter discussion about a possible merger.","The government has launched a new policy initiative.","The initiative foundered because there was no market interest in redevelopment.","The peace initiative was rejected out of hand.","The research initiative is being undertaken by a group of environmentalists.","We welcome the government's initiative to help the homeless.","a local initiative aimed at economic regeneration","a new initiative against car theft","a peace initiative sponsored by the Organization of African Unity","an initiative designed to promote collaborative research","fresh initiatives to find a peaceful end to the conflict","The initiative to reopen negotiations came from Moscow.","pioneering initiatives in bioengineering","the government's major new initiative on crime","the latest initiative by the UN Secretary General","A number of initiatives have been planned to tackle street crime.","Government leaders are meeting to discuss the latest peace initiative.","They proposed a joint initiative between the local authority and faith groups."],"opposite":"","synonyms":""},{"def":"the ability to decide and act on your own without waiting for somebody to tell you what to do","examples":["He said I was lazy and had no initiative.","You won't get much help. You'll have to use your initiative.","She needs to show more initiative if she wants to succeed.","Too much bureaucracy represses creativity and initiative.","She did it on her own initiative (= without anyone telling her to do it).","Don't ask me what you should do all the time. Use your initiative!","He acted on his own initiative and wasn't following orders.","He had the initiative to ask what time the last train left.","It's a very hierarchical company and there's little place for individual initiative.","Raising taxes on small businesses will stifle initiative.","In an unprecedented action, the army, on its own initiative, arrested seven civilians.","Some scientists show little initiative in applying their knowledge.","The project was set up on the initiative of a local landowner."],"opposite":"","synonyms":""},{"def":"the power or opportunity to act and gain an advantage before other people do","examples":["to seize/regain the initiative","It was up to the US to take the initiative in repairing relations.","In the second half, Manchester United regained the initiative.","She then regained the initiative in winning the third game.","She took the initiative in asking the board to conduct an enquiry."],"opposite":"","synonyms":""},{"def":"(in some states of the US) a process by which ordinary people can suggest a new law by signing a petition","examples":["a ballot initiative to establish a local minimum wage","The rights of referendum and initiative foster active participation by citizens."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Strategic Defense Initiative"]}]