[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/inj/injur/injury__us_1.mp3","phonsUS":"/ˈɪndʒəri/","level":"A2","meanings":[{"def":"harm done to a person’s or an animal’s body, for example in an accident","examples":["Two people sustained minor injuries.","One of the girls suffered serious injuries.","He was lucky to escape injury.","The passengers escaped with only minor injuries.","As a result of the accident, several passengers sustained serious head injuries.","injury to somebody/something One youth was treated for injuries to his arm.","He died from multiple injuries caused by the accident.","There were no injuries in the crash (= no people injured).","No damage or injuries were reported.","These new guidelines will help save lives and prevent injury.","Taking a few simple precautions will reduce your risk of injury.","This could result in serious injury or even death.","because of injury Two players are out of the team because of injury.","(British English, informal) Don't do that. You'll do yourself an injury (= hurt yourself).","Both defenders have been sidelined by injury.","Finger injuries should be dealt with immediately.","Fortunately, the passengers escaped serious injury.","He aggravated a neck injury while playing for Derby County.","He has pulled out of the match through injury.","He is still being treated for injuries to his legs.","He missed most of the season with a spate of injuries.","He pulled out with an injury at the last moment.","He underwent tests to assess his injuries.","He was accused of feigning injury.","He was an injury replacement for another player.","He went off (= off the playing field) with an injury in the second half.","Her athletics career has been dogged by injury.","India had wicketkeeper More back after injury.","McNair continues to play through injury.","Please help me before our dogs inflict serious injury on each other!","Researchers have determined that heading a football can cause permanent injury.","She has failed to shake off her stomach injury.","She has replaced him in the team while he nurses a shoulder injury.","She is out (= out of the competition/​team) for six weeks with a hamstring injury.","She picked up an injury during the quarter-final.","She should be back from injury.","She slumped to the floor with injuries to her back and neck.","She's unable to play because of injury.","Stretching exercises can help avoid injury.","The car turned right over, causing severe injury to the driver.","The doctor said he would risk serious injury if he were to fall again.","The inquest heard that he died from multiple injuries.","The knee injury forced him to give up playing at the age of 23.","The team has a lot of injury problems.","There is a real risk of injury in sports such as climbing.","These injuries ended her hopes of becoming a doctor.","This type of injury could happen to any player at any time.","You'll do yourself an injury riding that old bike.","a claim for personal injury","a guide to lifting without injury","a player on the injury list","a step-by-step guide to lifting without injury","an injury which robbed him of his speed","injuries from the fire","injuries resulting from exposure to harmful substances","personal injuries arising from negligence","A back injury forced him to give up rugby.","Failure to follow the safety instructions may result in injury."],"opposite":"","synonyms":""},{"def":"damage to a person’s feelings","examples":["Damages may be awarded for emotional injury."],"opposite":"","synonyms":""},{"def":"to make a bad relationship with somebody worse by offending them even more","examples":["Then, to add insult to injury, they told me I couldn't get on the flight.","It adds insult to injury that banks are allowed to increase their charges without our knowledge or consent.","Only 300 people came to the match and to add insult to injury, the floodlights went out during the second half."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"add insult to injury","def":"to make a bad relationship with somebody worse by offending them even more","examples":["Then, to add insult to injury, they told me I couldn't get on the flight.","It adds insult to injury that banks are allowed to increase their charges without our knowledge or consent.","Only 300 people came to the match and to add insult to injury, the floodlights went out during the second half."]}],"phrasal":[],"related":["injury time","personal injury","whiplash injury","add insult to injury"]}]