[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/inn/innoc/innocent__us_1.mp3","phonsUS":"/ˈɪnəsnt/","level":"B1","meanings":[{"def":"not guilty of a crime, etc.; not having done something wrong","examples":["They have imprisoned an innocent man.","innocent of something She was found innocent of any crime.","innocent of doing something I was convinced that he was innocent of taking the money.","He was the innocent party (= person) in the dispute.","There must be an innocent explanation for her behaviour.","He pleaded innocent to the charges.","I am totally innocent of this crime.","I had always believed her innocent.","The accused person should always be presumed innocent until proved guilty.","The court found her innocent of the crime.","She tried to sound all innocent as she asked the question.","Stop playing innocent and answer my questions, please."],"opposite":"guilty","synonyms":""},{"def":"suffering harm or being killed because of a crime, war, etc. although not directly involved in it","examples":["an innocent bystander","innocent victims of the bomb blast","Thousands of innocent civilians have been killed in this conflict.","He expressed outrage at the loss of innocent lives."],"opposite":"","synonyms":""},{"def":"having little experience of the world, especially of sexual matters, or of evil or unpleasant things","examples":["At the time I was still an innocent young child.","She is very naive and innocent.","He looked so sweet and innocent.","She was sixteen and sweetly innocent.","He came across as deceptively innocent and childlike.","the strangely innocent world of her childhood"],"opposite":"","synonyms":""},{"def":"not intended to cause harm or upset somebody","examples":["It was all innocent fun.","It was a perfectly innocent remark.","The circumstance could be altogether innocent, but suspicions have been raised."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"","meanings":[{"def":"an innocent person, especially a young child","examples":[],"opposite":"","synonyms":""},{"def":"a person involved by chance in a situation, especially a victim of crime or war","examples":["They are prepared to kill or maim innocents in pursuit of a cause."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]