[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/inp/input/input__us_1.mp3","phonsUS":"/ˈɪnpʊt/","level":"B2","meanings":[{"def":"time, knowledge, ideas, etc. that you put into work, a project, etc. in order to make it succeed; the act of putting something in","examples":["I'd appreciate your input on this.","input into something Her specialist input to the discussions has been very useful.","input to something Barley is one of the main inputs to the process of distillation.","input of something Growing anything in this soil will require heavy inputs of nutrients.","input of something into something There has been a big input of resources into the project from industry.","I have no creative input to the projects I work on.","If you have ideas for improvements, your input is always appreciated.","Once running, the system requires very little input.","The report contains a substantial input by the police.","The union would like more input on redundancies.","They all had some input in the discussion.","We actively solicit input from our users.","We have made some adjustments based on user input.","an additional input to market analysis","constructive criticism which provided an input into the school's decision-making process","her input into the survey","input from various interested parties","I'd appreciate your input on this."],"opposite":"","synonyms":""},{"def":"the act of putting information into a computer; the information that you put in","examples":["data input","input from something The software will accept input from a variety of other programs.","Decision tables can be used as computer input.","Early computers required input in the form of punched cards.","It may be beyond the capability of the hardware to process the input.","The cursor is positioned on the first input field of the page.","an input device such as a keyboard","input to a computer database","There's the socket for audio input.","input from a mouse"],"opposite":"","synonyms":""},{"def":"a place or means for electricity, data, etc. to enter a machine or system","examples":["an input lead","Where is the audio input on the computer?","inputs for the printers"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Basic Input-Output System"]},{"pos":"verb","level":"","meanings":[{"def":"to put information into a computer","examples":["to input text/data/figures"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]