[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/ins/inspi/inspiration__us_1.mp3","phonsUS":"/ˌɪnspəˈreɪʃn/","level":"C1","meanings":[{"def":"the process that takes place when somebody sees or hears something that causes them to have exciting new ideas or makes them want to create something, especially in art, music or literature","examples":["Dreams can be a rich source of inspiration for an artist.","Both poets drew their inspiration from the countryside.","Her work lacks inspiration (= it does not contain any exciting new ideas).","inspiration for something Looking for inspiration for a new dessert? Try this recipe.","inspiration to do something She had the time and the inspiration to develop her talent.","Her inspiration comes from Asia.","Her latest book owes its inspiration to childhood memories.","I had to wait until inspiration struck.","Many of us found inspiration in her teaching.","The movement draws much of its inspiration from the Greek philosophers.","Where did you get the inspiration for the book?"],"opposite":"","synonyms":""},{"def":"a person or thing that is the reason why somebody creates or does something","examples":["inspiration (for something) He says my sister was the inspiration for his heroine.","inspiration behind something Clark was the inspiration behind Saturday's victory.","The sea has provided an inspiration for many of his paintings.","His wife was the direct inspiration for the main character in the book.","The garden is an inspiration for all gardeners with limited resources."],"opposite":"","synonyms":""},{"def":"a person or thing that makes you want to be better, more successful, etc.","examples":["inspiration to somebody Her charity work is an inspiration to us all.","inspiration for somebody She became an inspiration and a role model for a new generation of women.","Julia's courage must be a great inspiration to those people facing a similar ordeal.","She's been a great inspiration to me."],"opposite":"","synonyms":""},{"def":"a sudden good idea","examples":["He had an inspiration: he'd give her a dog for her birthday.","It came to me in a flash of inspiration.","Then I had a moment of true inspiration.","One day the inspiration just came.","In a flash of inspiration, I decided to paint the whole house white."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]