[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/ins/inspe/inspection__us_1.mp3","phonsUS":"/ɪnˈspekʃn/","level":"C1","meanings":[{"def":"an official visit to a school, factory, etc. in order to check that rules are being obeyed and that standards are acceptable","examples":["Regular inspections are carried out at the prison.","The head went on a tour of inspection of all the classrooms.","A standard home-inspection report summarizes the condition of the house.","Following an on-site inspection, the surveyor prepared a written report on the property.","Nursing agencies are subject to inspection by the health authority.","The architect is carrying out a thorough inspection of the building.","The hotel passed its annual inspection.","The problem was not discovered during the home inspection.","a surprise inspection of the premises by the health inspector","an inspection of the troops by the commander-in-chief","the UN weapons inspection team","Council officials made one site inspection of the property.","The regional manager carried out a surprise inspection of the factory's safety equipment."],"opposite":"","synonyms":""},{"def":"the act of looking closely at something/somebody, especially to check that everything is as it should be","examples":["The documents are available for inspection.","Engineers carried out a thorough inspection of the track.","Following an 8 a.m. pitch inspection by the referee, today's game has been called off due to a waterlogged pitch.","on inspection On closer inspection, the notes proved to be forgeries.","A company's accounting records must be open for inspection at all times.","All packages arriving at the building undergo an inspection.","Closer inspection of the vase revealed it to be a fake.","He held out the saucepan for inspection.","He knew that his motives would not bear close inspection (= would be revealed as bad if someone inspected them).","The artwork requires close inspection by the viewer.","The report seemed impressive at first, but on closer inspection there were several inaccuracies.","They have refused to allow international inspection of their nuclear facilities.","a creature which closer inspection revealed to be a bat","The records are open to public inspection."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]