[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/ins/insta/instance__us_2.mp3","phonsUS":"/ˈɪnstəns/","level":"B2","meanings":[{"def":"a particular example or case of something","examples":["instance of somebody/something The report highlights a number of instances of injustice.","instance of doing something He admitted two instances of taking money from the till.","instance of somebody/something doing something There have been several instances of that happening.","in an instance In most instances, there will be no need for further treatment.","In rare instances, viral infections in the mother may be passed to the unborn child.","I would normally suggest taking time off work, but in this instance I'm not sure that would do any good.","instance in which… Students described many instances in which they had felt uncomfortable speaking in class.","instance where… This is one of the few instances where the director does not succeed.","Can you give me an example of what you mean?","In some cases people have had to wait several weeks for an appointment.","The report highlights a number of instances of injustice.","The aquarium has some interesting specimens of unusual tropical fish.","The statistics are a clear illustration of the point I am trying to make.","We have had instances of people who did not feel it was worth reporting a crime.","There are still countless instances of women being paid less for doing the same work as men.","Experts cite the country as an instance where human rights violations could lead to international intervention.","Further information is required to determine the correct answer in any given instance.","I cannot recall any other instance in modern times in which a huge and mighty state crumbled to dust.","In one instance, several people had their mobile phones stolen.","It is not always helpful to draw analogies, but in this instance it is useful.","North America provides the most striking instance of European settlement on a grand scale.","There are many documented instances of mass hysteria.","This instance shows how important it is to check that the machine is working properly before you use it.","This is a classic instance of Dostoevsky's writing operating on two levels.","This is an instance of his general attitude to his employees.","To take a particular instance of this problem:…"],"opposite":"","synonyms":"example"},{"def":"for example","examples":["What would you do, for instance, if you found a member of staff stealing?","Murder, petty theft and tax evasion, for instance, all have different motives and consequences.","The website has a variety of interactive exercises (e.g. matching games, crosswords and quizzes).","The website has a variety of interactive exercises, including matching games, crosswords and quizzes.","Internet technologies, such as wikis, blogs and social networking sites, have changed the way that people find information and interact with it.","Many websites allow users to contribute information. A good example of this is the ‘wiki’, a type of website that anyone can edit.","Wikis vary in how open they are. For example, some wikis allow anybody to edit content, while others only allow registered users to do this.","Wikis vary in how open they are. Some wikis, for example/for instance, allow anybody to edit content, while others only allow registered users to do this.","More and more people read their news on the internet. To take one example, over 14 million people now read the online version of ‘The Oxford Herald’.","Online newspapers are now more popular than paper ones. ‘The Oxford Herald’ is a case in point. Its print circulation has fallen in recent years, while its website attracts millions of users every month."],"opposite":"","synonyms":""},{"def":"as the first part of a series of actions","examples":["In the first instance, notify the police and then contact your insurance company.","In the first instance, a letter from your employer may be all you need."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"for instance","def":"for example","examples":["What would you do, for instance, if you found a member of staff stealing?","Murder, petty theft and tax evasion, for instance, all have different motives and consequences.","The website has a variety of interactive exercises (e.g. matching games, crosswords and quizzes).","The website has a variety of interactive exercises, including matching games, crosswords and quizzes.","Internet technologies, such as wikis, blogs and social networking sites, have changed the way that people find information and interact with it.","Many websites allow users to contribute information. A good example of this is the ‘wiki’, a type of website that anyone can edit.","Wikis vary in how open they are. For example, some wikis allow anybody to edit content, while others only allow registered users to do this.","Wikis vary in how open they are. Some wikis, for example/for instance, allow anybody to edit content, while others only allow registered users to do this.","More and more people read their news on the internet. To take one example, over 14 million people now read the online version of ‘The Oxford Herald’.","Online newspapers are now more popular than paper ones. ‘The Oxford Herald’ is a case in point. Its print circulation has fallen in recent years, while its website attracts millions of users every month."]},{"idiom":"in the first instance","def":"as the first part of a series of actions","examples":["In the first instance, notify the police and then contact your insurance company.","In the first instance, a letter from your employer may be all you need."]}],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to give something as an example","examples":["I refer to the situation instanced above."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]