[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/ins/insti/institute__us_2.mp3","phonsUS":"/ˈɪnstɪtuːt/","level":"B2","meanings":[{"def":"an organization that has a particular purpose, especially one that is connected with education or a particular profession; the building used by this organization","examples":["The report was compiled by Germany's five leading economic research institutes.","institute of something The course is offered at six colleges and institutes of higher education.","He is a member of the Institute of Chartered Accountants.","at an institute She was a senior researcher at the institute.","He is a key figure in the Institute of Mathematics.","She belongs to the Chartered Institute of Management.","She used to give lectures at the Mechanics' Institute.","The Institute says that an unidentified virus is to blame for the syndrome.","The environmental research institute found that the global average temperature had risen by 1.2°C.","The research was funded by the National Cancer Institute.","a national institute dedicated to treating people with eating disorders","a non-profit research institute dedicated to research in the public interest","an institute providing opportunities to graduates","the International Institute for Economic Development","She is a professor at Glasgow University's Institute of Law and Ethics in Medicine.","the Dundee Institute of Technology."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Women's Institute","collegiate institute","SETI Institute","Commonwealth Institute","Courtauld Institute","Adam Smith Institute","British Film Institute","Institute of Directors","Royal United Services Institute","City and Guilds Institute","Institute for Advanced Study","Institute of Contemporary Arts","Massachusetts Institute of Technology","American National Standards Institute","Barber Institute of Fine Arts","Royal Institute of British Architects","Royal National Institute for Deaf People","Royal National Institute of Blind People","Women’s Institute"]},{"pos":"verb","level":"","meanings":[{"def":"to introduce a system, policy, etc. or start a process","examples":["The new management intends to institute a number of changes.","They could institute criminal proceedings against you.","She formally instituted divorce proceedings against her husband.","The Church was seen as divinely instituted."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]