[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/ins/instr/instrument__us_1.mp3","phonsUS":"/ˈɪnstrəmənt/","level":"A2","meanings":[{"def":"an object used for producing musical sounds, for example a piano or a drum","examples":["to play an instrument","Is he learning an instrument?","percussion/brass/string instruments","an instrument maker","Ensure the instrument is tuned to concert pitch.","The instrument sounds like a cello.","The piece can be played on a keyboard instrument.","The score was written to be played on a keyboard instrument.","an instrument made by a violin maker in Canada","baroque music played on period instruments"],"opposite":"","synonyms":""},{"def":"a tool or device used for a particular task, especially for specialist or scientific work","examples":["surgical/optical/scientific instruments","Scientists then began using powerful instruments to peer through the planet's dense atmosphere.","syringes, needles or other sharp instruments","medieval instruments of torture such as the rack and the wheel","instrument for something Instruments for diagnosis and surgery have become hugely more sophisticated.","instrument for doing something the world's most powerful instrument for detecting gamma rays","All pupils should learn to use drawing instruments.","All the instruments are made from glass capillary tubing.","a set of mathematical instruments","This pen is the ideal precision instrument for all your graphic needs.","The autopsy revealed that the deceased had been hit with a blunt instrument."],"opposite":"","synonyms":""},{"def":"a device used for measuring speed, distance, temperature, etc. in a vehicle or on a machine","examples":["data gathered by instruments aboard the satellite","the flight instruments","There was a warning light flashing on the instrument panel.","to read the instruments and make a note of the wind speed and direction","an instrument that measures light intensity","The pilot did his instrument checks in preparation for take-off."],"opposite":"","synonyms":""},{"def":"something that is used by somebody in order to achieve something; a person or thing that makes something happen","examples":["instrument for (doing) something The law is not the best instrument for dealing with family matters.","instrument of something an instrument of change","Even though it was a somewhat blunt instrument (= not very precise), our questionnaire provided us with some interesting ideas.","Internet polls are considered to be better instruments than telephone polls.","More effective instruments of oversight are needed.","They agreed that the UN was the best instrument for reaching agreement.","They saw criminal law as an instrument for improving public morals.","the use of language as an instrument of power and social control","Financial aid can become an instrument of control rather than a support.","She was accused of making a public service an instrument of private advantage.","Some cynics say that popular music is a mere instrument of capitalist domination."],"opposite":"","synonyms":""},{"def":"a person who is used and controlled by somebody/something that is more powerful","examples":["an instrument of fate","The despot claimed to be the chosen instrument of divine providence."],"opposite":"","synonyms":""},{"def":"a formal legal document","examples":["credit instruments issued by banks"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["blunt instrument","wind instrument","musical instrument","stringed instrument","statutory instrument","musicals instrument"]}]