[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/ins/insti/instinct__us_1.mp3","phonsUS":"/ˈɪnstɪŋkt/","level":"C1","meanings":[{"def":"a natural quality that makes people and animals tend to behave in a particular way using the knowledge and abilities that they were born with rather than thought or training","examples":["She did not seem to have any of the usual maternal instincts.","by instinct Children do not know by instinct the difference between right and wrong.","instinct (is) to do something His first instinct was to run away.","instinct for (doing) something Horses have a well-developed instinct for fear.","Even at school, he showed he had an instinct for (= was naturally good at) business.","Artists have to learn to be guided by their instincts.","Babies know by instinct who their mother is.","Both superpowers shared the same instinct for self-preservation.","He has an instinct for survival in a tough job.","Her instincts took over and she dived on the escaping thief.","In negotiating you have to develop an instinct for when to be tough and when to make a deal.","They accused the campaign of appealing to the electorate's baser instincts.","What makes all these people come to the club? In my view it's the herd instinct.","Why don't you just follow your natural instincts?","As a player he seemed to lack the killer instinct.","Most people have a well-developed survival instinct.","She has a definite instinct for business.","The instinct for migration seems to be programmed into some birds and not others."],"opposite":"","synonyms":""},{"def":"a feeling that makes you do something or believe that something is true, even though it is not based on facts or reason","examples":["I've always trusted my instincts in the past.","It's best to follow your first instincts in matters like this.","instinct about somebody/something Her instincts about him had been right.","instinct for… He had a gut instinct for when people were lying to him.","on instinct I acted purely on instinct.","Her instinct told her that she was being followed.","Out of pure instinct, he moved back a little.","Against her better instincts, she ran back into the burning house to save some of her jewellery."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["herd instinct","killer instinct"]}]