[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/ins/insti/institution__us_2.mp3","phonsUS":"/ˌɪnstɪˈtuːʃn/","level":"B2","meanings":[{"def":"a large important organization that has a particular purpose, for example a university or bank","examples":["The deal is backed by one of the country's largest financial institutions.","He has worked as a visiting lecturer for various educational institutions.","The system is targeted mainly at academic and research institutions.","the Smithsonian Institution","institution of something The region boasts several institutions of higher education.","The College is one of the most prestigious medical institutions in the country.","We need to create institutions that benefit our community.","a course at an institution of higher education","cultural institutions such as the Danish Institute","examination procedures within educational institutions","young people who attend higher-education institutions"],"opposite":"","synonyms":""},{"def":"a building where people with special needs are taken care of, for example because they are old or mentally ill","examples":["They had him committed to a mental institution.","We want this to be like a home, not an institution.","patients in mental institutions","an institution for mentally ill offenders","The state built institutions for those who were considered insane.","Many people with dementia would rather remain at home than be placed in an institution.","He was released from the state institution where he had been confined for four years."],"opposite":"","synonyms":""},{"def":"a custom or system that has existed for a long time among a particular group of people","examples":["He claimed this threatened ‘the sacred institution of marriage’.","Fish and chips became a national institution in Britain.","Football is a national institution in this country.","American laws once protected the institution of slavery.","These changes threaten some of our most cherished institutions.","These values are embedded in mainstream social institutions.","cultural institutions such as religious and legal codes","Parliament remains the central institution of the constitution of the United Kingdom.","They argue for the reform of existing political institutions.","the central institutions of the nation's constitution","They are studying ways to reform government institutions."],"opposite":"","synonyms":""},{"def":"the act of starting or introducing something such as a system or a law","examples":["the institution of new safety procedures"],"opposite":"","synonyms":""},{"def":"a person who is well known because they have been in a particular place or job for a long time","examples":["You must know him—he's an institution around here!"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Royal Institution","Smithsonian Institution","young offender institution","the British Standards Institution","Royal National Lifeboat Institution"]}]