[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/ins/insta/instant__us_1.mp3","phonsUS":"/ˈɪnstənt/","level":"B2","meanings":[{"def":"happening immediately","examples":["This account gives you instant access to your money.","The show was an instant success.","People today seem to want instant gratification.","She took an instant dislike to me, the first time we met.","There is no instant solution to the problem of rising crime."],"opposite":"","synonyms":""},{"def":"that can be made quickly and easily, usually by adding hot water","examples":["instant coffee"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["instant message","instant-message","instant messaging","instant messenger","instant replay","instant coffee","instant replays","instant messages","instant-messages","instant-messaging","instant-messaged"]},{"pos":"noun","level":"","meanings":[{"def":"a very short period of time","examples":["in an instant I'll be back in an instant.","for an instant Just for an instant I thought he was going to refuse.","For a brief instant, I thought she was going to fall.","He paused for an instant before continuing.","His news was too important to be contained for a single instant longer.","It was all over in an instant.","She woke up in the instant before the phone rang."],"opposite":"","synonyms":""},{"def":"a particular point in time","examples":["at that instant At that (very) instant, the door opened.","the instant (that)… I recognized her the instant (that) (= as soon as) I saw her.","this instant Come here this instant (= immediately)!","The next instant she was flying through the air.","The bomb could go off at any instant.","At any given instant the distribution of molecular speeds is always constant under the same conditions.","He took out his keys to lock the door. At that very instant the door flew open and a man ran into the room."],"opposite":"","synonyms":""},{"def":"coffee that can be made quickly and easily by adding hot water","examples":["Do you want some coffee? Is instant OK?"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]