[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/ins/insur/insurance__us_3.mp3","phonsUS":"/ɪnˈʃʊrəns/","level":"B2","meanings":[{"def":"an arrangement with a company in which you pay them regular amounts of money and they agree to pay the costs, for example, if you die or are ill, or if you lose or damage something","examples":["health/medical insurance","car/travel/unemployment insurance","Private insurance accounts for about 35 per cent of healthcare in the US.","to have/buy insurance","The bill would require employers to provide insurance for their workers.","All the stolen items were covered by insurance.","insurance against something to take out insurance against fire and theft","on the/your insurance Can you claim for the loss on your insurance?","You'll get everything back on the insurance.","an insurance policy","(British English) to have adequate insurance cover","(North American English) to have adequate insurance coverage","(British English) an insurance scheme","(North American English) an insurance plan","insurance costs/claims","insurance premiums (= the regular payments made for insurance)","Do you have fully comprehensive insurance?","Does your personal accident insurance cover mountain rescue?","Her insurance is with General Accident.","If you make more than two claims in any period of insurance you may lose your no claim bonus.","Many people are covered by employer-provided health insurance.","Millions of Americans lack adequate health insurance.","Millions of people in the US are not covered by health insurance.","More people are taking out insurance against the high cost of dental care.","The company maintains liability insurance for its directors and officers.","The contract requires me to arrange my own insurance.","The travel agent recommended that I take out travel insurance.","We claimed for the car repairs on the insurance.","a compulsory health insurance system","a monthly insurance premium","a personal insurance policy","compulsory insurance for personal injury to employees","insurance cover for bodily injury to third parties","rising insurance costs","universal health insurance"],"opposite":"","synonyms":""},{"def":"the business of providing people with insurance","examples":["an insurance broker/company","the insurance industry/business","in insurance He works in insurance.","She's in insurance."],"opposite":"","synonyms":""},{"def":"money paid by or to an insurance company","examples":["to pay insurance on your house","When her husband died, she received £50 000 in insurance.","The insurance will pay for the damage.","Motorists have received thousands in insurance because of dangerous potholes.","She set fire to her house and then claimed insurance.","He bought a new suit out of the insurance money.","I haven't paid the insurance yet this month."],"opposite":"","synonyms":""},{"def":"something you do to protect yourself against something bad happening in the future","examples":["At that time people had large families as an insurance against some children dying."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["insurance policy","life insurance","insurance adjuster","National Insurance","employment insurance","third-party insurance","Social Insurance number","Federal Deposit Insurance Corporation","Federal Insurance Contributions Act","insurance policies","European Health Insurance Card"]}]