[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/int/inter/interest__us_1_rr.mp3","phonsUS":"/ˈɪntrəst/","level":"A1","meanings":[{"def":"the feeling that you have when you want to know or learn more about somebody/something","examples":["Her research has generated interest around the world.","The case has attracted the interest of the public and media.","interest in something Do your parents take an interest in your friends?","By that time I had lost (all) interest in the idea.","Many people have contacted me expressing interest in the idea.","A small number of investors have shown an interest.","He showed a keen interest in music from his childhood.","They shared a common interest in horses.","interest in doing something I have no interest in seeing the movie.","with interest I watched with interest.","out of interest Just out of interest, how much did it cost?","As a matter of interest (= I'd like to know), what time did the party finish?","A sticker on a bag caught my interest.","A childhood trip to Europe sparked his lifelong interest in history.","Despite intensive publicity, Channel 4 failed to maintain interest in its expensive new show.","He showed a polite interest in her story.","He's never shown the slightest interest in football.","I'll watch the programme with added interest now I know you're in it.","I'm asking purely out of interest.","My cousin expressed an interest in seeing where I work.","She always had a great interest in the supernatural.","She feigned interest in a magazine article to avoid meeting the man's stare.","She took an active interest in their welfare.","The children's interest began to flag after half an hour of the lesson.","The event attracted a lot of media interest.","The film kept my interest throughout.","The government failed to drum up any public interest in the referendum.","The police were starting to take a close interest in the company's activities.","They listened with interest.","While in prison he developed an interest in art.","Why the sudden interest?","growing interest from younger members","to stimulate interest among teachers","Does she take an interest in your research?","He showed no more than a passing interest in the sport.","I told him about it but he showed no interest.","Several people expressed an interest in learning the game."],"opposite":"","synonyms":""},{"def":"the quality that something has when it attracts somebody’s attention or makes them want to know more about it","examples":["There are many places of interest near the city.","These plants will add interest to your garden in winter.","be of interest These documents are of great historical interest.","The area is a site of special scientific interest.","This is a story of national interest.","be of interest to somebody The subject is of no interest to me at all.","interest for somebody This museum holds particular interest for geologists.","His books have a special interest for me.","We met to discuss matters of common interest.","a building of great architectural interest","issues of compelling strategic interest","This information was of no immediate interest to me.","Their conversation held no interest for me.","The interest of the painting lies in its unusual use of colour.","The CD-ROM gives the book added interest.","Since the championship has already been decided, this game is of purely academic interest.","His books are of no interest to me at all.","Her comments are of particular interest to me.","There are many places of interest around Oxford."],"opposite":"","synonyms":""},{"def":"an activity or a subject that you enjoy and that you spend time doing or studying","examples":["Her main interests are music and tennis.","He was a man of wide interests outside his work.","My main research interest is herbal medicine.","In the end, she left the company to pursue other interests.","Her main interests are music and gardening.","His hobbies include swimming and cooking.","a game of cops and robbers","He was playing games with the dog.","Eating out is the national pastime in France.","He has many hobbies and outside interests.","He wanted time to pursue his many and varied musical interests."],"opposite":"","synonyms":"interest"},{"def":"the extra money that you pay back when you borrow money or that you receive when you invest money","examples":["interest on something to pay interest on a loan","with interest The money was repaid with interest.","interest charges/payments","Interest rates have risen by 1%.","high rates of interest","They're paying 16% interest on the loan.","The Gold Account pays monthly interest of 5.5%.","Find a bank that has very low interest charges on overdrafts.","a mortgage with a fixed rate of interest"],"opposite":"","synonyms":""},{"def":"a good result or an advantage for somebody/something","examples":["The union is working to protect the interests of its members.","to promote/defend somebody's interests","Tough talk doesn't always serve your interests.","I was voted in to represent the interests of my constituents.","You can't blame them for looking after their own interests.","in somebody's interest(s) She was acting entirely in her own interests.","These reforms were in the best interests of local government.","It is in the public interest that these facts are made known.","against somebody's interests The policy is clearly working against the interests of consumers.","It is crucial to our national interest to keep stability in the region.","Continuing such a policy is short-sighted and not in the interest of consumers.","It's not in your best interests to let your boss know you're looking for a new job.","He claimed to be acting in the public interest.","I feel it is in everyone's best interest if I step aside now.","He was obviously acting purely out of selfish interest.","The lawyer refused to act against his client's interests.","The union refused to support proposals that it saw as contrary to the interests of its members."],"opposite":"","synonyms":""},{"def":"a share in a business or company and its profits","examples":["She has business interests in France.","American interests in Europe (= money invested in European countries)"],"opposite":"","synonyms":""},{"def":"a connection with something that affects your attitude to it, especially because you may benefit from it in some way","examples":["I should, at this point, declare my interest.","interest in (doing) something Organizations have an interest in ensuring that employee motivation is high.","Lawyers have a direct financial interest in the outcome of the debate."],"opposite":"","synonyms":""},{"def":"a group of people who are in the same business or who share the same aims that they want to protect","examples":["powerful farming interests","relationships between local government and business interests"],"opposite":"","synonyms":""},{"def":"a situation in which somebody has two jobs, aims, roles, etc. and cannot treat both of them equally and fairly at the same time","examples":["There was a conflict of interest between his business dealings and his political activities.","One member of the planning committee had a conflict of interest as he lived near the proposed road.","There is often a conflict of interests between farmers and conservationists."],"opposite":"","synonyms":""},{"def":"to do the same thing to somebody as they have done to you, but with more force, enthusiasm, etc.","examples":[],"opposite":"","synonyms":""},{"def":"to want somebody to be happy and successful even though your actions may not show this","examples":["Although he was sometimes too strict with his children, he had their best interests at heart."],"opposite":"","synonyms":""},{"def":"in order to help or achieve something","examples":["New work practices were introduced in the interests of efficiency."],"opposite":"","synonyms":""},{"def":"a person who is believed to be involved in a crime, but who has not been arrested","examples":["Police have said they do have a person of interest in the case."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"conflict of interest(s)","def":"a situation in which somebody has two jobs, aims, roles, etc. and cannot treat both of them equally and fairly at the same time","examples":["There was a conflict of interest between his business dealings and his political activities.","One member of the planning committee had a conflict of interest as he lived near the proposed road.","There is often a conflict of interests between farmers and conservationists."]},{"idiom":"do something (back) with interest","def":"to do the same thing to somebody as they have done to you, but with more force, enthusiasm, etc.","examples":[]},{"idiom":"have somebody’s interests at heart","def":"to want somebody to be happy and successful even though your actions may not show this","examples":["Although he was sometimes too strict with his children, he had their best interests at heart."]},{"idiom":"in the interest(s) of something","def":"in order to help or achieve something","examples":["New work practices were introduced in the interests of efficiency."]},{"idiom":"person of interest","def":"a person who is believed to be involved in a crime, but who has not been arrested","examples":["Police have said they do have a person of interest in the case."]}],"phrasal":[],"related":["interest in","interest-free","love interest","self-interest","compound interest","human interest","interest group","simple interest","vested interest","controlling interest","special interest group","site of special scientific interest","special interest","special interest groups","sites of special scientific interest","retail price index excluding mortgage interest payments","interest somebody in something","conflict of interest(s)","pique somebody’s interest, curiosity, etc."]},{"pos":"verb","level":"A1","meanings":[{"def":"to attract your attention and make you feel interested; to make yourself give your attention to something","examples":["interest somebody Politics doesn't interest me.","The museum has something to interest everyone, young and old.","interest somebody/yourself in something She has always interested herself in charity work.","it interests somebody to do something It may interest you to know that Andy didn't accept the job.","It is this aspect of the work that really interests me.","She tried to interest the director in her plan.","She has always interested herself in helping younger musicians.","The topic interests me very much."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["interest in"],"related":[]}]