[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/int/inter/interrupt__us_1.mp3","phonsUS":"/ˌɪntəˈrʌpt/","level":"B2","meanings":[{"def":"to say or do something that makes somebody stop what they are saying or doing","examples":["Sorry to interrupt, but there's someone to see you.","interrupt with something Would you mind not interrupting with questions all the time?","interrupt somebody/something I hope I'm not interrupting you.","They were interrupted by a knock at the door.","interrupt somebody/something with something The President's speech was constantly interrrupted with boos and jeers.","interrupt + speech ‘I have a question,’ she interrupted.","interrupt somebody + speech ‘Just listen for a moment,’ he interrupted her angrily.","Sorry to interrupt, but I have to disagree with that.","Could I just say something here?","If I could, let me stop you there for a moment and go back to your previous point.","Actually, we seem to have strayed a bit from the topic. Can we go back to the first point?","Just a moment, Sue. Can we hear what Jack has to say on this?","May I interrupt you there? I don't think that's true.","I’m sorry, but we’re running short on time. Can you please summarize very quickly so we can finish up?","I appreciate your enthusiasm on this topic, but I’m afraid we have a couple more people to hear from.","Could you two please discuss that issue privately after the meeting? We have several more items to cover and need to move on at this point.","I’m sorry, I really have to stop you there. We've run out of time.","Let’s save that conversation for another time.","‘He's kidding,’ I interrupted hastily.","I didn't manage to finish the report. I kept getting interrupted.","I thought it better not to interrupt her with any comment.","I'm sorry to interrupt, but there's a telephone call for you.","It was all irrelevant, but I didn't dare interrupt him in mid-flow.","What was I saying, before we were so rudely interrupted?","‘What's his name?’ John interrupted.","Please stop interrupting all the time!","Sh! You're always interrupting me!","Sorry to interrupt your dinner."],"opposite":"","synonyms":""},{"def":"to stop something for a short time","examples":["The game was interrupted several times by rain.","We interrupt this programme to bring you an important news bulletin.","Transport services were constantly interrupted by air raids.","Their luncheon was brutally interrupted by gunfire.","The morning's work was constantly interrupted by phone calls."],"opposite":"","synonyms":""},{"def":"to stop a line, surface, view, etc. from being even or continuous","examples":["There were no other buildings to interrupt the view of the valley."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]