[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/int/inter/interpret__us_1.mp3","phonsUS":"/ɪnˈtɜːrprət/","level":"B2","meanings":[{"def":"to explain the meaning of something","examples":["The students were asked to interpret the poem.","The data can be interpreted in many different ways.","These results must be interpreted cautiously.","judges who will faithfully interpret the Constitution","These figures cannot be easily interpreted.","We all seek to interpret what we hear and what we read.","The figure of the Ancient Mariner has been variously interpreted."],"opposite":"","synonyms":""},{"def":"to decide that something has a particular meaning and to understand it in this way","examples":["interpret something as something I didn't know whether to interpret her silence as acceptance or refusal.","interpret something The research focused on how parents interpret the behaviour of their toddlers.","Different people might interpret events differently.","The title could be interpreted to mean ‘human intelligence’.","The term ‘business’ is here interpreted broadly to include all types of organization in the public and private sectors.","Her message was interpreted as a warning to the general.","Her resignation has been widely interpreted as an admission of her guilt.","The strictness of the rules, even when liberally interpreted, has the effect of restricting innovation.","It is context and convention that determine whether a term will be interpreted literally or metaphorically."],"opposite":"","synonyms":""},{"def":"to translate one language into another as it is spoken","examples":["He took me with him to interpret in case no one spoke English.","interpret for somebody She couldn't speak much English so her children had to interpret for her.","interpret something Interpreters must interpret everything that is said in the interaction."],"opposite":"","synonyms":""},{"def":"to perform a piece of music, a role in a play, etc. in a way that shows your feelings about its meaning","examples":["He interpreted the role with a lot of humour."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]