[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/int/inten/intention__us_2.mp3","phonsUS":"/ɪnˈtenʃn/","level":"B1","meanings":[{"def":"what you intend or plan to do; your aim","examples":["intention of doing something I have no intention of going to the wedding.","I have every intention of paying her back what I owe her.","with the intention of doing something He left England with the intention of travelling in Africa.","intention to do something He has announced his intention to retire.","The Prime Minister declared her intention to remain in office despite declining support.","The original intention was to devote three months to the project.","intention in doing something Her intentions in making this proposal are clear.","intention that… It was not my intention that she should suffer.","She's full of good intentions but they rarely work out.","I did it with the best (of) intentions (= meaning to help), but I only succeeded in annoying them.","Our campaign’s main purpose is to raise money.","She went to London with the aim of finding a job.","Our main aim is to increase sales in Europe.","I have no intention of going to the wedding.","She’s full of good intentions but they rarely work out.","There are no plans to build new offices.","What’s the point of all this violence?","The point of the lesson is to compare the two countries.","The whole idea of going was so that we could meet her new boyfriend.","What’s the idea behind this?","He didn't make his intentions clear in his letter.","His intention in inviting us to dinner was to persuade us to back his project.","I have no intention of changing jobs.","I went to the bank with the intention of getting some cash.","It was done with the best intentions, I assure you.","My original intention was to study all morning, but this turned out to be impractical.","She may never reveal her true intentions.","The council has announced its intention to crack down on parking offences.","The general intention behind the project is a good one.","The intention by the local authority to build 2 000 new houses is unrealistic.","The senator has announced his intention to run for the presidency.","We have every intention of winning the next election.","Such an interpretation of the Act seems to be contrary to the intention of Parliament."],"opposite":"","synonyms":"purpose"},{"def":"it is not enough to intend to do good things; you must actually do them","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the road to hell is paved with good intentions","def":"it is not enough to intend to do good things; you must actually do them","examples":[]}],"phrasal":[],"related":[]}]