[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/int/inter/interview__us_2.mp3","phonsUS":"/ˈɪntərvjuː/","level":"A1","meanings":[{"def":"a formal meeting at which somebody is asked questions to see if they are suitable for a particular job, or for a course of study at a college, university, etc.","examples":["a job interview","She's been called for (an) interview.","interview for something He has an interview next week for the manager's job.","interview with somebody/something (for something) I got an interview with a PR company for a trainee position.","in an interview In the interview they asked me about my future plans.","at an interview He came across very well at the interview.","He had an interview with IBM.","I have a job interview tomorrow.","Prepare answers to possible interview questions.","She's been called for an interview for the manager's job.","The company contacted her to arrange an interview.","The questions are the central point of the whole interview procedure and should be planned in advance.","We're about to start the second round of interviews for the post.","an interview for the post of sales manager","He's going for an interview at Birmingham University.","I was one of 20 people to get an interview after over 1 000 people applied.","She sounded like just what we were looking for, so we asked her for an interview.","She's been called for (an) interview."],"opposite":"","synonyms":""},{"def":"a meeting (often a public one) at which a journalist asks somebody questions in order to find out their opinions","examples":["a television/TV/radio/newspaper interview","to do/give an interview (= to agree to answer questions)","to conduct an interview (= to ask somebody questions in public)","The interview was published in all the papers.","in an interview Yesterday, in an interview on German television, the minister denied the reports.","interview with somebody an in-depth interview with the new governor","interview about something an exclusive interview about her new book","interview by somebody The film begins with an interview by two local student reporters.","a job interview","He confessed after four days under interrogation.","The Pope granted her a private audience.","This month we feature an interview with Nicole Kidman.","I once read an interview with her in a kids' magazine.","We have an exclusive interview with the director of the movie.","The documentary features extensive interviews with the four original members of the band.","He refused to discuss his divorce during an interview on the radio.","The documentary combines interview footage and clips from his films.","She taped an interview to appear the following day on ‘CBS Sunday Morning’.","I get a lot of interview requests from journalists.","He's a very private man and rarely does interviews.","He said in an interview that he wanted to get married.","He gave the paper an interview about his musical tastes.","He did a live interview on the CBC News Morning show.","an interview with the Vietnamese leader"],"opposite":"","synonyms":"interview"},{"def":"a private meeting between people when questions are asked and answered","examples":["a telephone/phone interview","interview with somebody She's had an interview with the careers adviser.","He gave a very full account in long interviews with experienced police officers.","Interviews and questionnaires are the most important tools in market research.","All police interviews are recorded and transcribed.","Telephone interviews with over 400 Scottish businesses picked up impressively high rates of satisfaction.","The survey team carried out over 200 interviews with retired people.","a police interview with suspected terrorists","an interview between the French foreign minister and the president of Egypt"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["exit interview"]},{"pos":"verb","level":"A1","meanings":[{"def":"to talk to somebody and ask them questions at a formal meeting to find out if they are suitable for a job, course of study, etc.","examples":["interview somebody The university interviews all potential candidates.","interview somebody for something Which post are you being interviewed for?","We interviewed ten people for the job.","The deadline for applications is 15 October and we will be interviewing early in November."],"opposite":"","synonyms":""},{"def":"to talk to somebody and answer questions at a formal meeting to get a job, a place on a course of study, etc.","examples":["The website gives you tips on interviewing for colleges.","If you don't interview well you are unlikely to get the job."],"opposite":"","synonyms":""},{"def":"to ask somebody questions about their life, opinions, etc., especially on the radio or television or for a newspaper or magazine","examples":["interview somebody about something Next week, I will be interviewing Spielberg about his latest movie.","interview somebody The prime minister declined to be interviewed.","interview somebody on something I heard him being interviewed on the news earlier."],"opposite":"","synonyms":""},{"def":"to ask somebody questions at a private meeting","examples":["interview somebody The police are waiting to interview the injured man.","interview somebody about something After 14 days, patients were interviewed about the recurrence of any symptoms."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]