[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/int/inter/internet__us_1.mp3","phonsUS":"/ˈɪntərnet/","level":"A1","meanings":[{"def":"an international computer network connecting other networks and computers that allows people to share information around the world","examples":["to surf/browse/access the internet","on the internet I looked it up on the internet.","She likes to go on the internet in the evenings.","via the internet We have kept in touch via the internet.","over the internet You can view the video feed over the internet.","All the rooms have access to the internet/internet access.","I couldn't get an internet connection.","internet users","an internet cafe (= a cafe where you pay to use a computer to access the internet)","The payment can be made through internet banking.","Attempts to regulate the internet are usually doomed to failure.","He likes watching movies, reading, and surfing the internet.","It is possible to earn a degree over the internet.","Many of the sites launched at the peak of the internet boom have now disappeared.","More and more people are shopping on the internet.","Registering an internet domain name is now an essential part of setting up a company.","She went on the internet to check air fares.","She often talks to fans via live internet chats.","The auction was held in Paris with an internet link to New York.","They began scouring the internet for information about his condition.","Thousands logged on to view the live internet broadcast of the concert.","Travellers can check their email at the internet cafe in the square.","a broadband/​high-speed internet connection","issues facing the music industry in the internet age","software for downloading internet files","the bank's internet arm","the challenges of providing internet connectivity to rural communities","the laying of fast networks to carry internet traffic"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["internet dating","internet of things","internet service provider","Internet Relay Chat","the internet of things","transmission control protocol/internet protocol"]}]