[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/int/inter/interesting__us_1_rr.mp3","phonsUS":"/ˈɪntrəstɪŋ/","level":"A1","meanings":[{"def":"attracting your attention because it is/they are special, exciting or unusual","examples":["The article raises several interesting questions.","The speaker made some interesting points.","The documentary explores some interesting ideas about addiction.","She sounds like a really interesting person.","Our survey produced some very interesting results.","He had a lot of interesting things to say.","it is interesting to do something It will be interesting to see what happens.","It is particularly interesting to compare the two versions.","It would be interesting to know what he really believed.","interesting (that)… I find it interesting that she claims not to know him.","it is interesting (that)… It is interesting that you mention that.","interesting about something What is interesting about the speech is how modern it sounds.","The project does sound interesting.","Some of the titles look interesting.","Then things started to get interesting.","She puts enough detail into the story to make it interesting.","Can't we do something more interesting?","Her account makes interesting reading.","That’s an interesting question, Daniel.","The exhibition tells the fascinating story of the steam age.","Her latest book makes compelling reading.","Thank you for a most stimulating discussion.","His books are always so gripping.","Chess can be an extremely absorbing game.","He is completely uninterested in politics.","I am not really interested in politics.","A solicitor can give you disinterested advice.","The food was dull and uninteresting.","I find her ideas really interesting.","It was always interesting to hear his stories.","It's not very interesting for visitors.","None of them had anything remotely interesting to say.","So far, my trip has proved interesting.","Some topics appeared interesting enough to require more detailed information.","This is a genuinely interesting article.","This subject is intrinsically interesting and worthy of study in its own right.","architecturally interesting buildings","You seem to know a lot of very interesting people."],"opposite":"","synonyms":"interesting"}],"idioms":[],"phrasal":[],"related":[]}]