[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/int/inter/interested__us_1_rr.mp3","phonsUS":"/ˈɪntrəstɪd/","level":"A1","meanings":[{"def":"giving your attention to something because you enjoy finding out about it or doing it; showing interest in something and finding it exciting","examples":["He sounded genuinely interested.","interested in something/somebody I'm very interested in history.","I'm not particularly interested in art.","interested in doing something Anyone interested in joining the club should contact us at the address below.","interested to do something We would be interested to hear your views on this subject.","an interested audience","She was watching with a politely interested expression on her face.","There's a talk on Italian art—are you interested (= would you like to go)?","He is completely uninterested in politics.","I am not really interested in politics.","A solicitor can give you disinterested advice.","The food was dull and uninteresting.","As a landowner, he was actively interested in agricultural improvements.","Ben must have been more than a little interested in the possibility to have pursued it so far.","Carrie was only half interested in the conversation.","Charles had long been interested in architecture.","He's not in the least bit interested in girls.","I am always interested in how differently people can look at the same event.","I wasn't interested enough in the argument to take sides one way or the other.","If he's seriously interested in applying for the job, he'll do it.","She got very interested in politics.","She's always been interested in other people.","We need to get more young people interested in the sport.","You need to keep your audience interested.","‘Why do you ask?’ ‘I'm just interested, that's all.’"],"opposite":"","synonyms":""},{"def":"in a position to gain from a situation or be affected by it","examples":["As an interested party, I was not allowed to vote.","Interested groups will be given three months to give their views on the new development.","There were representatives of all the interested parties at the public meeting."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["self-interested"]}]