[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/int/intel/intelligence__us_3.mp3","phonsUS":"/ɪnˈtelɪdʒəns/","level":"B1","meanings":[{"def":"the ability to learn, understand and think in a logical way about things; the ability to do this well","examples":["a person of high/average/low intelligence","He didn't even have the intelligence to call for an ambulance.","As a director, he tends to underestimate the intelligence of his audience.","Please don't insult my intelligence by lying to me.","At least he had the intelligence to turn off the gas.","This essay shows considerable intelligence.","I always thought of him as a man of limited intelligence.","Is it really possible to measure intelligence?","Most people of average intelligence would find this task quite difficult.","Perhaps I underestimated your intelligence.","Wakefulness in a baby is sometimes seen as a sign of intelligence.","You will not be expected to know a great deal but you will need to show your intelligence."],"opposite":"","synonyms":""},{"def":"secret information that is collected, for example about a foreign country, especially one that is an enemy; the people that collect this information","examples":["the head of military intelligence","the collection of foreign intelligence","the director of national intelligence","intelligence on somebody/something They hope to gather more intelligence on any further plots.","intelligence about somebody/something We've obtained secret intelligence about enemy plans.","intelligence from somebody/something The government had intelligence from several different sources.","intelligence agencies/services","an intelligence officer/official/agent","the intelligence community (= all the people that collect this information)","intelligence sources (= people who give this information)","intelligence reports","He works for the French intelligence service.","His unit was responsible for intelligence gathering in North Africa.","the use of human intelligence (= information collected by people) in foiling terrorist attacks","Military intelligence is gathered using sophisticated technology.","The FBI and the CIA need to share intelligence on terrorism.","Intelligence sources report that a terrorist attack is highly probable.","The two countries agreed to exchange intelligence information to fight against terrorism.","We have learned important lessons from the intelligence failures that preceded the terrorist attacks.","Congress created permanent intelligence committees in both houses."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["intelligence test","artificial intelligence","counter-intelligence","emotional intelligence","intelligence quotient","Central Intelligence Agency","Secret Intelligence Service","Canadian Security Intelligence Service","intelligence quotients","the Search for Extraterrestrial Intelligence Institute"]}]