[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/int/inter/intervene__us_1.mp3","phonsUS":"/ˌɪntərˈviːn/","level":"C1","meanings":[{"def":"to become involved in a situation in order to improve or help it","examples":["She might have been killed if the neighbours hadn't intervened.","intervene in something The President intervened personally in the crisis.","intervene between A and B She went over to intervene between the two men.","intervene against somebody They would not intervene against the rebels themselves.","intervene (with somebody) (on behalf of somebody) attempts to intervene with the authorities on the prisoners' behalf","intervene to do something They intervened to halt the attack.","Eventually, the army was forced to intervene.","Government often intervenes decisively in major professional issues in medicine.","Intervening militarily will not bring peace.","Local people feel strongly about the proposed development but are virtually powerless to intervene.","Nurses should be ready to intervene on behalf of their patients.","Our government has no right to intervene.","She was reluctant to intervene in what was essentially a private dispute.","The King intervened personally on behalf of the children.","The UN refused to intervene.","Teachers should learn when to intervene and when to let the students do the talking.","The EU refuses to intervene to control the trade."],"opposite":"","synonyms":""},{"def":"to interrupt somebody when they are speaking in order to say something","examples":["‘But,’ she intervened, ‘what about the others?’"],"opposite":"","synonyms":""},{"def":"to happen in a way that delays something or prevents it from happening","examples":["They were planning to get married and then the war intervened."],"opposite":"","synonyms":""},{"def":"to exist between two events or places","examples":["I saw nothing of her during the years that intervened."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]