[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/int/intro/introduction__us_2.mp3","phonsUS":"/ˌɪntrəˈdʌkʃn/","level":"A2","meanings":[{"def":"the first part of a book or speech that gives a general idea of what is to follow","examples":["a book with an excellent introduction and notes","introduction to something Can you write a brief introduction to the text?","introduction by somebody The English edition has an introduction by Herbert Read.","in an introduction His mother is mentioned in the introduction.","By way of introduction, let me give you the background to the story.","She wrote the introduction to his collected letters.","Her book features an introduction by French actress Catherine Deneuve.","Let's skip the introduction and get straight down to the facts."],"opposite":"","synonyms":""},{"def":"the act of making one person formally known to another or a group of others, in which you tell them the person's name","examples":["Introductions were made and the conversation started to flow.","Our speaker today needs no introduction (= is already well known).","introduction to somebody I was hoping to get an introduction to his good-looking colleague.","a letter of introduction (= a letter which tells somebody who you are, written by somebody who knows both you and the person reading the letter)","I can never remember names, so I don't like to make the introductions.","I never gave you a proper introduction to my friends."],"opposite":"","synonyms":""},{"def":"the act of bringing something into use or existence for the first time, or of bringing something to a place for the first time","examples":["introduction of something the introduction of new manufacturing methods","the introduction of compulsory military service","introduction of something to… the 1 000th anniversary of the introduction of Christianity to Russia","introduction of something into… We can now begin commercial introduction of the product into the United States.","the gradual introduction of modern farming methods into traditional societies","the accidental introduction of species into new environments","More liberal policies have facilitated the introduction of new technologies.","That year, IBM announced the introduction of its first personal computer.","The testing process delayed the introduction of the drug by at least a year.","The bug illustrated the need for new mobile phone features to be thoroughly tested and debugged before introduction."],"opposite":"","synonyms":""},{"def":"a thing that is brought into use or introduced to a place for the first time","examples":["The book lists plants suitable for the British flower garden, among them many new introductions."],"opposite":"","synonyms":""},{"def":"a person’s first experience of something","examples":["This album was my first introduction to modern jazz."],"opposite":"","synonyms":""},{"def":"a book or course for people beginning to study a subject","examples":["‘Global Politics: An Introduction’","introduction to something It's a useful introduction to an extremely complex subject.","‘An Introduction to Astronomy’","The course provides a brief introduction to philosophy.","He has written the best available introduction to Stravinsky's music.","If you are looking for a general introduction, this volume will be sufficient.","It serves as an excellent introduction to 19th-century painting.","This collection provides a comprehensive introduction to his ideas.","Together, these two books offer the best possible introduction to the sport."],"opposite":"","synonyms":""},{"def":"a short section at the beginning of a piece of music","examples":["an eight-bar introduction","After a lengthy musical introduction, the dancers finally appear."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]