[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/int/intro/introduce__us_2.mp3","phonsUS":"/ˌɪntrəˈduːs/","level":"A1","meanings":[{"def":"to tell two or more people who have not met before what each other’s names are; to tell somebody what your name is","examples":["introduce somebody Allow me to introduce my mother.","The lead singer introduced each member of the band.","introduce somebody as something He introduced me as a new member of the company.","introduce A to B He introduced me to a Greek girl at the party.","introduce A to B as something She was introduced to me as a well-known novelist.","introduce A and B Sue and Jo were introduced by a mutual friend.","We have met before, but we haven't been formally introduced.","introduce yourself Can I introduce myself? I'm Helen Robins.","The chairperson introduced herself and opened the discussion.","‘Kay, this is Steve.’ ‘Yes, I know—we've already introduced ourselves.’","introduce yourself to somebody She made sure she introduced herself to all her new colleagues.","Amy, do you know my friend Simon?","Have you two met? Jane, this is Matt.","Ted, this is Gwen—she's Porter's mother.","Can I introduce you to my colleague Professor Welsh?","No, I don't think we've met. I'm Harry.","Hello. Nice to meet you.","Hi. I'm Norman Miller.","Can I introduce my wife?","We've already been introduced.","I briefly introduced him to my parents.","She introduced me to her friends."],"opposite":"","synonyms":""},{"def":"to be the main speaker in a television or radio show, who gives details about the show and who presents the people who are in it; to tell the audience the name of the person who is going to speak or perform","examples":["The next programme will be introduced by Mary David.","It is my pleasure to introduce my first guest on the show tonight…"],"opposite":"","synonyms":""},{"def":"to mention something for the first time in a piece of writing","examples":["introduce something Introduce the topic and briefly state your own opinion.","Each new idea should be introduced in a new paragraph.","In Chapter 3 the author introduces the concept of the learner-centred classroom to readers."],"opposite":"","synonyms":""},{"def":"to make somebody learn about something or do something for the first time","examples":["introduce somebody to something The first lecture introduces students to the main topics of the course.","He was first introduced to drugs by his elder brother.","She has developed her love of archery since being introduced to the sport by a workmate.","introduce something to somebody It was she who first introduced the pleasures of sailing to me."],"opposite":"","synonyms":""},{"def":"to make something available for use, discussion, etc. for the first time","examples":["introduce something The company has recently introduced a new warehouse management system.","Legislation will be introduced to ensure free bus travel for all pensioners.","The new law was introduced in 2007.","Psychologists first introduced the term in the early 1990s.","to introduce measures/reforms","introduce something to something We are going to introduce a few changes to the system.","introduce something into something The government plans to gradually introduce the latest technology into all schools.","The company is introducing a new range of products this year.","The airline has introduced a cheap return fare to New York.","The local authority plans to introduce new regulations on parking.","The government has introduced tough new import restrictions.","The practice of community policing was introduced in the 1970s.","She attempted in vain to introduce some order into the classroom.","They recently introduced a yogurt drink into the market."],"opposite":"","synonyms":""},{"def":"to be the start of something new","examples":["Bands from London introduced the craze for this kind of music.","A slow theme introduces the first movement."],"opposite":"","synonyms":""},{"def":"to bring a plant, an animal or a disease to a place for the first time","examples":["introduce something (to something) (from something) Some new species were introduced accidentally to Australia from Europe.","Vegetation patterns changed when goats were introduced to the island.","introduce something into something Diseases were inadvertently introduced into the environment by settlers."],"opposite":"","synonyms":""},{"def":"to formally present a new law so that it can be discussed","examples":["to introduce a bill (before Parliament)"],"opposite":"","synonyms":""},{"def":"to put something into something","examples":["Particles of glass had been introduced into the baby food."],"opposite":"","synonyms":""},{"def":"to cause something to contain errors","examples":["introduce something Measurement error could have been introduced by respondents' recall errors.","introduce something into something The analyst's rankings rely on subjective information, which may introduce a bias into the rankings."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]