[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/inv/inves/investigation__us_3.mp3","phonsUS":"/ɪnˌvestɪˈɡeɪʃn/","level":"B2","meanings":[{"def":"an official examination of the facts about a situation, crime, etc.","examples":["a criminal/murder/police investigation","an accident investigation team","The president has promised a full investigation.","The authorities have launched an investigation to determine why the ferry sank.","under investigation (for something) She remains under investigation for fraud.","under investigation (for doing something) He is under investigation for assaulting a teenager.","investigation into something The police are conducting ongoing investigations into the man's death.","Officials are calling for an investigation into the incident.","on investigation On investigation, the noise turned out to be only a door banging.","pending an investigation He is suspended pending a thorough investigation (= until an investigation has happened) of the allegations.","The police have completed their investigations into the accident.","Chief Supt Brian Allwood has been leading the investigation.","She headed the investigations into the bribery allegations.","An official investigation concluded that 9 000 people were killed or went missing during that period.","The company confirmed that an internal investigation was under way.","He was on trial for allegedly obstructing an investigation into the bank's dealings.","Police are still pursuing their investigations.","The authorities conducted an extensive investigation into his tax affairs.","The board of directors commissioned its own internal investigation.","The ongoing investigation has led to numerous intelligence leads.","These claims certainly warrant further investigation.","He called for investigation into the hospital's management."],"opposite":"","synonyms":""},{"def":"a scientific or academic examination of the facts of a subject or problem","examples":["Further investigation revealed a flaw in this theory.","Refer patients with these symptoms for further investigation.","investigation into something the results of a preliminary investigation into stress at work"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["CSI: Crime Scene Investigation","Federal Bureau of Investigation","Criminal Investigation Department"]}]