[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/inv/inves/invest__us_1.mp3","phonsUS":"/ɪnˈvest/","level":"B1","meanings":[{"def":"to buy property, shares in a company, etc. in the hope of making a profit","examples":["Now is a good time to invest.","invest in something She advised us to invest in the property market.","invest something If you want to invest your money, you are probably better off with bonds.","invest something in something He invested his life savings in his daughter's business.","She personally invested $980 000 in the company.","Now is a good time to invest in the property market.","Her savings are invested with a building society.","If you invest directly in the stock market potential profits are greater, but so are potential losses.","We can invest your money tax-free abroad.","You need to think about investing for your retirement.","Most of her money is invested overseas.","Individual investors are more successful if they invest for the long term."],"opposite":"","synonyms":""},{"def":"to spend money on something in order to make it better or more successful","examples":["The company plans to invest still further.","invest in somebody/something The government has invested heavily in public transport.","The industry has failed to invest in new product development.","invest on something Tokyo instead invested on infrastructure.","invest something The rest of the required funds will be invested by the council.","invest something (in/on somebody/something) | invest something in somebody/something The college is to invest $2 million in a new conference hall.","invest something on somebody/something In his time managing the club he has invested millions on new players."],"opposite":"","synonyms":""},{"def":"to spend time, energy, effort, etc. on something that you think is good or useful","examples":["invest something in something She had invested all her adult life in the relationship.","invest something (in) doing something He had invested so much personal energy turning the company around.","invest something Are you willing to invest the time and effort necessary to make the scheme work?"],"opposite":"","synonyms":""},{"def":"to give somebody power or authority, especially as part of their job","examples":["invest somebody with something The new position invested her with a good deal of responsibility.","invest somebody (as something) The interview was broadcast on the same day he was invested as President."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["invest in","invest with"],"related":["invest in","invest with","invest in something","invest somebody/something with something"]}]