[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/inv/invit/invite__us_1.mp3","phonsUS":"/ɪnˈvaɪt/","level":"A2","meanings":[{"def":"to ask somebody to come to a social event","examples":["invite somebody to something Have you been invited to their party?","She very kindly invited me to lunch.","invite somebody I'd have liked to have gone but I wasn't invited.","My mother invited a few friends that she hadn't seen for 20 years.","invite somebody for something Let's invite them all for dinner.","invite somebody to do something They have invited me to go to Paris with them.","Would you like to come for a meal on Saturday?","There's a presentation of our new product at the conference on Tuesday. Would you be interested in coming along?","I'm going to the game on Saturday—how about joining me?","We're going to Boston—do you want to come with us?","That would be very nice, thank you.","I'd love to, thanks very much.","I'm sorry. I've already got something on at the weekend.","I'm sorry. I already have plans on Saturday.","(British English) Thank you, I'll check my diary and let you know.","(North American English) Thank you, I'll check my calendar and let you know."],"opposite":"","synonyms":""},{"def":"to ask somebody formally to go somewhere or do something; to make a formal or polite request for something","examples":["invite somebody The bishop invited representatives from all the parishes in the diocese.","invite somebody for something Successful candidates will be invited for interview next week.","invite somebody to something Clarke was not invited to the meeting.","invite something The ministry had invited tenders for the demolition of the buildings.","invite something from somebody He invited questions from the audience.","invite somebody to do something Readers are invited to email their comments to us.","He was invited to attend the Paris Peace Conference in 1919.","Audience members are invited to participate in the discussion.","In 1956 she was invited to join the Bolshoi Ballet as a soloist.","You are cordially invited to attend the annual parish meeting.","If he has any complaints to make, I invite him to do so."],"opposite":"","synonyms":""},{"def":"to make something, especially something bad or unpleasant, likely to happen","examples":["invite something Such comments are just inviting trouble.","invite somebody/something to do something Such harsh punishments invited prisoners to respond with defiance.","The film seems to invite comparison with ‘The Italian Job’.","The hype and fervour surrounding the event positively invited scepticism."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["invite along","invite around","invite back","invite in","invite over","invite round"],"related":["invite in","invite back","invite over","invite along","invite around","invite round","invite somebody round","invite somebody in","invite somebody along","invite somebody back","invite somebody over/around"]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/inv/invit/invite__us_2.mp3","phonsUS":"/ˈɪnvaɪt/","level":"","meanings":[{"def":"an invitation","examples":["Thanks for your invite."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]