[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/i/inv/invol/involved__us_1.mp3","phonsUS":"/ɪnˈvɑːlvd/","level":"B1","meanings":[{"def":"taking part in something; being part of something or connected with something","examples":["Some people tried to stop the fight but I didn't want to get involved.","It can be helpful to talk about your worries to someone who is not directly involved.","involved in something He became actively involved in politics.","How many vehicles were involved in the crash?","They were involved in a road accident.","involved with something Several people have been involved with the project from the beginning.","We'll make our decision and contact the people involved.","We need to examine all the costs involved in the project first.","The musicians became more involved in the design process.","She first became involved with the organization in 2008.","Fraud and ethics are subjects of great concern to everyone involved in business."],"opposite":"uninvolved","synonyms":""},{"def":"giving a lot of time or attention to somebody/something","examples":["involved (with something/somebody) She was deeply involved with the local hospital.","You're too emotionally involved with the situation.","You shouldn't allow yourself to become so heavily involved.","He's a very involved father (= he spends a lot of time with his children).","involved in something/somebody I was so involved in my book I didn't hear you knock."],"opposite":"uninvolved","synonyms":""},{"def":"having a close personal relationship with somebody","examples":["They're not romantically involved.","involved with somebody She became personally involved with her boss."],"opposite":"uninvolved","synonyms":""},{"def":"complicated and difficult to understand","examples":["an involved plot","It all seems extremely involved and complicated.","Avoid long, involved debates which could be just delaying tactics.","It's an involved process with hours of testing.","Just how does this rather involved system work?"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["self-involved"]}]