[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/j/joi/join_/join__us_1.mp3","phonsUS":"/dʒɔɪn/","level":"A1","meanings":[{"def":"to fix or connect two or more things together","examples":["join A to/onto B Join one section of pipe to the next.","The island is joined to the mainland by a bridge.","The head was not joined onto the body.","join A and B A central hallway joins the two halves of the house.","join A and B together Join the two sections of pipe together.","join (A and B) (up) Draw a line joining (up) all the crosses.","How do these two pieces join?","Join the two halves together with glue.","Join up the dots to make a picture."],"opposite":"","synonyms":""},{"def":"if two things or groups join, or if one thing or group joins another, they come together to form one thing or group","examples":["the place where the two paths join","join something The path joins the road near the trees.","join together Farmers can join together to get better prices.","join with somebody/something They have joined with six other groups to lobby the government to end child poverty."],"opposite":"","synonyms":""},{"def":"to become a member of an organization, a company, a club, etc.","examples":["I've joined an aerobics class.","to join a group/club/team/party","She joined the company three months ago.","He left school to join the army.","(figurative) to join the ranks of the unemployed","New members can join online.","It costs £20 to join.","Although a sympathizer, he never officially joined the party.","By this time people were flocking to join the cult.","Some were conscripted into the army and others joined voluntarily."],"opposite":"","synonyms":""},{"def":"to take part in something that somebody else is doing or to go somewhere with them","examples":["join somebody Do you mind if I join you?","join somebody for something Will you join us for lunch?","join somebody + adv./prep They've invited us to join them on their yacht.","He joined her downstairs a few minutes later.","join something Over 200 members of staff joined the strike.","Members of the public joined the search for the missing boy.","join somebody in doing something I'm sure you'll all join me in wishing Ted and Laura a very happy marriage.","He waved a fork in greeting. ‘Come and join us!’","She was now old enough to be allowed to join the adults.","Will you join me for a drink in the bar?","Thousands of people are expected to join the sponsored walk.","I would gladly join you in whatever plans you have for this evening.","Please will you all join with me in singing the national anthem."],"opposite":"","synonyms":""},{"def":"if you join a train, plane, etc. you get on it","examples":[],"opposite":"","synonyms":""},{"def":"if you join a road or a line of people, you start to travel along it, or move into it","examples":[],"opposite":"","synonyms":""},{"def":"if you cannot defeat somebody or be as successful as they are, then it is more sensible to join them in what they are doing and perhaps get some advantage for yourself by doing so","examples":[],"opposite":"","synonyms":""},{"def":"to begin fighting somebody","examples":["The two armies joined battle.","(figurative) Local residents have joined battle with the council over the lack of parking facilities."],"opposite":"","synonyms":""},{"def":"used when something bad that has happened to somebody else has also happened to you","examples":["So you didn't get a job either? Join the club!"],"opposite":"","synonyms":""},{"def":"to work together in order to achieve a shared aim","examples":["The two firms joined forces to win the contract.","The two companies have joined forces to form a new consortium."],"opposite":"","synonyms":""},{"def":"if two people join hands, they hold each other’s hands","examples":[],"opposite":"","synonyms":""},{"def":"to work together in doing something","examples":["Education has been reluctant to join hands with business."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"if you can’t beat them, join them","def":"if you cannot defeat somebody or be as successful as they are, then it is more sensible to join them in what they are doing and perhaps get some advantage for yourself by doing so","examples":[]},{"idiom":"join battle (with somebody)","def":"to begin fighting somebody","examples":["The two armies joined battle.","(figurative) Local residents have joined battle with the council over the lack of parking facilities."]},{"idiom":"join the club","def":"used when something bad that has happened to somebody else has also happened to you","examples":["So you didn't get a job either? Join the club!"]},{"idiom":"join/combine forces (with somebody)","def":"to work together in order to achieve a shared aim","examples":["The two firms joined forces to win the contract.","The two companies have joined forces to form a new consortium."]},{"idiom":"join hands (with somebody)","def":"if two people join hands, they hold each other’s hands","examples":["Education has been reluctant to join hands with business."]}],"phrasal":["join in","join up"],"related":["join in","join up","join up (with somebody)","join the club","join in (something) | join in (with somebody/something)","join in (doing something) | join in (with somebody/something)","join hands (with somebody)","join battle (with somebody)","if you can’t beat them, join them","join/combine forces (with somebody)"]},{"pos":"noun","level":"","meanings":[{"def":"a place where two things are fixed together","examples":["The two pieces were stuck together so well that you could hardly see the join."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]