[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/j/jou/journ/journey__us_1.mp3","phonsUS":"/ˈdʒɜːrni/","level":"A1","meanings":[{"def":"an act of travelling from one place to another, especially when they are far apart","examples":["They went on a long train journey across India.","to begin/continue/complete a journey","Many refugees made the journey alone.","Did you have a good journey?","the outward/return journey","We broke our journey (= stopped for a short time) in Madrid.","(British English) Don't use the car for short journeys.","It's a day's journey by car.","The average journey time is about 50 minutes.","on a journey She took her sister with her to keep her company on the journey.","journey from… Devizes is a two-hour journey from London.","journey to… It is unclear why he embarked on his final journey to Vienna.","(British English) I'm afraid you've had a wasted journey (= you cannot do what you have come to do).","(informal) Bye! Safe journey! (= used when somebody is beginning a journey)","a business trip","a five-minute trip by taxi","a long and difficult journey across the mountains","a tour of Bavaria","the first expedition to the South Pole","We went on an all-day excursion to the island.","The children were on a day’s outing from school.","We had a day out at the beach.","measures to cut the number of car journeys into the city","He is planning a journey through Europe this summer.","People were crammed onto ships for the dangerous journey across the Atlantic.","Dawn was breaking as we set out on the last leg of our journey.","Few people have made this journey and lived to tell the tale.","He made the emotional journey back to the house he grew up in.","He wrote a column chronicling his journeys around the Americas.","Her search took her on an incredible journey across the world.","The bus driver told us where to change buses for our onward journey.","The bus journey from London to Athens took 60 hours.","The journey continued in silence.","The journey takes about five hours.","They continued their journey on foot.","They doubted that he would survive the journey to the nearest hospital.","They were on a journey to the Far East.","This is the story of the first astronauts and their journey into the unknown."],"opposite":"","synonyms":"trip"},{"def":"a long and often difficult process of personal change and development","examples":["I was excited by the character's journey in the film.","journey (from something) (to something) The book describes a spiritual journey from despair to happiness."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Long Day's Journey into Night"]},{"pos":"verb","level":"","meanings":[{"def":"to travel, especially a long distance","examples":["They journeyed for seven long months.","Human beings have long desired to journey into space.","In 1834 they journeyed south, staying in Rome and Naples.","It's a chance to journey through one of America's last wildernesses."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]