[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/j/joy/joy__/joy__us_1.mp3","phonsUS":"/dʒɔɪ/","level":"B2","meanings":[{"def":"a feeling of great happiness","examples":["Her books have brought joy to millions.","joy of something the joy of discovery","joy of doing something the sheer joy of being with her again","with joy I almost wept with joy.","for joy I didn't expect them to jump for joy at the news (= to be very pleased).","I danced for joy when I found out I was pregnant.","Tears of joy were running down her cheeks.","to somebody's joy To his great joy, she accepted.","joy at something He spoke of his joy at the news.","joy at doing something his joy at scoring the winning goal","joy in something Their joy in life and enthusiasm for learning are infectious.","joy in doing something Her joy in playing the violin was obvious.","the pleasures and pains of everyday life","It’s been a pleasure meeting you.","the delights of living in the country","the joys and sorrows of childhood","It was a great privilege to hear her sing.","You’ve never been to this area before? Then you’re in for a real treat.","It was a great honour to be invited here today.","His childlike joy was infectious.","I could have shouted with joy.","I find joy in many kinds of music.","I took a fierce joy in telling them the truth.","Imagine our joy when we saw each other again.","Protesters expressed joy at the government's decision.","She found to her joy that the house had a large garden."],"opposite":"","synonyms":"pleasure"},{"def":"a person or thing that causes you to feel very happy","examples":["the joys of fatherhood","The game was a joy to watch.","Over the years we have shared our joys and sorrows.","The children's expressions were a joy to behold.","the physical joys of fine wines and gourmet foods"],"opposite":"","synonyms":""},{"def":"success or satisfaction","examples":["We complained about our rooms but got no joy from the manager.","‘Any joy at the shops?’ ‘No, they didn't have what I wanted.’"],"opposite":"","synonyms":""},{"def":"very cheerful","examples":[],"opposite":"","synonyms":""},{"def":"a person or thing that causes somebody to feel very pleased or satisfied","examples":["The car is her pride and joy.","He loves that boat, it's his pride and joy."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"full of the joys of spring","def":"very cheerful","examples":[]},{"idiom":"somebody’s pride and joy","def":"a person or thing that causes somebody to feel very pleased or satisfied","examples":["The car is her pride and joy.","He loves that boat, it's his pride and joy."]}],"phrasal":[],"related":["Joy Division","bundle of joy","joy of missing out"]}]