[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/j/jud/judge/judge__us_1.mp3","phonsUS":"/dʒʌdʒ/","level":"B1","meanings":[{"def":"a person in a court who has the authority to decide how criminals should be punished or to make legal decisions","examples":["a High Court judge","a federal/district judge","the presiding trial judge","to appoint a judge","before a judge The case comes before Judge Cooper next week.","He will appear before a judge tomorrow.","The judge sentenced him to five years in prison.","The judge ruled that the evidence was inadmissible.","A judge ordered her to be remanded in custody.","The judge in the case reminded the jury not to discuss the case outside the courtroom.","Appeals court judges overturned the previous ruling.","She has a reputation as a liberal, activist judge.","The judge awarded him damages of £20 000."],"opposite":"","synonyms":""},{"def":"a person who decides who has won a competition","examples":["The judges' decision is final.","She has joined the panel of judges in the popular TV talent show.","She was invited to be a judge in a cookery competition."],"opposite":"","synonyms":""},{"def":"a person who has the necessary knowledge or skills to give their opinion about the value or quality of somebody/something","examples":["She's a good judge of character.","He was a shrewd judge of people.","The last singer was the best—not that I'm any judge (= I do not know much about the subject).","‘I'm not sure that's a good way to do it.’ ‘Let me be the judge of that.’","She's usually a pretty shrewd judge of character.","You are the best judge of what your body needs."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Judge Judy","touch judge","Judge Dredd™","Jeffreys","Bean","don’t judge a book by its cover"]},{"pos":"verb","level":"B1","meanings":[{"def":"to form an opinion about somebody/something, based on the information you have","examples":["As far as I can judge, all of them are to blame.","judging by something Judging by her last email, they are having a wonderful time.","to judge from something To judge from what he said, he was very disappointed.","judge somebody/something You shouldn't judge her too harshly.","judge somebody/something on something Schools should not be judged only on exam results.","Each painting must be judged on its own merits.","judge somebody/something + noun The tour was judged a great success.","judge somebody/something to be/do something The concert was judged to have been a great success.","judge somebody/something + adj. They judged it wise to say nothing.","judge that… He judged that the risk was too great.","it is judged that… It was judged that the risk was too great.","judge how, what, etc… It was hard to judge how great the risk was.","‘There's something I haven't told you.’ She judged her words carefully.","Those who preach intolerance should be judged accordingly.","He sensed that she was judging him.","He was often judged solely on his looks.","Your slogan will be judged on its originality and style.","You always judge your own performance against that of others.","You will be judged by the work you have produced over the year.","I judged that he must be a very lonely man.","It's difficult to judge exactly how accurate the account is.","Readers are left to judge for themselves whether McCrombie is hero or villain.","It's not for me to judge whether he made the right decision."],"opposite":"","synonyms":""},{"def":"to guess the size, amount, etc. of something","examples":["judge something Young children are unable to judge the speed of traffic.","judge how, what, etc… It's difficult to judge how long the journey will take.","judge somebody/something to be/do something I judged him to be about 50.","I think I judged the distance wrongly.","The age of the furniture can be judged from the type of wood used.","It's difficult to judge how long the journey will take.","The bowler judged it well, timing the ball to perfection."],"opposite":"","synonyms":""},{"def":"to decide the result of a competition; to be the judge in a competition","examples":["judge something She was asked to judge the essay competition.","judge somebody/something + noun The first team to cross the line will be judged the winner.","judge somebody/something + adj Their garden was judged the best in Wales by a TV viewers' poll."],"opposite":"","synonyms":""},{"def":"to give your opinion about somebody, especially when you think they are bad","examples":["What gives you the right to judge other people?","I'm not one to judge, but that's no way to behave."],"opposite":"","synonyms":""},{"def":"to decide whether somebody is guilty or innocent in a court","examples":["judge something to judge a case","judge somebody + adj. to judge somebody guilty/not guilty"],"opposite":"","synonyms":""},{"def":"used to say that you should not form an opinion about somebody/something from their appearance only","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"don’t judge a book by its cover","def":"used to say that you should not form an opinion about somebody/something from their appearance only","examples":[]}],"phrasal":[],"related":[]}]