[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/j/jus/justi/justification__us_1.mp3","phonsUS":"/ˌdʒʌstɪfɪˈkeɪʃn/","level":"C1","meanings":[{"def":"a good reason why something exists or is done","examples":["justification for doing something I can see no possible justification for any further tax increases.","justification for something I could find no real justification for the proposed reorganization.","with (some) justification He was getting angry—and with some justification.","without justification She was arrested entirely without justification.","He said no but he didn’t give a reason.","The most likely explanation is that his plane was delayed.","She left the room abruptly without explanation.","You have no grounds for complaint.","On what basis will this decision be made?","Late again! What’s your excuse this time?","It gave me an excuse to take the car.","There seemed to be no motive for the murder.","I can see no possible justification for any further tax increases.","He left the party early on the pretext of having to work.","I can see some justification for her remarks.","She had not given him the slightest justification for thinking she was interested in him.","Such a step requires substantial justification to be accepted by the public.","There was no compelling justification for the invasion.","The government is struggling to find a justification for this war."],"opposite":"","synonyms":"reason"},{"def":"as an explanation of why something exists or why somebody has done something","examples":["All I can say in justification of her actions is that she was under a lot of pressure at work.","the argument which he put forward in justification"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in justification (of somebody/something)","def":"as an explanation of why something exists or why somebody has done something","examples":["All I can say in justification of her actions is that she was under a lot of pressure at work.","the argument which he put forward in justification"]}],"phrasal":[],"related":[]}]