[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/j/jus/justi/justify__us_2.mp3","phonsUS":"/ˈdʒʌstɪfaɪ/","level":"B2","meanings":[{"def":"to show that somebody/something is right or reasonable","examples":["justify doing something How can they justify paying such huge salaries?","justify somebody/something doing something The results of the inquiry did not justify them departing from their existing policy.","justify something Her success had justified the faith her teachers had put in her.","Can you really justify the destruction of such a fine old building?","The decision is justified on the grounds that there is no realistic alternative.","The events that followed served to justify our earlier decision.","The extra effort involved would go a long way in helping to justify their high price tags.","The meagre result hardly justified the risks they took to get it.","The university could not easily justify spending the money on this.","It would be difficult for an employer to justify dismissing someone on those grounds."],"opposite":"","synonyms":""},{"def":"to give an explanation or excuse for something or for doing something","examples":["justify something/yourself The senator made an attempt to justify his actions.","justify something/yourself to somebody The Prime Minister has been asked to justify the decision to Parliament.","You don't need to justify yourself to me.","justify doing something He sought to justify taking these measures by citing the threat of a terrorist attack.","justify somebody/something doing something The press release was intended to justify them sacking her.","He found it very difficult to justify his decision.","Can you justify that accusation?","How will you justify this pay cut to your employees?"],"opposite":"","synonyms":""},{"def":"to arrange lines of printed text so that one or both edges are straight","examples":[],"opposite":"","synonyms":""},{"def":"bad or unfair methods of doing something are acceptable if the result of that action is good or positive","examples":["He defended a morality in which the end justifies the means.","That's only OK if you believe that the end justifies the means."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the end justifies the means","def":"bad or unfair methods of doing something are acceptable if the result of that action is good or positive","examples":["He defended a morality in which the end justifies the means.","That's only OK if you believe that the end justifies the means."]}],"phrasal":[],"related":[]}]