[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/k/key/key__/key__us_1.mp3","phonsUS":"/kiː/","level":"A1","meanings":[{"def":"a piece of metal with a special shape used for locking a door, starting a car, etc.","examples":["to put/turn the key in the lock","He inserted the key in the lock and let himself into the house.","the car keys","a set/bunch of keys","key to something the spare key to the front door","We'll have a duplicate key cut (= made).","key for something Luckily Dad has keys for my house.","key for doing something There's a special key for winding up this clock.","She quietly turned the key in the lock.","Fresh eggs are a key ingredient for a tasty cake.","Customers have to key their PIN for amounts over £30.","The constant coming and going of ferries makes the quay a bustling place.","He fished a ring of keys out of his pocket.","I'd accidentally locked the keys in my car.","She hides a front door key in a flowerpot.","You need a key to open the garage.","The sound of keys jangling caught her attention.","They heard a key turn in the back door lock."],"opposite":"","synonyms":""},{"def":"a thing that makes you able to understand or achieve something","examples":["Persistence is the key if you want to get a job.","key to something The key to success is preparation.","First-time voters could hold the key to the election result.","key to doing something The driver of the car probably holds the key to solving the crime.","Language is the key to understanding those around you.","(especially North American English) The key is, how long can the federal government control the inflation rate?"],"opposite":"","synonyms":""},{"def":"any of the buttons that you press to operate a computer, phone or typewriter","examples":["Press the return key to enter the information.","You can use the arrow keys on the keyboard instead.","He began tapping on the keys of his laptop.","F1 is the short-cut key for calling up help.","Hold down the Alt key while pressing the arrow keys.","the top row of keys"],"opposite":"","synonyms":""},{"def":"any of the wooden or metal parts that you press to play a piano and some other musical instruments","examples":["His hands flew over the piano keys."],"opposite":"","synonyms":""},{"def":"a set of related notes, based on a particular note. Pieces of music are usually written mainly using a particular key.","examples":["a sonata in the key of E flat major","This piece changes key many times.","Can we try it in a lower key?","The key changes from C major to A minor.","What key is it in?"],"opposite":"","synonyms":""},{"def":"a set of answers to exercises or problems","examples":["Check your answers in the key at the back of the book."],"opposite":"","synonyms":""},{"def":"an explanation of the symbols used on a map or plan","examples":["You can find the symbols in the key at the bottom of the page."],"opposite":"","synonyms":""},{"def":"locked up safely somewhere; in prison","examples":["We keep our valuables under lock and key.","I will not rest until the murderer is under lock and key.","Prisoners are kept under lock and key 24 hours a day."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"(keep something/put something/be) under lock and key","def":"locked up safely somewhere; in prison","examples":["We keep our valuables under lock and key.","I will not rest until the murderer is under lock and key.","Prisoners are kept under lock and key 24 hours a day."]}],"phrasal":[],"related":["key to","Alt key","card key","hot key","key card","key grip","key ring","Key West","low-key","off-key","pass key","soft key","tab key","key light","Allen key™","key worker","master key"]},{"pos":"adjective","level":"A1","meanings":[{"def":"most important; essential","examples":["the key issue/factor/point","a key element/component/part/feature","He was a key figure in the campaign.","Both are key players in the peace process.","She played a key role in the dispute.","‘Caution’ is the key word in this situation.","His contribution could be key.","key to something Good communication is key to our success.","key to doing something Better training for our staff has been key to improving the service.","She quietly turned the key in the lock.","Fresh eggs are a key ingredient for a tasty cake.","Customers have to key their PIN for amounts over £30.","The constant coming and going of ferries makes the quay a bustling place.","Be careful crossing the main road.","The main thing is to remain calm.","He played a major role in setting up the system.","He was a key figure in the campaign.","The central issue is that of widespread racism.","The principal reason for this omission is lack of time.","Unemployment was the chief cause of poverty.","My prime concern is to protect my property.","The key issue here is taxation.","Attitude is a key concept in social psychology.","Our commitment to high quality standards is key to maintaining our reputation.","Speed is key at this point."],"opposite":"","synonyms":"main"}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"B1","meanings":[{"def":"to put information into a computer using a keyboard","examples":["key something I was busy keying data.","key something in Key in your password.","key something into something The information is then keyed into a computer.","She quietly turned the key in the lock.","Fresh eggs are a key ingredient for a tasty cake.","Customers have to key their PIN for amounts over £30.","The constant coming and going of ferries makes the quay a bustling place."],"opposite":"","synonyms":""},{"def":"to deliberately damage a car by scratching it with a key","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["key to"],"related":[]}]