[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/k/kno/know_/know__us_1.mp3","phonsUS":"/nəʊ/","level":"A1","meanings":[{"def":"to have information in your mind as a result of experience or because you have learned or been told it","examples":["know something No one knows the answer.","I need to know your name.","The truth about what happened is not yet known.","All I know is that she used to work in a bank (= I have no other information about her).","know (that)… I know (that) people’s handwriting changes as they get older.","We know from experience that turning a hobby into a business is not easy.","I know for a fact (that) he didn't go to the party.","‘There's no one in.’ ‘How do you know?’","‘You've got a flat tyre.’ ‘I know.’","‘What's the answer?’ ‘I don't know.’","As you know, Emma and I are old friends.","‘Isn’t that his car?’ ‘I wouldn’t know./How should I know?’ (= I don’t know and I am not the person you should ask.)","(informal) ‘What are you two whispering about?’ ‘You don't want to know’ (= because you would be shocked or wouldn't approve).","it is known that… It is widely known that CFCs can damage the ozone layer.","know where, who, etc… I knew where he was hiding.","No one knows for sure who did it.","know about something You know about Amanda's baby, don't you?","I don't know about you, but I'm ready for something to eat.","I know next to nothing (= know almost nothing) about opera.","know of somebody/something I know of someone who can help us.","‘Is anyone else coming?’ ‘Not that I know of.’","know to do something Does he know to come here (= that he should come here) first?","know somebody/something to be/do something We know her to be honest.","Strobe lights are known to cause seizures.","Who knows what the future will bring?","Breathe in through your nose and out through your mouth.","I really don't know.","I’m afraid I don't have the faintest idea.","Sorry, I have absolutely no idea.","Has anyone left a message? No, not to my knowledge/​not as far as I know.","Well, that’s a good question.","Yes, that’s an interesting point/​idea.","Well, let me see…","Let me think about that for a moment.","Could you tell me the best way to get to Paddington station, please?","Do you happen to know whether Amy Brown works here?","I wonder whether/​if you can help me. I'm trying to find out which number to call for reservations.","Do you know his address?","The cause of the fire is not yet known.","Two women are known to have died.","I didn't know what he was talking about.","I need to know what everyone thinks about this.","‘He's feeling really down.’ ‘ I know.’","He knows a lot about early music.","I don't know much about art.","I don't know for certain, but I think she lives in the next town.","I don't know of anyone who might be interested in the job.","I honestly don't know what they mean to do.","The properties of this substance are poorly known.","If you don't know how to fill in the forms, just ask."],"opposite":"","synonyms":""},{"def":"to realize, understand or be aware of something","examples":["know (that)… As soon as I walked in the room I knew (that) something was wrong.","She knew she was dying.","‘Martin was lying all the time.’ ‘I should have known.’","know what, how, etc… I knew perfectly well what she meant.","I know exactly how you feel.","know something This case is hopeless and he knows it (= although he will not admit it).","If only we'd known you were having so many problems!","You know very well what I'm talking about!","If I'd known beforehand how bad it would be, I wouldn't have gone.","I instantly knew what the call was about.","He knew instinctively where he would find her."],"opposite":"","synonyms":""},{"def":"to feel certain about something","examples":["know (that)… He knew (that) he could trust her.","I know it's here somewhere!","I know things will turn out all right.","I don't know that I can finish it by next week.","I just knew that it was something I wanted to do.","know (something) ‘You were right—someone's been spreading rumours about you.’ ‘I knew it!’","‘She's the worst player in the team.’ ‘Oh, I don't know (= I am not sure that I agree)—she played well yesterday.’","I knew you would say that!","This new piece is less traditional than her early work.","She knew deep down that she would never see him again.","He knew that he could trust her.","I just knew there would be problems."],"opposite":"","synonyms":""},{"def":"to be familiar with a person, place, thing, etc.","examples":["I've known David for 20 years.","Do you two know each other (= have you met before)?","She was a secretary when I first knew her.","She's very nice when you get to know her.","Knowing Ben, we could be waiting a long time (= it is typical of him to be late).","This man is known to the police (= as a criminal).","I don’t know anyone in Oxford.","I know Paris well.","Do you know the play (= have you seen or read it before)?","How many of your neighbours do you know by name?","The new rules could mean the end of football as we know it (= in the form that we are familiar with).","He knows this city better than anyone.","I don't know them personally.","I don't know John very well.","But I hardly know the woman!","I know several people who could help.","The product our consumers know and love will not change."],"opposite":"","synonyms":""},{"def":"to have learned a skill or language and be able to use it","examples":["know something Do you know any Japanese?","know how to do something Do you know how to use spreadsheets?"],"opposite":"","synonyms":""},{"def":"to think that somebody/something is a particular type of person or thing or has particular characteristics","examples":["be known as something He has become widely widely known as an expert in child psychology.","It's known as the most dangerous part of the city.","be known for something She is best known for her work on the human brain.","He is internationally known for his work with vaccines.","be known to be/do something He's known to be an outstanding physicist."],"opposite":"","synonyms":""},{"def":"to give somebody/something a particular name or title","examples":["be known as somebody/something Iran was formerly known as Persia.","The drug is commonly known as Ecstasy.","Peter Wilson, also known as ‘The Tiger’","be known as somebody/something to somebody He was known as Bonzo to his friends.","be known by something The country was not yet known by the name of England.","parts of the body known collectively as the sensory system","The drug is variously known as crack or freebase.","He has been known by many names in his long life."],"opposite":"","synonyms":""},{"def":"to be able to recognize somebody/something","examples":["I couldn't see who was speaking, but I knew the voice.","She knows a bargain when she sees one.","She was able to identify her attacker.","I recognized him as soon as he came in the room.","The victim has not yet been named.","I could just make out a figure in the darkness."],"opposite":"","synonyms":"identify"},{"def":"to understand the difference between one person or thing and another","examples":["I hope we have taught our children to know right from wrong."],"opposite":"","synonyms":""},{"def":"to have seen, heard or experienced something","examples":["know somebody/something (to) do something I’ve never known it (to) snow in July before.","be known to do something He has been known to spend all morning in the bathroom."],"opposite":"","synonyms":""},{"def":"to have personal experience of something","examples":["He has known both poverty and wealth.","She may be successful now, but she has known what it is like to be poor.","She thought she would never know the joy of seeing a child grow up in her care."],"opposite":"","synonyms":""},{"def":"used to say that you think you know, remember, understand, etc. something but you cannot be completely sure, especially because you do not know all the facts","examples":["As far as we knew, there was no cause for concern.","As far as I can see, you've done nothing wrong.","She lived in Chicago, as far as I can remember."],"opposite":"","synonyms":""},{"def":"very quickly or suddenly","examples":["We were whisked off in a taxi before we knew where we were."],"opposite":"","synonyms":""},{"def":"to have no way of realizing or being aware that you have done something wrong","examples":["‘I'm sorry, I called when you were in bed.’ ‘Don't worry—you weren't to know.’"],"opposite":"","synonyms":""},{"def":"used to say that it is easier and wiser to stay in a bad situation that you know and can deal with rather than change to a new situation that may be much worse","examples":[],"opposite":"","synonyms":""},{"def":"used to emphasize that you do not know something and that it is not important to you","examples":["She could be dead for all I know."],"opposite":"","synonyms":""},{"def":"used to emphasize that you do not know something","examples":["God knows what else they might find.","‘Where are they?’ ‘Goodness knows.’"],"opposite":"","synonyms":""},{"def":"used to emphasize the truth of what you are saying","examples":["She ought to pass the exam—goodness knows she's been working hard enough."],"opposite":"","synonyms":""},{"def":"to be confident that you know something, especially when you actually do not","examples":["He thinks he knows all the answers."],"opposite":"","synonyms":""},{"def":"to know something perfectly so that you can repeat it at any time without having to think about it","examples":["He had all the answers off pat."],"opposite":"","synonyms":""},{"def":"to be in poor condition","examples":["Our car has seen better days!"],"opposite":"","synonyms":""},{"def":"used to criticize somebody’s behaviour","examples":["I don't know how you can say things like that."],"opposite":"","synonyms":""},{"def":"used to tell somebody the true facts about a situation, especially when these are not known by other people","examples":["If the truth be known, I was afraid to tell anyone."],"opposite":"","synonyms":""},{"def":"used to agree with somebody or to show sympathy","examples":["‘What a ridiculous situation!’ ‘I know.’"],"opposite":"","synonyms":""},{"def":"used to introduce a new idea or suggestion","examples":["I know, let's see what's on at the theatre."],"opposite":"","synonyms":""},{"def":"used to criticize somebody by saying that they should realize or understand something","examples":["You know as well as I do that you're being unreasonable."],"opposite":"","synonyms":""},{"def":"to know somebody/something extremely well","examples":["She must know the play backwards by now."],"opposite":"","synonyms":""},{"def":"to know what should be done, etc. better than other people","examples":["The doctor told you to stay in bed, and she knows best."],"opposite":"","synonyms":""},{"def":"to be sensible enough not to do something","examples":["He knows better than to judge by appearances."],"opposite":"","synonyms":""},{"def":"to recognize somebody without knowing them well","examples":[],"opposite":"","synonyms":""},{"def":"to have information or evidence that the opposite is true","examples":["He says he doesn't care about what the critics write, but I know different."],"opposite":"","synonyms":""},{"def":"to be very aware of a fact and unable to deny or ignore it","examples":["He knew full well what she thought of it."],"opposite":"","synonyms":""},{"def":"to be very familiar with somebody/something","examples":["This is where I grew up. I know this area like the back of my hand."],"opposite":"","synonyms":""},{"def":"to have very clear and definite ideas about what you want to do","examples":[],"opposite":"","synonyms":""},{"def":"to know a lot about a particular subject or job","examples":[],"opposite":"","synonyms":""},{"def":"to know/tell somebody some useful, interesting or surprising information about somebody/something","examples":["She's been married five times, so she knows a thing or two about men!"],"opposite":"","synonyms":""},{"def":"to know something because of something unpleasant that has happened to you","examples":["He's a ruthless businessman, as I know to my cost."],"opposite":"","synonyms":""},{"def":"to be familiar with a place, subject, etc.","examples":[],"opposite":"","synonyms":""},{"def":"to have knowledge about something from your own experience","examples":["I’ve lived in China, so I know what I’m talking about."],"opposite":"","synonyms":""},{"def":"to know where you can get an advantage for yourself","examples":[],"opposite":"","synonyms":""},{"def":"to make sure that people are informed about something, especially by getting somebody else to tell them","examples":["The President has let it be known that he does not intend to run for election again."],"opposite":"","synonyms":""},{"def":"to tell somebody about something","examples":["I don't know if I can come, but I'll let you know tomorrow.","Let me know how I can help.","Please let me know if there's anything I can do to help."],"opposite":"","synonyms":""},{"def":"used to emphasize what you are saying","examples":["Lord knows, I tried to teach her."],"opposite":"","synonyms":""},{"def":"used to say that you do not know the answer to something","examples":["‘Why did she say that?’ ‘Lord knows!’"],"opposite":"","synonyms":""},{"def":"to introduce yourself to somebody","examples":["I made myself known to the hotel manager."],"opposite":"","synonyms":""},{"def":"to behave badly, usually because you have not been taught the correct way to behave","examples":["Don’t blame the children—they don’t know any better."],"opposite":"","synonyms":""},{"def":"to be very stupid; to have absolutely no skill","examples":[],"opposite":"","synonyms":""},{"def":"to know nothing about a subject","examples":["I don’t know beans about making movies."],"opposite":"","synonyms":""},{"def":"to know nothing at all about somebody/something","examples":["I’m afraid I don’t know the first thing about cars."],"opposite":"","synonyms":""},{"def":"to know nothing at all about something/somebody","examples":["We’ve lived next to him for years, but we still don’t know the first thing about him."],"opposite":"","synonyms":""},{"def":"to not know at all who somebody is","examples":[],"opposite":"","synonyms":""},{"def":"to be so surprised by something that you do not know how to react","examples":[],"opposite":"","synonyms":""},{"def":"to feel very embarrassed and not know how to react","examples":[],"opposite":"","synonyms":""},{"def":"to be so excited or confused that you cannot behave or think in a sensible way","examples":[],"opposite":"","synonyms":""},{"def":"to have an easy life without realizing how easy it is","examples":["You people without kids don't know you're born."],"opposite":"","synonyms":""},{"def":"to take no interest in something because you do not care about it or it is too much trouble","examples":["I've tried to ask her advice, but she doesn't want to know (= about my problems).","‘How much was it?’ ‘You don't want to know’ (= it is better if you don't know)."],"opposite":"","synonyms":""},{"def":"old enough to behave in a more sensible way than you actually did","examples":[],"opposite":"","synonyms":""},{"def":"to show somebody/know/learn how a particular job should be done","examples":[],"opposite":"","synonyms":""},{"def":"used to say that it is impossible to say what might happen","examples":["There's no knowing how he'll react."],"opposite":"","synonyms":""},{"def":"used to say that somebody knows nothing about the subject you are talking about","examples":["What does he know about football, anyway?"],"opposite":"","synonyms":""},{"def":"used to express surprise","examples":["Well, what do you know? Look who's here!"],"opposite":"","synonyms":""},{"def":"(know) what things are useful, important, etc.","examples":["She certainly knows what's what."],"opposite":"","synonyms":""},{"def":"used when you are thinking of what to say next","examples":["Well, you know, it's difficult to explain."],"opposite":"","synonyms":""},{"def":"used to show that what you are referring to is known or understood by the person you are speaking to","examples":["Guess who I've just seen? Maggie! You know—Jim's wife.","You know that restaurant round the corner? It's closed down."],"opposite":"","synonyms":""},{"def":"used to emphasize something that you are saying","examples":["I'm not stupid, you know."],"opposite":"","synonyms":""},{"def":"used to introduce an interesting or surprising opinion, piece of news, etc.","examples":["You know something? I've never really enjoyed Christmas."],"opposite":"","synonyms":""},{"def":"used to refer to somebody/something without mentioning a name","examples":[],"opposite":"","synonyms":""},{"def":"used to say that you can never be certain about what will happen in the future, especially when you are suggesting that something good might happen","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"as far as I know | as far as I can remember, see, tell, etc.","def":"used to say that you think you know, remember, understand, etc. something but you cannot be completely sure, especially because you do not know all the facts","examples":["As far as we knew, there was no cause for concern.","As far as I can see, you've done nothing wrong.","She lived in Chicago, as far as I can remember."]},{"idiom":"before you know where you are","def":"very quickly or suddenly","examples":["We were whisked off in a taxi before we knew where we were."]},{"idiom":"be not to know","def":"to have no way of realizing or being aware that you have done something wrong","examples":["‘I'm sorry, I called when you were in bed.’ ‘Don't worry—you weren't to know.’"]},{"idiom":"better the devil you know (than the devil you don’t)","def":"used to say that it is easier and wiser to stay in a bad situation that you know and can deal with rather than change to a new situation that may be much worse","examples":[]},{"idiom":"for all you, I, they, etc. know","def":"used to emphasize that you do not know something and that it is not important to you","examples":["She could be dead for all I know."]},{"idiom":"God/goodness/Heaven knows","def":"used to emphasize that you do not know something","examples":["God knows what else they might find.","‘Where are they?’ ‘Goodness knows.’","She ought to pass the exam—goodness knows she's been working hard enough."]},{"idiom":"have/know all the answers","def":"to be confident that you know something, especially when you actually do not","examples":["He thinks he knows all the answers."]},{"idiom":"have/know something off pat","def":"to know something perfectly so that you can repeat it at any time without having to think about it","examples":["He had all the answers off pat."]},{"idiom":"have seen/known better days","def":"to be in poor condition","examples":["Our car has seen better days!"]},{"idiom":"I don’t know how, why, etc…","def":"used to criticize somebody’s behaviour","examples":["I don't know how you can say things like that."]},{"idiom":"if (the) truth be known/told","def":"used to tell somebody the true facts about a situation, especially when these are not known by other people","examples":["If the truth be known, I was afraid to tell anyone."]},{"idiom":"I know","def":"used to agree with somebody or to show sympathy","examples":["‘What a ridiculous situation!’ ‘I know.’","I know, let's see what's on at the theatre."]},{"idiom":"know something as well as I do","def":"used to criticize somebody by saying that they should realize or understand something","examples":["You know as well as I do that you're being unreasonable."]},{"idiom":"know somebody/something backwards","def":"to know somebody/something extremely well","examples":["She must know the play backwards by now."]},{"idiom":"know best","def":"to know what should be done, etc. better than other people","examples":["The doctor told you to stay in bed, and she knows best."]},{"idiom":"know better (than that/than to do something)","def":"to be sensible enough not to do something","examples":["He knows better than to judge by appearances."]},{"idiom":"know somebody by sight","def":"to recognize somebody without knowing them well","examples":[]},{"idiom":"know different/otherwise","def":"to have information or evidence that the opposite is true","examples":["He says he doesn't care about what the critics write, but I know different."]},{"idiom":"know full well","def":"to be very aware of a fact and unable to deny or ignore it","examples":["He knew full well what she thought of it."]},{"idiom":"know somebody/something inside out | know somebody/something like the back of your hand","def":"to be very familiar with somebody/something","examples":["This is where I grew up. I know this area like the back of my hand."]},{"idiom":"know your own mind","def":"to have very clear and definite ideas about what you want to do","examples":[]},{"idiom":"know your stuff","def":"to know a lot about a particular subject or job","examples":[]},{"idiom":"know/tell somebody a thing or two (about somebody/something)","def":"to know/tell somebody some useful, interesting or surprising information about somebody/something","examples":["She's been married five times, so she knows a thing or two about men!"]},{"idiom":"know/learn/find something to your cost","def":"to know something because of something unpleasant that has happened to you","examples":["He's a ruthless businessman, as I know to my cost."]},{"idiom":"know your way around","def":"to be familiar with a place, subject, etc.","examples":[]},{"idiom":"know what you’re talking about","def":"to have knowledge about something from your own experience","examples":["I’ve lived in China, so I know what I’m talking about."]},{"idiom":"know which side your bread is buttered","def":"to know where you can get an advantage for yourself","examples":[]},{"idiom":"let it be known/make it known that…","def":"to make sure that people are informed about something, especially by getting somebody else to tell them","examples":["The President has let it be known that he does not intend to run for election again."]},{"idiom":"let somebody know","def":"to tell somebody about something","examples":["I don't know if I can come, but I'll let you know tomorrow.","Let me know how I can help.","Please let me know if there's anything I can do to help."]},{"idiom":"Lord knows…","def":"used to emphasize what you are saying","examples":["Lord knows, I tried to teach her."]},{"idiom":"Lord (only) knows (what, where, why, etc.)…","def":"used to say that you do not know the answer to something","examples":["‘Why did she say that?’ ‘Lord knows!’"]},{"idiom":"make yourself known to somebody","def":"to introduce yourself to somebody","examples":["I made myself known to the hotel manager."]},{"idiom":"not know any better","def":"to behave badly, usually because you have not been taught the correct way to behave","examples":["Don’t blame the children—they don’t know any better."]},{"idiom":"not know your arse from your elbow","def":"to be very stupid; to have absolutely no skill","examples":[]},{"idiom":"not know beans about something","def":"to know nothing about a subject","examples":["I don’t know beans about making movies."]},{"idiom":"not know the first thing about somebody/something","def":"to know nothing at all about somebody/something","examples":["I’m afraid I don’t know the first thing about cars."]},{"idiom":"not know, etc. the first thing about something/somebody","def":"to know nothing at all about something/somebody","examples":["We’ve lived next to him for years, but we still don’t know the first thing about him."]},{"idiom":"not know somebody from Adam","def":"to not know at all who somebody is","examples":[]},{"idiom":"not know what hit you","def":"to be so surprised by something that you do not know how to react","examples":[]},{"idiom":"not know where to look","def":"to feel very embarrassed and not know how to react","examples":[]},{"idiom":"not know whether you’re coming or going","def":"to be so excited or confused that you cannot behave or think in a sensible way","examples":[]},{"idiom":"not know you are born","def":"to have an easy life without realizing how easy it is","examples":["You people without kids don't know you're born."]},{"idiom":"not want to know (about something)","def":"to take no interest in something because you do not care about it or it is too much trouble","examples":["I've tried to ask her advice, but she doesn't want to know (= about my problems).","‘How much was it?’ ‘You don't want to know’ (= it is better if you don't know)."]},{"idiom":"old enough to know better","def":"old enough to behave in a more sensible way than you actually did","examples":[]},{"idiom":"show somebody/know/learn the ropes","def":"to show somebody/know/learn how a particular job should be done","examples":[]},{"idiom":"there’s no knowing","def":"used to say that it is impossible to say what might happen","examples":["There's no knowing how he'll react."]},{"idiom":"what does… know?","def":"used to say that somebody knows nothing about the subject you are talking about","examples":["What does he know about football, anyway?"]},{"idiom":"what do you know?","def":"used to express surprise","examples":["Well, what do you know? Look who's here!"]},{"idiom":"(know) what’s what","def":"(know) what things are useful, important, etc.","examples":["She certainly knows what's what."]},{"idiom":"you know","def":"used when you are thinking of what to say next","examples":["Well, you know, it's difficult to explain.","Guess who I've just seen? Maggie! You know—Jim's wife.","You know that restaurant round the corner? It's closed down.","I'm not stupid, you know."]},{"idiom":"you know something/what?","def":"used to introduce an interesting or surprising opinion, piece of news, etc.","examples":["You know something? I've never really enjoyed Christmas."]},{"idiom":"you know who/what","def":"used to refer to somebody/something without mentioning a name","examples":[]},{"idiom":"you never know","def":"used to say that you can never be certain about what will happen in the future, especially when you are suggesting that something good might happen","examples":[]}],"phrasal":[],"related":["know-all","know-how","don’t-know","know-it-all","need-to-know","you-know-what","you-know-who","Know-Nothing Party","know-alls","I don’t know","know-it-alls","you-know-whats","Know-Nothings","as far as I know","if you know what I mean","in the know","know different/otherwise"]},{"pos":"noun","level":"","meanings":[{"def":"having more information about something than most people","examples":["Somebody in the know told me he's going to resign."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in the know","def":"having more information about something than most people","examples":["Somebody in the know told me he's going to resign."]}],"phrasal":[],"related":[]}]