[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lab/label/label__us_4.mp3","phonsUS":"/ˈleɪbl/","level":"B1","meanings":[{"def":"a piece of paper, etc. that is attached to something and that gives information about it","examples":["Always read the label carefully.","price/address labels","on a label The washing instructions are on the label.","The washing instructions are on the label.","address labels","Everyone at the conference had to wear a name tag.","The label on the bottle listed the ingredients.","It doesn't have a price label on it.","She stuck labels on all the jars.","The care label says ‘dry-clean only’.","What does it say on the label?","This program produces address labels from your database."],"opposite":"","synonyms":"label"},{"def":"a word or phrase that is used to describe somebody/something in a way that seems too general, unfair or not correct","examples":["I hated the label ‘housewife’.","One sometimes feels that the label ‘classic’ is applied to any book that is dull.","Why do we need to attach a label to these feelings?","He was cruelly given the label ‘Mr Zero’ by the Press."],"opposite":"","synonyms":""},{"def":"the name or trademark of a fashion company","examples":["today's major fashion labels","She plans to launch her own designer clothes label.","He's really fashion-conscious and will only wear labels (= clothes with a designer label)."],"opposite":"","synonyms":""},{"def":"a company that produces and sells music, CDs, etc.","examples":["the Virgin record label","It's his first release for a major label.","The band is hoping to sign with a major label.","The record was produced under the Virgin label."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["off-label","own-label","care label","white label","designer label"]},{"pos":"verb","level":"B1","meanings":[{"def":"to fix a label on something or write information on something","examples":["label something Make sure that your luggage is clearly labelled.","label something with something We carefully labelled each item with the contents and the date.","label something + adj. The file was labelled ‘Private’.","Some of the plants were wrongly labelled.","The samples were all labelled with a date and place of origin.","a pile of small plastic bags, each carefully labelled/​labeled.","Every box needs to be labelled before it goes into storage."],"opposite":"","synonyms":""},{"def":"to describe somebody/something in a particular way, especially unfairly","examples":["label somebody/something (as) something He was labelled (as) a traitor by his former colleagues.","label somebody/something + adj. It is unfair to label a small baby naughty.","It would be easy to label the boys as troublemakers.","She had automatically labelled the boys as troublemakers.","She was falsely labelled/​labeled a liar.","She was wrongly labelled a liar."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]