[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lac/lack_/lack__us_1.mp3","phonsUS":"/læk/","level":"B1","meanings":[{"def":"the state of not having something or not having enough of something","examples":["lack of something a lack of understanding/knowledge","Passengers complained about the lack of information when flights were cancelled.","Her enthusiasm compensated for her apparent lack of experience.","He was suffering from a complete lack of confidence.","There was no lack of volunteers.","because of a lack of something The project was abandoned because of a total lack of support.","due to (a) lack of something He was released due to lack of evidence.","through lack of something The trip was cancelled through lack of interest.","despite the lack of something Fans of classic comedy should be happy with this disc, despite the lack of extras.","Money and the fear of its lack are present in many of his poems.","She showed a distinct lack of enthusiasm for the idea of becoming a mother.","I've lost those skills through lack of practice.","She thought she would collapse from lack of sleep.","The situation was worsened by lack of communication.","There is certainly no lack of interest in the subject.","There was a distinct lack of urgency in his manner.","a general lack of knowledge among the young","an abysmal lack of knowledge"],"opposite":"","synonyms":""},{"def":"used to say that although somebody has not succeeded in something, they have tried very hard","examples":["They haven't won a game yet, but it isn't for want of trying.","They lost the game, but not for lack of trying."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"not for want/lack of trying","def":"used to say that although somebody has not succeeded in something, they have tried very hard","examples":["They haven't won a game yet, but it isn't for want of trying.","They lost the game, but not for lack of trying."]}],"phrasal":[],"related":["lack (for) nothing","have/lack the courage of your convictions"]},{"pos":"verb","level":"B1","meanings":[{"def":"to have none or not enough of something","examples":["to lack confidence/experience/resources/power","The team lacked the skill to compete at the highest level.","She has the natural ability that her brother lacks.","He lacks confidence.","Some houses still lack basic amenities such as bathrooms.","He apparently lacked the desire to learn.","Her high-heeled shoes gave her the height she otherwise lacked.","His claim clearly lacked conviction.","His life seemed to lack direction.","Perhaps you simply lack the intelligence to realize just how serious this is?","She completely lacks confidence.","What they lack in talent, they make up for in conviction."],"opposite":"","synonyms":""},{"def":"to be/not be brave enough to do what you feel to be right","examples":["You need to have the courage of your convictions."],"opposite":"","synonyms":""},{"def":"to have everything that you need","examples":["As the only child of wealthy parents, he lacked for nothing."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"have/lack the courage of your convictions","def":"to be/not be brave enough to do what you feel to be right","examples":["You need to have the courage of your convictions."]},{"idiom":"lack (for) nothing","def":"to have everything that you need","examples":["As the only child of wealthy parents, he lacked for nothing."]}],"phrasal":[],"related":[]}]