[{"pos":"","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lak/lake_/lake_erie_1_us_4.mp3","phonsUS":"/ˌleɪk ˈɪri/","level":"","meanings":[{"def":"one of the Great Lakes on the border between the US and Canada, named after the Eriez, a native North American people. It has an area of 9 907 square miles/25 667 square kilometres. It is linked to Lake Huron and Lake Ontario. Cities on Lake Erie include Buffalo, Cleveland and Toledo.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lak/lake_/lake_huron_1_us_4.mp3","phonsUS":"/ˌleɪk ˈhjʊrɑːn/","level":"","meanings":[{"def":"the second largest of the Great Lakes on the border between the US and Canada. It is the fourth largest lake in the world. It covers 23 010 square miles/59 596 square kilometres with a length of 206 miles/332 kilometres and largest width of 183 miles/295 kilometres. Lake Huron separates the US state of Michigan and the Canadian province of Ontario. Its ports include Alpena and Port Huron.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lak/lake_/lake__us_1.mp3","phonsUS":"/leɪk/","level":"A2","meanings":[{"def":"a large area of water that is surrounded by land","examples":["in a lake We swam in the lake.","on a lake There were a number of boats on the lake.","We stayed in a hotel on the edge of Lake Ontario.","(figurative) a wine lake (= a large supply of wine that is not being used)","A ferry takes people across the lake.","Carp live in the lake.","She fell into the lake.","There is a cafe on the other side of the lake.","We had a holiday at Lake Como.","We spent a weekend at Lake Crystal.","We walked around the lake.","We went boating on the lake.","You should cross the lake before nightfall.","a cottage on the lake","a hill overlooking the lake","Do you want to go for a swim in the lake?","The trees around the lake were large and old."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lak/lake_/lake_michigan_1_us_3.mp3","phonsUS":"/ˌleɪk ˈmɪʃɪɡən/","level":"","meanings":[{"def":"one of the Great Lakes, and the only one completely in the US. It is also the largest lake of fresh water in the US, having an area of 22 300 square miles/57 757 square kilometres. It is linked to Lake Huron. The states around Lake Michigan are Michigan, Wisconsin, Illinois and Indiana. Cities on the lake include Chicago and Milwaukee. In 1997 oil was discovered under the lake.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lak/lake_/lake_ontario_1_us_3.mp3","phonsUS":"/ˌleɪk ɑːnˈteriəʊ/","level":"","meanings":[{"def":"the smallest and most eastern of the Great Lakes. It has an area of 7 340 square miles/19 011 square kilometres and is linked to Lake Erie by the Niagara River. Lake Ontario separates the state of New York from the Canadian province of Ontario. Cities on it include Toronto, Ontario, and Rochester, New York.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lak/lake_/lake_superior_1_us_1.mp3","phonsUS":"/ˌleɪk suːˈpɪriər/","level":"","meanings":[{"def":"the largest of the Great Lakes, and the world's largest lake of fresh water. Its area is 31 820 square miles/82 414 square kilometres. It is the most western of the Great Lakes and is connected to Lake Huron by the Sault Sainte Marie Canals. It is surrounded by the states of Michigan, Wisconsin and Minnesota and by Ontario in Canada. The main port is Duluth, Minnesota.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]