[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lan/land_/land__us_1.mp3","phonsUS":"/lænd/","level":"A1","meanings":[{"def":"the surface of the earth that is not sea","examples":["The new project will reclaim the land from the sea.","on land It was good to be back on land.","Some animals can live both on land and in water.","by land We travelled by land, though flying would have been cheaper.","It's impossible to reach this beach by land because of the high cliffs.","We can organize air transport, land transport and all accommodation for your trip.","She was sitting on the floor watching TV.","I found her lying on the ground.","The rocket crashed a few seconds after it left the ground.","It was good to be back on dry land again.","They fought both at sea and on land.","You could feel the earth shake as the truck came closer.","Plant the seedlings in damp soil.","The car wheels got stuck in the mud.","A cloud of dust rose as the truck set off.","The tiles are made of clay.","an area of rich, fertile land","Pack the dirt firmly around the plants.","The car got stuck in the muddy ground.","They drove across miles of rough, stony ground.","The elephant is the largest living land animal.","In the distance the crew sighted land.","The explorers reached land after a long voyage.","With the land forces defeated, everything now rested on the navy.","Antarctica is the only continent without a land mammal population.","At last we sighted land.","They fought both at sea and on land.","We travelled mainly by land."],"opposite":"","synonyms":"floor"},{"def":"an area of ground, especially of a particular type or used for a particular purpose","examples":["agricultural/arable/fertile land","Changes in land use can have significant effects on the local wildlife.","a piece/plot of land","They are not permitted to build on the surrounding green belt land (= open land around a city).","The land rose to the east.","Some of the country's richest grazing lands are in these valleys.","agricultural land","building lots","a parking lot","The kids were playing on waste ground near the school.","the site of an ancient burial ground","The city has plenty of open space.","the wide open spaces of the Canadian prairies","She bought a small plot of land to build a house.","a vegetable plot","The land was very dry and hard after the long, hot summer.","a piece of waste/​derelict land","Every scrap of land is used for growing food.","Good agricultural land is scarce.","The land has been cleared ready for building.","They finally got out of the town and reached open land.","a piece of land adjoining a disused railway line","animals grazing on marginal land that was previously heath or moorland","land that is rich in mineral deposits","prime building land","rich agricultural land","the clearing of forested areas to create pastures and arable land","It's an attractive village in the heart of the county's agricultural lands.","Sheep and goats can live quite happily on mountainous land like this.","The land is parched and no crops grow here.","The valley provides some rich grazing land for farmers.","There was a stretch of derelict land next to the railway.","an area of rich, fertile land"],"opposite":"","synonyms":"land"},{"def":"the area of ground that somebody owns, especially when you think of it as property that can be bought or sold","examples":["public/private land","to own/buy/purchase/sell land","He acquired a parcel of several acres of land.","The college owns vast tracts of land.","land ownership/acquisition","Land values in the area are falling.","During the war their lands were occupied by the enemy.","Ancient tribes were forced off their ancestral lands.","The adjoining plot of land belongs to the local council.","The price of land is rising rapidly.","conflicts over tribal lands","the tribe's ancestral lands","These remote tribal lands have been semi-autonomous for decades.","He owns 50 hectares of land in Scotland.","He was granted land by the king.","This used to be common land, where everyone had the right to graze animals.","The inhabitants of a village held land in common.","The wealthy colonists bought up vast tracts of land.","They own a small plot of land.","Everyone had the right to graze animals on communal land.","They were refused permission to develop the land."],"opposite":"","synonyms":""},{"def":"used to refer to the countryside and the way people live in the country as opposed to in cities","examples":["At the beginning of the 20th century almost a third of the population lived off the land (= grew or produced their own food).","Many people leave the land to find work in towns and cities.","Her family had farmed the land for generations.","She lives in the country.","an area of wooded country","This pattern of woods and fields is typical of the English landscape.","Many younger people are leaving the land to find work in the cities.","We stopped on the mountain pass to admire the scenery.","He's tired of living in cities, and wants to get back to the land.","His family had always worked the land.","It's very fertile countryside where you can just live off the land.","Almost a third of the population live off the land."],"opposite":"","synonyms":"country"},{"def":"used to refer to a country or region in a way that involves the emotions or the imagination","examples":["She longed to return to her native land.","They dreamed of travelling to foreign lands.","faraway lands beyond the sea","America is the land of freedom and opportunity.","the land of the fairies/elves/giants","He journeyed to many distant lands.","She was all alone in a strange land.","He found himself all alone in a strange land.","They dreamed of travelling to faraway lands."],"opposite":"","synonyms":""},{"def":"alive; not sleeping; no longer ill","examples":["I’m glad to see you’re back in the land of the living. We were worried about you.","By lunchtime I’d returned to the land of the living."],"opposite":"","synonyms":""},{"def":"sleeping","examples":["Pete and Jo were still in the land of Nod, so I went out for a walk in the morning sunshine."],"opposite":"","synonyms":""},{"def":"a place where life is pleasant and easy and people are very happy","examples":["He dreamed of emigrating to Canada—the land of milk and honey."],"opposite":"","synonyms":""},{"def":"the way the land in an area is formed and what physical characteristics it has","examples":["The castle was hidden by the lie of the land."],"opposite":"","synonyms":""},{"def":"the way a situation is now and how it is likely to develop","examples":["Check out the lie of the land before you make a decision."],"opposite":"","synonyms":""},{"def":"to have enough money to be able to afford expensive things, food, drink, etc.","examples":[],"opposite":"","synonyms":""},{"def":"to find out about a situation","examples":["Let's wait and see how the land lies before we do anything."],"opposite":"","synonyms":""},{"def":"to collect information before deciding what to do","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in the land of the living","def":"alive; not sleeping; no longer ill","examples":["I’m glad to see you’re back in the land of the living. We were worried about you.","By lunchtime I’d returned to the land of the living."]},{"idiom":"in the land of Nod","def":"sleeping","examples":["Pete and Jo were still in the land of Nod, so I went out for a walk in the morning sunshine."]},{"idiom":"the land of milk and honey","def":"a place where life is pleasant and easy and people are very happy","examples":["He dreamed of emigrating to Canada—the land of milk and honey."]},{"idiom":"the lie of the land","def":"the way the land in an area is formed and what physical characteristics it has","examples":["The castle was hidden by the lie of the land.","Check out the lie of the land before you make a decision."]},{"idiom":"live off the fat of the land","def":"to have enough money to be able to afford expensive things, food, drink, etc.","examples":[]},{"idiom":"see, etc. how the land lies","def":"to find out about a situation","examples":["Let's wait and see how the land lies before we do anything."]},{"idiom":"spy out the land","def":"to collect information before deciding what to do","examples":[]}],"phrasal":[],"related":["dry land","land in","land grab","land mass","land with","common land","crash-land","land agent","land-based","land bridge","land guard","land office","land reform","Land Rover™","land yacht","la-la land","land grabber","land grabbing","land registry"]},{"pos":"verb","level":"A2","meanings":[{"def":"to come down through the air onto the ground or another surface","examples":["The plane landed safely.","Both aircraft landed on the runway.","A fly landed on his nose.","The plane slowly came down to land.","The plane was forced to land in a nearby field.","A swan landed on the water."],"opposite":"","synonyms":""},{"def":"to control a plane and bring it down to the ground","examples":["The pilot landed the plane safely.","to land a helicopter/an aircraft","He landed the damaged aircraft in a field."],"opposite":"","synonyms":""},{"def":"to arrive somewhere in a plane or a boat","examples":["The flight is due to land at 3 o'clock.","We shall be landing shortly. Please fasten your seat belts.","The troops landed at dawn.","They were the first men to land on the moon.","We are due to land at Heathrow at 12.15.","Plymouth Rock is the place where the Pilgrim Fathers landed in 1620.","They were arrested on landing at Heathrow.","Troops landed on the island.","We were due to land at Gatwick."],"opposite":"","synonyms":""},{"def":"to put somebody/something on land from an aircraft, a boat, etc.","examples":["The troops were landed by helicopter."],"opposite":"","synonyms":""},{"def":"to come down somewhere after jumping, falling or being thrown","examples":["She fell and landed heavily on her back.","I landed awkwardly and twisted my ankle.","Several men were killed when rocket shells landed in the troop camp.","The heavy ball landed with a thud.","He came flying through the air and landed in a crumpled heap at my feet.","I fell and landed heavily at the bottom of the stairs.","A large stone landed right beside him.","The coin landed squarely between his feet.","A single snowflake drifted down and landed on the window sill.","He tensed himself for the jump and landed expertly on the other side."],"opposite":"","synonyms":""},{"def":"to arrive somewhere and cause difficulties that have to be dealt with","examples":["Why do complaints always land on my desk (= why do I always have to deal with them)?"],"opposite":"","synonyms":""},{"def":"to succeed in getting a job, etc., especially one that a lot of other people want","examples":["land something He's just landed a starring role in a Hollywood movie.","land somebody/yourself something She's just landed herself a company directorship."],"opposite":"","synonyms":""},{"def":"to catch a fish and bring it out of the water on to the land","examples":["It took me three attempts to land the fish."],"opposite":"","synonyms":""},{"def":"to score a penalty (4) or conversion (3)","examples":["Ceri Sweeney landed a penalty with the last kick of the half."],"opposite":"","synonyms":""},{"def":"to be lucky in finding yourself in a good situation, or in getting out of a difficult situation","examples":["You landed on your feet, getting such a well-paid job with so little experience.","Jim’s always getting himself in trouble, but he usually seems to fall on his feet."],"opposite":"","synonyms":""},{"def":"to succeed in hitting somebody/something","examples":["She landed a punch on his chin."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"fall/land on your feet","def":"to be lucky in finding yourself in a good situation, or in getting out of a difficult situation","examples":["You landed on your feet, getting such a well-paid job with so little experience.","Jim’s always getting himself in trouble, but he usually seems to fall on his feet."]},{"idiom":"land a blow, punch, etc.","def":"to succeed in hitting somebody/something","examples":["She landed a punch on his chin."]}],"phrasal":["land in","land up at","land up in","land up on","land up with","land with"],"related":[]}]