[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lan/lane_/lane__us_1.mp3","phonsUS":"/leɪn/","level":"B2","meanings":[{"def":"a narrow road in the country","examples":["winding country lanes","We drove along a muddy lane to reach the farmhouse.","The lane runs past the lake.","We cycled for miles along winding country lanes.","We drove down winding country lanes on the journey to York.","the lane leading to the village","A little lane winds down to the coast.","Cattle were being led along the lane.","I turned into the lane where I lived.","Outside the village we turned into a leafy lane leading to a farm.","The lane petered out in a muddy track.","They drove along the winding lanes.","They live in a cottage in Church Lane.","They used to go and pick blackberries along the lanes.","We left the car at the end of the lane.","We walked down the quiet country lane towards the riverbank."],"opposite":"","synonyms":""},{"def":"a city street","examples":["Park Lane","The quickest way is through the back lanes behind the bus station.","Lighting is poor in the back lanes of the city.","There is plenty to explore in the narrow winding lanes behind the cathedral.","The address is 53 Chancery Lane."],"opposite":"","synonyms":""},{"def":"a section of a wide road, that is marked by painted white lines, to keep lines of traffic separate","examples":["the inside/middle lane","the northbound/southbound lane","to change lanes","She signalled and pulled over into the slow lane.","a four-lane highway","Commuters can expect lane closures for a while longer.","Get in lane early when approaching a junction.","I hate changing lanes on the motorway.","I hate changing lanes when the traffic is heavy.","Lane closures are causing hold-ups on the M6 near junction 2.","The bus was crawling along in the slow lane."],"opposite":"","synonyms":""},{"def":"a narrow marked section of a track or a swimming pool that is used by one person, for example when taking part in a race","examples":["The Australian in lane four is coming up fast from behind.","Obi, the record holder, is in lane 3."],"opposite":"","synonyms":""},{"def":"a route used by ships or aircraft on regular journeys","examples":["one of the world’s busiest shipping/sea lanes"],"opposite":"","synonyms":""},{"def":"(in tenpin bowling) a narrow section of floor along which the ball is bowled","examples":["a 20-lane bowling alley"],"opposite":"","synonyms":""},{"def":"where things are most exciting and where a lot is happening","examples":["He had a good job, plenty of money and he was enjoying life in the fast lane."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in the fast lane","def":"where things are most exciting and where a lot is happening","examples":["He had a good job, plenty of money and he was enjoying life in the fast lane."]}],"phrasal":[],"related":["air lane","bus lane","Gin Lane","HOV lane","sea lane","bike lane","fast lane","Park Lane","slow lane","cycle lane","Drury Lane","Lane","memory lane","bicycle lane","express lane","outside lane","passing lane","breakdown lane","Petticoat Lane","White Hart Lane"]}]