[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lau/launc/launch__us_1.mp3","phonsUS":"/lɔːntʃ/","level":"B2","meanings":[{"def":"to start an activity, especially an organized one","examples":["The government recently launched a national road safety campaign.","Police have launched an investigation into the incident.","to launch an appeal/initiative","Government forces launched an attack against militants in the north of the country.","to launch an offensive/air strike","The TV celebrities helped launch an anti-drugs campaign.","The appeal was officially launched last month.","A German firm launched a takeover bid for the company.","A massive attack was launched in the spring of 1918.","Enemy troops launched an assault on the town.","Police have launched a murder enquiry.","The Duchess of Cornwall, president of the charity, will launch the appeal in London.","The authorities launched a massive security operation in the city.","The charity tonight launched its crusade against homelessness.","The company launched a huge advertising campaign.","The government has launched a new policy initiative.","The police immediately launched a nationwide search for the killer.","We're going to launch a big recruitment drive in the autumn."],"opposite":"","synonyms":""},{"def":"to make a product or service available to the public for the first time; to become available for the first time","examples":["The company plans to launch the service to coincide with the World Cup this summer.","The updated website will be officially launched at the conference in April.","The new series launches in July.","a party to launch his latest novel","The new model will be launched in July.","The book was launched amid a fanfare of publicity."],"opposite":"","synonyms":""},{"def":"to put a ship or boat into the water, especially one that has just been built","examples":["The Navy is to launch a new warship today.","The lifeboat was launched immediately."],"opposite":"","synonyms":""},{"def":"to send something such as a spacecraft, weapon, etc. into space, into the sky or through water","examples":["to launch a missile/rocket","The satellite was successfully launched into orbit earlier this month.","to launch a communications satellite","The ship was hit by three torpedoes launched from the enemy submarine."],"opposite":"","synonyms":""},{"def":"to criticize somebody/something or protest strongly","examples":["He launched a biting attack on the senior management.","Residents have launched a protest against the proposed development."],"opposite":"","synonyms":""},{"def":"to jump forwards with a lot of force","examples":["Without warning he launched himself at me.","(figurative) She launched herself on the rock world with a brilliant album."],"opposite":"","synonyms":""},{"def":"to start a computer program; (of a computer program) to start","examples":["You can launch programs and documents from your keyboard.","It’s not the fastest way to launch an application.","I was impressed with how fast the app launches."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["launch into","launch out","launch yourself into"],"related":["launch into","launch out","launch pad","soft launch","soft-launch","launch yourself into","launch pads","launch into something | launch yourself into something"]},{"pos":"noun","level":"B2","meanings":[{"def":"the action of launching something","examples":["a missile/rocket launch","In the six months since its launch the car has sold extremely well.","the launch of the campaign/website/service","the successful launch of the Ariane rocket","The official launch date is in May.","The official product launch was scheduled for 2021.","The commercial launch was the end of 2019.","The show is timed to coincide with the launch of a new book on the subject.","They are preparing for the launch of the new campaign next month.","a big Hollywood event to mark the launch of the movie","a spring launch for the new TV system","the postponement of the scheduled launch on July 7"],"opposite":"","synonyms":""},{"def":"an event at which something is made available to the public for the first time","examples":["a book/product launch","Speaking at the launch of her new book, she thanked her family for their support.","About 50 artists attended the official launch of the exhibition."],"opposite":"","synonyms":""},{"def":"a large boat with a motor","examples":["one of the world's largest ocean-going launch platforms"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]