[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lay/lay__/lay__us_1.mp3","phonsUS":"/leɪ/","level":"B1","meanings":[{"def":"to put somebody/something in a particular position, especially when it is done gently or carefully","examples":["lay somebody/something + adv./prep. He laid a hand on my arm.","Relatives laid wreaths on the grave.","She laid the baby down gently on the bed.","Red roses were laid at the memorial.","She noticed some paintings laid against the far wall.","The horse laid back its ears.","lay something His mother visited the murder scene yesterday to lay flowers.","lay somebody/something + adj. The cloth should be laid flat.","She was lying on the beach.","She was laying on the beach.","Why don't you lie on the bed?","Why don’t you lay on the bed?","She had lain there all night.","She had laid there all night.","If you're tired, go and have a lie down.","Go and have a lay down.","He laid the clothes neatly on his bed.","She laid the child tenderly on the bed."],"opposite":"","synonyms":""},{"def":"to spread something on something; to cover something with a layer of something","examples":["lay A on/over B Before they started they laid newspaper on the floor.","The grapes were laid to dry on racks.","They carefully laid a blanket over the body.","B is laid with A The floor was laid with newspaper."],"opposite":"","synonyms":""},{"def":"to put something down, especially on the floor, ready to be used","examples":["to lay a carpet/cable/pipe","to lay tiles/bricks","The first high-speed track was laid between Paris and Lyons.","Thirteen U-boats left their base to lay mines in British waters.","The foundations of the house are being laid today.","(figurative) A series of short-term goals lays the foundation for long-term success.","(figurative) They had laid the groundwork for future development."],"opposite":"","synonyms":""},{"def":"if a bird, an insect, a fish, etc. lays eggs, it produces them from its body","examples":["The cuckoo lays its eggs in other birds' nests.","new-laid eggs","The hens are not laying well (= not producing many eggs)."],"opposite":"","synonyms":""},{"def":"to arrange knives, forks, plates, etc. on a table ready for a meal","examples":["to lay the table"],"opposite":"","synonyms":""},{"def":"to present a proposal, some information, etc. to somebody for them to think about and decide on","examples":["The bill was laid before Parliament."],"opposite":"","synonyms":""},{"def":"to put somebody/something in a particular position or state, especially a difficult or unpleasant one","examples":["to lay a responsibility/burden on somebody","to lay somebody under an obligation to do something","Failing to act now will merely lay the burden on future generations."],"opposite":"","synonyms":""},{"def":"used with a noun to form a phrase that has the same meaning as the verb related to the noun","examples":["to lay the blame on somebody (= to blame somebody)","Our teacher lays great stress on good spelling (= stresses it strongly).","She laid the blame for the crisis at the Prime Minister's door.","He laid stress on the importance of cooperation."],"opposite":"","synonyms":""},{"def":"to prepare something in detail","examples":["Little did he know they had laid a trap for him.","She began to lay her plans for her escape.","Bad weather can upset even the best-laid plans."],"opposite":"","synonyms":""},{"def":"to have sex with somebody","examples":["He went out hoping to get laid that night."],"opposite":"","synonyms":""},{"def":"to prepare a fire by arranging wood, sticks or coal","examples":[],"opposite":"","synonyms":""},{"def":"to bet money on something; to place a bet","examples":["lay something to lay a bet","lay something on something She had laid $100 on the favourite.","I think he’ll come, but I wouldn’t lay money on it.","lay (somebody) something (that)… I’ll lay you any money you like (that) he won’t come."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["lay about","lay about you","lay aside","lay down","lay in","lay into","lay off","lay on","lay out","lay over","lay up"],"related":["lay-by","lay in","lay on","lay up","lay-up","lay down","lay into","lay off","lay-off","lay out","lay over","lay about","lay aside","Frito-Lay™","lay about you","lay-bys","lay-ups"]},{"pos":"adjective","level":"","meanings":[{"def":"not having expert knowledge or professional qualifications in a particular subject","examples":["His book explains the theory for the lay public."],"opposite":"","synonyms":""},{"def":"not in an official position in the Church","examples":["a lay preacher"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"","meanings":[{"def":"a partner in sex, especially a woman","examples":["to be a great lay"],"opposite":"","synonyms":""},{"def":"a poem that was written to be sung, usually telling a story","examples":[],"opposite":"","synonyms":""},{"def":"the way the land in an area is formed and what physical characteristics it has","examples":["The castle was hidden by the lay of the land."],"opposite":"","synonyms":""},{"def":"the way a situation is now and how it is likely to develop","examples":["Check out the lay of the land before you make a decision."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the lay of the land","def":"the way the land in an area is formed and what physical characteristics it has","examples":["The castle was hidden by the lay of the land.","Check out the lay of the land before you make a decision."]}],"phrasal":[],"related":[]}]