[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lay/layer/layer__us_4.mp3","phonsUS":"/ˈleɪər/","level":"B1","meanings":[{"def":"a quantity or sheet of something that lies over a surface or between surfaces","examples":["layer (of something) A thin layer of dust covered everything.","Ducks have a thick layer of fat to keep them warm.","How many layers of clothing are you wearing?","Sunlight thickens the outer layer of the skin.","in layers The paint is applied in layers.","Beneath the surface layer of the skin are several further layers.","Everything was covered with a fine layer of dust.","He paints a base coat, allows it to dry, and then adds layers of paint.","Mulch with a generous layer of peat or compost.","The body had been covered with a thin layer of soil.","The building is constructed in layers.","The product is made from a single layer of plastic.","The recipe calls for alternating layers of meat sauce and pasta.","The remains lay buried under layer upon layer of black earth.","They put on thick hats and extra layers of clothing.","Use enough gravel to form a layer about 50mm thick.","We're flying just below a cloud layer at 33 000 feet.","a protective layer of black plastic","the upper layers of the earth's atmosphere","Brush each layer of filo pastry with melted butter.","The channel became silted up with layer upon layer of sludge.","The dessert is chocolate mousse between layers of coffee and chocolate sponge.","This provides the waterproof top layer of the roof."],"opposite":"","synonyms":""},{"def":"a level or part within a system or set of ideas","examples":["There were too many layers of management in the company.","the layers of meaning in the poem","You've got to fight your way through layer upon layer of bureaucracy.","It was claimed that the reforms would add layers to the EU's political structure.","I decided to peel back the layers of this story.","a layer of bureaucracy","multiple layers of meaning"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["layer up","layer cake","ozone layer","layer cakes"]},{"pos":"verb","level":"","meanings":[{"def":"to arrange something in layers","examples":["Layer the potatoes and onions in a dish.","The meat and potatoes are layered in a shallow dish."],"opposite":"","synonyms":""},{"def":"to cut hair in layers of different lengths","examples":["be layered Her hair had been layered."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["layer up"],"related":[]}]