[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lea/leade/leadership__us_1.mp3","phonsUS":"/ˈliːdərʃɪp/","level":"B2","meanings":[{"def":"the state or position of being a leader","examples":["a leadership role/position","a leadership contest","the battle for the party leadership","Who will take over the leadership of the club?","under somebody's leadership The party thrived under his leadership.","Leadership in science is moving east.","She withstood several challenges to her leadership.","The school has flourished under the leadership of Mr Buxton.","When Smith died, Blair took over the leadership of the party.","her method of asserting personal leadership","the opportunity to strengthen our market leadership","The media are bound to play a huge role in this leadership campaign."],"opposite":"","synonyms":""},{"def":"the ability to be a leader or the qualities a good leader should have","examples":["Strong leadership is needed to captain the team.","Many in the party have criticized his lack of leadership.","leadership qualities/skills","In his resignation speech he condemned her leadership style.","leadership in something They called on the United State to show greater leadership in the fight against international terrorism.","leadership in doing something She criticized the industrialized nations for failing to provide leadership in tackling climate change.","He lacks leadership qualities.","He was praised for his firm leadership.","It's a crisis that requires strong leadership.","The movement is deeply divided and lacks clear leadership.","In the crisis he showed real leadership.","The philosophy of the company is that leadership development cannot start early enough.","What is really needed is clear leadership from the president.","Political leadership needs a particular combination of skills.","He played an important role in providing political leadership for the working class.","Several opponents have accused her of an authoritarian style of leadership.","The board is extremely weak and has not taken leadership.","There is a leadership vacuum in the party."],"opposite":"","synonyms":""},{"def":"a group of leaders of a particular organization, etc.","examples":["The party leadership is/are divided.","the Communist/​East German/​military leadership","There have been disagreements within the leadership of the union.","There are reported to have been power struggles amongst the hard-line military leadership.","The announcement was welcomed by the ANC leadership.","He has once again voiced his criticism of the Football Association's leadership.","the army's senior leadership","the hard work of staff and the leadership team"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["thought leadership","Southern Christian Leadership Conference"]}]