[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lea/lead_/lead__us_1.mp3","phonsUS":"/liːd/","level":"A2","meanings":[{"def":"to go with or in front of a person or an animal to show the way or to make them go in the right direction","examples":["If you lead, I'll follow.","lead somebody/something + adv./prep. He led us out into the grounds.","The receptionist led the way to the boardroom.","She led the horse back into the stable.","The robbers led police on a high-speed chase through the city.","(figurative) I tried to lead the discussion back to the main issue.","It’s too far to walk—I’ll take you by car.","Firefighters led the survivors to safety.","The president arrived, escorted by twelve bodyguards.","My mother drove us to the airport.","The attendant showed us to our seats.","He always walked her home.","Have you walked the dog yet today?","She guided us through the busy streets.","We were guided around the museums.","She ushered her guests to their seats.","A young woman directed them to the station.","‘Lead on!’ said Arnold.","Firefighters led the survivors to safety.","You lead the way and we'll follow.","Five people helping to lead a convoy of aid are feared dead.","Let me lead the way.","She led them along a dark corridor to a small room."],"opposite":"","synonyms":"take"},{"def":"to connect one object or place to another","examples":["lead from something to something steps leading from the kitchen to the cellar","lead from something Disconnect the pipe leading from the top of the water tank.","lead to something The wire led to a speaker."],"opposite":"","synonyms":""},{"def":"to go in a particular direction or to a particular place","examples":["+ adv./prep. A path led down the hill.","The road led away from the house directly to the lake.","Which door leads to the yard?","The corridor led into a spacious living room.","lead somebody + adv./prep. The track led us through a wood.","Copper piping replaced the use of lead.","The staircase led to a secret passageway.","a path leading from the village to the old church","An old track led back through the wood.","The glass doors lead out onto a rooftop garden.","The gardens lead directly onto a beach.","(figurative) Discussion of a client's tax affairs will lead naturally into consideration of investment options."],"opposite":"","synonyms":""},{"def":"to have something as a result","examples":["The carbon tax will inevitably lead to an increase in energy bills.","the events that eventually led to war","The fire ant's painful sting can ultimately lead to death for some people.","Eating too much sugar can lead to health problems.","A reward was offered for information leading to an arrest.","Childhood obesity can cause/lead to long-term health problems.","Changes in lifestyle and diet over the last twenty years have caused/led to/resulted in a sharp increase in childhood obesity.","Several factors, including changes in diet and lifestyle, have contributed to the increase in childhood obesity.","Research suggests that fast food and soft drinks directly contribute to childhood obesity.","Genetics, lifestyle and diet are all important factors in cases of childhood obesity.","Even small changes in lifestyle and diet can bring about significant weight loss.","Business success does not automatically lead to financial success.","These measures in turn led to an increased opportunity for independent music production.","Worrying about your weight is more likely to lead to low self-esteem.","The use of soft drugs does not necessarily lead to a progression to hard drugs.","Such actions would most likely lead to the decline of rural communities.","Sugar and fat can easily lead to obesity.","Industrialization inevitably led to the expansion of the urban working class."],"opposite":"","synonyms":""},{"def":"to be the reason why somebody does or thinks something","examples":["lead somebody (to something) What led you to this conclusion?","He's too easily led (= easily persuaded to do or think something).","lead somebody to do something Circumstances eventually led her to train as a doctor.","The situation is far worse than we had been led to believe.","Some children are easily led.","This has led scientists to speculate on the existence of other galaxies.","What we found leads us to suspect that more people may be involved."],"opposite":"","synonyms":""},{"def":"to be in control of something; to be the leader of something","examples":["to lead a team/group","to lead an expedition/a discussion","Inspector Sam Roland is leading the investigation.","Who will lead the party in the next election?","The campaign for the ban was led by Greenpeace.","A good manager leads by example (= shows people how to behave by behaving in that way themselves).","The project is run by a team of experts led by Andrew Hall.","He led the first expedition to the North Pole.","Detective Inspector Adrian Eakins, who is leading the hunt for the killer, has called a press conference."],"opposite":"","synonyms":""},{"def":"to be the best at something; to be in first place","examples":["lead (somebody/something) (in something) The department led the world in cancer research.","We lead the way in space technology.","lead (somebody/something) by something The champion is leading (her nearest rival) by 18 seconds.","The firm's solid construction standards still lead the field.","He led the race for eight laps until his engine blew."],"opposite":"","synonyms":""},{"def":"to have a particular type of life","examples":["We lead a very quiet life.","to lead a life of luxury/a miserable existence","I tried to lead as normal a life as possible."],"opposite":"","synonyms":""},{"def":"to cause a process to start","examples":["The recent economic recovery was almost entirely led by exports."],"opposite":"","synonyms":""},{"def":"to play first; to play something as your first card","examples":["It's your turn to lead.","lead something to lead the ten of clubs"],"opposite":"","synonyms":""},{"def":"a situation in which people with almost no experience or knowledge give advice to others who also have no experience or knowledge","examples":[],"opposite":"","synonyms":""},{"def":"to make somebody go in the wrong direction or do things that are wrong","examples":["Jack's parents thought the other boys might lead him astray."],"opposite":"","synonyms":""},{"def":"to make somebody do everything you want; to control somebody completely","examples":[],"opposite":"","synonyms":""},{"def":"to be the first to make the effort to do something new","examples":["Denmark, Norway and Sweden are united in leading the charge to a cash-free economy."],"opposite":"","synonyms":""},{"def":"to cause somebody a lot of trouble or worry","examples":[],"opposite":"","synonyms":""},{"def":"to take an active part in what you are telling or persuading others to do","examples":[],"opposite":"","synonyms":""},{"def":"to live a happy and comfortable life with no problems or responsibilities","examples":["The two crooks had been living the life of Riley.","He planned to retire early and then lead the life of Riley."],"opposite":"","synonyms":""},{"def":"to have no successful result for somebody","examples":["This discussion is leading us nowhere.","Often there are discoveries which lead nowhere."],"opposite":"","synonyms":""},{"def":"to make somebody believe something that is not true","examples":[],"opposite":"","synonyms":""},{"def":"used to suggest that the way one event or action leads to others is so obvious that it does not need to be stated","examples":["He offered me a ride home one night, and, well, one thing led to another and now we're married!"],"opposite":"","synonyms":""},{"def":"you can give somebody the opportunity to do something, but you cannot force them to do it if they do not want to","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the blind leading the blind","def":"a situation in which people with almost no experience or knowledge give advice to others who also have no experience or knowledge","examples":[]},{"idiom":"lead somebody astray","def":"to make somebody go in the wrong direction or do things that are wrong","examples":["Jack's parents thought the other boys might lead him astray."]},{"idiom":"lead somebody by the nose","def":"to make somebody do everything you want; to control somebody completely","examples":[]},{"idiom":"lead the charge","def":"to be the first to make the effort to do something new","examples":["Denmark, Norway and Sweden are united in leading the charge to a cash-free economy."]},{"idiom":"lead somebody a (merry) dance","def":"to cause somebody a lot of trouble or worry","examples":[]},{"idiom":"lead from the front","def":"to take an active part in what you are telling or persuading others to do","examples":[]},{"idiom":"lead/live the life of Riley","def":"to live a happy and comfortable life with no problems or responsibilities","examples":["The two crooks had been living the life of Riley.","He planned to retire early and then lead the life of Riley."]},{"idiom":"lead (somebody) nowhere","def":"to have no successful result for somebody","examples":["This discussion is leading us nowhere.","Often there are discoveries which lead nowhere."]},{"idiom":"lead somebody up/down the garden path","def":"to make somebody believe something that is not true","examples":[]},{"idiom":"one thing leads to another","def":"used to suggest that the way one event or action leads to others is so obvious that it does not need to be stated","examples":["He offered me a ride home one night, and, well, one thing led to another and now we're married!"]},{"idiom":"you can lead/take a horse to water, but you can’t make it drink","def":"you can give somebody the opportunity to do something, but you cannot force them to do it if they do not want to","examples":[]}],"phrasal":["lead off","lead on","lead up to","lead with"],"related":[]},{"pos":"noun","level":"B1","meanings":[{"def":"the position ahead of everyone else in a race or competition","examples":["She took the lead in the second lap.","to hold (onto)/regain the lead","in the lead The Democrats now appear to be in the lead.","into the lead He has gone into the lead.","The lead car is now three minutes ahead of the rest of the field.","That game puts her back into the lead.","They regained the lead with only a few minutes left to play.","We were struggling to stay in the lead."],"opposite":"","synonyms":""},{"def":"the amount or distance that somebody/something is in front of somebody/something else","examples":["a commanding/comfortable lead","to extend/stretch/double/increase your lead","lead of something Labour have taken a lead of five points in the polls.","lead (of something) over somebody/something He managed to hold a lead of two seconds over his closest rival.","An own goal from United gave Chelsea an early two-goal lead in the 11th minute.","The polls have given Labour a five-point lead.","Manchester lost their early two-goal lead.","They took an early lead.","They took a 3–0 lead in the first leg of the semi-final.","The yacht quickly established a one-mile lead over the nearest rival.","This win gives the team a two-point lead over their closest rival.","He had opened up a small lead over his opponent.","The team has now built up a commanding lead.","She has a narrow lead over the other runners.","Opinion polls showed him with a solid lead over his rivals.","Houston increased their lead to 13–7","Sheffield increased their lead just before half time.","He gradually extended his lead in the second half of the race to win by 49 seconds."],"opposite":"","synonyms":""},{"def":"an example or action for people to copy","examples":["If one bank raises interest rates, all the others will follow their lead.","If we take the lead in this (= start to act), others may follow.","You go first, I'll take my lead from you.","Sixth- formers are seen to give the lead to younger students.","Intellectuals took the lead in criticism of the government.","The country is yearning for a firm moral lead.","The report did not provide a clear lead for the improvement of training.","The government should give a lead in tackling racism.","We should follow their lead in banning chemical weapons.","corporations that have chosen to take the lead on the privacy issue"],"opposite":"","synonyms":""},{"def":"a piece of information that may help to find out the truth or facts about a situation, especially a crime","examples":["The police will follow up all possible leads.","leads on the murderer's identity","They have several solid leads in their investigation.","The police are following every possible lead.","Some promising leads are already emerging.","It turned out to be a false lead.","He said that he has a lead as to where Dylan may be.","Did you find any leads when you searched it?"],"opposite":"","synonyms":""},{"def":"a person or thing that may be useful to you, especially a possible new customer or business opportunity","examples":["The marketing campaign generated hundreds of new leads."],"opposite":"","synonyms":""},{"def":"the main part in a play, film, etc.; the person who plays this part","examples":["Who is playing the lead?","the male/female lead","Both Christine and Fiona want the lead role.","I always dreamed of becoming the lead singer in a band.","He played lead guitar on a number of tracks.","the band's lead guitarist","Who is playing the lead?","She sings lead on four tracks.","Her big break came when she was chosen to play the lead in a Broadway musical."],"opposite":"","synonyms":""},{"def":"the person in charge of a project, department, etc.","examples":["Sam is the lead on this project.","Dr Mary Steadman, clinical lead in Accident and Emergency at the Royal Berkshire Hospital","Sarah Montague will become the lead presenter of the show from next month."],"opposite":"","synonyms":""},{"def":"the first sentence or paragraph of a news story, giving the most important points of the story","examples":["Check out this lead from Monday's front page story:…"],"opposite":"","synonyms":""},{"def":"a long piece of leather, chain or rope used for holding and controlling a dog","examples":["on a lead Dogs must be kept on a lead in the park.","Let the dog off the lead.","We have to keep him on a tight lead when there are other dogs around.","Give your dog a period of exercise off the lead."],"opposite":"","synonyms":""},{"def":"a long piece of wire, usually covered in plastic, that is used to connect a piece of electrical equipment to a source of electricity","examples":[],"opposite":"","synonyms":""},{"def":"to give the most important point of a news story near the end instead of at the beginning","examples":["Unfortunately, he buried the lede in the last paragraph of the story."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"bury the lede/lead","def":"to give the most important point of a news story near the end instead of at the beginning","examples":["Unfortunately, he buried the lede in the last paragraph of the story."]}],"phrasal":[],"related":[]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lea/lead_/lead__us_2.mp3","phonsUS":"/led/","level":"","meanings":[{"def":"a chemical element. Lead is a heavy, soft grey metal, used especially in the past for water pipes or to cover roofs.","examples":["Lead exposure can be harmful to everyone, especially young children and babies.","Copper piping replaced the use of lead.","The staircase led to a secret passageway."],"opposite":"","synonyms":""},{"def":"the thin black part of a pencil that marks paper","examples":[],"opposite":"","synonyms":""},{"def":"to be very unsuccessful; to not be accepted by people","examples":["My suggestion went down like a lead balloon."],"opposite":"","synonyms":""},{"def":"to pretend to be ill when in fact you are not, especially to avoid work","examples":["I don't think there's anything wrong with her—she's just swinging the lead."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"go down like a lead balloon","def":"to be very unsuccessful; to not be accepted by people","examples":["My suggestion went down like a lead balloon."]},{"idiom":"swing the lead","def":"to pretend to be ill when in fact you are not, especially to avoid work","examples":["I don't think there's anything wrong with her—she's just swinging the lead."]}],"phrasal":[],"related":[]}]