[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lea/leagu/league__us_1.mp3","phonsUS":"/liːɡ/","level":"B2","meanings":[{"def":"a group of sports teams who all play each other to earn points and find which team is best","examples":["Castleford have led the league for most of the season.","We must do better if we are to win the league again this season.","a league match/game","They missed an opportunity to clinch the league title at the weekend.","The league leaders scored 3 goals in the last five minutes.","United were league champions last season.","in a league the best team in the league","Their 3–0 win was enough to put them at the top of the league.","Bristol were at the bottom of the league.","He played Sunday League cricket for years.","He set a league record for the longest touchdown run.","Hopefully he'll get called up to the big leagues soon.","The Yankees dominated the league in 1998.","The team joined the Northern League last year.","They want to start a new football league.","They're hoping to improve their position in the league.","new proposals for a European super league","the first women's professional athletic league in the US","the standard for professional sports leagues in this country","players for a team in a fantasy league","They face a league club in the next round."],"opposite":"","synonyms":""},{"def":"a level of quality, ability, etc.","examples":["in a league As a painter, he is in a league of his own (= much better than others).","They're in a different league from us.","not in somebody's league When it comes to cooking, I'm not in her league (= she is much better than me).","out of somebody's league A house like that is out of our league (= too expensive for us).","Today's technology is in a different league.","This move propelled him into the political big league."],"opposite":"","synonyms":""},{"def":"a group of people or nations who have combined for a particular purpose","examples":["the League of Nations","a meeting of the Women’s League for Peace","the countries in the Arab League","the League for Prison Reform"],"opposite":"","synonyms":""},{"def":"a unit for measuring distance, equal to about 3 miles or 4 000 metres","examples":[],"opposite":"","synonyms":""},{"def":"making secret plans with somebody","examples":["Those two crooks seem to be in league with each other."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in league (with somebody)","def":"making secret plans with somebody","examples":["Those two crooks seem to be in league with each other."]}],"phrasal":[],"related":["big league","big-league","bush-league","Ivy League","league table","Little League","major league","major-league","minor league","minor-league","Rugby League","Urban League","American League","Football League","Iroquois League","Major League Baseball","Major League Soccer","National League","Premier League"]}]