[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lea/leak_/leak__us_1.mp3","phonsUS":"/liːk/","level":"C1","meanings":[{"def":"to allow liquid or gas to get in or out through a small hole","examples":["a leaking pipe","The roof was leaking.","leak something The tank had leaked a small amount of water.","The house was old and the roof leaked badly.","A pipe was leaking in her hotel room.","He came to help me repair the leaking roof."],"opposite":"","synonyms":""},{"def":"to get in or out through a small hole in something","examples":["Water had started to leak into the cellar.","A small stream of water leaked from the rock.","to prevent radiation from leaking out","Water was leaking into the cellar.","Gas was leaking from one of the pipes."],"opposite":"","synonyms":""},{"def":"to give secret information to the public, for example by telling a newspaper","examples":["The contents of the report were leaked to the press.","He obtained a leaked document containing the views of some officials.","Confidential information that has been leaked from the BBC.","The document had been widely leaked.","The report was leaked to the press."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["leak out"],"related":["leak out","spring a leak"]},{"pos":"noun","level":"C1","meanings":[{"def":"a small hole that lets liquid or gas flow in or out of something by accident","examples":["a leak in the roof","a leak in the gas pipe","Fortunately, we spotted the leak in time.","I managed to plug the leak.","Pollution inspectors were called to a leak from a chemical factory.","The boat had a small leak.","The pipe has sprung a leak.","The plumber fixed the leak."],"opposite":"","synonyms":""},{"def":"liquid or gas that escapes through a hole in something","examples":["If you have no idea where the gas leak is coming from, it is always best to turn the complete system off.","oil leaks/leaks of oil","a leak of dangerous chemicals","taking steps to prevent gas leaks in the future","The dismantling of a nuclear reprocessing plant caused a leak of radioactivity yesterday."],"opposite":"","synonyms":""},{"def":"a deliberate act of giving secret information to the newspapers, etc.","examples":["There has been a leak to the press about the government plans on tax.","There will be an inquiry into the alleged security leaks.","serious leaks of US intelligence","an alleged leak of a CIA employee's name to the media","a security leak about a number of suspicious deaths among civil servants","a leak to the American authorities","a leak of confidential material","a leak from the prime minister's office","The organization's press secretary is thought to be the source of the leak.","The leak could only have come from one source."],"opposite":"","synonyms":""},{"def":"an act of passing urine from the body","examples":["to have/take a leak"],"opposite":"","synonyms":""},{"def":"to develop a hole through which water or another liquid can pass","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"spring a leak","def":"to develop a hole through which water or another liquid can pass","examples":[]}],"phrasal":[],"related":[]}]