[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lea/learn/learn__us_1.mp3","phonsUS":"/lɜːrn/","level":"A1","meanings":[{"def":"to gain knowledge or skill by studying, from experience, from being taught, etc.","examples":["learn something to learn a language/skill/trade","He had the opportunity to learn English in Australia.","learn (something) from somebody/something I learned a lot from my father.","Everyone in the class had the opportunity to learn from each other.","learn (something) from doing something You can learn a great deal just from watching other players.","learn (about something) She's very keen to learn about Japanese culture.","The book is about how children learn.","She received no training but quickly learnt on the job (= while doing the job).","learn to do something He's learning to play the trumpet.","Most people learn to read as children.","learn how to do something Today we learnt how to use the new software.","learn what, where, etc… Students need to learn what to do in an emergency.","He’s learning Spanish/​to swim.","She studied chemistry for three years.","In this class we’ll revise/​review what we did last week.","If you practise speaking English, you’ll soon improve.","We only had two weeks to rehearse the play.","He's learning to dance.","He’s still learning how to dance.","Children learn very quickly.","He was eager to learn all she could teach him.","She learned from watching others.","The children learn about art by painting.","Did you ever learn any languages?","Everyone learns in a slightly different way.","He learned to ride when he was about three years old.","I've forgotten most of what I learned at school.","It's a bit overwhelming at first but don't worry, you'll soon learn.","Most of the kids here are eager to learn.","She's very interested in learning more about Japanese culture.","I've got a lot to learn, haven't I?","You still have a lot to learn."],"opposite":"","synonyms":""},{"def":"to study and repeat something in order to be able to remember it","examples":["I learnt the poem by heart.","We have to learn one of Hamlet's speeches for school tomorrow.","You'll have to learn your lines by next week."],"opposite":"","synonyms":""},{"def":"to gradually change your attitudes about something so that you behave in a different way","examples":["Some people never learn, do they?","learn from something I'm sure she'll learn from her mistakes.","Why do people so often fail to learn from experience?","learn (that)… He’ll just have to learn (that) he can’t always have his own way.","They soon learn that bad behaviour is a sure-fire way of getting attention.","learn to do something They soon learned to love living in the countryside.","I soon learned not to ask too many questions."],"opposite":"","synonyms":""},{"def":"to become aware of something by hearing about it from somebody else","examples":["learn of something I first learnt of his death many years later.","learn about something We only learned about the problems in May of this year.","learn (that)… We were very surprised to learn (that) she had got married again.","learn who, what, etc… We only learned who the new teacher was a few days ago.","learn something How did they react when they learned the news?","it is learned that… It has been learned that 500 jobs are to be lost at the factory.","I learnt of her arrival from a close friend.","We first learned of the problem from her school.","I was surprised to learn that he was only 23."],"opposite":"","synonyms":""},{"def":"to know something because of something unpleasant that has happened to you","examples":["He's a ruthless businessman, as I know to my cost."],"opposite":"","synonyms":""},{"def":"to find out how to behave by learning from your mistakes or from unpleasant experiences, rather than from being told","examples":[],"opposite":"","synonyms":""},{"def":"to learn what to do or not to do in the future because you have had a bad experience in the past","examples":[],"opposite":"","synonyms":""},{"def":"to show somebody/know/learn how a particular job should be done","examples":[],"opposite":"","synonyms":""},{"def":"used to express surprise at something new or unexpected you have been told","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"know/learn/find something to your cost","def":"to know something because of something unpleasant that has happened to you","examples":["He's a ruthless businessman, as I know to my cost."]},{"idiom":"learn (something) the hard way","def":"to find out how to behave by learning from your mistakes or from unpleasant experiences, rather than from being told","examples":[]},{"idiom":"learn your lesson","def":"to learn what to do or not to do in the future because you have had a bad experience in the past","examples":[]},{"idiom":"show somebody/know/learn the ropes","def":"to show somebody/know/learn how a particular job should be done","examples":[]},{"idiom":"you live and learn","def":"used to express surprise at something new or unexpected you have been told","examples":[]}],"phrasal":[],"related":["show somebody/know/learn the ropes","know/learn/find something to your cost"]}]