[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lec/lectu/lecture__us_1.mp3","phonsUS":"/ˈlektʃər/","level":"A2","meanings":[{"def":"a talk that is given to a group of people to teach them about a particular subject, often as part of a university or college course","examples":["to go to/attend a lecture","to give/deliver a lecture","I have a lecture at nine tomorrow.","lecture on something a series of lectures on Jane Austen","a course of lectures on art history","lecture about something an illustrated lecture about the planet Mars","lecture to somebody a book based on her lectures to students","a lecture to the Darwin Society","lecture by somebody a lecture by Professor Snow","in a lecture She spoke about the environmental problems of the future in a lecture at Georgetown University.","at a lecture There were very few students at his lecture that morning.","Several people made speeches at the wedding.","a lecture on the Roman army","a course/​series of lectures","a televised presidential address","She gave an interesting talk on her visit to China.","to preach a sermon","Professor Pearson gave the inaugural lecture in the new lecture theatre.","She referred to Professor Jones's work in her lecture on Shakespeare's imagery.","She wasn't at the lecture.","The fire alarm went during his lecture.","The society is putting on a series of lectures on the subject next term.","a familiar figure on the international lecture circuit","a lecture entitled ‘How to Prevent Food Poisoning’","He gave a very interesting and informative lecture on the Roman army.","a lecture room/​hall"],"opposite":"","synonyms":"speech"},{"def":"a long, angry talk that somebody gives to one person or a group of people because they have done something wrong","examples":["I know I should stop smoking—don't give me a lecture about it.","I don't need any lectures from you on responsibility.","I don't take lectures from anyone on how to behave.","I got a lecture from Dad about coming home on time.","She gave me a stern lecture on ingratitude."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["lecture hall","lecture theatre","lecture halls","lecture theatres"]},{"pos":"verb","level":"A2","meanings":[{"def":"to give a talk or a series of talks to a group of people on a subject, especially as a way of teaching in a university or college","examples":["He has taught and lectured at the University of Pretoria.","lecture on something He lectures on Islamic history at Birkbeck College.","lecture in something She lectures in Russian literature.","lecture to somebody a live broadcast of the professor lecturing to students"],"opposite":"","synonyms":""},{"def":"to criticize somebody or tell them how you think they should behave, especially when it is done in an annoying way","examples":["lecture somebody Don’t start lecturing me!","lecture somebody about/on something He's always lecturing me about the way I dress.","lecture somebody about doing something She lectured me about taking responsibility for my actions."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]