[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/leg/legac/legacy__us_1.mp3","phonsUS":"/ˈleɡəsi/","level":"C1","meanings":[{"def":"money or property that is given to you by somebody when they die","examples":["They each received a legacy of $5 000.","She is the heir to a legacy of £1 million.","She left her the money in a legacy.","a legacy from my old teacher"],"opposite":"","synonyms":""},{"def":"a situation that exists now because of events, actions, etc. that took place in the past","examples":["Future generations will be left with a legacy of pollution and destruction.","The problems were made worse by the legacy of centuries of neglect.","His influence on younger musicians is perhaps his greatest legacy.","She said she would continue her father's legacy.","Such attitudes are a legacy from colonial times.","These problems have arisen as a result of historical legacies.","a great legacy of technical innovation","the enduring legacy bequeathed by the war years"],"opposite":"","synonyms":""},{"def":"something that somebody has done successfully and that has positive effects even after they retire or die","examples":["She was an active anti-bullying campaigner, and after she died her family set up a charity to ensure that her legacy lives on."],"opposite":"","synonyms":""},{"def":"the idea that something created for an event in the past can be used in a different way in the future","examples":["In the UK, the Olympic legacy lives on most strongly in East London where the Olympic Park is located."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adjective","level":"","meanings":[{"def":"used to describe a computer system or product that is no longer available to buy but is still used because it would be too difficult or expensive to replace it","examples":["How can we integrate new technology with our legacy systems?","legacy hardware/software","Legacy hardware and software should be able to cope with the website."],"opposite":"","synonyms":""},{"def":"created to be remembered and to have an effect that continues into the future","examples":["The new arts centre is a legacy project that will boost tourism and create jobs."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]