[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/len/lengt/length__us_3.mp3","phonsUS":"/leŋkθ/","level":"B1","meanings":[{"def":"the size or measurement of something from one end to the other","examples":["Measure the length of the line from A to B.","to estimate/calculate/increase/reduce the length of something","in length The river is 300 miles in length.","The snake usually reaches a length of 100 cm.","Safety barriers will be installed along the full length of the road.","He ran the entire length of the beach.","Look at the length of that queue!","He has to hold newspapers at arm's length to focus on the print.","This room is twice the length of the kitchen.","He measured the length and width of the table.","Measure the size of the window and cut the cloth to length.","The fence runs the length of the footpath.","The pipe was six feet in length.","The queen bee is twice the length of a worker bee.","The queue stretched the whole length of the High Street.","The vehicle has an overall length of 12 feet.","There were coloured lights along the whole length of the street.","These fish can reach a length of over five feet.","a ditch of great length and width"],"opposite":"","synonyms":""},{"def":"the quality of being long","examples":["Did you see the length of his hair?"],"opposite":"","synonyms":""},{"def":"the amount of time that something lasts","examples":["The average length of each song on the album is six minutes.","These changes will shorten the length of time spent waiting for test results.","She got a headache if she had to read for any length of time (= for a long time).","Size of pension depends partly on length of service with the company.","in length Each class is 45 minutes in length.","We discussed shortening the length of the course.","Each lesson was an hour in length.","They complained about the inordinate length of time they had to wait."],"opposite":"","synonyms":""},{"def":"the amount of writing in a book, or a document, etc.; the amount of time that a film lasts","examples":["There is a maximum length of 2 500 words.","in length The document is over 800 pages in length.","Her novels vary in length."],"opposite":"","synonyms":""},{"def":"having the length mentioned","examples":["shoulder-length hair"],"opposite":"","synonyms":""},{"def":"the distance from one end of a swimming pool to the other","examples":["He swims 50 lengths a day.","I did 20 lengths today."],"opposite":"","synonyms":""},{"def":"the size of a horse or boat from one end to the other, when it is used to measure the distance between two horses or boats taking part in a race","examples":["The horse won by two clear lengths."],"opposite":"","synonyms":""},{"def":"a long, thin piece of something","examples":["a length of rope/string/wire","The timber is sold in lengths of 2, 5 or 10 metres.","a short length of wire","long lengths of wool","Carry a whistle and a spare length of rope.","The pipe was attached to the wall with a length of wire"],"opposite":"","synonyms":""},{"def":"for a long time and in detail","examples":["He quoted at length from the report.","We have already discussed this matter at great length.","He told me at length about his new job."],"opposite":"","synonyms":""},{"def":"after a long time","examples":["‘I'm still not sure,’ he said at length."],"opposite":"","synonyms":""},{"def":"to put a lot of effort into doing something, especially when this seems extreme","examples":["She goes to extraordinary lengths to keep her private life private."],"opposite":"","synonyms":""},{"def":"to avoid having a close relationship with somebody","examples":["He keeps all his clients at arm's length.","She kept him at arm's length until he stopped smoking."],"opposite":"","synonyms":""},{"def":"in or to all parts of a place","examples":["They have travelled the length and breadth of Europe giving concerts.","They travelled the length and breadth of the land."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"at length | at… length","def":"for a long time and in detail","examples":["He quoted at length from the report.","We have already discussed this matter at great length.","He told me at length about his new job.","‘I'm still not sure,’ he said at length."]},{"idiom":"go to any, some, great, etc. lengths (to do something)","def":"to put a lot of effort into doing something, especially when this seems extreme","examples":["She goes to extraordinary lengths to keep her private life private."]},{"idiom":"keep somebody at arm’s length","def":"to avoid having a close relationship with somebody","examples":["He keeps all his clients at arm's length.","She kept him at arm's length until he stopped smoking."]},{"idiom":"the length and breadth of…","def":"in or to all parts of a place","examples":["They have travelled the length and breadth of Europe giving concerts.","They travelled the length and breadth of the land."]}],"phrasal":[],"related":["full length","full-length","knee-length","focal length","feature-length","shoulder-length","the length and breadth of…","keep somebody at arm’s length"]}]