[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/les/lesso/lesson__us_4.mp3","phonsUS":"/ˈlesn/","level":"A1","meanings":[{"def":"a period of time in which somebody is taught something","examples":["She gives piano lessons.","I’m having driving lessons.","lesson in something He took lessons in Thai cookery.","lesson on something a history lesson on the Roman Empire","lesson with somebody Beethoven's lessons with Haydn continued until 1794.","lesson from somebody His parents paid for lessons from local dance teachers.","lesson for somebody Lessons for beginners can be arranged.","(especially British English) Our first lesson on Tuesdays is French.","(especially British English) What did we do last lesson?","The aim is to lessen the impact of farming practices on the environment.","I have a guitar lesson after school today.","All new students are given lessons in how to use the library.","He got into trouble for skipping lessons.","I go to Italian lessons at the local college.","I had to take a biology lesson this afternoon because the biology teacher was away.","No talking was allowed during the lesson.","Pupils get lessons on how to organize their study time.","She gives singing lessons.","She started guitar lessons at the age of 38.","She was preparing a lesson plan for a class she was teaching.","The trouble is that teachers don't prepare their lessons carefully enough.","They have a lesson with Mrs Evans at two o'clock.","They're offering free lessons in computing.","We had a history lesson followed by a double maths lesson.","You can't expect to learn all there is to know about the subject in a 45-minute lesson.","I have a piano lesson after school today.","I've decided to take golf lessons.","She made a living giving private lessons in English.","We've got a lesson with Mr Jones this afternoon."],"opposite":"","synonyms":""},{"def":"something that is intended to be learned","examples":["The coursebook is divided into 30 lessons.","lesson on something Other countries can teach us a lesson or two on industrial policy."],"opposite":"","synonyms":""},{"def":"an experience, especially an unpleasant one, that somebody can learn from so that it does not happen again in the future","examples":["The accident taught me a lesson I'll never forget.","There are lessons to be learned from this mistake.","The narrative presents the hero with a series of life lessons.","It is dangerous to ignore the lessons of history.","lesson to somebody Let that be a lesson to you (= so that you do not make the same mistake again).","Their openness was a terrific lesson to me.","lesson on/about something The film offers an important lesson on the value of friendship.","lesson on/about doing something That's one of the lessons about being in a relationship that I hope not to forget.","lesson in something He said that the election results were a lesson in humility for the party.","lesson in doing something This experience has provided many valuable lessons in caring for the marine habitat.","lesson for somebody The lesson for the leaders of Western governments is clear.","What lessons can we draw from this?","We are still absorbing the harsh lessons of this disaster.","It was a lesson not lost on (= learned well by) the team manager.","It's a hard lesson to learn.","It taught me some valuable lessons about working with other people.","It is dangerous to ignore the lessons of the past.","I learned a lesson in harsh economics when I was made redundant.","I had learned a lesson in respecting the privacy of others.","a salutary lesson in the pitfalls facing those responsible for transport policy"],"opposite":"","synonyms":""},{"def":"a passage from the Bible that is read to people during a church service in the Church of England","examples":["The first lesson is taken from St John’s Gospel."],"opposite":"","synonyms":""},{"def":"to learn what to do or not to do in the future because you have had a bad experience in the past","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"learn your lesson","def":"to learn what to do or not to do in the future because you have had a bad experience in the past","examples":[]}],"phrasal":[],"related":["object lesson","learn your lesson"]}]