[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/let/lette/letter__us_3.mp3","phonsUS":"/ˈletər/","level":"A1","meanings":[{"def":"a written, typed or printed message that is put in an envelope or attached to an email and sent to somebody","examples":["to write/send (somebody) a letter","to receive/get a letter","(British English) to post a letter","(North American English) to mail a letter","a thank-you/resignation/rejection letter","letter to somebody In a letter to members, the Chairman explained the changes.","I wrote a letter to the editor of our local paper.","letter from somebody You may need a letter from your doctor.","a letter of something a letter of recommendation/complaint/apology","by letter You will be notified by letter.","More than 100 scientists have signed a letter to the Prime Minister.","In a letter dated 8 January last year, residents warned of the fire risk.","Her letter was published in the local paper.","There's a letter here addressed to you.","I'm just going out to post/​mail a letter.","He's applied for dozens of jobs and had dozens of rejection letters.","Police received an anonymous letter about the case.","I started to receive threatening letters demanding further payments.","We've had so many calls and letters from people who are worried.","Keep a copy of the letter on file.","Put the information in an email or a letter and send it to me.","I got a letter from their lawyers threatening legal action.","We welcome letters from our readers.","They sent me a letter saying the appointment had been changed.","Why don't you write her a letter saying how you feel?","I went home and wrote a letter of resignation.","He made these remarks in a letter to a friend.","He fired off a letter of complaint to the Chief Executive.","A collection of letters between the artist and her sister has been published.","A letter headed ‘Advertising Mania’ appeared in the paper.","Apart from the occasional letter, they had not been in touch for years.","George Bernard Shaw was a prolific letter writer.","His letter went on to give reasons for his refusal to take part.","I haven't had a letter from her for ages.","I hope my last letter has reached you.","I was angry that they didn't even acknowledge my letter.","I wrote my uncle a thank-you letter as soon as I opened the present.","In your letter of 5 June…","Our letters crossed in the post.","Please reply by letter.","She drafted an angry letter to the newspaper.","She wrote him a letter saying that she was not coming back.","She wrote an impassioned letter to her local newspaper to complain about the new road.","She received countless letters of support while in jail.","The charity received an anonymous letter enclosing a large cheque.","The conditions are explained in the accompanying letter.","The letter concluded with a threat of possible legal action.","The letter contained information that only the killer could know.","The letter is dated 7 July.","The letter started off by thanking us for our offer.","The letter was addressed to me.","The letter was forwarded from my old address.","The porter distributes incoming letters to the offices.","We reserve the right to cut or edit letters.","a letter of application/​apology","a letter to the editor (= of a newspaper)","The prime minister has sent a letter of condolence to the family of the missing pilot.","They wrote a letter of complaint to the television network.","There's a letter for you from your mother."],"opposite":"","synonyms":""},{"def":"a written or printed sign representing a sound used in speech","examples":["‘B’ is the second letter of the alphabet.","How many letters are in the Greek alphabet?","the letter A/B/C","I'm thinking of a word that begins with the letter M.","in… letters She typed the word ‘HISTORY’ in capital letters.","The slogan is printed in bold letters across the top.","Chai is the 18th letter of the Hebrew alphabet.","The pieces of card were marked with letters of the alphabet.","Each item is assigned a different number or letter.","He had typed a jumble of letters and numbers.","All their names begin with the same letter.","The first letter of my name is K, not C.","His name is written Louis, but you don't pronounce the last letter.","What do those letters after your name mean?","The system does not distinguish between upper and lower case letters.","words such as ‘debt’ and ‘half’, which contain silent letters","Words with double letters, such as ‘accommodate’, are commonly misspelled.","The company's name is made from the initial letters of his children's names.","Fill in the form in block letters.","His name was written in large white letters over the doorway.","The card said ‘Birthday Girl’ in gold letters.","The title of the book is in large raised letters on the front.","At the end of the course you will receive a letter grade from A–F."],"opposite":"","synonyms":""},{"def":"a sign in the shape of a letter that is sewn onto clothes to show that a person plays in a school or college sports team","examples":[],"opposite":"","synonyms":""},{"def":"the exact words of a law or rule rather than its general meaning","examples":["They insist on sticking to the letter of the law.","We might be guilty of slightly bending the letter of the law.","In spite of the difficulties it would cause her family, the judge stuck to the letter of the law and jailed her."],"opposite":"","synonyms":""},{"def":"doing/following exactly what somebody/something says, paying attention to every detail","examples":["I followed your instructions to the letter."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the letter of the law","def":"the exact words of a law or rule rather than its general meaning","examples":["They insist on sticking to the letter of the law.","We might be guilty of slightly bending the letter of the law.","In spite of the difficulties it would cause her family, the judge stuck to the letter of the law and jailed her."]},{"idiom":"to the letter","def":"doing/following exactly what somebody/something says, paying attention to every detail","examples":["I followed your instructions to the letter."]}],"phrasal":[],"related":["air letter","dead letter","form letter","letter bomb","letter box","letter-size","love letter","open letter","chain letter","cover letter","French letter","letter opener","capital letter","covering letter","letter carrier","letter-perfect","red-letter day","Dear John letter","four-letter word"]},{"pos":"verb","level":"","meanings":[{"def":"to give a letter to something as part of a series or list","examples":["lettered (+ noun) the stars lettered Alpha and Beta"],"opposite":"","synonyms":""},{"def":"to print, paint, sew, etc. letters onto something","examples":["lettered (in something) a black banner lettered in white"],"opposite":"","synonyms":""},{"def":"to receive a letter made of cloth that you sew onto your clothes for playing in a school or college sports team","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]