[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lev/level/level__us_2.mp3","phonsUS":"/ˈlevl/","level":"A2","meanings":[{"def":"the height of something in relation to the ground or to what it used to be","examples":["The cables are buried one metre below ground level.","The floodwater nearly reached roof level.","The river has fallen to its lowest level since 2012.","the level rose/dropped/decreased/increased","on a level with something On the second floor you are on a level with (= at the same height as) the treetops.","on a level The tables are not on a level (= the same height).","the level of water in the bottle","The plane was flying at a very low level.","The water rose to the level of the ground floor windows.","They are going to raise the level of the banks to prevent flooding.","below the level of the cloud"],"opposite":"","synonyms":""},{"def":"a floor of a building; a layer of ground","examples":["a multi-level parking lot","Take the elevator to Level Four.","on a level The restaurant is on the level below this one.","The library is all on one level.","Archaeologists found pottery in the lowest level of the site.","Are we on the right level for the restaurant?","Remember that we parked on level 5."],"opposite":"","synonyms":""},{"def":"the amount of something that exists in a particular situation at a particular time","examples":["a low level of support for the proposed changes","Increase your level of activity to burn more calories.","to raise/reduce the level of something","They have achieved higher levels of efficiency.","A change of course may be needed if the current level of violence continues.","low/high/elevated blood cholesterol levels","a reduction/a rise/a decrease/an increase/a change in energy levels","at a/the… level Profits were at the same level as the year before.","a test that checks the level of alcohol in the blood","Crime has reached its highest level ever.","Emissions are well below the levels set by the WHO.","Excessive levels of lead were found in the water.","Her blood pressure has returned to its normal level.","Industrial output has reached record levels.","Mortgage rates were 10% above their current level.","Radiation is well below the permitted level.","Rents will be kept at this level for another year.","She predicts that fuel prices will remain at current levels.","There will be stiff penalties if companies exceed these levels of pollution.","They were asked to indicate the level of distress they experienced as a result of their experiences.","a generous level of financial support for the arts","an acceptable level of risk","permitted levels of chemical pollutants","the worst level of business failure since 1997","Another cause for concern is the rising level of crime.","High stress levels will affect employees' productivity.","The aim is to reduce pollution levels in the city.","These cities have relatively low levels of unemployment."],"opposite":"","synonyms":""},{"def":"a particular standard or quality","examples":["The hotel's level of service is consistently high.","The participants had different levels of education.","He studied French to degree level.","What is the level of this course?","It is difficult to maintain this level of performance.","at a… level She has played tennis at a high level.","on a level Both players are on a level (= of the same standard).","I refuse to sink to their level (= behave as badly as them).","students who have reached the intermediate level","students at intermediate level","language students at different levels of proficiency","They work hard, but with varying levels of success.","He has reached an advanced level in his studies.","Standards of hygiene are at a fairly low level.","a sport suitable for people of all fitness levels","Most of these students have a high level of language ability.","She studied psychology at degree level.","She reached a very high level at a very young age.","The school offers classes at all levels from beginner to advanced.","He's reading at grade level.","His English is way above the level of the other students.","The book is not suitable for students below degree level.","The difficulty level of the exercises in the book varies widely.","The teaching is at quite a basic level."],"opposite":"","synonyms":""},{"def":"a position or rank in a scale of size or importance","examples":["the upper levels of government","at (a) … level Discussions are currently being held at national level.","at local/international level","The decision is being made at top level.","There is a lot of corruption at a local level.","The thing has got to be organized on an international level.","At the local level there's a lot to be said for the plan.","The party needs to win support at grass-roots level.","These decisions are made at board level.","He promised reforms at all levels of government.","It's people at the lower levels within the company that will lose their jobs.","He rose to the level of general manager.","You need to do all three levels to qualify as a canteen supervisor.","It's time to take my career to the next level."],"opposite":"","synonyms":""},{"def":"a particular way of looking at, reacting to or understanding something","examples":["on a… level On a more personal level, I would like to thank Jean for all the help she has given me.","Fables can be understood on various levels.","at a… level At a conscious level, I was quite satisfied with my life.","On a superficial level everything appears to be in order, but at a deeper level you an see that there's a lot wrong.","We probably need to look at this problem at a more detailed level."],"opposite":"","synonyms":""},{"def":"one of a series of stages in a computer game. Players progress from easy to more advanced levels within the game.","examples":["a computer game with 15 levels","Players advance to the next level by collecting all the pieces and constructing the spaceship.","Each level is randomly generated so each game is different."],"opposite":"","synonyms":""},{"def":"a device used to test whether a surface is level, consisting of a glass tube partly filled with liquid with a bubble of air inside. The position of the bubble indicates whether the surface is level.","examples":[],"opposite":"","synonyms":""},{"def":"honest; legal","examples":["I'm not convinced he's on the level.","Are you sure this deal is on the level?"],"opposite":"","synonyms":""},{"def":"as good, bad, important, etc. as somebody/something else","examples":["This place is on a level with the best French restaurants."],"opposite":"","synonyms":""},{"def":"as good, bad, important, etc. as somebody/something else","examples":["This place is on a par with the best French restaurants."],"opposite":"","synonyms":""},{"def":"to further improve or develop something that is already successful","examples":["He decided to move to New York to take his career to the next level.","We are taking web design to the next level."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"on the level","def":"honest; legal","examples":["I'm not convinced he's on the level.","Are you sure this deal is on the level?"]},{"idiom":"on a level/par with somebody/something","def":"as good, bad, important, etc. as somebody/something else","examples":["This place is on a level with the best French restaurants."]},{"idiom":"on a par/level with somebody/something","def":"as good, bad, important, etc. as somebody/something else","examples":["This place is on a par with the best French restaurants."]},{"idiom":"take something to the next level","def":"to further improve or develop something that is already successful","examples":["He decided to move to New York to take his career to the next level.","We are taking web design to the next level."]}],"phrasal":[],"related":["A level","level at","level up","O level","eye level","level off","level out","low-level","sea level","top-level","A2 (level)","AS (level)","entry-level","high-level","level down","level with","split-level"]},{"pos":"adjective","level":"B1","meanings":[{"def":"having a flat surface that does not slope","examples":["Pitch the tent on level ground.","Add a level tablespoon of flour (= enough to fill the spoon but not so much that it goes above the level of the edge of the spoon).","Keep the pot level, or you'll spill the coffee.","Make sure you get the shelf level before screwing it in.","The floor has got to be absolutely level."],"opposite":"","synonyms":""},{"def":"having the same height, position, value, etc. as something","examples":["Are these pictures level?","The unemployment rate remained level in November.","level with something This latest rise is intended to keep wages level with inflation.","He bent down so that his eyes were nearly level with hers.","She drew level with (= came beside) the police car.","The water came level with the top of her boots."],"opposite":"","synonyms":""},{"def":"having the same score as somebody","examples":["A good second round brought him level with the tournament leader.","England fought well to stay on level terms.","France took an early lead but Wales soon drew level (= scored the same number of points).","The score was level at 5 points each.","The clubs are level on points.","He went into the last match on level points with Jones."],"opposite":"","synonyms":""},{"def":"not showing any emotion; steady","examples":["a level gaze"],"opposite":"","synonyms":""},{"def":"to have an equal or even score","examples":["The contestants were level pegging after round 3.","Five minutes later it was level pegging when Kane banged in the equalizer"],"opposite":"","synonyms":""},{"def":"to do as much as you can to try to achieve something","examples":[],"opposite":"","synonyms":""},{"def":"a situation in which everyone has the same opportunities","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be level pegging","def":"to have an equal or even score","examples":["The contestants were level pegging after round 3.","Five minutes later it was level pegging when Kane banged in the equalizer"]},{"idiom":"do/try your level best (to do something)","def":"to do as much as you can to try to achieve something","examples":[]},{"idiom":"a level playing field","def":"a situation in which everyone has the same opportunities","examples":[]}],"phrasal":[],"related":[]},{"pos":"verb","level":"B2","meanings":[{"def":"to make something flat or smooth","examples":["level something out The first coat of plaster levels out the surface of the wall.","level something off Use a palette knife to level off the top.","level something If you're laying tiles, the floor will need to be levelled first."],"opposite":"","synonyms":""},{"def":"to make something, especially a score in sport, equal or similar","examples":["Davies levelled the score at 2 all.","to level the match/game","France levelled with two minutes remaining."],"opposite":"","synonyms":""},{"def":"to destroy a building or a group of trees completely by knocking it down","examples":["The blast levelled several buildings in the area.","Bulldozers are now waiting to level their home."],"opposite":"","synonyms":""},{"def":"to point something, especially a gun, at somebody","examples":["I had a gun levelled at my head.","She brought her right hand from behind her and levelled the pistol.","She levelled the gun at his head."],"opposite":"","synonyms":""},{"def":"to create a situation where everyone has the same opportunities","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"level the playing field","def":"to create a situation where everyone has the same opportunities","examples":[]}],"phrasal":["level against","level at","level down","level off","level out","level up","level with"],"related":[]}]