[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lib/liber/liberty__us_1.mp3","phonsUS":"/ˈlɪbərti/","level":"C1","meanings":[{"def":"freedom to live as you choose without too many limits from government or authority","examples":["the fight for justice and liberty","The concept of individual liberty is enshrined in the constitution.","Our personal liberty is being eroded.","The law should protect the liberty of the individual.","The new legislation threatens individual liberty.","The system allows us complete liberty to do the task as we like.","Women are demanding greater liberty for themselves.","liberty from the abuse of police power","The Turkish government has fought to uphold religious liberty.","He claimed that the order was an unjustified infringement of his liberty."],"opposite":"","synonyms":""},{"def":"the state of not being a prisoner or a slave","examples":["He had to endure six months' loss of liberty.","The city won its liberty in the 16th century.","If found guilty, she is in danger of losing her liberty."],"opposite":"","synonyms":""},{"def":"the legal right and freedom to do something","examples":["The right to vote should be a liberty enjoyed by all.","People fear that security cameras could infringe personal liberties.","a citizens' charter which gives people basic civil liberties","This is a gross infringement of our civil liberties."],"opposite":"","synonyms":""},{"def":"an act or a statement that may offend or annoy somebody, especially because it is done without permission or does not show respect","examples":["He took the liberty of reading my files while I was away."],"opposite":"","synonyms":""},{"def":"no longer in prison or in a cage","examples":["The escaped prisoner has been at liberty for five days."],"opposite":"","synonyms":""},{"def":"having the right or freedom to do something","examples":["You are at liberty to say what you like.","I am not at liberty to discuss my client’s case."],"opposite":"","synonyms":""},{"def":"to make important and unreasonable changes to something, especially a book","examples":["The movie takes considerable liberties with the novel that it is based on."],"opposite":"","synonyms":""},{"def":"to be too friendly with somebody, especially in a sexual way","examples":["He’s always taking liberties with the secretaries."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"at liberty","def":"no longer in prison or in a cage","examples":["The escaped prisoner has been at liberty for five days."]},{"idiom":"at liberty to do something","def":"having the right or freedom to do something","examples":["You are at liberty to say what you like.","I am not at liberty to discuss my client’s case."]},{"idiom":"take liberties with somebody/something","def":"to make important and unreasonable changes to something, especially a book","examples":["The movie takes considerable liberties with the novel that it is based on.","He’s always taking liberties with the secretaries."]}],"phrasal":[],"related":["Liberty","civil liberty","Liberty Bonds","Liberty Bell","Sons of Liberty","Statue of Liberty","Radio Free Europe/Radio Liberty","Liberty's"]},{"pos":"","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lib/liber/liberty__us_3.mp3","level":"","meanings":[{"def":"an independent organization formed in 1934 to protect the legal rights of British citizens and to argue for greater freedom and equality under the existing law. It has fought campaigns to defend the rights of women, LGBT people and people in prison. Liberty is also known as the National Council for Civil Liberties, its official name until 1989.Culture pressure groupspressure groupsPressure groups work for the benefit of a particular section of society, for example children or nurses, or for a particular issue or cause. Groups that work for a section of society are sometimes called interest groups. Those that work for a particular cause are known as promotional groups or simply pressure groups. These pressure groups operate in a similar way in Britain and in the US.There are several types of interest groups. Trade unions and labor unions represent workers in industry and are mostly concerned with their wages and health, safety, etc. Professional bodies such as the BMA (British Medical Association) are similar to trade unions and the CBI (Confederation of British Industry) represents the interests of employers. In Britain several watchdogs have been established by Act of Parliament to monitor certain industries, for example, Ofgem, which watches the gas and electricity industries for the benefit of users. Many promotional groups are linked to charities. Since charities are not allowed to take part in party political activity, many set up a related organization to act as a pressure group. In the US many pressure groups form political action committees which are allowed to give money to political campaigns. Well-known promotional groups include Friends of the Earth and Amnesty International. There are also many smaller groups, usually less permanent, which are formed to protest about local issues.Pressure groups aim to influence the government to the benefit of their members or the cause they support. They may draw attention to problems by asking people to sign a petition (= a formal request signed by many people), often online, by giving media interviews, or by organizing demonstrations that will attract public and media attention. Many groups try to get the support of well-known people such as pop stars. They also try to persuade politicians to support their cause and to speak about it in Parliament or Congress, a practice known as lobbying. Government departments may talk to pressure groups when changes to the law are being considered. There are some groups that are ready to break the law in order to achieve their aims.","examples":[],"opposite":"","synonyms":""},{"def":"a department store (= large shop where many types of goods are sold in different departments) in Regent Street, London. It was opened in 1875 and sold goods imported from countries such as India and Japan. It later became well known for its art nouveau designs in furniture and silver and its range of fabrics and carpets.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]