[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lib/libra/library__us_1.mp3","phonsUS":"/ˈlaɪbreri/","level":"A1","meanings":[{"def":"a building in which collections of books, newspapers, etc. and sometimes films and recorded music are kept for people to read, study or borrow","examples":["a public/university/school library","a library book","a toy library (= for borrowing toys from)","How often do you go to the library?","You can borrow it from your local library.","I got this very interesting book out of the library.","a plan to provide mobile library services in rural environments","A number of councils operate mobile libraries.","Do you have any books to take back to the library?","Do you know about the other services available at your local library?","I've been reading newspapers in the library.","In 1784 he established his first circulating library (= lending library).","Students are taught library skills in the first week of their course.","The library has an extensive collection of books on Chinese history.","The school has an excellent library.","a holiday programme for children at the local library","teaching library skills to schoolchildren","the Herbert Hoover presidential library in West Branch, Iowa","the need to improve library provision"],"opposite":"","synonyms":""},{"def":"a collection of books, newspapers, films, recorded music, etc. held in a library or stored in digital form","examples":["a music/photo library","The Media Centre houses a digital library of radio and television programmes."],"opposite":"","synonyms":""},{"def":"a room in a large house where most of the books are kept","examples":[],"opposite":"","synonyms":""},{"def":"a personal collection of books, music recordings, etc.","examples":["a new edition to add to your library","The family possessed an extensive library.","She had built up an impressive library of art books.","a personal library of over 1 000 volumes"],"opposite":"","synonyms":""},{"def":"a series of books, recordings, etc. produced by the same company and similar in appearance","examples":["a library of children’s classics"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["copyright library","lending library","mobile library","reference library","Bodleian Library","British Library","London Library","Library of Congress","New York Public Library"]}]