[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lie/lie__/lie__us_1.mp3","phonsUS":"/laɪ/","level":"A1","meanings":[{"def":"to be or put yourself in a flat position so that you are not standing or sitting","examples":["lie + adv./prep. to lie on your back/side/front","She lay in bed listening to music.","Lie there for a bit until you feel better.","lie + adj. I lay awake all night worrying about it.","The cat was lying fast asleep by the fire.","She was lying on the beach.","She was laying on the beach.","Why don't you lie on the bed?","Why don’t you lay on the bed?","She had lain there all night.","She had laid there all night.","If you're tired, go and have a lie down.","Go and have a lay down.","She likes to lie in bed all day.","He was lying next to his wife in bed.","I lay on the sofa reading my book.","I lay on the grass and fell asleep.","She wouldn't enjoy a holiday just lying on the beach.","A man lay dead in the middle of the road.","They found him lying in a pool of blood.","They found him lying unconscious at the foot of the stairs.","He fell on the floor and just lay there not moving.","Her body lay motionless on the bed.","Lying there listening to music, I felt at peace.","He just lay there smiling.","They stole her belongings while she lay helpless on the bed.","A sleeping dog lies at his feet.","He was lying face down in the mud.","I was lying flat on the floor.","Lie face up with your feet on the floor.","Lie still and try to sleep.","Lie still while I put the bandage on.","They lay quietly for a while.","She lay on her stomach.","She lay sprawled on the sofa.","He was lying naked on the bed.","She lay on her back and looked up at the sky.","The painting depicts a male figure lying prone."],"opposite":"","synonyms":""},{"def":"to be or remain in a flat position on a surface","examples":["lie + adv./prep. Clothes were lying all over the floor.","She picked up a pen that was lying nearby.","lie + adj. The book lay open on the desk.","Make sure the fabric lies flat.","He just leaves his wet towel lying on the carpet.","Broken glass lay scattered all over the floor.","An empty pill bottle lay on the bedside table.","He found a piece of quartz lying on the sand.","She left the letter lying unread on her desk for a week.","He tried to pick up the gun that was lying close by.","A stack of waffles lay next to a pile of blueberry pancakes.","The books lay gathering dust on the shelf.","Bodies and rubble lay everywhere.","The cables, pipes and wires that serve New York lie as deep as 800 feet underground.","The ship now lies at the bottom of the sea."],"opposite":"","synonyms":""},{"def":"to be, remain or be kept in a particular state","examples":["lie + adj. Houses lie empty while people are homeless.","These machines have lain idle since the factory closed.","Snow was lying thick on the ground.","lie + adv./prep. Much of the city now lay in ruins.","a ship lying at anchor","I'd rather use my money than leave it lying in the bank.","The seeds lie dormant in the soil throughout the winter.","Passengers were standing up while first class seats lay empty.","Too many apartments are lying vacant.","The field is left to lie fallow.","A tremendous amount of work lay ahead of us.","None of us knows what lies in front of us.","These Roman ruins have lain undiscovered for two thousand years.","This precious film lay untouched in an attic.","Our plans lay in ruins.","Their dreams lay in tatters."],"opposite":"","synonyms":""},{"def":"to exist or be found","examples":["lie in something The problem lies in deciding when to intervene.","Our strength lies in our loyal customer base.","lie with somebody The fault lies with you.","lie + adv./prep. The answer seems to lie elsewhere.","We need to consider carefully where our best interests lie.","Different people see quite different things in this film, and therein lies its genius.","My main interest lies in his early work.","The big difference between them lies in their attitudes.","Her strength lies in her ability to understand her opponent's thinking.","The challenge lies in the fact that most people do not like to plan so far ahead.","The appeal of his paintings lies in their simplicity and boldness.","The answer lies in your hands.","Where does the answer lie?","Perhaps the truth lies somewhere in between.","The really important things lie outside of our narrow concerns.","This is an issue that lies very close to my heart.","The responsibility lies with your employer to ensure this review is followed up.","All the power lies with him in this situation.","Our sympathies lie with the main character.","The blame lies squarely with the company.","Thousands of units would be needed, and therein lies the challenge.","Cloning endangered species may seem a wonderful idea, but where would scientists stop? Herein lies the danger.","We can guess what lies at the root of her problems: money.","Joy and love lie at the heart of all his films.","At the heart of this story there lies a puzzle.","Between the two of them there lay an unspoken tension."],"opposite":"","synonyms":""},{"def":"to be located in a particular place","examples":["The town lies on the coast.","An island lies in the middle of the lagoon.","The building dates from around 1700 and lies close to the centre of Vienna.","The village lies in the foothills of the Dolomites.","The site lies next to the old library building.","There's a field lying next to the barn.","We walked to a stream that lay nearby.","The palace lies just outside the city walls.","The airport lies 50 miles east of the city.","These nations lie close to the sea lanes between Europe and China and Japan."],"opposite":"","synonyms":""},{"def":"to be spread out in a particular place","examples":["The valley lay below us."],"opposite":"","synonyms":""},{"def":"to be in a particular position during a competition","examples":["+ adv./prep. Thompson is lying in fourth place.","+ adj. After five games the German team are lying second."],"opposite":"","synonyms":""},{"def":"to be the original cause of something, especially something unpleasant","examples":["We need to find out what lies at the bottom of these fears.","I'd love to know what lies at the bottom of all this."],"opposite":"","synonyms":""},{"def":"to be very easy to notice in a particular place in a way that is unpleasant","examples":["Smoke lay heavy on the far side of the water.","Despair hangs heavy in the stifling air."],"opposite":"","synonyms":""},{"def":"to cause somebody/something to feel uncomfortable or anxious","examples":["The crime lay heavy on her conscience."],"opposite":"","synonyms":""},{"def":"to avoid mentioning a subject or something that happened in the past, in order to avoid any problems or arguments","examples":[],"opposite":"","synonyms":""},{"def":"to be going to happen to somebody in the future","examples":["You are young and your whole life lies ahead of you.","She didn’t know what lay in store.","We must be prepared for whatever lies ahead.","None of us knows what lies in store for us."],"opposite":"","synonyms":""},{"def":"to be placed on view in a public place before being buried","examples":[],"opposite":"","synonyms":""},{"def":"to hide, waiting to surprise, attack or catch somebody","examples":["He was surrounded by reporters who had been lying in wait for him."],"opposite":"","synonyms":""},{"def":"to try not to attract attention to yourself","examples":[],"opposite":"","synonyms":""},{"def":"to find out about a situation","examples":["Let's wait and see how the land lies before we do anything."],"opposite":"","synonyms":""},{"def":"to accept an offensive remark or act without protesting or reacting","examples":[],"opposite":"","synonyms":""},{"def":"you must accept the results of your actions","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be/lie at the bottom of something","def":"to be the original cause of something, especially something unpleasant","examples":["We need to find out what lies at the bottom of these fears.","I'd love to know what lies at the bottom of all this."]},{"idiom":"hang/lie heavy","def":"to be very easy to notice in a particular place in a way that is unpleasant","examples":["Smoke lay heavy on the far side of the water.","Despair hangs heavy in the stifling air.","The crime lay heavy on her conscience."]},{"idiom":"let sleeping dogs lie","def":"to avoid mentioning a subject or something that happened in the past, in order to avoid any problems or arguments","examples":[]},{"idiom":"lie ahead/in store","def":"to be going to happen to somebody in the future","examples":["You are young and your whole life lies ahead of you.","She didn’t know what lay in store.","We must be prepared for whatever lies ahead.","None of us knows what lies in store for us."]},{"idiom":"lie in state","def":"to be placed on view in a public place before being buried","examples":[]},{"idiom":"lie in wait (for somebody)","def":"to hide, waiting to surprise, attack or catch somebody","examples":["He was surrounded by reporters who had been lying in wait for him."]},{"idiom":"lie low","def":"to try not to attract attention to yourself","examples":[]},{"idiom":"see, etc. how the land lies","def":"to find out about a situation","examples":["Let's wait and see how the land lies before we do anything."]},{"idiom":"take something lying down","def":"to accept an offensive remark or act without protesting or reacting","examples":[]},{"idiom":"you’ve made your bed and you must lie in/on it","def":"you must accept the results of your actions","examples":[]}],"phrasal":["lie around","lie back","lie behind","lie down","lie in","lie with"],"related":[]},{"pos":"noun","level":"","meanings":[{"def":"the way the land in an area is formed and what physical characteristics it has","examples":["The castle was hidden by the lie of the land."],"opposite":"","synonyms":""},{"def":"the way a situation is now and how it is likely to develop","examples":["Check out the lie of the land before you make a decision."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the lie of the land","def":"the way the land in an area is formed and what physical characteristics it has","examples":["The castle was hidden by the lie of the land.","Check out the lie of the land before you make a decision."]}],"phrasal":[],"related":[]},{"pos":"verb","level":"B1","meanings":[{"def":"to say or write something that you know is not true","examples":["You could see from his face that he was lying.","lie to somebody Don't lie to me!","lie about something She lies about her age.","lie about doing something He lied about having a university degree.","The camera cannot lie (= give a false impression).","He was unable to lie convincingly."],"opposite":"","synonyms":""},{"def":"to say something that is not true at all","examples":["The witness was clearly lying through his teeth."],"opposite":"","synonyms":""},{"def":"to get yourself into or out of a situation by lying","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"lie through your teeth","def":"to say something that is not true at all","examples":["The witness was clearly lying through his teeth."]},{"idiom":"lie your way into/out of something","def":"to get yourself into or out of a situation by lying","examples":[]}],"phrasal":[],"related":[]},{"pos":"noun","level":"B1","meanings":[{"def":"a statement made by somebody knowing that it is not true","examples":["to tell a lie","The whole story is nothing but a pack of lies.","That's an outright lie!","a barefaced/bald-faced/blatant lie (= a lie that is deliberate and shocking)","lie about somebody/something How dare you spread such vicious lies about other people?","He said he would not respond to the lies about his war record.","lie about doing something an elaborate lie about being attacked by two masked men","He told a big fat lie!","He told a whopping great lie!","How could she swallow such a blatant lie?","That's a downright lie!","That's a lie—I never said that!","a web of elaborate lies","As usual, the party's leaflet is full of barefaced lies.","I couldn't tell her a lie."],"opposite":"","synonyms":""},{"def":"to show that something is not true","examples":["These new figures give the lie to the belief that unemployment is going down."],"opposite":"","synonyms":""},{"def":"used to say that something you have just said is not true or correct","examples":["We first met in 2006, no, I tell a lie, it was 2007."],"opposite":"","synonyms":""},{"def":"to keep something important about yourself a secret from other people, so that they do not know what you really think, what you are really like, etc.","examples":["He lived a lie for thirty years, ‘married’ to two women."],"opposite":"","synonyms":""},{"def":"a story, an excuse, etc. that is full of lies","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"give the lie to something","def":"to show that something is not true","examples":["These new figures give the lie to the belief that unemployment is going down."]},{"idiom":"I tell a lie","def":"used to say that something you have just said is not true or correct","examples":["We first met in 2006, no, I tell a lie, it was 2007."]},{"idiom":"live a lie","def":"to keep something important about yourself a secret from other people, so that they do not know what you really think, what you are really like, etc.","examples":["He lived a lie for thirty years, ‘married’ to two women."]},{"idiom":"a tissue of lies","def":"a story, an excuse, etc. that is full of lies","examples":[]}],"phrasal":[],"related":[]}]