[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lif/life_/life__us_1.mp3","phonsUS":"/laɪf/","level":"A1","meanings":[{"def":"the ability to breathe, grow, produce young, etc. that people, animals and plants have before they die and that objects do not have","examples":["This could mean the difference between life and death.","The body was cold and showed no signs of life.","I wish we could bring dinosaurs back to life.","In spring the countryside bursts into life.","The driver showed no signs of life.","She clung to life for several weeks.","Anti-abortionists say they are campaigning for the right to life.","a child bursting with life","It's April and the garden is burgeoning with life.","I could almost see the life draining from his body.","Dr Frankenstein was able to endow his creature with life.","These two-dimensional figures are somehow given life.","He creates wonderful puppets, brimming with life."],"opposite":"","synonyms":""},{"def":"the state of being alive as a human; an individual person’s existence","examples":["The floods caused a massive loss of life (= many people were killed).","All risk to human life should be avoided.","He risked his life to save his daughter from the fire.","The operation saved her life.","My grandfather lost his life (= was killed) in the war.","The bombing claimed the lives of (= killed) thousands of people.","Hundreds of lives were threatened when the building collapsed.","Attempts have been made on his life (= people have tried to kill him).","He said the men had threatened his life.","People's lives are in danger because of this disease.","You've put lives in danger through your carelessness.","You've endangered lives through your carelessness.","a drug that will save lives","He saved her life by pulling her out of the water.","She went back into the building at the risk of her own life.","Tackle the fire if there is no threat to your life.","You'll do anything if your life is on the line.","Witnesses are living in fear for their life after giving evidence against the gang.","Fearing for their lives, they ran away.","He lost his life in an air crash.","Is it ever justifiable to take a life?","I owe my life to the doctors at the hospital.","I owe him my life.","No lives were lost in the accident.","She begged the soldiers to spare her son's life.","The crash claimed 43 lives.","She risked her life for the sake of the children.","The plane crashed with heavy loss of life.","There have been three attempts on the president's life.","His foolishness almost cost him his life."],"opposite":"","synonyms":""},{"def":"living things","examples":["plant/animal/insect life","Plastic is a threat to marine life.","Nuclear war could mean the end of life on earth.","Is there intelligent life on other planets?","There was no sign of life in the abandoned village.","All forms of life are to be found in this forest.","More species of plant and animal life die out as their very specialized habitat is disturbed.","Algae can pose a danger to pond life.","The area has a rich and complex plant life.","The world's oceans are teeming with life.","In spring, the hedgerows buzz with life.","The hedgerow supports a wide variety of animal and bird life.","Loss of habitat is a major threat to insect life.","Pollution is harming bird life in our cities.","Climate change will affect all life on earth.","Is there life on Mars?"],"opposite":"","synonyms":""},{"def":"the period between somebody’s birth and their death; a part of this period","examples":["He's lived here all his life.","I've lived in England for most of my life.","somebody's whole/entire life","We have known each other our whole lives.","He will spend the rest of his life (= until he dies) in a wheelchair.","to have a long/short life","to devote/dedicate your life to something","in somebody's life She's had some interesting experiences in her life.","I've never in my entire life been so embarrassed.","in early/later life","Brenda took up tennis late in life.","A baby's weight will normally double in the first five months of life.","throughout somebody's life Throughout her life she was dogged by loneliness.","during somebody's life She had three marriages during her 89-year life.","for life There's no such thing as a job for life any longer.","She stayed there until the end of her life.","He was sentenced to life imprisonment.","Experiences in early life can have a great impact.","Bad posture is one of the causes of back pain in later life.","This usually happens during the first 24 to 36 hours of life.","for the first time in her life","He'll be haunted by the crash for the rest of his life.","She discovered jazz quite late in life.","I've known her all my life.","He built his whole life around his children.","I've been wanting to do this my whole life.","I've never seen so much food in my entire life.","He devoted his life to the education of deaf children.","She dedicated her whole life to this cause.","He ended his life a happy man.","He never let his work dominate his life.","He ruined his life through drinking.","He spent his whole life in Cornwall.","They cannot cure her, but they can prolong her life.","Her paintings became more obscure towards the end of her life.","He became very weak towards the end of his life.","In later life he took up writing.","She sensed she was entering a new phase in her life.","I think I may have been an animal in a previous life.","They became friends for life.","A monarch normally rules for life.","That experience put me off alcohol for life!","She thought marriage should be for life.","There has only been one woman in her life.","He met the love of his life at college.","She is a life member of the club."],"opposite":"","synonyms":""},{"def":"a period of somebody’s life when they are in a particular situation or job","examples":["She has been an accountant all her working life.","He spent his entire adult life in France.","throughout somebody's life They were very happy throughout their married life.","during somebody's life During his 13-year life in Britain he has never worked.","life as something He met a lot of interesting people during his life as a student.","He was a miner all his working life.","She began her working life as an architect.","Last July I began my post-college life.","She spent most of her working life in Strasbourg.","They spent their working lives as farm labourers.","I enjoyed the freedom I had during my single life.","During my professional life I had to deal with many different types of people.","He held several advisory posts during his academic life.","It was the high point of her sporting life.","It was the most difficult experience of my life as a teacher.","Soon I will begin my life as a parent.","She had some interesting stories about her life as a musician.","He lived in Paris for most of his life as a painter.","I've enjoyed our life together."],"opposite":"","synonyms":""},{"def":"the period of time when something exists or functions","examples":["In Italy the average life of a government is eleven months.","There are a few things you can do to extend the life of your carpet.","These machines have a limited life (= they do not function well for very long).","These smaller, lighter phones tend to have a shorter battery life.","life as something The International Stock Exchange started life as a coffee shop.","The building will now have a new life as a museum.","The hotel began life as a prison.","The magazine started life as a comic book in 1952.","By expanding your computer's storage you extend its useful life.","Refrigeration can extend the life of food products.","My new phone battery has a much longer life than the old one.","A steady temperature will help lengthen the life of the battery.","They could see that the company had a limited life (= it was going to close).","Publicity has a very short life, so make the most of it while you're in the news."],"opposite":"","synonyms":""},{"def":"the experience and activities that are typical of all people’s existences","examples":["the worries of everyday life","Commuting is a part of daily life for many people.","Trees and green spaces enhance our quality of life.","He is young and has little experience of life.","Jill wants to travel and see life for herself.","We have no time just to enjoy life.","Life can be hard.","We bought a dishwasher to make life easier.","Life isn't like in the movies, you know.","in life It's important to have a purpose in life.","In real life (= when she met him) he wasn't how she had imagined him at all.","life without something Can you imagine life without music?","You can share life events like getting married or becoming a parent.","He just needs a little more life experience.","Disappointment is part of normal life.","I wanted to see something of life before I settled down.","Eventually you adjust to life without your loved one.","Life with a baby is exhausting but wonderful.","I can't imagine life without work.","What would life be like if we didn't have the internet?","the brutal reality of life on the streets","His time in London was his first glimpse of the seamier side of life.","He always had a great love of life.","Technology has transformed every aspect of life.","Sometimes in life you have to make compromises.","Keeping busy helps you stay positive in life.","They accepted that it was their role in life to serve others.","She went through life always wanting what she couldn't get.","He always believed in living life to the full.","I've always had a fairly optimistic outlook on life.","They both seem to want the same things out of life.","Moving house is one of the most stressful life events there is."],"opposite":"","synonyms":""},{"def":"the activities and experiences that are typical of a particular way of living","examples":["We just want a normal family life.","Technology is part of modern life.","She enjoyed political life.","His fame was so sudden that he was unprepared for public life.","country/city/island life","How do you find life in Japan?","He eventually got used to life in prison.","Arguments are part of married life.","Island life has its own rhythms.","A child will take time to adjust to school life.","Communication is vital to the economic life of a country.","He finds city life very stressful.","Transport problems are part of life in the countryside.","Have you ever experienced life in a small town?","He had only ever known life in an institution.","the frenetic pace of modern life"],"opposite":"","synonyms":""},{"def":"a person’s experiences during their life; the activities that form a particular part of a person’s life","examples":["to have/live/lead a… life","He has had a good life.","She lived a quiet life in the countryside.","Many of these children have led very sheltered lives (= they have not had many different experiences).","a hard/an easy life","Her daily life involved meeting lots of people.","My day-to-day life is not very exciting.","Meeting Penny changed my life.","to affect/improve somebody's life","They emigrated to start a new life in Canada.","He doesn't like to talk about his private life.","She has a full social life.","a life of something They lead a life of luxury.","in somebody's life I don't want people like that in my life.","He has had a hard life.","She led a life of luxury.","He led a life of great hardship.","They live a life of toil.","They went to Australia to start a new life.","They're living a life of luxury in the Bahamas.","My life would be nothing without you.","Education has always been an important part of my life.","I find a positive attitude helps in every aspect of my life.","We all encounter challenges in our lives.","These are issues that affect our lives.","Meeting you has changed my life.","Learning meditation changed her life.","There are some discoveries that change lives.","We have the power to improve the lives of all Americans.","Architecture has the potential to transform human lives.","They moved here in search of a better life.","She leads a busy social life.","She did not tolerate press intrusion into her private life.","She is still rebuilding her life after the accident.","He never discussed the unhappiness of his past life.","Only his wife had access to his inner life."],"opposite":"","synonyms":""},{"def":"the quality of being active and exciting","examples":["This is a great holiday resort that is full of life.","We need to inject some new life into this project.","The market is bustling with life.","The streets are crowded and full of life.","They hope the new bars and restaurants will bring some life to an area normally dead after 8pm.","Let's put some life into this party!","The introduction of her character gives the movie a bit more life.","The city has started to have much more life, with new parks and shopping precincts.","She has brought new life to the team.","When she left it was as if all the life went out of the house.","All the life seemed to have gone out of the movement.","I love the energy and life of the city."],"opposite":"","synonyms":""},{"def":"the punishment of being sent to prison for life or a very long period of time; life imprisonment","examples":["The judge gave him life.","She is doing life for murder."],"opposite":"","synonyms":""},{"def":"a living model or a real object or scene that people draw or paint","examples":["She had lessons in drawing from life.","a life class (= one in which art students draw a naked man or woman)"],"opposite":"","synonyms":""},{"def":"a story of somebody’s life","examples":["She wrote a life of Mozart."],"opposite":"","synonyms":""},{"def":"one of a set number of chances before a player is out of a game","examples":["He's lost two lives, so he's only got one left."],"opposite":"","synonyms":""},{"def":"at the age you are (especially when you are not young)","examples":["Eyesight doesn't get any better at my time of life."],"opposite":"","synonyms":""},{"def":"be the most important person or thing to somebody","examples":["My children are my life.","Writing is his life."],"opposite":"","synonyms":""},{"def":"to improve something by introducing new ideas and making people more interested in it","examples":["The results of their research have breathed new life into the debate.","He hopes the development will breathe new life into the community.","They need some new, younger staff to breathe some life into the company."],"opposite":"","synonyms":""},{"def":"an essential part of a person’s existence","examples":["Playing the violin has been the breath of life to her for over 20 years."],"opposite":"","synonyms":""},{"def":"to make somebody/something more interesting or exciting","examples":["The new teacher really brought French to life for us.","Flowers can bring a dull room back to life."],"opposite":"","synonyms":""},{"def":"to become more interesting, exciting or full of activity","examples":["The match finally came to life in the second half.","The city only comes to life at night."],"opposite":"","synonyms":""},{"def":"to start to act or move as if alive","examples":["In my dream all my toys came to life."],"opposite":"","synonyms":""},{"def":"to die. People say ‘depart this life’ to avoid saying ‘die’.","examples":[],"opposite":"","synonyms":""},{"def":"an unhappy life, full of problems or unfair treatment","examples":["He led his poor partner a dog's life."],"opposite":"","synonyms":""},{"def":"to spend the last part of your life in a particular state or place","examples":["He ended his days in poverty."],"opposite":"","synonyms":""},{"def":"a situation that cannot be changed, especially one that is unpleasant","examples":["Illness is just a fact of life.","It’s a fact of life that some people will always be racist.","a rather harsh fact of life","It's a fact of life that you don't get anything for nothing.","It is an sad fact of life that the most deserving people do not often achieve the most success."],"opposite":"","synonyms":""},{"def":"the details about sex and about how babies are born, especially as told to children","examples":[],"opposite":"","synonyms":""},{"def":"to make a great effort to stay alive, especially when you are badly injured or seriously ill","examples":["A young cyclist is fighting for his life after the accident."],"opposite":"","synonyms":""},{"def":"as hard or as fast as possible","examples":["She was holding on to the rope for dear life.","Run for your life!"],"opposite":"","synonyms":""},{"def":"however hard you try","examples":["I cannot for the life of me imagine why they want to leave."],"opposite":"","synonyms":""},{"def":"to frighten somebody very much","examples":["You scared the life out of me coming in so suddenly like that."],"opposite":"","synonyms":""},{"def":"having a lot of energy","examples":["It's nice to see an old man still so full of life."],"opposite":"","synonyms":""},{"def":"used to tell somebody to stop being boring and to do something more interesting","examples":["Do us all a favour… get a life!"],"opposite":"","synonyms":""},{"def":"to hold somebody/something very tightly because you are afraid","examples":[],"opposite":"","synonyms":""},{"def":"to be very lucky in dangerous situations","examples":[],"opposite":"","synonyms":""},{"def":"to enjoy yourself very much","examples":[],"opposite":"","synonyms":""},{"def":"feeling frightened that you might be killed","examples":[],"opposite":"","synonyms":""},{"def":"a method of helping somebody who has stopped breathing to breathe again by placing your mouth on theirs and forcing air into their lungs","examples":[],"opposite":"","synonyms":""},{"def":"used to show surprise at seeing somebody/something","examples":["I hadn’t seen her for fifteen years and then there she was, (as) large as life."],"opposite":"","synonyms":""},{"def":"looking or behaving in a way that is more interesting or exciting than other people, and so is likely to attract attention","examples":["He's a larger than life character."],"opposite":"","synonyms":""},{"def":"to die in order to save somebody/something","examples":["They were prepared to lay down their lives for their country."],"opposite":"","synonyms":""},{"def":"to live a happy and comfortable life with no problems or responsibilities","examples":["The two crooks had been living the life of Riley.","He planned to retire early and then lead the life of Riley."],"opposite":"","synonyms":""},{"def":"the chance to live or last longer, or with a better quality of life","examples":["Since her hip operation she's had a new lease of life."],"opposite":"","synonyms":""},{"def":"the possibility or belief that people continue to exist in some form after they die","examples":["Do you believe in life after death?"],"opposite":"","synonyms":""},{"def":"the liveliest and funniest person at a party, etc.","examples":[],"opposite":"","synonyms":""},{"def":"used to say that there is a situation in which it is not thought to be important if people somewhere die or are treated badly","examples":[],"opposite":"","synonyms":""},{"def":"seeming to move or function by itself without a person touching or working it","examples":[],"opposite":"","synonyms":""},{"def":"used to say that it is not worth wasting time doing something that you dislike or that is not important","examples":["Life's too short to sit around moping."],"opposite":"","synonyms":""},{"def":"the person somebody loves more than any other","examples":[],"opposite":"","synonyms":""},{"def":"to cause problems for somebody","examples":["She does everything she can to make life difficult for him."],"opposite":"","synonyms":""},{"def":"to behave in a way that makes somebody else feel very unhappy","examples":["My old boss used to make my life a misery.","His constant criticism made her life a misery."],"opposite":"","synonyms":""},{"def":"the man or woman that you are having a sexual or romantic relationship with","examples":["Anna has a new man in her life."],"opposite":"","synonyms":""},{"def":"used to describe a situation that is very important or serious","examples":["You mustn't let anyone know— it's a matter of life and death.","These talks are a matter of life or death for the factory."],"opposite":"","synonyms":""},{"def":"to be completely unable to do something","examples":["He can't interview people to save his life."],"opposite":"","synonyms":""},{"def":"used to say that you will definitely not do something","examples":[],"opposite":"","synonyms":""},{"def":"to risk being killed or injured in order to do something","examples":["She risked life and limb to save her children from the fire."],"opposite":"","synonyms":""},{"def":"a film, play or book that gives a very realistic view of ordinary life","examples":["This drama provides a slice of life in 1950s Connecticut."],"opposite":"","synonyms":""},{"def":"to suddenly start working or doing something","examples":["‘Let's go!’ he said, springing into action.","The town springs to life (= becomes busy) during the carnival."],"opposite":"","synonyms":""},{"def":"a basic food, especially bread","examples":[],"opposite":"","synonyms":""},{"def":"to kill somebody","examples":[],"opposite":"","synonyms":""},{"def":"to kill yourself","examples":["She took her own life."],"opposite":"","synonyms":""},{"def":"to risk being killed","examples":["You take your life in your hands just crossing the road here."],"opposite":"","synonyms":""},{"def":"used when you are disappointed about something but know that you must accept it","examples":["It’s a shame I can’t go on the trip, but that’s life."],"opposite":"","synonyms":""},{"def":"when you say that’s the story of my life about a bad experience you have had, you mean you have had many similar experiences","examples":["Another missed opportunity—that’s the story of my life!","Out of work with no money—that's the story of my life."],"opposite":"","synonyms":""},{"def":"seeming real rather than invented","examples":["I don’t think the characters are very true to life."],"opposite":"","synonyms":""},{"def":"having a range of different experiences makes life more interesting","examples":[],"opposite":"","synonyms":""},{"def":"a person’s job or position in society","examples":["She has friends from all walks of life."],"opposite":"","synonyms":""},{"def":"the typical pattern of behaviour of a person or group","examples":["the American way of life","She loved the Spanish way of life and immediately felt at home there.","the beliefs and practices of the Hindu way of life"],"opposite":"","synonyms":""},{"def":"in a bad situation you must not give up hope because there is always a chance that it will improve","examples":[],"opposite":"","synonyms":""},{"def":"used to say that you are certain that something will happen","examples":["You can bet your life that he'll be late."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"at my, your, his, etc. time of life","def":"at the age you are (especially when you are not young)","examples":["Eyesight doesn't get any better at my time of life."]},{"idiom":"be somebody’s life","def":"be the most important person or thing to somebody","examples":["My children are my life.","Writing is his life."]},{"idiom":"breathe (new) life into something","def":"to improve something by introducing new ideas and making people more interested in it","examples":["The results of their research have breathed new life into the debate.","He hopes the development will breathe new life into the community.","They need some new, younger staff to breathe some life into the company."]},{"idiom":"the breath of life to/for somebody","def":"an essential part of a person’s existence","examples":["Playing the violin has been the breath of life to her for over 20 years."]},{"idiom":"bring somebody/something to life","def":"to make somebody/something more interesting or exciting","examples":["The new teacher really brought French to life for us.","Flowers can bring a dull room back to life."]},{"idiom":"come to life","def":"to become more interesting, exciting or full of activity","examples":["The match finally came to life in the second half.","The city only comes to life at night.","In my dream all my toys came to life."]},{"idiom":"depart this life","def":"to die. People say ‘depart this life’ to avoid saying ‘die’.","examples":[]},{"idiom":"a dog’s life","def":"an unhappy life, full of problems or unfair treatment","examples":["He led his poor partner a dog's life."]},{"idiom":"end your days/life (in something)","def":"to spend the last part of your life in a particular state or place","examples":["He ended his days in poverty."]},{"idiom":"a fact of life","def":"a situation that cannot be changed, especially one that is unpleasant","examples":["Illness is just a fact of life.","It’s a fact of life that some people will always be racist.","a rather harsh fact of life","It's a fact of life that you don't get anything for nothing.","It is an sad fact of life that the most deserving people do not often achieve the most success."]},{"idiom":"the facts of life","def":"the details about sex and about how babies are born, especially as told to children","examples":[]},{"idiom":"fight for (your) life","def":"to make a great effort to stay alive, especially when you are badly injured or seriously ill","examples":["A young cyclist is fighting for his life after the accident."]},{"idiom":"for dear life | for your life","def":"as hard or as fast as possible","examples":["She was holding on to the rope for dear life.","Run for your life!"]},{"idiom":"for the life of you","def":"however hard you try","examples":["I cannot for the life of me imagine why they want to leave."]},{"idiom":"frighten/scare the life out of somebody","def":"to frighten somebody very much","examples":["You scared the life out of me coming in so suddenly like that."]},{"idiom":"full of beans/life","def":"having a lot of energy","examples":["It's nice to see an old man still so full of life."]},{"idiom":"get a life","def":"used to tell somebody to stop being boring and to do something more interesting","examples":["Do us all a favour… get a life!"]},{"idiom":"hang/hold on for dear life","def":"to hold somebody/something very tightly because you are afraid","examples":[]},{"idiom":"have nine lives","def":"to be very lucky in dangerous situations","examples":[]},{"idiom":"have the time of your life","def":"to enjoy yourself very much","examples":[]},{"idiom":"in fear of your life","def":"feeling frightened that you might be killed","examples":[]},{"idiom":"the kiss of life","def":"a method of helping somebody who has stopped breathing to breathe again by placing your mouth on theirs and forcing air into their lungs","examples":[]},{"idiom":"(as) large as life","def":"used to show surprise at seeing somebody/something","examples":["I hadn’t seen her for fifteen years and then there she was, (as) large as life."]},{"idiom":"larger than life","def":"looking or behaving in a way that is more interesting or exciting than other people, and so is likely to attract attention","examples":["He's a larger than life character."]},{"idiom":"lay down your life (for somebody/something)","def":"to die in order to save somebody/something","examples":["They were prepared to lay down their lives for their country."]},{"idiom":"lead/live the life of Riley","def":"to live a happy and comfortable life with no problems or responsibilities","examples":["The two crooks had been living the life of Riley.","He planned to retire early and then lead the life of Riley."]},{"idiom":"a (new) lease of life","def":"the chance to live or last longer, or with a better quality of life","examples":["Since her hip operation she's had a new lease of life."]},{"idiom":"life after death","def":"the possibility or belief that people continue to exist in some form after they die","examples":["Do you believe in life after death?"]},{"idiom":"the life and soul of the party, etc.","def":"the liveliest and funniest person at a party, etc.","examples":[]},{"idiom":"life is cheap","def":"used to say that there is a situation in which it is not thought to be important if people somewhere die or are treated badly","examples":[]},{"idiom":"(have) a life of its own","def":"seeming to move or function by itself without a person touching or working it","examples":[]},{"idiom":"life’s too short","def":"used to say that it is not worth wasting time doing something that you dislike or that is not important","examples":["Life's too short to sit around moping."]},{"idiom":"the light of somebody’s life","def":"the person somebody loves more than any other","examples":[]},{"idiom":"make life difficult (for somebody)","def":"to cause problems for somebody","examples":["She does everything she can to make life difficult for him."]},{"idiom":"make somebody’s life a misery","def":"to behave in a way that makes somebody else feel very unhappy","examples":["My old boss used to make my life a misery.","His constant criticism made her life a misery."]},{"idiom":"the man/woman in your life","def":"the man or woman that you are having a sexual or romantic relationship with","examples":["Anna has a new man in her life."]},{"idiom":"a matter of life and/or death","def":"used to describe a situation that is very important or serious","examples":["You mustn't let anyone know— it's a matter of life and death.","These talks are a matter of life or death for the factory."]},{"idiom":"not be able to do something to save your life","def":"to be completely unable to do something","examples":["He can't interview people to save his life."]},{"idiom":"not on your life","def":"used to say that you will definitely not do something","examples":[]},{"idiom":"risk life and limb","def":"to risk being killed or injured in order to do something","examples":["She risked life and limb to save her children from the fire."]},{"idiom":"a slice of life","def":"a film, play or book that gives a very realistic view of ordinary life","examples":["This drama provides a slice of life in 1950s Connecticut."]},{"idiom":"spring into action | spring into/to life","def":"to suddenly start working or doing something","examples":["‘Let's go!’ he said, springing into action.","The town springs to life (= becomes busy) during the carnival."]},{"idiom":"the staff of life","def":"a basic food, especially bread","examples":[]},{"idiom":"take somebody’s life","def":"to kill somebody","examples":[]},{"idiom":"take your (own) life","def":"to kill yourself","examples":["She took her own life."]},{"idiom":"take your life in your hands","def":"to risk being killed","examples":["You take your life in your hands just crossing the road here."]},{"idiom":"that’s life","def":"used when you are disappointed about something but know that you must accept it","examples":["It’s a shame I can’t go on the trip, but that’s life."]},{"idiom":"that’s the story of my life","def":"when you say that’s the story of my life about a bad experience you have had, you mean you have had many similar experiences","examples":["Another missed opportunity—that’s the story of my life!","Out of work with no money—that's the story of my life."]},{"idiom":"true to life","def":"seeming real rather than invented","examples":["I don’t think the characters are very true to life."]},{"idiom":"variety is the spice of life","def":"having a range of different experiences makes life more interesting","examples":[]},{"idiom":"a walk of life","def":"a person’s job or position in society","examples":["She has friends from all walks of life."]},{"idiom":"a/the/somebody’s way of life","def":"the typical pattern of behaviour of a person or group","examples":["the American way of life","She loved the Spanish way of life and immediately felt at home there.","the beliefs and practices of the Hindu way of life"]},{"idiom":"where there’s life (, there’s hope)","def":"in a bad situation you must not give up hope because there is always a chance that it will improve","examples":[]},{"idiom":"you can bet your life/your bottom dollar (on something/(that)…)","def":"used to say that you are certain that something will happen","examples":["You can bet your life that he'll be late."]}],"phrasal":[],"related":["Life","low life","low-life","pro-life","sex life","half-life","high life","life form","life peer","life raft","life-size","life vest","long-life","love life","real-life","true-life","double life","life-saving","life coach","life cover"]},{"pos":"","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lif/life_/life__us_2.mp3","level":"","meanings":[{"def":"a former US magazine which was known especially for its photographs. It was first published in 1936 by Henry Luce who owned Time magazine. His aim was to enable readers ‘to see life; to see the world; to witness great events’. It was published every week until 1972, when it went out of business. It was brought back in 1978, appearing every month until 2000. From 2004 to 2007 it was given free every week with certain newspapers. It closed in 2007.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]