[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lif/lifet/lifetime__us_1.mp3","phonsUS":"/ˈlaɪftaɪm/","level":"B2","meanings":[{"def":"the length of time that somebody lives or that something lasts","examples":["a lifetime of experience","in/during somebody's lifetime His diary was not published during his lifetime.","in the lifetime of something These spending commitments are not achievable in the lifetime of the present government.","Memories can last a lifetime.","He had spent a lifetime trying to please his father.","The veteran actor was honoured with a lifetime achievement award.","He received a lifetime ban from cycling after testing positive for a performance-enhancing drug.","After a lifetime as a journalist in the trouble spots of the world, he retired to the country.","College seems half a lifetime away.","Christmas feels like a lifetime ago.","He devoted a lifetime to working with disabled children.","I've seen many changes during my lifetime.","It seems a lifetime since we first met.","It's hard to break the habits of a lifetime.","Payments are based on expected lifetime income.","She spent a lifetime in politics.","That’s more money than I’m likely to make in my entire lifetime.","The images are part of a lifetime's worth of photographs from Cohen's long career.","The veteran director won a lifetime achievement award.","This watch should last you a lifetime.","You can live a whole lifetime and not witness such an event.","wisdom gained in the course of a long lifetime","He has nothing to look forward to but a lifetime of misery.","Only two volumes of his poetry were published during his lifetime."],"opposite":"","synonyms":""},{"def":"a wonderful opportunity, etc. that you are not likely to get again","examples":["When she was offered the job she knew it was the chance of a lifetime.","the trip/experience/opportunity of a lifetime","It was the holiday of a lifetime!","She gave the performance of a lifetime.","For the chance of a lifetime fill in the coupon below and send it to the following address."],"opposite":"","synonyms":""},{"def":"used to describe something special that is not likely to happen to you again","examples":["An opportunity like this comes once in a lifetime.","a once-in-a-lifetime experience","That sort of thing happens only once in a lifetime."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the chance, etc. of a lifetime","def":"a wonderful opportunity, etc. that you are not likely to get again","examples":["When she was offered the job she knew it was the chance of a lifetime.","the trip/experience/opportunity of a lifetime","It was the holiday of a lifetime!","She gave the performance of a lifetime.","For the chance of a lifetime fill in the coupon below and send it to the following address."]},{"idiom":"once in a lifetime","def":"used to describe something special that is not likely to happen to you again","examples":["An opportunity like this comes once in a lifetime.","a once-in-a-lifetime experience","That sort of thing happens only once in a lifetime."]}],"phrasal":[],"related":[]}]