[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lif/lift_/lift__us_1.mp3","phonsUS":"/lɪft/","level":"A2","meanings":[{"def":"to raise somebody/something or be raised to a higher position or level","examples":["lift somebody/something I lifted the lid of the box and peered in.","She lifted her head to look at him.","lift somebody/something up He lifted the toddler up and cuddled her.","lift somebody/something (up) + adv./prep. He stood there with his arms lifted above his head.","(figurative) John lifted his eyes (= looked up) from his book.","Her eyebrows lifted. ‘Apologize? Why?’","Her head lifted sharply","Juliet nodded, lifting her face to David's.","The box was so heavy I could barely lift it."],"opposite":"","synonyms":""},{"def":"to take hold of somebody/something and move them/it to a different position","examples":["I lifted the baby out of the chair.","He lifted the suitcase down from the rack.","Carefully lift the cake off the tray and cool on a wire rack.","He felt as if an enormous weight had been lifted from his shoulders.","He hugged her, almost lifting her off the ground.","She lifted the book up off the table.","She lifted the child over the fence.","She was lifted bodily aboard by two sailors.","She leaned on him and he half lifted her down the stairs.","She lifted back the sheet.","The heavy beams were lifted into place."],"opposite":"","synonyms":""},{"def":"to transport people or things by air","examples":["The survivors were lifted to safety by helicopter."],"opposite":"","synonyms":""},{"def":"to give somebody/something the ability to escape from a difficult situation","examples":["The best way to lift nations out of poverty is through trade."],"opposite":"","synonyms":""},{"def":"to remove or end controls or limits","examples":["The government decided to lift the ban on arms exports.","to lift sanctions/restrictions","The US remained opposed to lifting the embargo.","Martial law has now been lifted.","The police managed to restore calm and the curfew was partially lifted."],"opposite":"","synonyms":""},{"def":"to become or make somebody more cheerful","examples":["His heart lifted at the sight of her.","lift something The news lifted our spirits."],"opposite":"","synonyms":""},{"def":"to rise and disappear","examples":["The fog began to lift.","(figurative) Gradually my depression started to lift.","The fog suddenly lifted."],"opposite":"","synonyms":""},{"def":"to steal something","examples":["He had been lifting electrical goods from the store where he worked."],"opposite":"","synonyms":""},{"def":"to use somebody’s ideas or words without asking permission or without saying where they come from","examples":["She lifted most of the ideas from a book she had been reading.","lines lifted from a famous poem"],"opposite":"","synonyms":""},{"def":"to dig up vegetables or plants from the ground","examples":["to lift potatoes"],"opposite":"","synonyms":""},{"def":"to make the amount or level of something greater; to become greater in amount or level","examples":["Interest rates were lifted yesterday.","The redevelopment along the river should help lift property prices in the area."],"opposite":"","synonyms":""},{"def":"to do nothing to help somebody","examples":["The children never lift a finger to help around the house."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"not lift/raise a finger/hand (to do something)","def":"to do nothing to help somebody","examples":["The children never lift a finger to help around the house."]}],"phrasal":["lift off"],"related":["lift off","lift-off","ski lift","drag lift","button lift","Lift Every Voice and Sing","lift-offs","T-bar lift","lift the lid on something","not lift/raise a finger/hand (to do something)","not raise/lift a finger/hand (to do something)"]},{"pos":"noun","level":"A2","meanings":[{"def":"a machine that carries people or goods up and down to different levels in a building or a mine","examples":["It's on the sixth floor—let's take the lift.","We got the lift to the tenth floor.","in a lift I went down in the lift and made my way to reception.","She got into the lift and pressed the button for the fourth floor.","They spotted him coming out of the lift.","The hotel has a private lift linking it to the beach.","The lift serves the top four floors of the building.","We took the lift down to the ground floor."],"opposite":"","synonyms":""},{"def":"a free ride in a car, etc. to a place you want to get to","examples":["I'm going your way—do you want a lift?","I got a lift from a friend.","lift + adv./prep. I'll give you a lift to the station.","Could I have a lift into town?","They offered me a lift home.","She hitched a lift on a truck.","We stood by the roadside and thumbed a lift.","Could you give me a lift to the station?","His car broke down and he hitched a lift into town."],"opposite":"","synonyms":""},{"def":"a feeling of being happier or more confident than before","examples":["Passing the exam gave him a real lift.","Winning the semi-final gave the team a huge lift."],"opposite":"","synonyms":""},{"def":"a movement in which something rises or is lifted up","examples":["the puzzled lift of his eyebrows","He looked at me with a quizzical lift of his eyebrows."],"opposite":"","synonyms":""},{"def":"an act of lifting somebody/something","examples":["When lifting heavy objects, keep your back straight, bend at the knees and power the lift with your legs."],"opposite":"","synonyms":""},{"def":"the pressure of air moving upwards on an aircraft when flying","examples":[],"opposite":"","synonyms":""},{"def":"an increase in price, level or amount","examples":["The company has seen a 10 per cent lift in profits since the last financial year."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]