[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lig/light/light__us_1.mp3","phonsUS":"/laɪt/","level":"A1","meanings":[{"def":"the energy from the sun, a lamp, etc. that makes it possible to see things","examples":["bright/dim light","a room with good natural light","White paint reflects the light.","The light was beginning to fail (= it was beginning to get dark).","The knife gleamed as it caught the light (= as the light shone on it).","The substance causes the bacteria to emit light.","Some light filters through the dense tree cover.","by the light of something She could just see by the light of the candle.","in the fading light of a summer’s evening","into the light Bring it into the light so I can see it.","towards the light The plants grow towards the light.","travelling at the speed of light","a beam/ray of light","a light source/beam","changes in light intensity","Bring it into the light and we'll have a look at it.","In winter here there are many more hours of darkness than light.","The bleach may have lost its effectiveness due to exposure to light or heat.","Yellow brings light and warmth into a room.","Lamps threw small pools of light on the carpet.","Light streamed in through the window.","Objects reflect, transmit or absorb the light which falls upon them.","In full light, you could see stains all over the coat.","Light from a tall lamp fell in a pool on the desk.","Nothing can travel faster than the speed of light.","She held up the letter against the light.","The lamp was the only source of light in the room.","The place looked calm in the golden evening light.","There was a flash of light followed by an explosion.","They managed to see where the door was by the light of the moon.","We could hardly see the ball in the failing light.","We were momentarily blinded by the light of the sun.","You could see the imperfections in the repair when the light caught it.","film that is sensitive to ultraviolet light","in the cold light of morning","light emitted by a star","the light from the kitchen window","He squinted in the bright light.","The light reflecting off the snow was dazzling.","We could only just make out the path in the dim light."],"opposite":"","synonyms":""},{"def":"a particular type of light with its own colour or qualities","examples":["A cold, grey light crept under the curtains.","It glowed and gave off a white light.","The fluorescent tubes emit a harsh light.","The scene is bathed in an artificial yellow light.","A pale light streamed through the window.","They are only 18 watt but give a light equal to old-style 100 watt bulbs.","The lamps give a cold bluish light.","The digital clock produces a sickly green light.","The tubes emit different-coloured lights."],"opposite":"","synonyms":""},{"def":"a thing that produces light, especially an electric light","examples":["to turn/switch the lights on/off","to turn out the light(s)","to turn down/dim the lights","the lights fade/flicker","The lights dimmed and the film began.","Suddenly all the lights went out.","It was an hour before the lights came on again.","A light flashed in the distance.","A bright light shone in his eyes.","ceiling/wall lights","The city twinkled with Christmas lights.","A police car went by with flashing lights.","Keep going—the lights (= traffic lights) are green.","Check your car before you drive to make sure that your lights are working.","He was cycling at night without lights.","She felt along the wall and found the light switch.","A light was still burning in the bedroom.","The company installed fluorescent lights to cut energy costs.","They strung the room with party lights.","I could see a flashing light.","I need a bedside light for reading.","I'll put on the outside lights for when you arrive.","We leave the landing light on at night.","You've left the porch light on.","They had wrought iron light fixtures made for the yard.","The dining room features sleek Art Deco light fittings.","A warning light goes on when the battery is running low.","He flashed his lights to warn the oncoming cars.","Some cars already had their lights on.","Someone shone a light in my face.","The blue light was flashing.","The pilot could just make out the runway landing lights.","The warning light came on.","a dark country lane with no lights","It was getting dark and the street lights had come on.","The lights dimmed and the curtain rose.","Turn on the lights!","The light flickered a couple of times then went out.","The car was stopped at the side of the road with its hazard lights flashing."],"opposite":"","synonyms":""},{"def":"an expression in somebody’s eyes that shows what they are thinking or feeling","examples":["There was a soft light in her eyes as she looked at him."],"opposite":"","synonyms":""},{"def":"light colours in a picture, which contrast with darker ones","examples":["Examine the artist's use of light and shade.","contrasting areas of light and dark"],"opposite":"","synonyms":""},{"def":"a match or device with which you can light a cigarette","examples":["(British English) Have you got a light?","(North American English, British English) Do you have a light?","Could you give me a light?"],"opposite":"","synonyms":""},{"def":"a window or an opening to allow light in","examples":["leaded lights","the lighting system","the movie’s interesting lighting effects","The lighting at the disco was fantastic."],"opposite":"","synonyms":""},{"def":"according to the standards that somebody sets for himself or herself","examples":["The police were left to do the job according to their lights."],"opposite":"","synonyms":""},{"def":"to be between somebody and a source of light","examples":["Could you move—you're in my light."],"opposite":"","synonyms":""},{"def":"to go to sleep very quickly","examples":["She returned to bed and went out like a light."],"opposite":"","synonyms":""},{"def":"to be pleasant, friendly and polite","examples":["I can’t complain—he’s been all sweetness and light with me.","People think she's all sweetness and light, but she actually has a temper."],"opposite":"","synonyms":""},{"def":"to be fun and easy to deal with","examples":["It’s not all sweetness and light being an actor."],"opposite":"","synonyms":""},{"def":"the excitement of city life","examples":["Although he grew up in the country, he's always had a taste for the bright lights."],"opposite":"","synonyms":""},{"def":"to make new information known to people","examples":["These facts have only just been brought to light."],"opposite":"","synonyms":""},{"def":"to make a problem, etc. easier to understand","examples":["Recent research has thrown new light on the causes of the disease."],"opposite":"","synonyms":""},{"def":"to become known to people","examples":["New evidence has recently come to light."],"opposite":"","synonyms":""},{"def":"to not let people know that you are good at something","examples":[],"opposite":"","synonyms":""},{"def":"when you have had time to think calmly about something; in the morning when things are clearer","examples":["These things always look different in the cold light of day."],"opposite":"","synonyms":""},{"def":"if you see something or put something in a good, bad, etc. light, it seems good, bad, etc.","examples":["You must not view what happened in a negative light.","They want to present their policies in the best possible light."],"opposite":"","synonyms":""},{"def":"after considering something","examples":["He rewrote the book in the light of further research."],"opposite":"","synonyms":""},{"def":"to fail to stop at a red traffic light","examples":[],"opposite":"","synonyms":""},{"def":"something that shows you are nearly at the end of a long and difficult time or situation","examples":["For the first time since the start of his treatment, we can now see light at the end of the tunnel."],"opposite":"","synonyms":""},{"def":"somebody suddenly understood or began to understand something","examples":["I puzzled over the problem for ages before the light suddenly dawned."],"opposite":"","synonyms":""},{"def":"the person somebody loves more than any other","examples":[],"opposite":"","synonyms":""},{"def":"used to describe somebody who is stupid, not thinking clearly or not paying attention","examples":[],"opposite":"","synonyms":""},{"def":"to finally understand or accept something, especially something obvious","examples":["He thinks she’s wonderful but he’ll soon see the light! (= realize that she’s not)"],"opposite":"","synonyms":""},{"def":"to begin to believe in a religion","examples":[],"opposite":"","synonyms":""},{"def":"to begin to exist or to become publicly known about","examples":["He's written a lot of good material that has never seen the light of day.","Some of his paintings never even saw the light of day."],"opposite":"","synonyms":""},{"def":"to make something start burning","examples":["A spark from the fire had set light to a rug."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"according to somebody’s/something’s lights","def":"according to the standards that somebody sets for himself or herself","examples":["The police were left to do the job according to their lights."]},{"idiom":"be in somebody’s light","def":"to be between somebody and a source of light","examples":["Could you move—you're in my light."]},{"idiom":"be/go out like a light","def":"to go to sleep very quickly","examples":["She returned to bed and went out like a light."]},{"idiom":"be (all) sweetness and light","def":"to be pleasant, friendly and polite","examples":["I can’t complain—he’s been all sweetness and light with me.","People think she's all sweetness and light, but she actually has a temper.","It’s not all sweetness and light being an actor."]},{"idiom":"the bright lights","def":"the excitement of city life","examples":["Although he grew up in the country, he's always had a taste for the bright lights."]},{"idiom":"bring something to light","def":"to make new information known to people","examples":["These facts have only just been brought to light."]},{"idiom":"cast/shed/throw light on something","def":"to make a problem, etc. easier to understand","examples":["Recent research has thrown new light on the causes of the disease."]},{"idiom":"come to light","def":"to become known to people","examples":["New evidence has recently come to light."]},{"idiom":"hide your light under a bushel","def":"to not let people know that you are good at something","examples":[]},{"idiom":"in the cold light of day","def":"when you have had time to think calmly about something; in the morning when things are clearer","examples":["These things always look different in the cold light of day."]},{"idiom":"in a good, bad, favourable, etc. light","def":"if you see something or put something in a good, bad, etc. light, it seems good, bad, etc.","examples":["You must not view what happened in a negative light.","They want to present their policies in the best possible light."]},{"idiom":"in the light of something","def":"after considering something","examples":["He rewrote the book in the light of further research."]},{"idiom":"jump the lights","def":"to fail to stop at a red traffic light","examples":[]},{"idiom":"light at the end of the tunnel","def":"something that shows you are nearly at the end of a long and difficult time or situation","examples":["For the first time since the start of his treatment, we can now see light at the end of the tunnel."]},{"idiom":"(the) light dawned (on somebody)","def":"somebody suddenly understood or began to understand something","examples":["I puzzled over the problem for ages before the light suddenly dawned."]},{"idiom":"the light of somebody’s life","def":"the person somebody loves more than any other","examples":[]},{"idiom":"the lights are on but nobody’s home","def":"used to describe somebody who is stupid, not thinking clearly or not paying attention","examples":[]},{"idiom":"see the light","def":"to finally understand or accept something, especially something obvious","examples":["He thinks she’s wonderful but he’ll soon see the light! (= realize that she’s not)"]},{"idiom":"see the light (of day)","def":"to begin to exist or to become publicly known about","examples":["He's written a lot of good material that has never seen the light of day.","Some of his paintings never even saw the light of day."]},{"idiom":"set light to something","def":"to make something start burning","examples":["A spark from the fire had set light to a rug."]}],"phrasal":[],"related":["light on","light up","key light","light ale","light gun","light pen","red light","black light","brake light","fill light","first light","green light","green-light","half-light","light bulb","light cream","light globe"]},{"pos":"adjective","level":"A1","meanings":[{"def":"pale in colour","examples":["He's got light blue eyes.","Lighter shades suit you best.","People with pale complexions should avoid wearing light colours.","a box of light and dark chocolates","She has light brown hair.","The floors are light in colour.","We painted the walls light grey/​gray.","The larvae are light green.","a light-skinned man with black hair","The man was wearing a light coloured/​colored raincoat.","Green eye shadow can look very striking with light eyes.","Her hair is slightly lighter than her eyes.","Do you like this dark green, or maybe something a bit lighter?","Use a lighter tone of pink for your lips."],"opposite":"dark","synonyms":""},{"def":"full of light; having the natural light of day","examples":["We'll leave in the morning as soon as it's light.","It gets light at about 5 o'clock.","Let's go now while it's still light.","It was a light spacious apartment at the top of the building.","As soon as it grew light, we got up and dressed.","It stays light for so long on these summer evenings.","It's light until 9 pm in the summer.","What time does it get light?","I woke up early, before it was light.","It was almost light outside.","It was barely light yet.","It was not light enough to see things clearly.","It was starting to get light.","The sky turned light once more.","We'll set out as soon as it's completely light.","The whole house was beautifully light and airy.","a lovely light kitchen","They added more windows to make the space lighter.","Sit by the window to read, where it's light."],"opposite":"dark","synonyms":""},{"def":"easy to lift or move; not weighing very much","examples":["The device is light and portable.","Carry this bag—it's the lightest.","Hydrogen gas is lighter than air.","The little girl was as light as a feather.","The tent is light enough for backpacking and touring.","The aluminium body is considerably lighter than if built with steel.","The new coins are slightly smaller and noticeably lighter in weight.","The aluminium tow bars are signfiicantly lighter and easier to lift.","It is filled with gasoline to make it buoyant, since gasoline is lighter than water.","I pulled him to his feet. He was surprisingly light, or maybe I was just stronger than I thought.","Babies born to poorer mothers tend to have lighter birthweights."],"opposite":"heavy","synonyms":""},{"def":"of less than average or usual weight","examples":["light summer clothes","Only light vehicles are allowed over the old bridge.","wearing only very light clothes","the market for cars and light trucks","The bottle felt strangely light between my fingers.","It a bit light, so I think it's empty.","Most of them wore sandals or light shoes.","It's very warm, so just bring a light jacket for the evenings.","The dog should be secured with a rope or light chain.","They wear light body armour.","I like this coat because it's light and waterproof."],"opposite":"heavy","synonyms":""},{"def":"used with a unit of weight to say that something weighs less than it should do","examples":["The delivery of potatoes was several kilos light."],"opposite":"","synonyms":""},{"def":"gentle and without weight; not using much force","examples":["She felt a light tap on her shoulder.","the sound of quick light footsteps","You only need to apply light pressure.","As a boxer, he was always light on his feet (= quick and elegant in the way he moved).","A light touch sets the ball in motion.","A light touch on the screen will activate the sequence.","She gave the horse a light pat.","His breathing became lighter as he relaxed.","Her steps are light and graceful.","There was a light knock at the door.","She rested her hand on his knee and gave it a light squeeze.","The kiss was so light I hardly felt it.","She smiled, giving him a light kiss on the forehead.","Typing is done with light fingers.","I was able to close the case with light manual pressure.","The fruit is soft enough to mash with the lightest pressure.","The section should be played with just a light staccato.","The spear bit into his side, thankfully just a light jab."],"opposite":"heavy","synonyms":""},{"def":"easy to do; not making you tired","examples":["After his accident he was moved to lighter work.","some light housework","Her duties are relatively light.","You are probably well enough to take a little light exercise.","She does a bit of light gardening herself, but has someone to do the digging and mow the lawn.","I need someone to help me look after the children and do some light cleaning.","No cleaning is needed, just a light dusting.","His routine includes some light strength training.","He supplements his disability pay by doing light work.","She returns to work in September with a fairly light schedule.","I have a relatively light timetable this term.","Follow a day of intense training with a lighter one."],"opposite":"","synonyms":""},{"def":"not great in amount, degree, etc.","examples":["Traffic was light.","Light rain is forecast.","Civilian casualties were comparatively light.","Trading on the stock exchange was light today.","Apply a light coating of cooking oil.","Trading volume remains light.","The traffic is usually fairly light in the afternoons.","During the summer demand on the power grid is relatively light.","Exercise just enough to break a light sweat.","Turnout for the game was light.","There was a lighter turnout for the protest than expected.","Although total Allied losses were lighter than predicted, by nightfall over ten thousand men had been killed or wounded.","Everything was covered in a light coating of ash.","There wasn't much rain, just a light drizzle.","The forecast is for light showers.","It will be dry, with light winds.","At dawn the wind was light and the sky clear.","Rainfall has been light this spring.","We go out when the sea is calm or there's just a light swell."],"opposite":"heavy","synonyms":""},{"def":"fun rather than serious and not needing much mental effort","examples":["light reading for the beach","This is not something you'd watch for light entertainment.","light music/opera","We were just making light conversation.","Her novels are light, but very well written.","We all needed a little light relief at the end of a long day (= something funny or fun that comes after something serious or boring).","It's intended as light entertainment rather than a ‘message movie’.","I read light fiction as well as literary novels.","If you're in the mood for something light and goofy, this will do the trick.","This is a light romantic comedy.","The title leads one to expect something lighter and more playful.","a concert of light classical music"],"opposite":"","synonyms":""},{"def":"not serious","examples":["She kept her tone light.","This programme looks at the lighter side of politics.","The job does have its lighter moments.","Let’s talk about lighter things, shall we?","On a lighter note, we end the news today with a story about a duck called Quackers.","It's meant to be light and comical.","It was just a bit of light banter between friends.","The journey was full of light teasing and jokes.","In his next play, he aimed for a lighter tone.","This led to a light exchange between the lawyer and the judge which made the court laugh.","She made a light remark to relieve the tension.","We're focusing on the lighter aspects of family life.","There are some light moments, but overall the film is depressing.","Tom and I kept it light on the set, joking around with each other."],"opposite":"","synonyms":""},{"def":"not severe","examples":["He was convicted of assaulting a police officer but he got off with a light sentence.","The punishment can be remarkably light."],"opposite":"","synonyms":""},{"def":"small in quantity","examples":["a light meal/supper/snack/breakfast","Light refreshments will be provided.","I just want something light for lunch.","You can have a light meal the night before the surgery.","They're so tiny, they're not much more than a light snack.","Busy work schedules mean most people eat lighter meals during the day.","We ate a light supper in front of the television.","Lunch is usually light on weekdays."],"opposite":"heavy","synonyms":""},{"def":"not containing much fat, sugar or other rich ingredients and therefore easy to digest","examples":["Stick to a light diet.","a deliciously light alternative to cake","The soup was pleasantly light.","The fish was served with a surprisingly light garlic butter.","The seafood made a delightfully light and refreshing starter.","Have something light, such as steamed fish or vegetables.","If you want something a bit lighter, how about a fresh crab sandwich."],"opposite":"","synonyms":""},{"def":"containing a lot of air","examples":["This pastry is so light."],"opposite":"","synonyms":""},{"def":"low in alcohol","examples":["a light beer"],"opposite":"","synonyms":""},{"def":"containing a lot of water","examples":["I don't like my coffee too light.","I think I’ll have a light tea."],"opposite":"strong","synonyms":""},{"def":"carrying only light weapons","examples":["the light infantry/cavalry"],"opposite":"heavy","synonyms":""},{"def":"a person in a light sleep is easy to wake","examples":["She drifted into a light sleep.","I've always been a light sleeper."],"opposite":"deep","synonyms":""},{"def":"free from worry; cheerful","examples":["I left the island with a light heart."],"opposite":"","synonyms":""},{"def":"to not have enough of something","examples":["We seem to be light on fuel."],"opposite":"","synonyms":""},{"def":"the ability to deal with something in a sensitive and relaxed way","examples":["She handles this difficult subject with a light touch."],"opposite":"","synonyms":""},{"def":"to treat something as not being important and not serious","examples":["I didn’t mean to make light of your injuries."],"opposite":"","synonyms":""},{"def":"to do something quickly and with little effort","examples":[],"opposite":"","synonyms":""},{"def":"used to say that a job is made easier if a lot of people help","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be light on something","def":"to not have enough of something","examples":["We seem to be light on fuel."]},{"idiom":"a light touch","def":"the ability to deal with something in a sensitive and relaxed way","examples":["She handles this difficult subject with a light touch."]},{"idiom":"make light of something","def":"to treat something as not being important and not serious","examples":["I didn’t mean to make light of your injuries."]},{"idiom":"make light work of something","def":"to do something quickly and with little effort","examples":[]},{"idiom":"many hands make light work","def":"used to say that a job is made easier if a lot of people help","examples":[]}],"phrasal":[],"related":[]},{"pos":"verb","level":"A2","meanings":[{"def":"to make something start to burn","examples":["She lit a candle.","Come in, I'll light a fire and you can get warmed up.","to light a cigarette/cigar/pipe","The gas lamps were lit.","I put a lighted match to the letter and watched it burn.","The fire is thought to have started when someone dropped a lit cigarette.","Steve took out a cigarette and lit it.","She leaned across to light my cigarette.","She lit the copper lamp on her desk.","The candles were lit.","Light the fuse, then stand well back.","Bonfires were lit on nearby hills.","The procession approached carrying lighted torches.","She brought a lighted taper for the candles.","He lit the Olympic flame in Atlanta.","Beacons were lit on the clifftops as a warning.","Children should not be allowed to light fireworks.","You need to keep the pilot light lit.","They filled and lit kerosene lanterns.","It was her job to light the stove in the morning.","The Hindu tradition is that the eldest son must light his father's funeral pyre."],"opposite":"","synonyms":""},{"def":"to start to burn","examples":["The fire wouldn't light.","The matches were damp and he couldn't get them to light.","It took three attempts to get the gas to light.","Her cigarette wouldn't light.","If the pilot won't light, call an engineer.","Don't return to a firework that doesn't light.","The kindling lights easily."],"opposite":"","synonyms":""},{"def":"to give light to something or to a place","examples":["be lit (by something) At night the hall was lit by candles.","a dimly lit street","a brightly lit room","light something They use lanterns to light the room.","the lighted windows of the house","The stage was lit by bright spotlights.","The entire scene was lit only by candles.","The painting shows a kitchen dimly lit by a tallow lamp.","The cellar was lit by a bulb dangling from a cord.","a table lit by a single lamp","a corridor lit by flaming torches","a softly lit bedroom","a beautifully lit scene","a room harshly lit with a single bare bulb","a series of starkly lit black and white photographs","The film is so darkly lit it's hard to see what's going on.","Make sure you always park your car in busy, well lit streets.","The room was dark now, lit only by a single candle.","The dining room is lit by a floor-length window.","The house was dark except for one lighted window upstairs.","They installed gas apparatus to light the factory.","(figurative) A gleam of humour momentarily lit his face."],"opposite":"","synonyms":""},{"def":"to guide somebody with a light","examples":["Our way was lit by a full moon."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["light on","light up","light upon"],"related":[]},{"pos":"adverb","level":"","meanings":[{"def":"to take very little with you when you go on a trip","examples":["She travels light, choosing to use as little equipment as possible."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"travel light","def":"to take very little with you when you go on a trip","examples":["She travels light, choosing to use as little equipment as possible."]}],"phrasal":[],"related":[]}]