[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lik/likel/likely__us_2.mp3","phonsUS":"/ˈlaɪkli/","level":"A2","meanings":[{"def":"having a good chance of happening or being something; probable or expected","examples":["the most likely explanation/outcome/scenario","the likely cause/consequence","a likely nominee/contender/winner","A threat level of ‘Severe’ means a terrorist attack is highly likely.","They might ask for help or, more likely, just give up.","likely to do something Tickets are likely to be expensive.","The beetles are likely to cause damage.","There is likely to be heavy snowfall.","likely (that)… It's hardly likely (that) they'll refuse.","It is quite likely the discussion may never take place.","It's pretty much inevitable that prices will go up this year.","I think it's likely to rain this afternoon.","I’m probably going to be away then.","I guess there's a fifty per cent chance that they'll say no.","It's unlikely, but not totally impossible, I suppose.","They can't possibly/​really be serious about buying a boat!","Let's start without them. They're bound to be late.","By 2050, one in six people on the planet will be aged 65 or over.","The number of people globally aged 65 and over is expected/likely to more than double by 2050.","Experts have predicted/forecast that the over-65s will make up 17 per cent of the global population by 2050.","World population is set to reach 9.8 billion by 2050.","Net migration into Britain over the last decade was higher than expected.","Overall population growth in Britain has been in line with predictions.","What is the most likely cause of the infection?","It's very likely they already have their own website.","Workplaces that scored highest for employee satisfaction were 38% more likely to have above-average productivity.","Severe storms are most likely to occur in October and November.","Older people are more likely to die of the disease.","Women are more likely to have the condition than men.","You are less likely to have problems if you plan ahead.","It is likely to remain cold all weekend.","This is one of the strangest art galleries you're ever likely to see.","This is likely to cause problems further down the line.","Economists warn that this willingness to lend is not likely to continue.","The most likely explanation for these changes is a decline in insect numbers.","I think there's a more likely explanation.","We need to talk honestly about the likely outcomes of these different choices.","We'd be fine if someone gave us $200 000 but that, unfortunately, is not a likely scenario.","The rising cost of housing is the most likely culprit.","We discussed the likely consequences of the vote.","The retiring Chairman was photographed having lunch with his likely successor.","a list of likely Oscar nominees","His movie is still the most likely winner of this year's Best Picture.","a development they believed would make nuclear war more likely","Juries became increasingly likely to acquit.","Violence may appeal to some viewers, but it's equally likely to put people off.","They're hardly likely to get home before ten.","This match was never likely to be a classic.","It is entirely likely that the company will make another offer.","It's more than likely that the thieves don't know how much it is worth.","It is highly likely that the factory will have to close.","The doctors didn't think it likely that she would ever heal completely."],"opposite":"","synonyms":""},{"def":"seeming suitable for a purpose","examples":["She seems the most likely candidate for the job."],"opposite":"","synonyms":""},{"def":"used to show that you do not believe what somebody has said","examples":["You just found it lying in the street? A likely story!","He said he'd met Rihanna. A likely story."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a likely story","def":"used to show that you do not believe what somebody has said","examples":["You just found it lying in the street? A likely story!","He said he'd met Rihanna. A likely story."]}],"phrasal":[],"related":["not likely!","most/very likely","as likely as not"]},{"pos":"adverb","level":"SYMBOL","meanings":[{"def":"very probably","examples":["As likely as not she's forgotten all about it.","The illness was caused, most likely, by a virus.","We will most likely see him later.","The deal will likely result in more cuts to services.","We will likely see him later.","He said that he would likely run for President."],"opposite":"","synonyms":""},{"def":"used to disagree strongly with a statement or suggestion","examples":["Me? Join the army? Not likely!"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"as likely as not | most/very likely","def":"very probably","examples":["As likely as not she's forgotten all about it.","The illness was caused, most likely, by a virus.","We will most likely see him later.","The deal will likely result in more cuts to services.","We will likely see him later.","He said that he would likely run for President."]},{"idiom":"not likely!","def":"used to disagree strongly with a statement or suggestion","examples":["Me? Join the army? Not likely!"]}],"phrasal":[],"related":[]}]