[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lim/limit/limitation__us_1.mp3","phonsUS":"/ˌlɪmɪˈteɪʃn/","level":"B2","meanings":[{"def":"the act or process of limiting or controlling somebody/something","examples":["They would resist any limitation of their powers.","talks on arms limitation","The EU has set strict limits on pollution levels.","the speed limit","There are no restrictions on the amount of money you can withdraw.","arms control","We have to work within severe constraints of time and money.","The government has imposed export restraints on some products.","The unions are unlikely to accept any sort of wage restraint.","They would resist any limitation of their powers."],"opposite":"","synonyms":"limit"},{"def":"a rule, fact or condition that limits something","examples":["to impose limitations on imports","Disability is a physical limitation on your life.","Because of space limitations, I can only discuss the first and second points here.","There should be no limitations to progress in the talks.","This is a deliberate self-imposed limitation.","We face considerable limitations on our capacity to assess and analyze this.","We've put some limitations on who and where they can purchase these."],"opposite":"","synonyms":""},{"def":"a limit on what somebody/something can do or how good they or it can be","examples":["This technique is useful but it has its limitations.","She has serious limitations as a poet.","He was well aware of his own limitations.","Please don't ask me to sing—I know my limitations!","The team's technical limitations were exposed by the Italians.","You just have to accept your limitations.","Despite its limitations, the study has highlighted some interesting issues.","The limitations of this teaching approach are not always immediately obvious.","Our findings illustrate the limitations of this treatment."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["damage limitation","Strategic Arms Limitation Talks"]}]