[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lim/limit/limit__us_1.mp3","phonsUS":"/ˈlɪmɪt/","level":"B1","meanings":[{"def":"the greatest or smallest amount of something that is allowed","examples":["They imposed a strict spending limit.","His speed was double the legal limit.","Do not exceed the recommended limit of 6g of salt per day.","limit on something The EU has set strict limits on levels of pollution.","within limits to keep government spending within acceptable limits","over the limit You can't drive—you're over the limit (= you have drunk more alcohol than is legal when driving).","The EU has set strict limits on pollution levels.","the speed limit","There are no restrictions on the amount of money you can withdraw.","arms control","We have to work within severe constraints of time and money.","The government has imposed export restraints on some products.","The unions are unlikely to accept any sort of wage restraint.","They would resist any limitation of their powers.","Banks may import currency without limit.","They called for a limit on the use of pesticides.","Air pollution is in danger of breaching the limits set by the European Union.","If the £145 limit is breached customs can insist on the payment of import duty and VAT.","The package exceeded the weight limit for a normal first class stamp.","There is an upper limit on spending.","The law placed a limit of 100 years on copyright.","Central government has set a limit on spending by local councils.","Four cups of coffee is my daily limit.","Heat levels rose beyond the recommended limits.","I can offer you $50 but that's my absolute limit.","I don't want to go over my overdraft limit.","Most credit card issuers have set limits on how low rates can go.","The application must be made within a strict time limit.","The engine was still reading well above normal limits.","The level of radioactivity in the soil was found to be above recommended limits.","The price fell below the lower limit.","The same emission limits apply to all engines.","There's a limit on the number of tickets you can buy.","There's a weight limit on the bridge.","This led them to reduce the upper age limit from age 65 to age 59.","We are forced to operate within relatively narrow limits."],"opposite":"","synonyms":"limit"},{"def":"a point at which something stops being possible or existing","examples":["She knew the limits of her power.","to set/define the limits of something","to push/test the limits of something","It's a movie that stretches the limits of believability.","His arrogance knew (= had) no limits.","limit to something There is a limit to the amount of pain we can bear.","to the limit The team performed to the limit of its capabilities.","to push/test somebody/something to the limit","I knew I had reached my limit and couldn't do any more.","within the limits of something They've done their best within the limits of their capability.","beyond the limits of something I saw things beyond the limits of my ability to describe.","I was almost at the limits of my patience.","His family business had reached the limits of possible expansion.","Every society defines the limits of acceptable behaviour.","He set very definite limits on what he would reveal about his private life.","Such restrictions would place severe limits on the music's wider cultural relevance.","He pushed the limits of what the budget would bear.","She is testing the limits of architecture as we know it.","Daring art sometimes tests the limits of the legally permissible.","We choose to accept challenges, to take risks, and to stretch limits.","She pushed me to the limit of my abilities.","She wants Zack to be free to explore his limits, experiment and try new things.","The industry was approaching the limits of expansion.","The new law has its limits.","Their designers have pushed the limits of technology in order to create something new.","There's a practical limit to how small a computer can be.","They did well within the limits of their knowledge.","They recognize the limits of conventional strategies.","Our finances have been stretched to the limit.","The managers' skills and expertise were being tested to the limits.","There is no limit to what we can achieve."],"opposite":"","synonyms":""},{"def":"the furthest edge of an area or a place","examples":["We were reaching the limits of civilization.","the city limits (= the imaginary line which officially divides the city from the area outside)","islands on the outer limit of the continent","Fishing beyond the twelve-mile limit is not permitted.","There was no school within a limit of ten miles.","Let us wonder what stops at the limits of the universe.","The trees are found only below a limit of 1 500 feet."],"opposite":"","synonyms":""},{"def":"to be extremely annoying","examples":[],"opposite":"","synonyms":""},{"def":"to attempt to go beyond what is allowed or thought to be possible","examples":["We aim to push the boundaries of what we can achieve.","She pushes her physical limits through various endurance challenges."],"opposite":"","synonyms":""},{"def":"there is no limit to what somebody can achieve, earn, do, etc.","examples":["With a talent like his, the sky's the limit."],"opposite":"","synonyms":""},{"def":"to some extent","examples":["I'm willing to help, within limits.","The children can do what they like, within limits."],"opposite":"","synonyms":""},{"def":"without a point at which something has to stop","examples":["The debt is rising without limit.","She's a free spirit and lives her life without limits."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be the limit","def":"to be extremely annoying","examples":[]},{"idiom":"push the boundaries/limits","def":"to attempt to go beyond what is allowed or thought to be possible","examples":["We aim to push the boundaries of what we can achieve.","She pushes her physical limits through various endurance challenges."]},{"idiom":"the sky’s the limit","def":"there is no limit to what somebody can achieve, earn, do, etc.","examples":["With a talent like his, the sky's the limit."]},{"idiom":"within limits","def":"to some extent","examples":["I'm willing to help, within limits.","The children can do what they like, within limits."]},{"idiom":"without limit/limits","def":"without a point at which something has to stop","examples":["The debt is rising without limit.","She's a free spirit and lives her life without limits."]}],"phrasal":[],"related":["limit to","age limit","speed limit","time limit","limit something to somebody/something"]},{"pos":"verb","level":"B1","meanings":[{"def":"to stop something from increasing beyond a particular amount or level","examples":["measures to limit carbon dioxide emissions","The amount of money you have to spend will limit your choice.","Try to limit the number of trips you make.","to limit somebody's ability/freedom/power to do something","The guidelines include limiting the number of birds that can be kept in one cage.","It's really important to limit the amount of fat in your diet.","The room is small, which limits the size of table we can consider.","He believes in limiting the power of government.","There are laws which limit our freedom to act.","In an effort to limit the damage to his career, he gave an interview.","I don't know much about the subject, which limits my ability to comment.","We try to limit the children's use of social media.","The change in the law was designed to limit the scope for corruption.","Rigid job descriptions can serve to limit productivity.","They are working to limit oil drilling in the Arctic National Wildlife Refuge.","Campaign spending was limited to a maximum of $500 000.","Workshops are limited to a maximum of 25 participants.","The possibilities are limited only by your imagination.","What are the factors limiting economic growth?","Such agreements seek to limit the liability of air carriers.","There are no regulations which limit the hours which ships' crews work.","There is no evidence that the restrictions have limited the effectiveness of the advertising."],"opposite":"","synonyms":""},{"def":"to stop yourself or somebody from having, using or doing more than a particular amount or number of something","examples":["limit somebody/yourself You can use any material available—why limit yourself?","limit somebody/yourself to something I've limited myself to 1 000 calories a day to try and lose weight.","Families are limited to four free tickets each.","I limited myself to two small pieces of toast.","For this design, he limited himself to basic geometric shapes.","Few painters choose to limit themselves to only one type of subject.","In this report, we limit ourselves to an examination of current legislation.","There are many films I could mention but I will limit myself to just five.","I try not to limit myself in what I think I can achieve.","The writer does not limit herself to one time or place.","We will have to limit you to two helpings each.","During the last fuel crisis we had to limit people to £5 worth of fuel.","Some shops were limiting customers to two loaves of bread each.","Claimants are now limited to one emergency claim per year.","The time restriction does limit us in terms of how many we can sell.","The system limits us to 8-character passwords.","With the premium account you are limited to four users."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["limit to"],"related":[]}]