[{"pos":"phrasal verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/par/partl/partly__us_1.mp3","phonsUS":"","level":"","meanings":[{"def":"to stand in a line or row; to form a queue","examples":["Line up, children!","Cars lined up waiting to board the ship."],"opposite":"","synonyms":""},{"def":"to arrange people or things in a straight line or row","examples":["The suspects were lined up against the wall.","He lined the bottles up along the shelf."],"opposite":"","synonyms":""},{"def":"to arrange for an event or activity to happen, or arrange for somebody to be available to do something","examples":["Mark had a job lined up when he left college.","I've got a lot lined up this week (= I'm very busy).","She's lined up a live band for the party."],"opposite":"","synonyms":""},{"def":"to move one thing into a correct position in relation to another thing","examples":["To get good TV reception, the dish must be accurately lined up with the satellite."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lin/line_/line_up_1_us_1.mp3","phonsUS":"/ˈlaɪn ʌp/","level":"C1","meanings":[{"def":"the people who are going to take part in a particular event","examples":["an impressive line-up of speakers","Jones has not been included in the quarter-final line-up.","the starting line-up (= the players who will begin the game)","The team returns this season with a new car and a new line-up of drivers."],"opposite":"","synonyms":""},{"def":"a set of items, events etc. arranged to follow one another","examples":["A horror movie completes this evening's TV line-up."],"opposite":"","synonyms":""},{"def":"a row of people, including one person who is suspected of a crime, who are shown to a witness to see if they can recognize the suspect","examples":["He was identified in an April 21 police line-up."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]