[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lin/line_/line__us_1.mp3","phonsUS":"/laɪn/","level":"A1","meanings":[{"def":"a long, thin mark on a surface","examples":["a straight/solid/dotted/dashed line","a wavy/diagonal line","a vertical/horizontal line","parallel lines","Draw a thick black line across the page.","He wrote the title and drew a line under it.","She could draw a perfectly straight line.","He created his first strictly geometrical work, using only straight lines and circles.","a faint white line","Cut along the dotted line.","The outlines of the object beneath its cover are shown in dotted lines.","The old Roman road is indicated on the map by a dotted line.","This is indicated in sheet music by a long wavy line connecting the two staves.","The contour lines represent points of equal elevation.","The mural has white diagonal lines crisscrossing in all directions.","Red lines denote security updates and blue lines denote recommended updates.","a pattern of parallel wavy lines","Draw a chalk line on the container to record the level.","He traces a line in white paint along the wall.","The road has a double yellow line painted on the side indicating that you cannot park.","A red line marks where the wall stood.","The pencil line connects one box to another.","The watercolor strokes and the pencil lines run in the same direction.","She draws the paint out into thin, spidery lines.","The work shows thin black parallel lines crossing a field of white.","Dark areas are shaded with thin lines.","Why is there that faint vertical line on the screen?","Yellowish spots form a line down the middle of the caterpillar's back."],"opposite":"","synonyms":""},{"def":"a long, thin mark on the ground to show the limit or border of something, especially of a playing area in some sports","examples":["The first to cross the line wins the race.","They were all waiting on the starting line.","She crossed the centre line and hit an oncoming truck.","over/across the line The ball was over the line.","behind the line Your feet must be behind the line when you serve (= in tennis).","The ball was called out but a replay showed it was right on the line.","A goal was given but I don't think the ball crossed the line.","He moved the ball quickly along the line and scored.","They are good at passing the ball down the line.","He stood in the middle of an empty football pitch, on the centre line.","It was a photo finish, with three cyclists appearing to cross the line simultaneously.","She got off the start line quickly and was leading at the 500-meter mark.","It's a country lane with no lines."],"opposite":"","synonyms":""},{"def":"a mark like a line on somebody’s skin that people usually get as they get older","examples":["He has fine lines around his eyes.","Deep worry lines had appeared on her forehead.","I saw the faint lines of concern etched into his brow.","a cream that improves the appearance of fine lines and wrinkles","I'm starting to get lines around my mouth.","The camera focuses on the wrinkled laughter lines around the man's eyes.","The bright light shows all the lines on your face.","a slim face with deep lines on either side of the mouth","Smoking gives you lines on your skin.","She says she doesn't frown because it gives you lines."],"opposite":"","synonyms":""},{"def":"a row of people or things next to each other or behind each other","examples":["They formed a line and marched forward.","in a line The children all stood in a line.","line of something They were stuck in a line of traffic.","a straight/long line of trees","Make sure the posts are planted in a straight line.","There were three bins in a line.","They were all walking along the lane in a line.","grasses are planted at regular intervals in long diagonal lines","A line of cars stretched as far as the eye could see.","There was a long line of lorries on the A40.","A line of dancers stood on stage kicking their legs.","A line of trees was sillhouetted against the sky.","A line of mounted police stopped protesters."],"opposite":"","synonyms":""},{"def":"a queue of people","examples":["A line formed at each teller window.","in line to stand/wait in line","If you want a ticket, get in line.","line for something There's a line for the women's bathroom.","They have to stand in line for groceries.","The lunch line was long as usual.","You'll have to wait in line like everybody else.","people standing in line at the bank","How many hours each week do you spend waiting in line for coffee?","‘Get back in line!’ the teacher snarled.","He was sent to the back of the line.","I joined the line and prepared for a long wait.","supermarket checkout lines","The lines stretched around the block.","There was a long line at the post office.","If there's a line for the women's room, I go in the men's."],"opposite":"","synonyms":""},{"def":"a phone connection; a particular phone number","examples":["The phone lines were jammed (= very busy) with people calling to complain.","I tried to call but the line was busy.","I was talking to John when the line suddenly went dead.","Lines are open from 7.30 am until midnight seven days a week.","If you hold the line (= stay on the phone and wait), I'll see if she is available.","on the line It's your mother on the line.","Your bill includes line rental.","He kept shouting down the line at me.","Please stay on the line until one of our customer service operatives becomes available.","She didn't know that he was on the line listening to the call.","Speak up—it's rather a bad line.","What do I dial for an outside line?","At that time you needed a phone line to connect with the internet.","The toll-free phone line is open from 8:30 a.m. to 6:30 p.m.","The panic room has its own ventilation system and telephone line.","He gave me the number of his private line.","I don't use this line for personal calls.","You can call me back on this line.","‘Bye,’ he said and the line went dead.","Lines are now open and viewers can vote by calling 090 77 77 77.","Throughout the evening the telephone lines will be open for listeners to share their memories.","Whenever I try to ring the doctor's the lines are all busy.","They said they tried to call you, but your line was busy."],"opposite":"","synonyms":""},{"def":"a railway track or other transport route; a section of a transport system or route","examples":["The train was delayed because a tree had fallen across the line.","a rail line","(British English also) a railway line","the East Coast line","We got off the bus near the end of the line at San Gerardo.","Streetcar lines carried passengers to ever more distant areas of the city.","on a line We live on the Northern Line.","The restaurant has an unpromising site beside a railway line.","Trains were cancelled because of leaves on the line.","They built a high-speed rail line linking the two cities.","The new line would link Clapham Junction in south-west London with Dalston in the north-east of the city.","There are two railroad lines running next to the French Quarter.","He became a successful stagecoach operator, establishing lines between Boston, Massachusetts and Albany, New York.","You have to get off the bus here—it's the end of the line.","the little village of Jicotea, at the end of the bus line","The branch line is threatened with closure."],"opposite":"","synonyms":""},{"def":"the direction that somebody/something is moving or located in","examples":["in a line Just keep going in a straight line.","The town is in a direct line between London and the coast.","line of something Be careful to stay out of the line of fire (= the direction somebody is shooting in).","They followed the line of the river for three miles.","He couldn't even walk in a straight line.","The surveyors moved across the country, through forests, up mountains, and down ravines, but always travelling in straight lines.","The wall follows the line of the mountain range.","We could have gone in a more direct line to Denver.","It's three miles along the road, although only a mile and a half away in a direct line.","The kitchen garden runs along the line of the building's south facing terrace.","If you follow the line of my finger, you can see the building there on the hillside."],"opposite":"","synonyms":""},{"def":"a route from one place to another especially when it is used for a particular purpose","examples":["Their aim was to block guerrilla supply lines."],"opposite":"","synonyms":""},{"def":"a row of words on a page or the empty space where they can be written; the words of a song or poem or other piece of writing","examples":["Look at line 5 of the text.","Write the title of your essay on the top line.","I can only remember the first two lines of that song.","She quoted a few lines of Shakespeare.","A team of programmers wrote 200 000 lines of code (= computer programming language).","Avoid a line break (= starting a new line) in the middle of a word.","Start each paragraph on a new line.","There should be a full stop at the end of the line.","He asked me to sing the opening lines of Tosti's ‘In the hush of the night’.","Each picture is accompanied by a short line of text.","As soon as I read those lines I knew this was a writer I would love.","The story's first line reads, ‘There were once two little girls who saw, or believed they saw, a thing in a forest.’","He pointed to a line in the book he was holding.","Each line of the poem has five stressed syllables.","A sonnet usually has fourteen lines.","The first letter of each line forms a word.","The poet was very particular about the font, punctuation, and line spacing of his poems."],"opposite":"","synonyms":""},{"def":"the words spoken by an actor in a play or film","examples":["to learn your lines","I keep forgetting my lines.","The way she delivers the line is hilarious.","line from something He quoted a line from the film ‘Casablanca’.","He delivers his lines in a flat, uninflected way.","In a musical, actors often sing their lines.","In the audition you will be asked to read a few lines.","He read his lines in a monotone.","She is obviously reading lines from a script.","The film includes some great lines.","an unoriginal plot enlivened by a few good lines of dialogue","That's when he utters the memorable line ‘Frankly, my dear, I don't give a damn.’","He started coughing in the middle of the line.","It was a small part with few lines.","Actors always want more lines."],"opposite":"","synonyms":""},{"def":"a punishment in which a child has to write out a particular sentence a number of times","examples":["The teacher gave me 100 lines."],"opposite":"","synonyms":""},{"def":"a remark, especially when somebody says it to achieve a particular purpose","examples":["Don't give me that line about having to work late again.","(British English) That's the worst chat-up line I've ever heard."],"opposite":"","synonyms":""},{"def":"a long piece of rope, string, etc., especially when it is used for a particular purpose","examples":["They dropped the sails and threw a line to a man on the dock.","on the line Towels were hanging on the line (= clothes line).","He had a fish on his line.","150 feet of nylon line","Get the clothes off the line.","When he reeled in his line, there was nothing on the end of it.","He measured the land by laying out lines running due east-west and six miles apart, cut at right angles by other lines running due north-south, to create a grid.","An anchor was dropped over the side on almost 1 000 feet of anchor line.","The fish immediately pulled out about 20 yards of line."],"opposite":"","synonyms":""},{"def":"a pipe or thick wire that carries water, gas or electricity from one place to another","examples":["water/gas/sewage lines","Telephone lines were brought down in the storm.","There were two fuel lines coming into the engine.","The telegraph lines connecting the two cities had been cut.","a series of posts which were linked to one another by telegraph lines","They made plans for new sewage lines and roads.","The infrastructure, including sewage pipes and water lines, is in bad shape.","The storm has cut off electricity lines and blocked roads.","Excavations for driveways, gas lines or other utilities may have caused root damage."],"opposite":"","synonyms":""},{"def":"an imaginary limit or border between one place or thing and another","examples":["a district/county line","lines of longitude and latitude","across a line He was convicted of illegally importing weapons across state lines.","His family lived across the state line in West Virginia.","As we crossed the New York state line, we passed a field of soybeans.","He remembers the first time he crossed the line into Iraq.","the boundary line between two countries","We must end this separation of rich and poor across school district lines.","Computer databases are being used to redraw electoral district lines.","For residents of Los Angeles, California, the county line to the south is often referred to as ‘the orange curtain’.","The Civil War was a moment when the various lines dividing the country were contested.","The Equator is an imaginary line encircling the globe.","When they talk about North and South, they are referring to an imaginary line from Dublin to Galway."],"opposite":"","synonyms":""},{"def":"the division between one area of thought or behaviour and another or between one group of people and another","examples":["Mass consumption blurred the lines of class distinction.","We want to cut across lines of race, sex and religion.","Music offers a way to cross cultural lines.","line between A and B There is a fine line between informing the public and alarming them.","There's a fine line between showing interest in what someone is doing and interfering in it.","With this film he crosses the line into straightforward commercialism.","Government is damaged when the line separating church and state is crossed.","This architecture is about blurring the lines between nature and the built environment.","Her work plays with stereotypes, blurring lines of sex and gender.","British figurative artist Gary Benfield straddles the line between drawing and painting.","Some of the performances fail to straddle the fine line between understatement and dullness."],"opposite":"","synonyms":""},{"def":"an attitude or a belief, especially one that somebody states publicly","examples":["The company line is that discrimination in any form is not tolerated.","line on something He supported the official line on education.","The government is taking a firm line on terrorism.","There's been a hardening of lines on both sides (= both sides have developed stricter or more fixed attitudes).","A senior intelligence officer contradicted the government's official line.","Newsreaders just repeat the government line.","They are expected to unquestioningly support the management line.","His speech cast aside the Foreign Office line on the issue.","I tend to take the line that as long as everyone consents and is of a legal age, then it is best to just let people do what they want.","The administration has taken a line that is basically contrary to its own principles."],"opposite":"","synonyms":""},{"def":"a method or way of doing or thinking about something","examples":["His research follows quite different lines.","line of something I don't follow your line of reasoning.","a line of thought/thinking","She decided to try a different line of argument (= way of persuading somebody of something).","somebody’s first line of attack/defence","The police are pursuing a new line of inquiry (= way of finding out information).","This line of thought perturbs me.","His line of thinking seems to be that the food industry is fraudulently promoting addictive, unhealthy foods as healthy.","We know that intelligence is our first line of defence against terrorism.","Our approach involves two main lines of attack.","This line of questioning seemed to be getting us nowhere.","One line of research focuses on gender.","We are pursuing several lines of investigation.","The broad lines of company policy are already laid down.","Multiple lines of evidence were all leading to the same conclusion.","Keep your lines of communication open.","The plot runs along predictable lines.","Other writers followed similar lines in discussing this theorem.","It's pointless to pursue that line any further."],"opposite":"","synonyms":""},{"def":"a series of people, things or events that follow one another in time","examples":["to pass something down through the male/female line","line of something She came from a long line of doctors.","This novel is the latest in a long line of thrillers that he has written.","That was the first in a whole line of mistakes and bad decisions.","line (from somebody/something) (to somebody/something) The book traces a historical line from Beethoven to the present day.","down the line The muddle seems to have happened further down the line.","The film traces a line of events from their first meeting through to their tragic separation and death.","We can trace a line of such thinking from Voltaire.","His work is in a direct line from that of John Cassavetes.","I do not accept the claim that there is a direct line from Nietzsche via Heidegger to Nazism.","Mitochondrial DNA makes it possible to trace the maternal line.","The mutation gets passed down the ancestral line.","This is pop that can trace its line all the way back to the Beatles."],"opposite":"","synonyms":""},{"def":"a series of people in order of importance","examples":["line of something a line of command","There is some benefit to having a clear line of authority.","down the line (from somebody/something) Orders came down the line from the very top.","in line (to somebody/something) He is second in line to the chairman.","to be next in line to the throne","You have to report them to a higher authority, someone further up the line.","They undermined old lines of authority.","He resigned and the next in the line of succession became president.","There was nostalgia for the traditional dynastic line of succession.","Prince George is currently third in line to the throne.","She is next in line for a promotion.","I was the heir; I was next in line.","She was first in line to succeed her father."],"opposite":"","synonyms":""},{"def":"the edge, outline or shape of somebody/something","examples":["He traced the line of her jaw with his finger.","a beautiful sports car with sleek lines","I prefer simple lines in skirts and trousers."],"opposite":"","synonyms":""},{"def":"a system of making something, in which the product moves from one worker to the next until it is finished","examples":[],"opposite":"","synonyms":""},{"def":"a type or area of business, activity or interest","examples":["line of something My line of work pays pretty well.","What line of business are they in?","in the… line You can't do much in the art line without training."],"opposite":"","synonyms":""},{"def":"a type of product","examples":["Some lines sell better than others.","new product lines","line in something We are starting a new line in casual clothes."],"opposite":"","synonyms":""},{"def":"a company that provides transport for people or goods","examples":["a shipping/bus line","the White Star Line"],"opposite":"","synonyms":""},{"def":"a row or series of military defences where the soldiers are fighting during a war","examples":["They were trapped behind enemy lines (= in the area controlled by the enemy)."],"opposite":"","synonyms":""},{"def":"an amount of cocaine that is spread out in a thin line, ready to take","examples":[],"opposite":"","synonyms":""},{"def":"connected with the income that a company receives and the costs it has to pay in its daily business, which affect the profit it makes","examples":["All these costs are above the line and directly hit profits."],"opposite":"","synonyms":""},{"def":"connected with advertising in the mass media","examples":["They planned an advertising campaign with both above-the-line and social media components."],"opposite":"","synonyms":""},{"def":"at some point during an activity or a process","examples":["Somewhere along the line a large amount of money went missing.","We'll make a decision on that further down the line."],"opposite":"","synonyms":""},{"def":"in the way that is mentioned","examples":["The new system will operate along the same lines as the old one.","They voted along class lines."],"opposite":"","synonyms":""},{"def":"similar to the way or thing that is mentioned","examples":["Those aren't his exact words, but he said something along those lines.","The hotel was built along the lines of a French chateau."],"opposite":"","synonyms":""},{"def":"used to say that people or groups have shown which side they intend to support in an argument or contest that is going to begin","examples":[],"opposite":"","synonyms":""},{"def":"to be working or functioning","examples":["The new working methods will come on line in June."],"opposite":"","synonyms":""},{"def":"to be in a position where you can be shot at","examples":["attempts to prevent civilians from being in the firing line"],"opposite":"","synonyms":""},{"def":"to be in a position where people can criticize or blame you","examples":["The employment secretary found himself in the firing line over recent job cuts."],"opposite":"","synonyms":""},{"def":"connected with unusual costs or income that a company pays or receives, that are not part of its daily business and are taken away or added after calculating profits","examples":["There was a £4 million extraordinary charge below the line."],"opposite":"","synonyms":""},{"def":"connected with advertising by means of direct mail, email, social media, events, etc.","examples":["We are planning social networking, digital marketing and below-the-line activities across the country."],"opposite":"","synonyms":""},{"def":"connected with a section at the end of an online article or blog post where readers can put comments","examples":["There were numerous comments below the line."],"opposite":"","synonyms":""},{"def":"to behave or make somebody/something behave in the same way as other people or how they should behave","examples":["The other members of the board must be brought into line.","The actions of investors do not always fall into line with financial theory."],"opposite":"","synonyms":""},{"def":"to do something that is not considered to be acceptable behaviour","examples":["He crossed the line by making details of their very private conversation public."],"opposite":"","synonyms":""},{"def":"to go to the front of a line of people without waiting for your turn","examples":["Somebody cut in line in front of me."],"opposite":"","synonyms":""},{"def":"to say that something is finished and not worth discussing any more","examples":[],"opposite":"","synonyms":""},{"def":"(to reach) the point at which something can no longer continue in the same way","examples":["A defeat in the second round marked the end of the line for last year's champion.","The loss of this contract could signal the end of the line for the shipyard.","This latest disagreement could mean the end of the road for the band."],"opposite":"","synonyms":""},{"def":"strong control or discipline","examples":["Those children need a firm hand to make them behave."],"opposite":"","synonyms":""},{"def":"completely","examples":["What I said was not true, but he fell for it (= believed it) hook, line and sinker."],"opposite":"","synonyms":""},{"def":"in a position that forms a straight line with something","examples":["An eclipse happens when the earth and moon are in line with the sun."],"opposite":"","synonyms":""},{"def":"likely to get something","examples":["She is in line for promotion."],"opposite":"","synonyms":""},{"def":"while doing a job","examples":["A policeman was injured in the line of duty yesterday."],"opposite":"","synonyms":""},{"def":"similar to something or so that one thing is closely connected with another","examples":["Annual pay increases will be in line with inflation."],"opposite":"","synonyms":""},{"def":"to tell somebody clearly what you think, especially when they will not like what you say","examples":["The manager laid it on the line—some people would have to lose their jobs."],"opposite":"","synonyms":""},{"def":"(to establish) a clear limit to what you will do or accept","examples":["It’s time to draw a line in the sand and stop allowing workplace bullying to continue."],"opposite":"","synonyms":""},{"def":"(to choose, etc.) the easiest way of doing something","examples":[],"opposite":"","synonyms":""},{"def":"at risk","examples":["If we don't make a profit, my job is on the line."],"opposite":"","synonyms":""},{"def":"not forming a straight line","examples":[],"opposite":"","synonyms":""},{"def":"different from something","examples":["London prices are way out of line with the rest of the country."],"opposite":"","synonyms":""},{"def":"behaving in a way that is not acceptable or right","examples":[],"opposite":"","synonyms":""},{"def":"to behave in a way that people think is not acceptable","examples":["She realized she had overstepped the mark and quickly apologized."],"opposite":"","synonyms":""},{"def":"to tell somebody a story or make an excuse that is not true","examples":[],"opposite":"","synonyms":""},{"def":"to look for or discover a meaning in something that is not openly stated","examples":["Reading between the lines, I think Clare needs money."],"opposite":"","synonyms":""},{"def":"to sign a document to show that you have agreed to buy something or do something","examples":["Just sign on the dotted line and the car is yours."],"opposite":"","synonyms":""},{"def":"to behave badly or break the rules","examples":["His boss warned him that if he stepped out of line once more he would be fired."],"opposite":"","synonyms":""},{"def":"to say or do what somebody in authority tells you to say or do, even if you do not share the same opinions, etc.","examples":["One or two of them refused to toe the line.","MPs rarely fail to toe the party line."],"opposite":"","synonyms":""},{"def":"to be in a difficult or dangerous situation where you could easily make a mistake","examples":["He was walking a fine line between being funny and being rude.","She often seems to tread a thin line between success and failure.","His comedy treads the line between shocking and sickening.","We have to walk a fine line to make sure we don't promote one brand more than another.","His buildings walk the thin line between visionary and completely mad."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"above the line","def":"connected with the income that a company receives and the costs it has to pay in its daily business, which affect the profit it makes","examples":["All these costs are above the line and directly hit profits.","They planned an advertising campaign with both above-the-line and social media components."]},{"idiom":"along/down the line","def":"at some point during an activity or a process","examples":["Somewhere along the line a large amount of money went missing.","We'll make a decision on that further down the line."]},{"idiom":"along/on (the)… lines","def":"in the way that is mentioned","examples":["The new system will operate along the same lines as the old one.","They voted along class lines.","Those aren't his exact words, but he said something along those lines.","The hotel was built along the lines of a French chateau."]},{"idiom":"the battle lines are drawn","def":"used to say that people or groups have shown which side they intend to support in an argument or contest that is going to begin","examples":[]},{"idiom":"be, come, etc. on line","def":"to be working or functioning","examples":["The new working methods will come on line in June."]},{"idiom":"be in the firing line","def":"to be in a position where you can be shot at","examples":["attempts to prevent civilians from being in the firing line","The employment secretary found himself in the firing line over recent job cuts."]},{"idiom":"below the line","def":"connected with unusual costs or income that a company pays or receives, that are not part of its daily business and are taken away or added after calculating profits","examples":["There was a £4 million extraordinary charge below the line.","We are planning social networking, digital marketing and below-the-line activities across the country.","There were numerous comments below the line."]},{"idiom":"bring somebody/something, come, get, fall, etc. into line (with somebody/something)","def":"to behave or make somebody/something behave in the same way as other people or how they should behave","examples":["The other members of the board must be brought into line.","The actions of investors do not always fall into line with financial theory."]},{"idiom":"cross a/the line","def":"to do something that is not considered to be acceptable behaviour","examples":["He crossed the line by making details of their very private conversation public."]},{"idiom":"cut in line","def":"to go to the front of a line of people without waiting for your turn","examples":["Somebody cut in line in front of me."]},{"idiom":"draw a line under something","def":"to say that something is finished and not worth discussing any more","examples":[]},{"idiom":"(reach) the end of the line/road","def":"(to reach) the point at which something can no longer continue in the same way","examples":["A defeat in the second round marked the end of the line for last year's champion.","The loss of this contract could signal the end of the line for the shipyard.","This latest disagreement could mean the end of the road for the band."]},{"idiom":"a firm hand","def":"strong control or discipline","examples":["Those children need a firm hand to make them behave."]},{"idiom":"hook, line and sinker","def":"completely","examples":["What I said was not true, but he fell for it (= believed it) hook, line and sinker."]},{"idiom":"in (a) line (with something)","def":"in a position that forms a straight line with something","examples":["An eclipse happens when the earth and moon are in line with the sun."]},{"idiom":"in line for something","def":"likely to get something","examples":["She is in line for promotion."]},{"idiom":"in the line of duty","def":"while doing a job","examples":["A policeman was injured in the line of duty yesterday."]},{"idiom":"in line with something","def":"similar to something or so that one thing is closely connected with another","examples":["Annual pay increases will be in line with inflation."]},{"idiom":"lay it on the line","def":"to tell somebody clearly what you think, especially when they will not like what you say","examples":["The manager laid it on the line—some people would have to lose their jobs."]},{"idiom":"(draw) a line in the sand","def":"(to establish) a clear limit to what you will do or accept","examples":["It’s time to draw a line in the sand and stop allowing workplace bullying to continue."]},{"idiom":"(choose, follow, take, etc.) the line/path of least resistance","def":"(to choose, etc.) the easiest way of doing something","examples":[]},{"idiom":"(put something) on the line","def":"at risk","examples":["If we don't make a profit, my job is on the line."]},{"idiom":"out of line (with somebody/something)","def":"not forming a straight line","examples":["London prices are way out of line with the rest of the country."]},{"idiom":"overstep the mark/line","def":"to behave in a way that people think is not acceptable","examples":["She realized she had overstepped the mark and quickly apologized."]},{"idiom":"pitch a story/line/yarn (to somebody)","def":"to tell somebody a story or make an excuse that is not true","examples":[]},{"idiom":"read between the lines","def":"to look for or discover a meaning in something that is not openly stated","examples":["Reading between the lines, I think Clare needs money."]},{"idiom":"sign on the dotted line","def":"to sign a document to show that you have agreed to buy something or do something","examples":["Just sign on the dotted line and the car is yours."]},{"idiom":"step out of line | be/get out of line","def":"to behave badly or break the rules","examples":["His boss warned him that if he stepped out of line once more he would be fired."]},{"idiom":"toe the (party) line","def":"to say or do what somebody in authority tells you to say or do, even if you do not share the same opinions, etc.","examples":["One or two of them refused to toe the line.","MPs rarely fail to toe the party line."]},{"idiom":"walk/tread a fine/thin line (between A and B)","def":"to be in a difficult or dangerous situation where you could easily make a mistake","examples":["He was walking a fine line between being funny and being rude.","She often seems to tread a thin line between success and failure.","His comedy treads the line between shocking and sickening.","We have to walk a fine line to make sure we don't promote one brand more than another.","His buildings walk the thin line between visionary and completely mad."]}],"phrasal":[],"related":["A-line","bar line","in-line","line-out","line up","line-up","red line","tag line","top line","top-line","zip line","Date Line","fire line","foul line","goal line","hard line","hard-line","line item"]},{"pos":"verb","level":"B2","meanings":[{"def":"to cover the inside of something with a layer of another material, especially to keep it clean or make it stronger","examples":["Butter and line a 25 cm cake tin.","line something with something Line the pan with greaseproof paper.","a coat lined with silk","Cut a circle of parchment paper to line the mould.","She lines the drawers with old wallpaper.","Last week's newspaper is used to line the bottom of the cat's litter tray.","I lined the sides of the box with black card.","She lined the inside of the storage compartment with a scrap piece of vinyl flooring.","Prepare a small loaf tin by lining it with foil.","Line the bottom of the baking dish with the tomatoes.","Place on a baking tray lined with greaseproof paper.","Arrange the skewers on a grill rack lined with foil.","I lined the curtains with heavy cotton.","The boots are lined with fur.","The inside of the box is lined in red velvet.","When you tear one of the pods open, you can see that the inside is lined with a cottony padding.","The skirt is not lined so it tends to cling."],"opposite":"","synonyms":""},{"def":"to form a layer on the inside of something","examples":["the membranes that line the nose","White tiles line the walls.","A thin layer of dough lines the bottom of the casserole before the rice is put in.","Timber panels line the walls.","Terracotta floor tiles line the hallway.","The soil that lines the bottom of a sinkhole is often thin.","Broken glass lined the footwell of the car."],"opposite":"","synonyms":""},{"def":"to form lines or rows along something","examples":["line something Crowds lined the streets to watch the race.","Trees line the road on both sides.","Jars line the shelves.","be lined with something The walls were lined with books.","Cheering spectators lined the route.","Entering the room, one is struck by the heavy gilt-framed paintings lining its walls.","Willows and elder trees line the river banks.","The pavements are lined with shady trees.","New industrial parks line both sides of the highway.","Shops and restaurants line the sidewalk.","Two tiers of box seats lined the sides of the auditorium.","I found the girl hiding in the shrubbery lining the path.","walkways lined with roses","a hallway lined with classrooms","They walked along a corridor lined with paintings.","Small fishing communities line the shore.","Jamaica's northern shores are lined by many miles of lovely white sand beaches."],"opposite":"","synonyms":""},{"def":"to get richer or make somebody richer, especially by taking unfair advantage of a situation or by being dishonest","examples":["Health services are lining the drug companies’ pockets, according to the report."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"line your (own)/somebody’s pockets","def":"to get richer or make somebody richer, especially by taking unfair advantage of a situation or by being dishonest","examples":["Health services are lining the drug companies’ pockets, according to the report."]}],"phrasal":["line up"],"related":[]}]