[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lis/list_/list__us_1.mp3","phonsUS":"/lɪst/","level":"A1","meanings":[{"def":"a series of names, items, figures, etc., especially when they are written or printed","examples":["The guest list includes numerous celebrities.","on the list Is your name on the list?","I'll add you to the email list.","Her novel shot to the top of the bestseller list.","He plays drums, guitar, piano, flute, the list goes on.","list of something a list of names/candidates/questions","I made a list of things to do.","They compiled a list of all the items they'd need.","to draw up a list","Going to the bank tops my list of priorities today.","Having to wait hours came high on the list of complaints.","For further information, see the reading list at the end of the chapter.","Her teacher scanned the list of students' names.","It was on the New York Times bestseller list for 25 weeks.","Names of past members are not included in the list.","The play has an impressive cast list.","The restaurant is required to post a list of all the prices.","The show always featured an impressive list of guest stars.","They have narrowed their list of suspects to six.","There's an alphabetical list of department stores at the back of the book.","They were asked to add their names to the bottom of the list."],"opposite":"","synonyms":""},{"def":"the fact of a ship leaning to one side","examples":["The ship had a noticeable list to the starboard side."],"opposite":"","synonyms":""},{"def":"to be so ill that you may die; to no longer be very ill","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be on/off the danger list","def":"to be so ill that you may die; to no longer be very ill","examples":[]}],"phrasal":[],"related":["A-list","B-list","Z-list","hit list","list box","wait list","wait-list","wine list","wish list","word list","active list","bucket list","dean’s list","list price","price list","disabled list","laundry list","mailing list","reading list"]},{"pos":"verb","level":"A1","meanings":[{"def":"to write a list of things in a particular order","examples":["We were asked to list our ten favourite songs.","The key items are listed below.","Towns in the guide are listed alphabetically.","He had listed all the hotels in the area for us.","The book lists every ship still in service."],"opposite":"","synonyms":""},{"def":"to mention or include somebody/something in a list","examples":["be listed in something Key benefits are listed in Table 1.","be listed among somebody/something The koala is listed among Australia's endangered animals.","be listed as something soldiers listed as missing","be listed under something Articles may be listed under more than one heading."],"opposite":"","synonyms":""},{"def":"to be put or put something in a list of things for sale","examples":["This laptop lists at $500."],"opposite":"","synonyms":""},{"def":"to lean to one side","examples":["She began to list dangerously and the order was given to abandon ship."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]