[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lit/litte/litter__us_1.mp3","phonsUS":"/ˈlɪtər/","level":"B2","meanings":[{"def":"small pieces of rubbish such as paper, cans and bottles, that people have left lying in a public place","examples":["There will be fines for people who drop litter.","Please do not leave litter after your picnic.","Pick up your litter and take it home with you."],"opposite":"","synonyms":""},{"def":"a number of things that are lying in an untidy way","examples":["The floor was covered with a litter of newspapers, clothes and empty cups."],"opposite":"","synonyms":""},{"def":"a dry substance that is put in a shallow open box for pets, especially cats, to use as a toilet when they are indoors","examples":["cat litter","(also especially North American English) kitty litter","(British English) a litter tray","(North American English) a litter box"],"opposite":"","synonyms":""},{"def":"a number of baby animals that one mother gives birth to at the same time","examples":["a litter of puppies","the runt (= the smallest and weakest baby) of the litter","‘Chief’ was born six years ago, one of a litter of 11."],"opposite":"","synonyms":""},{"def":"the substance, especially straw, that is used for farm animals to sleep on","examples":[],"opposite":"","synonyms":""},{"def":"a kind of chair or bed that was used in the past for carrying important people","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["litter bin","litter lout","litter louts"]},{"pos":"verb","level":"","meanings":[{"def":"to be spread around a place, making it look untidy","examples":["Piles of books and newspapers littered the floor.","Broken glass littered the streets."],"opposite":"","synonyms":""},{"def":"to leave things in a place, making it look untidy","examples":["be littered with something The floor was littered with papers.","He was arrested for littering."],"opposite":"","synonyms":""},{"def":"to contain or involve a lot of a particular type of thing, usually something bad","examples":["Your essay is littered with spelling mistakes."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]