[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/loa/load_/load__us_1.mp3","phonsUS":"/ləʊd/","level":"B2","meanings":[{"def":"something that is being carried (usually in large amounts) by a person, vehicle, etc.","examples":["The trucks waited at the warehouse to pick up their loads.","load of something The women came down the hill with their loads of firewood.","These backpacks are designed to carry a heavy load.","A lorry shed its load (= accidentally dropped its load) on the motorway.","(figurative) The company's debt load could drag it into bankruptcy."],"opposite":"","synonyms":""},{"def":"the total amount of something that something can carry or contain","examples":["a busload of tourists","They ordered three truckloads of sand.","He put half a load of washing in the machine.","The plane took off with a full load.","Maximum load, including passengers, is 800 pounds."],"opposite":"","synonyms":""},{"def":"the amount of weight that is pressing down on something","examples":["a load-bearing wall","Modern backpacks spread the load over a wider area.","The table creaked under its heavy load."],"opposite":"","synonyms":""},{"def":"a large number or amount of people or things; plenty","examples":["a load/loads of somebody/something She's got loads of friends.","He wrote loads and loads of letters to people.","Uncle Jim brought a whole load of presents for the kids.","We saw a load of houses before we bought this one.","They all had loads of fun at the park.","In my job I get the chance to meet loads of different people.","a load/loads to do There's loads to do today."],"opposite":"","synonyms":""},{"def":"used to emphasize that something is wrong, stupid, bad, etc.","examples":["You're talking a load of rubbish."],"opposite":"","synonyms":""},{"def":"an amount of work that a person or machine has to do","examples":["Teaching loads have increased in all types of school.","Extra warmth from sunlight can put an additional load on the air-conditioning system.","We're trying to spread the load by employing more staff."],"opposite":"","synonyms":""},{"def":"a feeling of responsibility or worry that is difficult to deal with","examples":["She thought she would not be able to bear the load of bringing up her family alone.","Knowing that they had arrived safely took a load off my mind.","Many companies are burdened by high debt loads."],"opposite":"","synonyms":""},{"def":"the amount of electrical power that is being supplied at a particular time","examples":[],"opposite":"","synonyms":""},{"def":"used to tell somebody to look at or listen to somebody/something","examples":["Get a load of that dress!"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"get a load of somebody/something","def":"used to tell somebody to look at or listen to somebody/something","examples":["Get a load of that dress!"]}],"phrasal":[],"related":["load down","load line","front-load","load-shedding","load up on","load lines","load up on something","load somebody/something down (with something)","load the dice (against/in favour of somebody)","a brick short of a load, two sandwiches short of a picnic, etc."]},{"pos":"verb","level":"B2","meanings":[{"def":"to put a large quantity of things or people onto or into something","examples":["load something We loaded the car in ten minutes.","Can you help me load the dishwasher?","load something up They loaded up the lorry.","load something up with something Men were loading up a truck with timber.","load something with something Lastly came six wagons loaded with coal.","load something/somebody onto something Sacks were being loaded onto the truck.","load something/somebody into something The paramedics loaded Jason into the ambulance.","We finished loading and set off.","load up We got back to the car and began loading up."],"opposite":"unload","synonyms":""},{"def":"to receive a load","examples":["The ship was still loading."],"opposite":"unload","synonyms":""},{"def":"to give somebody a lot of things, especially things they have to carry","examples":["They loaded her with gifts."],"opposite":"","synonyms":""},{"def":"to put something into a weapon, camera or other piece of equipment so that it can be used","examples":["load something (into something) She loaded a new cartridge into the printer.","load something (with something) She loaded the printer with a new cartridge.","load (something) Is the gun loaded?"],"opposite":"unload","synonyms":""},{"def":"to put data or a program into the memory of a computer, usually from local disk storage","examples":["The program automatically loads the file.","This page won't load on my laptop."],"opposite":"","synonyms":""},{"def":"to put somebody at an unfair disadvantage/advantage","examples":["He has always felt that the dice were loaded against him in life.","This is another attempt to load the dice in favour of employers."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"load the dice (against/in favour of somebody)","def":"to put somebody at an unfair disadvantage/advantage","examples":["He has always felt that the dice were loaded against him in life.","This is another attempt to load the dice in favour of employers."]}],"phrasal":["load down","load up on"],"related":[]}]