[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/loa/loan_/loan__us_1.mp3","phonsUS":"/ləʊn/","level":"B2","meanings":[{"def":"money that an organization such as a bank lends and somebody borrows","examples":["to take out/repay a loan (= to borrow money/pay it back)","She took out an $8  000 personal loan.","bank loans with low interest rates","It took three years to repay my student loan (= money lent to a student).","a car/home loan (= a loan to buy a car/house)","The bank almost collapsed under the weight of bad loans (= loans that will never be paid back).","The loan repayment period is 10 years.","a loan agreement","He had to use his house as security for the loan.","a loan from my brother","The bank provides personal loan facilities at competitive rates.","They used the inheritance to pay off their outstanding loan.","They were struggling to meet their monthly loan repayments."],"opposite":"","synonyms":""},{"def":"the act of lending something; the state of being lent","examples":["loan of something I even gave her the loan of my car.","on loan an exhibition of paintings on loan (= borrowed) from private collections","on loan from somebody/something The striker, on loan from United, scored his first goal for City today (= he is playing for City for a fixed period by agreement with his own team, United).","The midfielder comes to the Premiership on an 18-month loan deal from Roma.","The book must be returned by the end of the loan period."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["home loan","loan shark","payday loan","bridging loan","loan translation","savings and loan association","bridge loan","loan sharks","loan translations","savings and loan associations"]},{"pos":"verb","level":"","meanings":[{"def":"to lend something to somebody, especially money","examples":["loan something (to somebody) The bank is happy to loan money to small businesses.","loan somebody something A friend loaned me $1 000."],"opposite":"","synonyms":""},{"def":"to lend a valuable object to a museum, etc.","examples":["loan something This exhibit was kindly loaned by the artist's family.","loan something (out) to somebody/something The painting has been loaned to the Walker Art Gallery.","loan somebody something He loaned the museum his entire collection."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]