[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/loc/locat/location__us_2.mp3","phonsUS":"/ləʊˈkeɪʃn/","level":"B1","meanings":[{"def":"a place where something happens or exists; the position of something","examples":["a honeymoon in a secret location","Mobile phones can determine our exact location and relay it to the police in an emergency.","The harsh climate and remote location made mining even more difficult.","the country's strategic geographical/geographic location","This would be a good place for a picnic.","They’ve chosen a site for the new school.","the hotel reception area","Move the cursor to a blank area on the screen.","From his position at the top of the hill, he could see the harbour.","the point at which the river divides","The company is moving to a new location.","the scene of the accident","The lake is one of the local beauty spots.","He couldn't pinpoint her exact location because of some kind of interference.","The equipment allows sailors to read their geographical coordinates for any given location.","We selected these two locations because they offer a range of services.","We still do not know the precise location of the crash.","The company is moving to a new location.","The hotel is in a central location near the market place.","The location of the nests is not being disclosed."],"opposite":"","synonyms":"place"},{"def":"a place outside a film studio where scenes of a film are made","examples":["location for something A mountain in the Rockies became the location for a film about Everest.","on location The movie was shot entirely on location in Italy.","the exotic locations they filmed in","He went to the restaurant to scout a location for his next film."],"opposite":"","synonyms":""},{"def":"the act of finding the position of somebody/something","examples":["Location of a suitable site may take some time."],"opposite":"","synonyms":""},{"def":"a position or an address in computer memory","examples":["A domain name is the location of your website on the internet."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]