[{"pos":"adverb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/lon/long_/long_term_1_us_2.mp3","phonsUS":"/ˌlɔːŋ ˈtɜːrm/","level":"B2","meanings":[{"def":"over a long period of time","examples":["to benefit/affect somebody long-term","It is unclear if this shift will continue long-term.","We need to think long-term (= think about what will happen over a long period of time) if we want to get any serious results."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["in the long/short/medium term"]},{"pos":"adjective","level":"B2","meanings":[{"def":"lasting or having an effect over a long period of time","examples":["Our long-term goal is to lower operating costs by 10 per cent.","discussions about the long-term future of agriculture","the long-term effects/consequences/impact of something","They questioned his long-term commitment to the project.","She has never been in a long-term relationship.","The long-term trend is for prices to rise.","a long-term strategy/plan","long-term investment","the long-term unemployed","solutions for long-term unemployment","the long-term effects of fertilizers","We can help you realize your short-term and long-term objectives.","There are serious and potentially long-term consequences.","Subsidies are not a viable long-term solution.","a business environment that can support long-term sustainable growth","There must be a new long-term strategy for tackling the disease.","Analysts look at the long-term prospects of a company.","Patients with strong social support had more favourable long-term survival rates.","This raises questions about the long-term stability of the economy.","genetic traits that play a key role in long-term health and survival","We have seen the drug cause some relatively long-term changes in nerve function.","I take a very long-term view.","The effects of the deal will be long-term in nature.","The contract is long-term.","Minorities represent a larger share of the long-term unemployed.","Employers are reluctant to hire long-term unemployed workers.","Since taking over the business we have emphasized cost control and the reduction of long-term debt.","health conditions thatWe are likely to require long-term care","This is a long-term problem and not one that will be easily solved."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]