[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/los/lose_/lose__us_1.mp3","phonsUS":"/luːz/","level":"A1","meanings":[{"def":"to be unable to find something/somebody","examples":["I've lost my keys.","The tickets seem to have got lost.","She lost her husband in the crowd.","We've lost Alfie—is he with you?","Here, tie it round your neck so you don't lose it.","If your card is lost or stolen, inform your bank immediately."],"opposite":"","synonyms":""},{"def":"to have something/somebody taken away from you, especially as a result of an accident, dying, etc.","examples":["She lost a leg in a car crash.","Some families lost everything (= all they owned) in the flood.","She lost her baby (= had a miscarriage) three months into the pregnancy.","They lost both their sons (= they were killed) in the war.","The ship was lost at sea (= it sank).","Many people lost their lives (= were killed)."],"opposite":"","synonyms":""},{"def":"to have to give up something; to fail to keep something/somebody","examples":["He's lost his job.","You will lose your deposit if you cancel the order.","Sit down or you'll lose your seat.","The government has lost control of the city.","We cannot afford to lose any more senior members of staff.","The average business loses 20 per cent of its customers every year.","You risk losing your house if you do not keep up the payments.","lose something to somebody/something The company has lost a lot of business to its competitors."],"opposite":"","synonyms":""},{"def":"to no longer have something, or have less of something than you had before, especially as a result of getting older","examples":["to lose your hair/teeth","to lose your sight/eyesight/hearing/memory","There's new hope for people trying to lose weight.","I've lost ten pounds since I started this diet."],"opposite":"","synonyms":""},{"def":"to have less and less of a quality or ability, especially until you no longer have any of it","examples":["She seemed to have lost interest in food.","to lose faith/confidence","He lost his nerve at the last minute.","At that moment he lost his balance and fell.","The train was losing speed.","He never lost the ability to make people laugh."],"opposite":"","synonyms":""},{"def":"to be defeated; to fail to win a competition, a court case, an argument, etc.; to cause somebody to be defeated","examples":["lose something So far they haven't lost a game.","to lose a race/an election/a battle/a war","lose to somebody We lost to a stronger team.","lose by something He lost by less than 100 votes.","lose something by something We lost the game by three points.","lose on something (to somebody) They lost on penalties to (= because they scored fewer penalties than) Spain.","lose somebody something Many believe the incident lost them the election.","The visiting side lost to the home team.","There was really no shame in losing to Norton at that stage of his career.","This is a game that Lazio cannot afford to lose.","We lost against Albyn College.","We lost by five goals to two.","They deserved to lose.","Win or lose, the important thing is to remain calm.","The South lost the war.","He yesterday lost his appeal against a six-month ban.","She resigned as party leader after they lost the election."],"opposite":"","synonyms":""},{"def":"to fail to keep something you want or need, especially money; to cause somebody to fail to keep something","examples":["lose something The business is losing money.","Poetry always loses something in translation.","lose something by doing something You have nothing to lose by telling the truth.","What do we lose by working with them?","lose on something We lost on that deal.","The company stands to lose financially if this deal falls through.","lose somebody something His carelessness lost him the job."],"opposite":"","synonyms":""},{"def":"to fail to get, hear or understand something","examples":["His words were lost (= could not be heard) in the applause."],"opposite":"","synonyms":""},{"def":"to be no longer understood by somebody","examples":["I'm afraid you've lost me there."],"opposite":"","synonyms":""},{"def":"to escape from somebody/something","examples":["We managed to lose our pursuers in the darkness."],"opposite":"","synonyms":""},{"def":"to waste time or an opportunity","examples":["We lost twenty minutes changing a tyre.","Hurry—there's no time to lose!","He lost no time in setting out for London."],"opposite":"","synonyms":""},{"def":"if a watch or clock loses or loses time, it goes too slowly or becomes a particular amount of time behind the correct time","examples":["This clock loses two minutes a day."],"opposite":"gain","synonyms":""},{"def":"to be unable to stop yourself from crying, laughing, etc.; to become crazy","examples":["Then she just lost it and started screaming."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"lose it","def":"to be unable to stop yourself from crying, laughing, etc.; to become crazy","examples":["Then she just lost it and started screaming."]}],"phrasal":["lose out","lose out to","lose yourself in"],"related":["lose out","lose out to","lose yourself in","lose your temper","lose out (on something)","lose yourself in something","lose face","lose out to somebody/something","lose heart","lose the plot","lose your rag","lose your way","win or lose","lose your cool","lose your head","lose your mind","lose count (of something)","lose your grip (on something)","lose sight of somebody/something","you win some, you lose some"]}]