[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/l/los/loss_/loss__us_3.mp3","phonsUS":"/lɔːs/","level":"B1","meanings":[{"def":"the state of no longer having something or as much of something; the process that leads to this","examples":["I want to report the loss of a package.","Insure your instrument against loss or damage.","weight loss","hearing/memory loss","The closure of the factory will lead to a number of job losses.","When she died I was filled with a sense of loss.","loss of something He suffered a loss of confidence.","loss of earnings/income (= the money you do not earn because you are prevented from working)","The loss of her job was a terrible blow.","She suffered a significant loss of hearing after the operation.","The knife hit an artery, causing significant blood loss.","She could have died from shock or loss of blood.","They form a barrier to prevent water loss.","a gradual loss of hope","loss of appetite","the dramatic loss of farmland to urban growth"],"opposite":"","synonyms":""},{"def":"money that has been lost by a business or an organization","examples":["The company has announced net losses of $1.5 million.","The banks incurred huge losses.","loss on something We made a loss on (= lost money on) the deal.","It took the company five years to recoup its losses.","No bank would be willing to underwrite such a loss.","The business sustained losses of €20 million.","The company took a big loss of 28%.","The fund may not be large enough to absorb these losses.","We can offset the loss against next year's budget."],"opposite":"profit","synonyms":""},{"def":"the death of a person","examples":["He is mourning the loss of his wife.","the tragic loss of a child","Enemy troops suffered heavy losses.","The drought caused widespread loss of life.","Our country had sustained a tremendous loss of innocent life.","The loss of his wife was a great blow to him.","The family has suffered a terrible loss.","the devastating losses of the war"],"opposite":"","synonyms":""},{"def":"the disadvantage that is caused when somebody leaves, or when a useful or valuable object is taken away; a person who causes a disadvantage by leaving","examples":["a loss to somebody/something Her departure is a big loss to the school.","She will be a great loss to the company.","She wouldn't be able to attend the lecture, which was no great loss.","His death is a sad loss to all who knew him.","His passing is a tremendous loss for all of us.","Her suicide was a terrible loss to the music world."],"opposite":"","synonyms":""},{"def":"a failure to win a contest","examples":["Brazil’s 2–1 loss to Argentina"],"opposite":"","synonyms":""},{"def":"not knowing what to say or do","examples":["His comments left me at a loss for words.","I'm at a loss what to do next.","We are at a loss to understand his actions."],"opposite":"","synonyms":""},{"def":"in a way that loses you money","examples":["We are now operating at a loss."],"opposite":"","synonyms":""},{"def":"used to say that if somebody chooses not to do something, they will not obtain a benefit they could have had","examples":["If people can't appreciate how great this film is, it's their loss.","I can see you don't trust me. Well, that's your loss"],"opposite":"","synonyms":""},{"def":"to stop doing something that is not successful before the situation becomes even worse","examples":["I decided to cut my losses and move back to England.","He decided to cut his losses and sell the shares before they sank further."],"opposite":"","synonyms":""},{"def":"the state of being less respected by other people or looking stupid because of something you have done","examples":["Failure to pass the exams means a massive loss of face for the students and their parents."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"at a loss","def":"not knowing what to say or do","examples":["His comments left me at a loss for words.","I'm at a loss what to do next.","We are at a loss to understand his actions.","We are now operating at a loss."]},{"idiom":"be somebody's loss","def":"used to say that if somebody chooses not to do something, they will not obtain a benefit they could have had","examples":["If people can't appreciate how great this film is, it's their loss.","I can see you don't trust me. Well, that's your loss"]},{"idiom":"cut your losses","def":"to stop doing something that is not successful before the situation becomes even worse","examples":["I decided to cut my losses and move back to England.","He decided to cut his losses and sell the shares before they sank further."]},{"idiom":"loss of face","def":"the state of being less respected by other people or looking stupid because of something you have done","examples":["Failure to pass the exams means a massive loss of face for the students and their parents."]}],"phrasal":[],"related":["dead loss","loss-leader","loss-making","capital loss","loss adjuster","Action on Hearing Loss","profit and loss account","loss-leaders","loss adjusters","profit and loss accounts","loss of face"]}]