[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mac/machi/machine__us_1.mp3","phonsUS":"/məˈʃiːn/","level":"A1","meanings":[{"def":"a piece of equipment with many parts that work together to do a particular task. The power used to work a machine may be electricity, steam, gas, etc. or human power.","examples":["Machines have replaced human labour in many industries.","to operate/run a machine","How does this machine work?","a washing/sewing machine","a machine for making plastic toys","They have installed a new coffee machine in the staff room.","to invent/design a machine","In the factory he oversees 14 teams of machine operators.","by machine The potatoes are planted by machine.","The machine runs on solar power.","What make of machine are they using?","The machine is designed to fit under a counter.","Treadmills and other exercise machines help residents to keep fit.","Machine parts may need to be replaced."],"opposite":"","synonyms":""},{"def":"a computer","examples":["The new machines will be shipped next month.","We build machines that process data.","All machines are connected online to reach specialists in Germany."],"opposite":"","synonyms":""},{"def":"a particular machine, for example in the home, when you do not refer to it by its full name","examples":["Just put those clothes in the machine (= the washing machine).","Is the machine working again?"],"opposite":"","synonyms":""},{"def":"an organized system for achieving something and the people who control it","examples":["the president’s propaganda machine","He played the Republican political machine to get himself into power.","These years saw a massive growth in the US military machine.","Hollywood’s slick public relations machine has produced a new improved model of a young movie star.","The independent candidates did not have the support of a party machine.","Tired of being a tiny cog in a vast machine, he handed in his resignation."],"opposite":"","synonyms":""},{"def":"a person who acts without thinking and without allowing their feelings to show or to affect their work","examples":["In this movie he plays a lean, mean killing machine.","He was the perfect fighting machine with a total disregard for his own personal safety.","This guy is as good as it gets ﹘﹘he's a machine on assignment!"],"opposite":"","synonyms":""},{"def":"a person who is a small part of a large organization","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a cog in the machine/wheel","def":"a person who is a small part of a large organization","examples":[]}],"phrasal":[],"related":["machine gun","machine-gun","war machine","bank machine","cash machine","drum machine","fruit machine","machine code","machine-made","machine shop","machine tool","poker machine","slot machine","time machine","wave machine","wind machine","answering machine","bathing machine","coffee machine"]},{"pos":"verb","level":"","meanings":[{"def":"to make or shape something with a machine","examples":["This material can be cut and machined easily."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]