[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mag/magic/magic__us_1.mp3","phonsUS":"/ˈmædʒɪk/","level":"B1","meanings":[{"def":"the secret power of appearing to make impossible things happen by saying special words or doing special things","examples":["Do you believe in magic?","a place of secret shadows and ancient magic","He sensed the presence of powerful dark magic (= evil magic).","as if by magic He suddenly appeared as if by magic.","like magic A passage was cleared through the crowd like magic.","Prospero uses his magic to attack them.","The magic slowly begins to work and the princess starts to come to life again.","They used to practise ritual magic.","(figurative) A hot bath and a good night's sleep worked their usual magic."],"opposite":"","synonyms":""},{"def":"the art of doing tricks that seem impossible in order to entertain people","examples":["He earns extra money doing magic at children's parties.","a magic show/trick","Of course, magicians don't perform magic—they perform illusions.","by magic The rabbit disappeared by magic."],"opposite":"","synonyms":""},{"def":"a special quality or ability that somebody/something has, that seems too wonderful to be real","examples":["dance and music which capture the magic of India","He loved the magic and mystery of the place.","Like all truly charismatic people, he can work his magic on both men and women.","The show is three hours of pure magic.","Our year in Italy was sheer magic.","His goal on New Year's Day was a moment of magic.","He’s returning to the team this season, hoping that the old magic can be made to work once more.","Fans agree the musical magic is still there.","The new Star Wars film offers more galactic movie magic.","Many people think he has lost his magic as a player.","The film fails to recapture the magic of his earlier films.","The fireworks brought a touch of magic to the occasion.","Visitors can experience the magic of age-old traditions and historical sites.","It's the director's job to make the magic happen."],"opposite":"","synonyms":""},{"def":"to perform or behave in a way that is attractive or interesting, or that makes somebody behave in a particular way","examples":["Will Hegerberg be able to weave her magic against Italy on Wednesday?"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"weave your magic | weave a spell (over somebody)","def":"to perform or behave in a way that is attractive or interesting, or that makes somebody behave in a particular way","examples":["Will Hegerberg be able to weave her magic against Italy on Wednesday?"]}],"phrasal":[],"related":["black magic","magic wand","Black Magic™","magic bullet","magic carpet","magic lantern","Magic Marker™","magic number","magic realism","magic mushroom","Magic Circle","Magic Roundabout","magic bullets","magic carpets","Magic Markers"]},{"pos":"adjective","level":"B1","meanings":[{"def":"having or using special powers to make impossible things happen or seem to happen","examples":["a magic spell/charm/potion","There is no magic formula for passing exams—only hard work."],"opposite":"","synonyms":""},{"def":"having a special quality that makes something seem wonderful","examples":["It was a magic moment when the two sisters were reunited after 30 years.","Then he said the magic words: ‘I can help you with that.’","She has a magic touch with the children and they do everything she asks.","Trust is the magic ingredient in our relationship."],"opposite":"","synonyms":""},{"def":"very good or a lot of fun","examples":["‘What was the trip like?’ ‘Magic!’"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to make somebody/something appear somewhere, disappear or turn into something, by magic, or as if by magic","examples":["He played an early little sonata of Mozart's, which he magicked into a masterpiece with his deft touch."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]