[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mai/main_/main__us_1.mp3","phonsUS":"/meɪn/","level":"A1","meanings":[{"def":"being the largest or most important of its kind","examples":["Be careful crossing the main road.","the main course (= of a meal)","We have our main meal at lunchtime.","Reception is in the main building.","Poor housing and unemployment are the main problems.","Loss of habitat is the main reason for the bird's decline.","The main thing is to stay calm.","Be careful crossing the main road.","The main thing is to remain calm.","He played a major role in setting up the system.","He was a key figure in the campaign.","The central issue is that of widespread racism.","The principal reason for this omission is lack of time.","Unemployment was the chief cause of poverty.","My prime concern is to protect my property.","Please use the main entrance.","Our main concern is safety.","There were three main political parties in the country.","The main character in this movie is Lucky, an Irish setter.","Try to summarize the main points of your argument.","The main event is preceded by four bouts, including a five-round title fight."],"opposite":"","synonyms":"main"},{"def":"with the hope of using a particular situation in order to gain some advantage for yourself","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"with an eye for/on/to the main chance","def":"with the hope of using a particular situation in order to gain some advantage for yourself","examples":[]}],"phrasal":[],"related":["main man","main line","main-line","main verb","ring main","main clause","main course","main street","rising main","water main","main drag","Spanish Main","main dish","main men","main lines","Main Street"]},{"pos":"noun","level":"","meanings":[{"def":"a large pipe that carries water or gas to a building; a large cable that carries electricity to a building","examples":["a leaking gas main","The main serves four towns."],"opposite":"","synonyms":""},{"def":"a large pipe that carries waste water and sewage (= human waste, etc.) away from a building","examples":[],"opposite":"","synonyms":""},{"def":"the place where the supply of water, gas or electricity to a building or an area starts; the system of providing gas, water and electricity to a building or of carrying it away from a building","examples":["The house is not yet connected to the mains.","at the mains The electricity supply has been cut off at the mains.","Plug the transformer into the mains (= the place on a wall where electricity is brought into a room).","mains gas/water/electricity","The shaver will run off batteries or mains.","mains drainage","Some of the remoter houses in the town are not on the mains.","Turn the water off at the mains.","an island without mains electricity"],"opposite":"","synonyms":""},{"def":"used to say that a statement is true in most cases","examples":["The service here is, in the main, reliable.","In the main, the money raised goes to children’s charities."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in the main","def":"used to say that a statement is true in most cases","examples":["The service here is, in the main, reliable.","In the main, the money raised goes to children’s charities."]}],"phrasal":[],"related":[]}]