[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mai/maint/maintain__us_2.mp3","phonsUS":"/meɪnˈteɪn/","level":"B2","meanings":[{"def":"to make something continue at the same level, standard, etc.","examples":["to maintain law and order/standards/a balance/control","ANU has maintained its position as Australia's top university.","The two countries have always maintained close relations.","(formal) She maintained a dignified silence.","to maintain prices (= prevent them from falling or rising)","Building and maintaining good relationships is an important part of what we do.","He emphasized the need to maintain the status quo.","He successfully maintained the financial health of the company.","The government's position became increasingly difficult to maintain.","They are looking to cut costs while simultaneously maintaining the existing levels of service.","This pace cannot be maintained indefinitely.","Security personnel struggled to maintain order.","Email is used to maintain contact with members."],"opposite":"","synonyms":""},{"def":"to keep a building, a machine, etc. in good condition by checking or repairing it regularly","examples":["The house is large and difficult to maintain.","a poorly maintained central heating system","I do a lot of mechanical work and I maintain my own car.","The grounds are beautifully maintained.","The wheel spats collect debris and make it difficult to maintain the brakes."],"opposite":"","synonyms":""},{"def":"to support somebody/something over a long period of time by giving money, paying for food, etc.","examples":["Her income was barely enough to maintain one child, let alone three.","His priority is to maintain and protect his family.","At that time it was assumed that a man would maintain his wife.","Maintaining a modern, well-equipped armed force is a challenge."],"opposite":"","synonyms":""},{"def":"to keep stating that something is true, even though other people do not agree or do not believe it","examples":["maintain (that)… The men maintained (that) they were out of the country when the crime was committed.","It is difficult to maintain that such a harsh punishment was justified.","maintain something She has always maintained her innocence.","+ speech ‘But I'm innocent!’ she maintained.","Some critics argue that Picasso remained a great master all his life.","Others maintain that there is a significant deterioration in quality in his post-war work.","Picasso himself claimed that good art is created, but great art is stolen.","As Smith has noted, Picasso borrowed imagery from African art.","As the author points out, Picasso borrowed imagery from African art.","The writer challenges the notion that Picasso’s sculpture was secondary to his painting.","It has been suggested that Picasso’s painting was influenced by jazz music."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]