[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/maj/major/majority__us_3_rr.mp3","phonsUS":"/məˈdʒɔːrəti/","level":"B2","meanings":[{"def":"the largest part of a group of people or things","examples":["majority (of somebody/something) The majority of people interviewed prefer TV to radio.","The majority was/were in favour of banning smoking.","This treatment is not available in the vast majority of hospitals.","The overwhelming majority of participants were men.","to represent/form/constitute/comprise the majority of somebody/something","in a/the majority (of something) In the nursing profession, women are in the majority.","The drug provided significant pain relief in a majority of cases.","a majority decision (= one that is decided by what most people want)","We make decisions by majority vote.","the majority opinion/view","English speakers form the majority of the population.","He joined the majority in criticizing the government's reforms.","In the general population, right-handed people are in the majority.","Opinion polls show that a majority supports a change in the law.","The French company holds a majority stake in the retail chain.","The leader of the majority party in the assembly serves as the prime minister."],"opposite":"minority","synonyms":""},{"def":"the number of votes by which one political party wins an election; the number of votes by which one side in a discussion, etc. wins","examples":["by/with a majority of something She was elected by a majority of 749.","The resolution was carried by a huge majority.","majority over somebody They had a large majority over their nearest rivals.","They have a clear majority (= large majority) in Parliament.","to win/get/gain/secure a majority","Republicans increased their majority in both the House and the Senate.","They failed to win the requisite two-thirds majority.","To govern effectively, he will need a working majority in Congress."],"opposite":"","synonyms":""},{"def":"the difference between the number of votes given to the candidate who wins the election and the total number of votes of all the other candidates","examples":["Without this shift, Kerry would have had a popular majority of a million votes."],"opposite":"","synonyms":""},{"def":"the age at which you are legally considered to be an adult","examples":["The age of majority in Britain was reduced from 21 to 18 in 1970."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["majority rule","majority whip","absolute majority","majority leader","majority verdict","overall majority","moral majority","silent majority","majority whips","majority verdicts"]}]