[{"pos":"phrasal verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/par/partl/partly__us_1.mp3","phonsUS":"","level":"","meanings":[{"def":"to put powder, lipstick, etc. on your/somebody’s face to make it more attractive or to prepare for an appearance in the theatre, on television, etc.","examples":[],"opposite":"","synonyms":""},{"def":"to form something","examples":["Women make up 56 per cent of the student numbers.","be made up of something The course is made up of 12 two-hour sessions."],"opposite":"","synonyms":""},{"def":"to put something together from several different things","examples":[],"opposite":"","synonyms":""},{"def":"to invent a story, etc., especially in order to trick or entertain somebody","examples":["He made up some excuse about his daughter being sick.","I told the kids a story, making it up as I went along.","You made that up!"],"opposite":"","synonyms":""},{"def":"to complete a number or an amount required","examples":["We need one more person to make up a team."],"opposite":"","synonyms":""},{"def":"to replace something that has been lost; to compensate for something","examples":["Can I leave early this afternoon and make up the time tomorrow?"],"opposite":"","synonyms":""},{"def":"to prepare a medicine by mixing different things together","examples":[],"opposite":"","synonyms":""},{"def":"to prepare a bed for use; to create a temporary bed","examples":["We made up the bed in the spare room.","They made up a bed for me on the sofa."],"opposite":"","synonyms":""},{"def":"to clean a hotel room and make the bed","examples":["The maid asked if she could make up the room.","They had forgotten to make up the room."],"opposite":"","synonyms":""},{"def":"to end an argument with somebody and become friends again","examples":["Why don't you two kiss and make up?","Has he made it up with her yet?","Have they made it up yet?"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["make up for","make up to","make up to somebody","make up for something","make up (to somebody) for something","make up leeway","make up your mind","make your mind up","make up for lost time","gain/make up ground (on somebody/something)"]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mak/make_/make_up_1_us_1.mp3","phonsUS":"/ˈmeɪk ʌp/","level":"B2","meanings":[{"def":"coloured substances used on the skin to make yourself look more attractive or to change your appearance","examples":["eye make-up","to put on your make-up","She never wears make-up.","a make-up artist (= a person whose job is to put make-up on other people)","in make-up The actor has to spend three hours in make-up (= having make-up put on) each morning before filming can start.","publicity photos of the actor in make-up (= wearing make-up) for the role","He was given an Oscar for his make-up work on the film.","I never wear make-up.","She was checking her make-up in the mirror.","You don't wear full make-up to go swimming.","a tearful girl with make-up running down her face","the make-up effects for the film"],"opposite":"","synonyms":""},{"def":"the different qualities that combine to form somebody’s character or being","examples":["Jealousy is not part of his make-up.","The final act exposes the fatal flaws in his make-up.","a person’s genetic make-up","The report studies the psychological make-up of a serial killer."],"opposite":"","synonyms":""},{"def":"the different things, people, etc. that combine to form something; the way in which they combine","examples":["the make-up of a TV audience","Ireland did show up a number of flaws in the England team's make-up.","(specialist) the page make-up of a text (= the way in which the words and pictures are arranged on a page)"],"opposite":"","synonyms":""},{"def":"a special exam taken by students who missed or failed an earlier one","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]