[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/man/manag/manage__us_2.mp3","phonsUS":"/ˈmænɪdʒ/","level":"A2","meanings":[{"def":"to control or be in charge of a business, a team, an organization, land, etc.","examples":["to manage a business/factory/bank/hotel/soccer team","to manage a department/project","I think that Forestry Tasmania manages the forest.","The units in some areas are poorly maintained and badly managed.","We need people who are good at managing.","He has no experience of managing a football team.","The hotel is managed by two brothers.","We need a new approach to managing our hospitals.","Organizers are looking for someone to manage the project.","an exchange rate system that will be tightly managed by the central bank","We will actively manage your portfolio to maximize the return on your investment.","All applications are managed in the cloud.","A volunteer group is managing the Seven Fields Nature reserve."],"opposite":"","synonyms":""},{"def":"to succeed in doing something, especially something difficult","examples":["I don't know exactly how we'll manage it, but we will, somehow.","Can you manage another piece of cake? (= eat one)","manage to do something We managed to get to the airport in time.","How did you manage to persuade him?","She somehow managed to escape through the window.","(humorous) He always manages to say the wrong thing.","They managed to find a place to stay.","We couldn't have managed without you.","‘Need any help?’ ‘No, thanks. I can manage.’","Can you play the piano?","I can hear someone calling.","The podcast can be downloaded here.","Can you/​are you able to come on Saturday?","You’ll be able to get a taxi outside the station.","I haven’t been able to get much work done today.","She’d love to be able to play the piano.","Our daughter could walk when she was nine months old.","I was able to/​managed to find some useful books in the library.","I could find some useful books in the library.","We weren’t able to/​didn’t manage to/​couldn’t get there in time.","I could see there was something wrong.","I could have won the game but decided to let her win.","He easily managed to disarm his attacker.","He skilfully managed to keep the aircraft on the runway.","Paul barely managed to stifle a chuckle."],"opposite":"","synonyms":""},{"def":"to succeed in achieving or producing something","examples":["In spite of his disappointment, he managed a weak smile.","Davies manages light humour without seeming silly."],"opposite":"","synonyms":""},{"def":"to be able to solve your problems, deal with a difficult situation, etc.","examples":["She's 82 and can't manage on her own any more.","manage with/without somebody/something How do you manage without a car?","I can manage without a dishwasher.","I don’t know how she manages on her own with four kids."],"opposite":"","synonyms":""},{"def":"to be able to live or survive without having much money, support, sleep, etc.","examples":["young families who are just about managing","She was finding it difficult to manage financially.","manage on something He has to manage on less than £100 a week.","Many find it difficult to manage on their weekly income.","He generally managed on five hours' sleep a night","manage with something Everyone will just have to manage with less."],"opposite":"","synonyms":""},{"def":"to use money, time, information, etc. in a sensible way","examples":["Don't tell me how to manage my affairs.","a computer program that helps you manage data efficiently","This enables pension funds to manage risk.","Charities have to be careful about how they manage their resources.","You need to learn how to manage your time effectively."],"opposite":"","synonyms":""},{"def":"to be able to do something at a particular time","examples":["Let's meet up again—can you manage next week sometime?"],"opposite":"","synonyms":""},{"def":"to keep somebody/something under control; to be able to deal with somebody/something","examples":["It's like trying to manage an unruly child.","Can you manage that suitcase?","She manages horses better than anyone I know.","I really liked the chapter about how to manage stress.","How do skydivers manage these risks in practice?","The condition can be easily managed by simple dietary adjustments.","They have learnt to successfully manage their diabetes."],"opposite":"","synonyms":""},{"def":"to control how land is used, so that it is used in a sensible way","examples":["The landowners manage their land to provide habitat for the desired species.","All the timber comes from sustainably managed forests."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["stage-manage"]}]