[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/man/manda/mandate__us_1.mp3","phonsUS":"/ˈmændeɪt/","level":"C1","meanings":[{"def":"the authority to do something, given to a government or other organization by the people who vote for it in an election","examples":["It is undemocratic to govern an area without an electoral mandate.","mandate to do something The election victory gave the party a clear mandate to continue its programme of reform.","mandate for something a mandate for an end to the civil war","The party was elected with a mandate to reduce the size of government.","Troops moved into the country to restore order under a UN mandate."],"opposite":"","synonyms":""},{"def":"the period of time for which a government is given power","examples":["The presidential mandate is limited to two terms of four years each."],"opposite":"","synonyms":""},{"def":"an official order given to somebody to perform a particular task","examples":["The bank had no mandate to honour the cheque.","They accused him of acting without a mandate."],"opposite":"","synonyms":""},{"def":"the power given to a country to govern another country or region, especially in the past","examples":["The Cook Islands mandate was given to New Zealand.","The mandate ran until 1947."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to order somebody to behave, do something or vote in a particular way; to order something to be done","examples":["mandate that… The law mandates that imported goods be identified as such.","mandate somebody to do something The new law would mandate children to study a foreign language from second grade.","mandate something The government began mandating better car safety."],"opposite":"","synonyms":""},{"def":"to give somebody, especially a government or a committee, the authority to do something","examples":["be mandated to do something The assembly was mandated to draft a constitution.","We need to be sure that the directors are mandated to act."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]