[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mar/margi/margin__us_1.mp3","phonsUS":"/ˈmɑːrdʒɪn/","level":"B2","meanings":[{"def":"the empty space at the side of a written or printed page","examples":["the left-hand/right-hand margin","a narrow/wide margin","in the margin notes scribbled in the margin"],"opposite":"","synonyms":""},{"def":"the amount of time, or number of votes, etc. by which somebody wins something","examples":["He won by a narrow margin.","by a margin of something She beat the other runners by a margin of ten seconds.","Members voted by a margin of 7–1 to become a public limited company.","He had an 18-second margin over his nearest rival.","He won by the narrowest of margins.","The amendment passed by an overwhelming margin.","The election is likely to be decided by razor-thin margins.","The winning margin was only 8 seconds."],"opposite":"","synonyms":""},{"def":"the difference between the cost of buying or producing something and the price that it is sold for","examples":["What are your average operating margins?","a gross margin of 45 per cent","How does the company get by with such razor-thin margins?","The company relies on fat margins from luxury models.","They are operating at very low margins.","They hope to improve their margins on computers."],"opposite":"","synonyms":""},{"def":"an extra amount of something such as time, space, money, etc. that you include in order to make sure that something is successful","examples":["a safety margin","The narrow gateway left me little margin for error as I reversed the car.","The schedule left no margin for error.","We have substantial reserves, which provide a good margin for uncertainties."],"opposite":"","synonyms":""},{"def":"the extreme edge or limit of a place","examples":["the eastern margin of the Indian Ocean"],"opposite":"","synonyms":""},{"def":"the part that is not included in the main part of a group or situation","examples":["on the margins of something people living on the margins of society"],"opposite":"","synonyms":""},{"def":"an amount that is added to a basic wage, paid for special skill or responsibility","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["profit margin","margin of error"]}]