[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mar/marke/market__us_1.mp3","phonsUS":"/ˈmɑːrkɪt/","level":"A1","meanings":[{"def":"an occasion when people buy and sell goods; the open area or building where they meet to do this","examples":["a fruit/flower/fish market","an antiques market","an indoor/a street market","market stalls/traders","at the market We buy our fruit and vegetables at the market.","Thursday is market day.","Every town here has its street market.","They took the pigs to market.","He bought the socks from a market stall in Gloucester.","The town was granted a charter to hold a market on Fridays.","You can buy seaweed at any local market.","Market traders donned traditional costumes to sell their mouth-watering crepes, cheeses and wines."],"opposite":"","synonyms":""},{"def":"business or trade, or the amount of trade in a particular type of goods","examples":["the world market in coffee","They have increased their share of the market by 10 per cent.","The firm will expand its size to claim more market share.","the property/housing/job market (= the number and type of houses, jobs, etc. that are available)","They have cornered the market in sportswear (= sell the most).","New companies have entered the market.","The big players still dominate the market.","A relatively small group of collectors drives the art market.","Organic product lines have expanded from serving a small niche market.","Their books were geared to a mass market.","Lenders have flooded the market with easy credit.","Markets evolve in response to consumer demands.","They seem to have identified a gap in the market.","Rising mortgage rates will price some people out of the market.","We will charge whatever the market will bear."],"opposite":"","synonyms":""},{"def":"a particular area, country or section of the population that might buy goods","examples":["The Chinese market has opened up recently.","Expansion into the global market brings more risk.","They supply beef to the domestic market.","The young, health-conscious female consumer is our target market.","Emerging markets in Asia and Latin America represent the best export opportunities for us.","They're hoping to get into the Far Eastern market.","The disks are designed for professional applications, rather than the consumer market.","There is not a broad commercial market for these prints.","Giving away free toys is a popular way to tap the family market.","Both products are targeting the same market.","Single professionals with no children are a lucrative market.","The company has established new markets in China, Bermuda and Algeria."],"opposite":"","synonyms":""},{"def":"the number of people who want to buy something","examples":["a growing/declining market for second-hand cars","There's not much of a market for tourist art on the island.","New Zealand is competing in an international market for medical graduates."],"opposite":"","synonyms":""},{"def":"people who buy and sell goods in competition with each other","examples":["The market will decide if the TV station has any future.","a market-based/market-led/market-driven economy","innovative products at the forefront of market trends","He believes that regulating the market is a good thing.","Some services cannot be left to the market."],"opposite":"","synonyms":""},{"def":"the business of buying and selling shares in companies and the place where this happens; a stock exchange","examples":["the futures market","a market crash","The market closed weaker.","The markets reacted quickly to the negative publicity.","The market was down 15 per cent.","He believes oil stocks will outperform the market over the next 12 months.","Government attempts to manipulate currency markets tend to backfire."],"opposite":"","synonyms":""},{"def":"a situation in which there is a lot of a particular item for sale, so that prices are low and people buying have a choice","examples":["In a buyer's market, the commodity is plentiful and so its price is not high."],"opposite":"","synonyms":""},{"def":"interested in buying something","examples":["I'm not in the market for a new car at the moment."],"opposite":"","synonyms":""},{"def":"available for people to buy","examples":["to put your house on the market","The house came on the market last year.","There are hundreds of different brands on the market."],"opposite":"","synonyms":""},{"def":"available to buy without any limits","examples":[],"opposite":"","synonyms":""},{"def":"to buy and sell stocks and shares in order to make a profit","examples":["He is a skilled investor who knows how to play the market—and win."],"opposite":"","synonyms":""},{"def":"to charge such a high price for your goods, services, etc. that nobody wants to buy them","examples":["Some leading UK firms are pricing themselves out of the market."],"opposite":"","synonyms":""},{"def":"a situation in which people selling something have an advantage, because there is not a lot of a particular item for sale, and prices can be kept high","examples":["In a seller’s market, demand exceeds supply, and prices are high."],"opposite":"","synonyms":""},{"def":"to stop something from being sold","examples":["The slimming pills were taken off the market.","Thousands of egg products were taken off the shelves following the health scare."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a buyer’s market","def":"a situation in which there is a lot of a particular item for sale, so that prices are low and people buying have a choice","examples":["In a buyer's market, the commodity is plentiful and so its price is not high."]},{"idiom":"in the market for something","def":"interested in buying something","examples":["I'm not in the market for a new car at the moment."]},{"idiom":"on the market","def":"available for people to buy","examples":["to put your house on the market","The house came on the market last year.","There are hundreds of different brands on the market."]},{"idiom":"on the open market","def":"available to buy without any limits","examples":[]},{"idiom":"play the market","def":"to buy and sell stocks and shares in order to make a profit","examples":["He is a skilled investor who knows how to play the market—and win."]},{"idiom":"price yourself/something out of the market","def":"to charge such a high price for your goods, services, etc. that nobody wants to buy them","examples":["Some leading UK firms are pricing themselves out of the market."]},{"idiom":"a seller’s market","def":"a situation in which people selling something have an advantage, because there is not a lot of a particular item for sale, and prices can be kept high","examples":["In a seller’s market, demand exceeds supply, and prices are high."]},{"idiom":"take something off the market/shelves","def":"to stop something from being sold","examples":["The slimming pills were taken off the market.","Thousands of egg products were taken off the shelves following the health scare."]}],"phrasal":[],"related":["bear market","bull market","flea market","free market","grey market","market town","mass-market","meat market","open market","wet market","black market","common market","labour market","market forces","market garden","market leader","market price","market share"]},{"pos":"verb","level":"B1","meanings":[{"def":"to advertise a product in a particular way in order to make people want it","examples":["market something The company utilizes every media tool available to market its products.","The drug had been successfully marketed in Germany.","market something as something It is marketed as a low-alcohol wine.","market something to somebody School meals need to be marketed to children in the same way as other food.","They manufacture and market sports and fitness products.","Librarians seek new ways to market their services.","The chemical is marketed under the name Calicide.","Banks were accused of aggressively marketing credit cards and auto loans.","The printer is being selectively marketed in a handful of countries.","The ‘holiday village’ idea is being heavily marketed in the United Kingdom.","The brand is marketed by Forest Farms, one of the regional dairy cooperatives.","It will be marketed as a tonic for the elderly.","Nintendo is trying to market its games to parents.","The company is not actively marketing its products to schools."],"opposite":"","synonyms":""},{"def":"to offer a product for sale","examples":["Many farmers have taken steps to directly market their meat to consumers.","All her products are marketed online on her website.","They are currently marketing a three-bedroom house requiring modernization."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]