[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mas/mask_/mask__us_1.mp3","phonsUS":"/mæsk/","level":"C1","meanings":[{"def":"something that you wear over your face to hide it, or to frighten or entertain other people","examples":["The robbers wore stocking masks.","The kids were all wearing animal masks.","In the second part of the play, the actors take off their masks.","The man's face was hidden by a mask.","Two eyes glared at him from beneath the mask.","two men in black masks"],"opposite":"","synonyms":""},{"def":"something that you wear over part or all of your face in order to protect it","examples":["a surgical/gas mask","a fencing mask"],"opposite":"","synonyms":""},{"def":"a thick cream made of various substances that you put on your face and neck in order to improve the quality of your skin","examples":["a face mask"],"opposite":"","synonyms":""},{"def":"a manner or an expression that hides your true character or feelings","examples":["He longed to throw off the mask of respectability.","Her face was a cold, blank mask.","For a moment her mask slipped, and I saw how scared she really was.","He was hiding behind a mask of indifference but she wasn't fooled.","His fooling around is a mask for his lack of confidence.","He looked at me, his face a mask of innocence.","The mask of politeness slipped for a moment."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["gas mask","face mask","death mask","oxygen mask"]},{"pos":"verb","level":"","meanings":[{"def":"to hide a feeling, smell, fact, etc. so that it cannot be easily seen or noticed","examples":["She masked her anger with a smile.","He hid the letter in a drawer.","She managed to hide her disappointment.","The paintings were concealed beneath a thick layer of plaster.","Tim could barely conceal his disappointment.","She covered her face with her hands.","He tried to disguise his accent.","She masked her anger with a smile.","The soldiers camouflaged themselves with leaves and twigs.","Varnish tends to mask the natural grain of the wood.","Spices were used to mask the unpleasant taste of the meat."],"opposite":"","synonyms":"hide"}],"idioms":[],"phrasal":[],"related":[]}]