[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mas/mass_/mass__us_2.mp3","phonsUS":"/mæs/","level":"B2","meanings":[{"def":"a large amount of a substance that does not have a definite shape or form","examples":["She saw a large dark mass in the water.","The hill appeared as a black mass in the distance.","mass of something a mass of snow and rocks falling down the mountain","The sky was full of dark masses of clouds.","When I washed the jumper, it just turned into a shapeless mass.","a dense mass of smoke","A mass of cold air is coming from the north.","A tumbling mass of water cascaded down the staircase.","a seething mass of volcanic activity"],"opposite":"","synonyms":""},{"def":"a large amount or quantity of something","examples":["a mass of blonde hair","I began sifting through the mass of evidence.","Both titles give readers a mass of information.","A huge mass of material has been organized into a clear narrative.","He sorted through the mass of images scattered across the table."],"opposite":"","synonyms":""},{"def":"a large number of people or things grouped together, often in a confused way","examples":["I struggled through the mass of people to the exit.","The page was covered with a mass of figures.","a chaotic mass of ideas","She was a seething mass of neuroses.","A mass of anti-war protesters packed the streets of London."],"opposite":"","synonyms":""},{"def":"a large number or amount of something","examples":["There were masses of people in the shops yesterday.","I've got masses of work to do.","Don't give me any more. I've eaten masses!","There is masses of cake left over from the party.","Masses of adoring fans flocked to the venue.","The plant has masses of small flowers all summer long.","Workshops offers expert advice and masses of health information."],"opposite":"","synonyms":""},{"def":"the ordinary people in society who are not leaders or who are considered to be not very well educated","examples":["government attempts to suppress dissatisfaction among the masses","a TV programme that brings science to the masses","the image of America with arms open wide to the world's huddled masses"],"opposite":"","synonyms":""},{"def":"the most; the majority","examples":["The reforms are unpopular with the mass of teachers and parents.","Their policies appeal to the broad mass of the population."],"opposite":"","synonyms":""},{"def":"the quantity of material that something contains","examples":["calculating the mass of a planet","a mass of 46.3 kg","Bodybuilders trying to gain muscle mass eat a lot of protein.","Calcium deficiency can lead to low bone mass in adolescent girls.","As a black hole gives off particles and radiation, it will lose mass."],"opposite":"","synonyms":""},{"def":"to be full of or covered with something","examples":["The rose bushes are a mass of flowers in June.","Her arm was a mass of bruises."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be a mass of something","def":"to be full of or covered with something","examples":["The rose bushes are a mass of flowers in June.","Her arm was a mass of bruises."]}],"phrasal":[],"related":["Mass","land mass","mass noun","atomic mass","black mass","mass-market","mass number","critical mass","mass-produce","mass-produced","mass transit","center of mass","centre of mass","mass production","body mass index","mass media","relative atomic mass"]},{"pos":"adjective","level":"B2","meanings":[{"def":"affecting or involving a large number of people or things","examples":["The world faces the tremendous problem of mass unemployment.","The industrial revolution heralded the start of mass production.","victims of a mass shooting","Their latest product is aimed at the mass market.","These weapons were used to commit mass murder.","The victims were buried in a mass grave.","Better mass transit means easier commuting.","Mass surveillance of private communication concerns us all.","The play was so awful that there was a mass exodus from the theatre at the interval."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to come together in large numbers; to gather people or things together in large numbers","examples":["(+ adv./prep.) Demonstrators had massed outside the embassy.","Dark clouds massed on the horizon.","Their troops were massing for war.","mass somebody/something The general massed his troops for a final attack."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mas/mass_/mass__us_1.mp3","level":"","meanings":[{"def":"(especially in the Roman Catholic Church) a ceremony held in memory of the last meal that Christ had with his disciples","examples":["to go to Mass","a priest celebrating/saying Mass"],"opposite":"","synonyms":""},{"def":"a piece of music that is written for the prayers, etc. of this ceremony","examples":["Bach’s Mass in B minor"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]