[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mat/mater/material__us_2.mp3","phonsUS":"/məˈtɪriəl/","level":"A2","meanings":[{"def":"a substance that things can be made from","examples":["building materials (= bricks, sand, glass, etc.)","Every item we sell is made out of recycled material.","All the furniture is crafted from natural materials.","synthetic/man-made materials","Bacteria help break down dead plant material such as fallen leaves.","We have 98% of the same genetic material as chimpanzees.","Higher raw material costs have pushed up the price of many manufactured goods.","Kaolin, the source material for porcelain, was discovered near the town.","Many of the original materials were reused in the restoration of the building.","The artificial turf is laid onto a rubber composite material.","A ban on risk materials from the human food chain provides protection to public health.","The corn contains genetically modified material.","Toxic chemicals and other materials have been found."],"opposite":"","synonyms":""},{"def":"things that are needed in order to do a particular activity","examples":["teaching materials","They publish a range of educational materials.","Advertising and promotional materials target the male market.","The company produces its own training material.","camping equipment","a piece of equipment","household cleaning materials","teaching material","Skiing gear can be expensive.","a first-aid kit","a tool kit","breathing apparatus for firefighters","laboratory apparatus","Prisoners were not allowed writing materials.","You have to buy your own art materials.","Many household cleaning materials are highly toxic."],"opposite":"","synonyms":"equipment"},{"def":"information or ideas used in books, etc.","examples":["She's collecting material for her latest novel.","This is not suitable reading material for a child.","The letters were used as source material in this new biography.","Such conflicts provide good material for film plots.","He's collecting material for a new book on space travel.","This is not really suitable reading material for a young child.","I can't find any relevant material on him in the library.","The DVD includes some great supplementary material.","The library has a wealth of old photographs and other archival material.","The magazine contains not one bit of original material.","This new biography contains a wealth of previously unpublished material.","original material on the First World War","He was convicted of importing indecent material.","The collection includes objects and printed material."],"opposite":"","synonyms":""},{"def":"cloth used for making clothes, curtains, etc.","examples":["You'll need a piece of material about 20 cm square.","‘What material is this dress made of?’ ‘Cotton.’","cotton fabric","furnishing fabrics","His bandages had been made from strips of cloth.","‘What material is this dress made of?’ ‘Cotton.’","He owns a factory producing a range of textiles.","the textile industry","satin, velvet, silk and other dress material","A patchwork quilt is a good way of using up scraps of material.","The military uses synthetic materials for clothing because they're more durable than cotton."],"opposite":"","synonyms":"fabric"},{"def":"items used in a performance","examples":["The band played all new material at the gig."],"opposite":"","synonyms":""},{"def":"a person with particular qualities or suitable for a particular opportunity","examples":["The teacher saw her as good university material (= good enough to go to university).","He's not really Olympic material."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["raw material"]},{"pos":"adjective","level":"B2","meanings":[{"def":"connected with money, possessions, etc. rather than with the needs of the mind or spirit","examples":["material possessions/wealth","The early pioneers had few material resources at their disposal.","Only 34% of respondents said that material goods brought them happiness.","changes in your material circumstances"],"opposite":"spiritual","synonyms":""},{"def":"connected with the physical world rather than with the mind or spirit","examples":["the material world"],"opposite":"immaterial","synonyms":""},{"def":"important and needing to be considered","examples":["material evidence/facts","We must allow all material considerations to be taken into account.","material to something She omitted information that was material to the case."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]