[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mat/matte/matter__us_2.mp3","phonsUS":"/ˈmætər/","level":"A2","meanings":[{"def":"used (to ask) if somebody is upset, unhappy, etc. or if there is a problem","examples":["What's the matter? Is there something wrong?","Is anything the matter?","matter with somebody/something Is something the matter with Bob? He seems very down.","There's something the matter with my eyes.","‘We've bought a new TV.’ ‘What was the matter with the old one?’","What's the matter with you today (= why are you behaving like this)?","What on earth was the matter with her, she wondered. She’d come here to enjoy herself and here she was, stuck on her own in the hotel."],"opposite":"","synonyms":""},{"def":"a subject or situation that you must consider or deal with","examples":["It's a private matter.","They had important matters to discuss.","She may need your help with some business matters.","financial/legal/political matters","They've agreed in theory, but now we need to discuss practical matters.","The matter should be referred to a senior manager.","Do I have any choice in the matter?","I always consulted him on matters of policy.","matter for somebody It's a matter for the police (= for them to deal with).","matter of something (formal) It was a matter of some concern to most of those present (= something they were worried about).","It should have been a simple matter to check.","It was no easy matter getting him to change his mind.","Let's get on with the matter in hand (= what we need to deal with now).","I wasn't prepared to let the matter drop (= stop discussing it).","We have sent these concerns to Professor Tribe, and now consider the matter closed (= it is finished).","I did not feel that we had got to the heart of the matter (= the most important part).","And that is the crux of the matter (= the most important thing about the situation).","(ironic) And then there's the little matter of the fifty pounds you owe me.","The involvement of the king in legal matters was threatened by the civil war.","Dr Bell holds traditional views on a variety of matters.","That's a matter for you to take up with your boss.","He left, saying he had pressing matters to attend to.","His lawyer advised him to drop the matter.","I don't have much experience in these matters.","I don't really want to go into this matter now.","It is then a simple matter to print off the data you have collected.","It's a relief to have the matter settled.","She was a great source of knowledge on matters relating to nutrition.","The matter will be raised at our next meeting.","The question of his innocence is a weighty matter for this court.","The rest of the meeting was taken up by routine matters.","They talk mostly about work and related matters.","I wasn't sure how to approach the delicate matter of pay."],"opposite":"","synonyms":""},{"def":"the present situation, or the situation that you are talking about","examples":["Unfortunately, there is nothing we can do to improve matters.","I'd forgotten the keys, which didn't help matters.","And then, to make matters worse, his parents turned up.","I decided to take matters into my own hands (= deal with the situation myself).","Matters came to a head (= the situation became very difficult) with his resignation.","Matters were made worse by a fire in the warehouse.","Let me simplify matters by giving you my answer now.","She always arranges matters to suit herself."],"opposite":"","synonyms":""},{"def":"a situation that involves something or depends on something","examples":["matter of something Learning to drive is all a matter of coordination.","Some people prefer the older version to the new one. It's a matter of taste.","She resigned over a matter of principle.","The government must deal with this as a matter of urgency.","Just as a matter of interest (= because it is interesting, not because it is important), how much did you pay for it?","‘I think this is the best so far.’ ‘Well, that's a matter of opinion (= other people may think differently).’","It's not pure fantasy ! It's a plain matter of fact.","Getting the effect you want is a matter of trial and error.","matter of doing something That's not a problem. It's simply a matter of letting people know in time.","Planning a project is just a matter of working out the right order to do things in."],"opposite":"","synonyms":""},{"def":"physical substance that everything in the world is made of; not mind or spirit","examples":["to study the properties of matter","This swirling mass of energy and matter is classed as a spiral galaxy."],"opposite":"","synonyms":""},{"def":"a substance or things of a particular sort","examples":["Add plenty of organic matter to improve the soil.","elimination of waste matter from the body","She didn't approve of their choice of reading matter.","There were small lumps of matter floating on the surface."],"opposite":"","synonyms":""},{"def":"used to add a comment on something that you have just said, usually adding something that you think the other person will be interested in","examples":["It's a nice place. We've stayed there ourselves, as a matter of fact."],"opposite":"","synonyms":""},{"def":"used to disagree with something that somebody has just said","examples":["‘I suppose you'll be leaving soon, then?’ ‘No, as a matter of fact I'll be staying for another two years.’"],"opposite":"","synonyms":""},{"def":"to be very different","examples":["I know which area they live in, but whether I can find their house is a different matter.","That's a whole different matter.","I don't mind lizards, but snakes are a different matter."],"opposite":"","synonyms":""},{"def":"to be something serious that you should not joke about","examples":[],"opposite":"","synonyms":""},{"def":"used to emphasize a statement, especially one that is the opposite of what has just been mentioned","examples":["A new car would be wonderful but the fact of the matter is that we can't afford one."],"opposite":"","synonyms":""},{"def":"used to add a comment on something that you have just said","examples":["I didn't like it much. Nor did the kids, for that matter."],"opposite":"","synonyms":""},{"def":"used to say that something will definitely happen, although you are not sure when","examples":["It's only a matter of time before they bring out their own version of the software."],"opposite":"","synonyms":""},{"def":"(as) the usual and correct thing to do","examples":["We always check people's addresses as a matter of course."],"opposite":"","synonyms":""},{"def":"only a few hours, minutes, etc.","examples":["It was all over in a matter of minutes.","The bullet missed her by a matter of inches."],"opposite":"","synonyms":""},{"def":"used to describe a situation that is very important or serious","examples":["You mustn't let anyone know— it's a matter of life and death.","These talks are a matter of life or death for the factory."],"opposite":"","synonyms":""},{"def":"something that has been recorded as being true","examples":[],"opposite":"","synonyms":""},{"def":"used to say that something is not important","examples":["If that doesn't work out, no matter, I'll rent for another year or two."],"opposite":"","synonyms":""},{"def":"used to say that something is always true, whatever the situation is, or that somebody should certainly do something","examples":["They don't last long no matter how careful you are.","Call me when you get there, no matter what the time is."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"as a matter of fact","def":"used to add a comment on something that you have just said, usually adding something that you think the other person will be interested in","examples":["It's a nice place. We've stayed there ourselves, as a matter of fact.","‘I suppose you'll be leaving soon, then?’ ‘No, as a matter of fact I'll be staying for another two years.’"]},{"idiom":"be another/a different matter","def":"to be very different","examples":["I know which area they live in, but whether I can find their house is a different matter.","That's a whole different matter.","I don't mind lizards, but snakes are a different matter."]},{"idiom":"be no laughing matter","def":"to be something serious that you should not joke about","examples":[]},{"idiom":"the fact (of the matter) is (that)…","def":"used to emphasize a statement, especially one that is the opposite of what has just been mentioned","examples":["A new car would be wonderful but the fact of the matter is that we can't afford one."]},{"idiom":"for that matter","def":"used to add a comment on something that you have just said","examples":["I didn't like it much. Nor did the kids, for that matter."]},{"idiom":"it’s just/only a matter of time (before…)","def":"used to say that something will definitely happen, although you are not sure when","examples":["It's only a matter of time before they bring out their own version of the software."]},{"idiom":"(as) a matter of course","def":"(as) the usual and correct thing to do","examples":["We always check people's addresses as a matter of course."]},{"idiom":"a matter of hours, minutes, etc. | a matter of inches, metres, etc.","def":"only a few hours, minutes, etc.","examples":["It was all over in a matter of minutes.","The bullet missed her by a matter of inches."]},{"idiom":"a matter of life and/or death","def":"used to describe a situation that is very important or serious","examples":["You mustn't let anyone know— it's a matter of life and death.","These talks are a matter of life or death for the factory."]},{"idiom":"a matter of record","def":"something that has been recorded as being true","examples":[]},{"idiom":"no matter","def":"used to say that something is not important","examples":["If that doesn't work out, no matter, I'll rent for another year or two."]},{"idiom":"no matter who, what, where, etc.","def":"used to say that something is always true, whatever the situation is, or that somebody should certainly do something","examples":["They don't last long no matter how careful you are.","Call me when you get there, no matter what the time is."]}],"phrasal":[],"related":["dark matter","grey matter","matter-of-fact","subject matter","matter-of-factly","gray matter","waste matter","mind over matter","as a matter of fact","be no laughing matter","(as) a matter of course","be another/a different matter","a matter of life and/or death","the fact (of the matter) is (that)…"]},{"pos":"verb","level":"A2","meanings":[{"def":"to be important or have an important effect on somebody/something","examples":["‘I'm afraid I forgot that book again.’ ‘It doesn't matter (= it is not important enough to worry about).’","‘What did you say?’ ‘Oh, it doesn't matter’ (= it is not important enough to repeat).","After his death, nothing seemed to matter any more.","She was trying to get noticed by the people who matter.","matter to somebody The children matter more to her than anything else in the world.","Councillors are tackling the things that matter most to local people.","matter who, what, etc… Does it really matter who did it?","It doesn't matter how fast you walk (= it will not make any difference), you're going to get very wet.","matter to somebody who, what, etc… It doesn't matter to me what you do.","matter (to somebody) that… It didn't matter that the weather was bad.","What does it matter if I spent $100 on it—it's my money!","As long as you're happy, that's all that matters.","He's been in prison, you know—not that it matters (= that information does not affect my opinion of him).","Somehow it didn't seem to matter much any more.","These things matter a lot to young children.","It doesn't matter about the mess.","She could find a job. It hardly mattered what.","It doesn't matter one whit what their ethnic background is."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]