[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mea/mean_/mean__us_1.mp3","phonsUS":"/miːn/","level":"A1","meanings":[{"def":"to have something as a meaning in the same or another language","examples":["mean something What does this sentence mean?","What does ‘lark’ mean?","The word ‘Kuching’ means ‘cat’ in Malay.","Many languages use a single word to mean both music and dance.","What is meant by ‘batch processing’?","‘Parcours’ is a French word meaning the route or the journey.","‘Zavod’ is usually translated as ‘The Iron Foundry’, though the word means simply ‘factory’ or ‘work’."],"opposite":"","synonyms":""},{"def":"to have something as a meaning; to represent something","examples":["mean something by something What do we mean by democracy?","mean something to somebody Does the name ‘Jos Vos’ mean anything to you (= do you know who he is)?","mean (that)… The flashing light means (that) you must stop.","mean something The Olympics have come to mean a wide variety of things.","Convenience means different things to different customers.","Too often impressionism is taken to mean gazing through a soft-focus lens."],"opposite":"","synonyms":""},{"def":"to intend to say something on a particular occasion","examples":["mean something by something What did he mean by that remark?","mean something ‘Perhaps we should try another approach.’ ‘What do you mean? (= I don't understand what you are suggesting.)’","‘What's that supposed to mean?’ demanded John.","What do you mean, you thought I wouldn't mind? (= of course I mind and I am very angry)","What she means is that there's no point in waiting here.","I always found him a little strange, if you know what I mean (= if you understand what I mean by ‘strange’).","I know what you mean (= I understand and feel sympathy). I hated learning to drive too.","(informal) It was like—weird. Know what I mean?","I see what you mean (= I understand although I may not agree), but I still think it's worth trying.","See what I mean (= I was right and this proves it, doesn't it)? She never agrees to anything I suggest.","‘But Pete doesn't know we're here!’ ‘That's what I mean! (= that's what I have been trying to tell you.)’","Do you mean Ann Smith or Mary Smith?","mean (that)… Did he mean (that) he was dissatisfied with our service?","You mean (= are you telling me) we have to start all over again?","Some poems are mnemonics, i.e. they are designed to help you remember something.","Some poems are mnemonics, that is to say, they are designed to help you remember something.","Mnemonic poems, that is poems designed to help you remember something, are an excellent way to learn lists.","A limerick’s rhyme scheme is A–A–B–B–A. In other words, the first, second, and fifth lines all rhyme with one another, while the third and fourth lines have their own rhyme.","In this exercise the reader is encouraged to work out the meaning, or rather the range of meanings, of the poem.","This is a poem about death, or, more precisely, dying.","He says his poems deal with ‘the big issues’, by which he means love, loss, grief and death.","I'll be there at five fifteen, I mean five fifty—ten to six.","It'll be Tuesday—sorry, I meant to say Thursday.","Sorry, what I mean is, we need two handouts per person.","We can meet in the conference centre—or rather in front of the centre.","The painter—or should I say, the sculptor—was born in Padua.","It's one t and double s—no, sorry, one s and double t.","It's on the fifth floor—no, actually, it's the fourth.","Can I get two lattes and an espresso—no, scratch that—three lattes?","There are three items on tonight's agenda. Correction, four items."],"opposite":"","synonyms":""},{"def":"to have something as a purpose or intention","examples":["mean something What did she mean by leaving so early (= why did she do it)?","Don't laugh! I mean it (= I am serious).","He means trouble (= to cause trouble).","mean something as something Don't be upset—I'm sure she meant it as a compliment.","mean what… He means what he says (= is not joking, exaggerating, etc.).","mean something for somebody/something The chair was clearly meant for a child.","Don't be angry. I'm sure she meant it for the best (= intended to be helpful).","mean to do something She means to succeed.","I'm sorry I hurt you. I didn't mean to.","I'm feeling very guilty—I've been meaning to call my parents for days, but still haven't got around to it.","mean somebody/something to do something I didn't mean you to read the letter.","You're meant to (= you are supposed to) pay before you go in.","mean (that)… (formal) I never meant (that) you should come alone.","What do you mean by that?","I didn't mean to read your letter.","The house was clearly meant to be a family home.","There was a rack by the door presumably meant for umbrellas.","They are not using the system in the way the manufacturer meant it to be used."],"opposite":"","synonyms":""},{"def":"to have something as a result or a likely result","examples":["mean something Spending too much now will mean a shortage of cash next year.","Being frugal doesn't necessarily mean doing without.","Lower energy consumption means less pollution.","Touching the wires means instant death.","mean to be/do something Do you have any idea what it means to be poor?","mean (that)… We’ll have to be careful with money but that doesn’t mean (that) we can’t enjoy ourselves.","mean doing something This new order will mean working overtime.","mean somebody/something doing something The injury could mean him missing next week's game.","High unemployment means people are spending less.","Mr President, does this mean an end to the current conflict?","The cost would have meant financial ruin for us.","Good civic planning means more green space.","Rural life meant having to draw water from a well every day."],"opposite":"","synonyms":""},{"def":"to be of value or importance to somebody","examples":["Your friendship means a great deal to me.","$20 means a lot (= represents a lot of money) when you live on $100 a week.","Money means nothing to him.","Her children mean the world to her."],"opposite":"","synonyms":""},{"def":"to intend somebody to be or do something","examples":["be meant for something/somebody I was never meant for the army (= did not have the qualities needed to become a soldier).","Duncan and Makiko were meant for each other (= are very suitable as partners).","mean somebody/something to be something His father meant him to be an engineer.","She did everything to get the two of them together, but I guess it just wasn't meant to be."],"opposite":"","synonyms":""},{"def":"to be generally considered to be something","examples":["This restaurant is meant to be excellent."],"opposite":"","synonyms":""},{"def":"used to explain or correct what you have just said","examples":["It was so boring—I mean, nothing happened for the first hour!","She's English—Scottish, I mean."],"opposite":"","synonyms":""},{"def":"to be serious in your intentions","examples":["He has the look of a man who means business.","He says he's going to make changes, and I think he means business."],"opposite":"","synonyms":""},{"def":"to not have any intention of hurting somebody","examples":[],"opposite":"","synonyms":""},{"def":"used to emphasize what you are saying or to ask somebody if they really mean what they say","examples":["I mean to say, you should have known how he would react!","Do you mean to say you've lost it?"],"opposite":"","synonyms":""},{"def":"to have good intentions, although their effect may not be good","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be meant to be something","def":"to be generally considered to be something","examples":["This restaurant is meant to be excellent."]},{"idiom":"I mean","def":"used to explain or correct what you have just said","examples":["It was so boring—I mean, nothing happened for the first hour!","She's English—Scottish, I mean."]},{"idiom":"mean business","def":"to be serious in your intentions","examples":["He has the look of a man who means business.","He says he's going to make changes, and I think he means business."]},{"idiom":"mean (somebody) no harm | not mean (somebody) any harm","def":"to not have any intention of hurting somebody","examples":[]},{"idiom":"mean to say","def":"used to emphasize what you are saying or to ask somebody if they really mean what they say","examples":["I mean to say, you should have known how he would react!","Do you mean to say you've lost it?"]},{"idiom":"mean well","def":"to have good intentions, although their effect may not be good","examples":[]}],"phrasal":[],"related":["Mean Streets","arithmetic mean","geometric mean","Greenwich Mean Time","if you know what I mean","mean business","be no mean…","the happy/golden mean","do, mean, etc. something for the best"]},{"pos":"adjective","level":"","meanings":[{"def":"not willing to give or share things, especially money","examples":["She's always been mean with money.","He's rather mean when it comes to spending money on the children.","They were too mean to buy the kids proper beds.","Don't be so mean with the chocolate sauce."],"opposite":"generous","synonyms":""},{"def":"unkind, for example by not letting somebody have or do something","examples":["Don't be so mean to your little brother!","He's so mean to his mother!","I thought it was really mean of him not to let her use the car.","That was a pretty mean trick."],"opposite":"","synonyms":""},{"def":"likely to become angry or violent","examples":["That's a mean-looking dog.","He has a mean streak in him."],"opposite":"","synonyms":""},{"def":"very good and showing skill","examples":["He's a mean tennis player.","She plays a mean game of chess."],"opposite":"","synonyms":""},{"def":"average; between the highest and the lowest, etc.","examples":["the mean temperature"],"opposite":"","synonyms":""},{"def":"not very great","examples":["This should be clear even to the meanest intelligence."],"opposite":"","synonyms":""},{"def":"poor and dirty in appearance","examples":["mean houses/streets"],"opposite":"","synonyms":""},{"def":"born into or coming from a low social class","examples":["These rights apply even to the meanest labourer."],"opposite":"","synonyms":""},{"def":"used to say that somebody is very good at doing something","examples":["His mother was a painter, and he's no mean artist himself."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be no mean…","def":"used to say that somebody is very good at doing something","examples":["His mother was a painter, and he's no mean artist himself."]}],"phrasal":[],"related":[]},{"pos":"noun","level":"","meanings":[{"def":"a quality, condition, or way of doing something that is in the middle of two extremes and better than either of them","examples":["He needed to find a mean between frankness and rudeness."],"opposite":"","synonyms":""},{"def":"the value found by adding together all the numbers in a group, and dividing the total by the number of numbers","examples":[],"opposite":"","synonyms":""},{"def":"a course of action that is not extreme","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the happy/golden mean","def":"a course of action that is not extreme","examples":[]}],"phrasal":[],"related":[]}]