[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mea/meani/meaning__us_3.mp3","phonsUS":"/ˈmiːnɪŋ/","level":"A1","meanings":[{"def":"the thing or idea that a sound, word, sign, etc. represents","examples":["What's the meaning of this word?","Words often have several meanings.","I am using the word with its original meaning.","The literal meaning of China is ‘the country at the centre’.","‘Honesty’? He doesn't know the meaning of the word!","I can't grasp the meaning of this quotation.","The customer did not understand the meaning of the licence terms.","It is difficult for a non-Italian to grasp all the nuances of meaning.","Some of the symbols carry meaning and some just represent sounds.","The context largely determines the meaning.","The copy editor uses her skill to clarify the meaning.","The word ‘gay’ took on its modern meaning in the 1960s.","There's often a double meaning in jokes and riddles.","These translation errors alter the meaning of the sentence."],"opposite":"","synonyms":""},{"def":"the things or ideas that somebody wishes to communicate to you by what they say or do","examples":["It is important to make your meaning clear.","I don't quite get your meaning (= understand what you mean to say).","What's the meaning of this? I explicitly told you not to leave the room.","I think you misunderstood my meaning.","I'm sure there's no hidden meaning in what he says.","She assigns a meaning to his words they just didn't have."],"opposite":"","synonyms":""},{"def":"the real importance of a feeling or an experience","examples":["With Anna he learned the meaning of love.","The story explores the true meaning of freedom.","It is difficult to grasp the meaning of these events.","For her, the research trip had a different meaning: she was going home.","I am finally learning the real meaning of moderation."],"opposite":"","synonyms":""},{"def":"the ideas that a writer, artist, etc. wishes to communicate through a book, painting, etc.","examples":["several layers of meaning","There are, of course, deeper meanings in the poem.","This chapter is important if the reader is to understand the full meaning of this novel.","This is a disturbing tale that conveys meaning on several levels.","For him, art held little intrinsic meaning.","The movie ends with scenes that are supposed to leave us pondering its meaning."],"opposite":"","synonyms":""},{"def":"the quality or sense of purpose that makes you feel that your life is valuable","examples":["Her life seemed to have lost all meaning.","Having a child gave new meaning to their lives.","Falling in love gave meaning to his life.","He found spiritual meaning through religion.","Her work no longer had any meaning for her.","She's searching for the deeper meaning of life.","Young people can feel that life is without meaning."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["well meaning","lexical meaning"]},{"pos":"adjective","level":"","meanings":[{"def":"intended to communicate or express something to somebody, without any words being spoken","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]