[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mea/measu/measure__us_1.mp3","phonsUS":"/ˈmeʒər/","level":"B1","meanings":[{"def":"to find the size, quantity, etc. of something in standard units","examples":["measure something/somebody a device that measures the level of radiation in the atmosphere","Blood pressure and heart rate should be measured before treatment.","A nurse visited country schools to weigh and measure children.","measuring equipment/instruments","measure something in something A ship's speed is measured in knots.","measure somebody/something for something He's gone to be measured for a new suit.","measure how much, how long, etc… A dipstick is used to measure how much oil is left in an engine.","Body temperatures were measured with a digital thermometer.","The wage price index measures hourly rates of pay.","Cloth is measured in metres.","You can now measure its length more accurately.","They measure the time taken by each rat to find the centre of the maze.","Biomarkers can measure your biological age, regardless of what your birth certificate says.","Any type of data that could not be directly measured was rejected.","Education policy places too much emphasis on things that can be quantitatively measured."],"opposite":"","synonyms":""},{"def":"to be a particular size, length, amount, etc.","examples":["The main bedroom measures 12ft by 15ft.","The pond measures about 2 metres across.","The whole plot measures just 13ft wide at the front.","The earthquake measured 8.4 on the Richter scale.","The burial chamber measures approximately 85m wide and stands 12m high.","The mantis nymph typically measures 4mm in size."],"opposite":"","synonyms":""},{"def":"to judge the importance, value or effect of something","examples":["It is difficult to measure the success of the campaign at this stage.","The company never measures success in dollars alone.","Regular tests are used to measure students' progress.","How does a teacher measure performance in music or gym, for example?","Success is measured by the enjoyment of the audience.","Is it really possible to measure the skills of such jobs according to objective standards?","It is hard to measure the benefits to society of the system.","Success cannot be measured merely in terms of the size of your salary.","The policy's effectiveness cannot be measured by numbers alone."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["measure against","measure out","measure up"],"related":["measure out","measure up","tape measure","customary measure","measure against","safety measure","Measure for Measure","made to measure","measure somebody up","measure something","measure up (to something/somebody)","beyond measure","measure up | measure somebody/something","measure somebody/something against somebody/something","in full measure","in large measure"]},{"pos":"noun","level":"B1","meanings":[{"def":"an official action that is done in order to achieve a particular aim","examples":["safety/austerity measures","a temporary/an emergency measure","a series/number/range of measures","a package of measures aimed at cutting pollution","New security measures were implemented to prevent further violence.","as a… measure Police in riot gear were in attendance as a precautionary measure.","measure to do something We must take preventive measures to reduce crime in the area.","The government is introducing tougher measures to combat crime.","measure against something They are demanding harsher measures against racism.","Can you explain your actions?","Tougher measures against racism are needed.","This was a first step towards a united Europe.","an act of kindness","They are waiting for the results of the opinion polls before deciding their next move.","Development of new water sources needs to be combined with conservation measures.","They are taking measures to ensure they do not overspend the budget.","Special measures are being taken to protect the local water supplies.","The authorities are using increasingly repressive measures.","We had to resort to extraordinary measures to find employees.","We urge you to adopt all necessary measures to guarantee people's safety.","The company introduced a number of measures designed to improve working conditions."],"opposite":"","synonyms":"action"},{"def":"a unit used for stating the size, quantity or degree of something; a system or a scale of these units","examples":["weights and measures","The Richter Scale is a measure of ground motion.","Which measure of weight do pharmacists use?","liquid/dry measure","an accurate measure of length","Higher scores on this standardized measure indicate greater creativity.","This measure is obtained by dividing corporate profits by corporate bond yields.","Charlemagne standardized weights and measures which made it easier to determine the value of goods."],"opposite":"","synonyms":""},{"def":"a standard quantity","examples":["a generous measure of whisky"],"opposite":"","synonyms":""},{"def":"a way of judging or measuring something","examples":["measure of something an accurate measure of ability","Is this test a good measure of reading comprehension?","Exam results are only one measure of a school's success.","as a… measure Companies can use their stock price as a performance measure.","A reliable measure of progress is whether your children can do something they couldn't do before.","The price of housing relative to income is an important measure of real income.","They tried to formulate a quantitative measure of well-being.","This figure alone is not a fair measure of our success.","This figure provides an objective measure of risk.","We still have no objective measure of pain in babies.","GDP is considered the broadest measure of a country's economic activity."],"opposite":"","synonyms":""},{"def":"a sign of the size or the strength of something","examples":["Sending flowers is a measure of how much you care.","Accepting the lower salary was seen as an important measure of commitment.","Her hand trembled slightly, a measure of her anxiety.","Landed income was the true measure of the gentry."],"opposite":"","synonyms":""},{"def":"a particular amount of something, especially a fairly large amount","examples":["A measure of technical knowledge is desirable in this job.","She achieved some measure of success with her first book.","It was a success, containing equal measures of unbridled anarchy and infantile fun."],"opposite":"","synonyms":""},{"def":"an instrument such as a stick, a long tape or a container that is marked with standard units and is used for measuring","examples":[],"opposite":"","synonyms":""},{"def":"a written suggestion, especially one for a new law made by the lawmakers of a state","examples":["a motion to refer the measure to another committee","a ballot measure (= a change in the law that voters decide on)","The mayor threatened to veto a measure passed by the city council.","The Committee unanimously approved the measure."],"opposite":"","synonyms":""},{"def":"one of the short sections of equal length that a piece of music is divided into, and the notes that are in it","examples":["The band began playing the opening measures.","He placed his fingers on the keys and played a few measures.","a steady rhythm of four beats to a measure","the first few measures of Mozart's third violin concerto"],"opposite":"","synonyms":""},{"def":"very much","examples":["He irritated me beyond measure."],"opposite":"","synonyms":""},{"def":"as an extra amount of something in addition to what has already been done or given","examples":["Use 50g of rice per person and an extra spoonful for good measure.","‘I’m no good at puzzles. I can’t even do crosswords,’ she added for good measure."],"opposite":"","synonyms":""},{"def":"the whole of something or less of something than you expect or should have","examples":["We experienced the full measure of their hospitality.","The concert only lasted an hour, so we felt we were getting short measure."],"opposite":"","synonyms":""},{"def":"to form an opinion about something, especially somebody’s character or abilities, so that you can deal with them","examples":["After only one game, the chess champion had the measure of his young opponent."],"opposite":"","synonyms":""},{"def":"to the greatest possible degree","examples":["My expectations had been met in full measure."],"opposite":"","synonyms":""},{"def":"to a great extent","examples":["Their success is due in large measure to their determination."],"opposite":"","synonyms":""},{"def":"to a great extent","examples":["Their success is due in large part to their determination."],"opposite":"","synonyms":""},{"def":"to a large extent or degree; to some, etc. extent or degree","examples":["The introduction of a new tax accounted in no small measure for the downfall of the government.","Our thanks are due in equal measure to every member of the team.","He's been praised and condemned in equal measure.","His success was due in large measure to your help."],"opposite":"","synonyms":""},{"def":"made especially for one person according to particular measurements","examples":["You'll need to get a suit made to measure.","I’m having the curtains made to measure.","a made-to-measure suit"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"beyond measure","def":"very much","examples":["He irritated me beyond measure."]},{"idiom":"for good measure","def":"as an extra amount of something in addition to what has already been done or given","examples":["Use 50g of rice per person and an extra spoonful for good measure.","‘I’m no good at puzzles. I can’t even do crosswords,’ she added for good measure."]},{"idiom":"full/short measure","def":"the whole of something or less of something than you expect or should have","examples":["We experienced the full measure of their hospitality.","The concert only lasted an hour, so we felt we were getting short measure."]},{"idiom":"get/take/have the measure of somebody/something | get/have/take somebody’s measure","def":"to form an opinion about something, especially somebody’s character or abilities, so that you can deal with them","examples":["After only one game, the chess champion had the measure of his young opponent."]},{"idiom":"in full measure","def":"to the greatest possible degree","examples":["My expectations had been met in full measure."]},{"idiom":"in large measure | in large part","def":"to a great extent","examples":["Their success is due in large measure to their determination."]},{"idiom":"in large part | in large measure","def":"to a great extent","examples":["Their success is due in large part to their determination."]},{"idiom":"in no small measure | in some, equal, etc. measure","def":"to a large extent or degree; to some, etc. extent or degree","examples":["The introduction of a new tax accounted in no small measure for the downfall of the government.","Our thanks are due in equal measure to every member of the team.","He's been praised and condemned in equal measure.","His success was due in large measure to your help."]},{"idiom":"made to measure","def":"made especially for one person according to particular measurements","examples":["You'll need to get a suit made to measure.","I’m having the curtains made to measure.","a made-to-measure suit"]}],"phrasal":[],"related":[]}]