[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/med/media/media__us_1.mp3","phonsUS":"/ˈmiːdiə/","level":"A2","meanings":[{"def":"the main ways that large numbers of people receive information and entertainment, that is television, radio, newspapers and the internet","examples":["the national/international media","The news media reported extensively on the story.","The media was/were accused of influencing the final decision.","Digital media change so quickly.","print/electronic/broadcast media","This is a story that the mainstream media refuses to cover.","in the media The trial was fully reported in the media.","Any event attended by the actor received widespread media coverage.","Rumours about her illness began in some media outlets.","The star has been the focus of intense media attention.","He became a media star for his part in the protests.","Innovations in education take place through digital media and mobile devices.","Rescuers and state media rushed to the disaster scene.","There is a perception that the government controls the media.","The minister will address the media on Friday afternoon.","He hosted lavish parties, according to media reports.","Music has been turned into a series of media events.","One story has dominated the media this week.","She's very different from her media image.","Some blame the media for propagating negative stereotypes.","The company is anxious to play down the media hype.","The event was widely covered by the mass media.","The local media reported rioting across the country.","Their PR officer handles TV, radio, and print media interviews.","They believe that the media is biased against them."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["new media","media-savvy","mixed media","media studies","social media","magnetic media","mainstream media","mass media","social media optimization","Department for Digital, Culture, Media and Sport","social media optimisation","Graphical, Paper and Media Union"]}]