[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/med/mediu/medium__us_1.mp3","phonsUS":"/ˈmiːdiəm/","level":"B1","meanings":[{"def":"in the middle between a larger and smaller size, amount, length, temperature, etc.","examples":["There are three sizes—small, medium and large.","a man of medium height/build","a medium steak (= one cooked quite well but not too much)","Cook over a medium heat for 15 minutes.","a medium dry white wine","Choose medium to large tomatoes.","He is a man of medium build, with receding grey hair and a moustache.","Put the eggs in a medium saucepan.","There are hundreds of small and medium enterprises developing software in Brazil."],"opposite":"","synonyms":""},{"def":"used to describe what will happen a long, short, etc. time in the future","examples":["Such a development seems unlikely, at least in the short term (= it will not happen for quite a long time).","In the longer term, children of depressed mothers are more likely to suffer from childhood depression.","In the long term, our efforts will pay off."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in the long/short/medium term","def":"used to describe what will happen a long, short, etc. time in the future","examples":["Such a development seems unlikely, at least in the short term (= it will not happen for quite a long time).","In the longer term, children of depressed mothers are more likely to suffer from childhood depression.","In the long term, our efforts will pay off."]}],"phrasal":[],"related":["medium-term","medium wave","medium-sized","medium-size","the medium wave","a/the happy medium","in the long/short/medium term"]},{"pos":"noun","level":"B2","meanings":[{"def":"a way of communicating information, etc. to people","examples":["the medium of radio/television","electronic/audiovisual media","medium of something The internet is the modern medium of communication.","medium for doing something A T-shirt can be an excellent medium for getting your message across.","Radio is an important communication medium in many countries.","The government communicates through the medium of television.","As a political campaigner he quickly learned to exploit the new medium of radio."],"opposite":"","synonyms":""},{"def":"something that is used for a particular purpose","examples":["medium of something English is the medium of instruction (= the language used to teach other subjects).","medium for doing something Video is a good medium for learning a foreign language.","The first use of tape as a recording medium was in 1956.","She used her novels as a medium for encouraging political debate.","She experimented with the blog as a new medium for exploring issues."],"opposite":"","synonyms":""},{"def":"the material used for storing computer files, such as on magnetic tape or discs","examples":["Copy files to and from the device as you would with any other storage medium."],"opposite":"","synonyms":""},{"def":"the material or the form that an artist, a writer or a musician uses","examples":["the medium of paint/poetry/drama","Watercolour is his favourite medium.","Oil paint is her preferred artistic medium.","The gallery has been committed to the photographic medium for 25 years."],"opposite":"","synonyms":""},{"def":"a substance that something exists or grows in or that it travels through","examples":["The bacteria were growing in a sugar medium."],"opposite":"","synonyms":""},{"def":"a person who claims to be able to communicate with the spirits of dead people","examples":[],"opposite":"","synonyms":""},{"def":"something that is in the middle between two choices or two ways of doing something","examples":["She tried to strike a happy medium between making the questions too hard and making them too easy."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a/the happy medium","def":"something that is in the middle between two choices or two ways of doing something","examples":["She tried to strike a happy medium between making the questions too hard and making them too easy."]}],"phrasal":[],"related":[]}]