[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mee/meeti/meeting__us_1.mp3","phonsUS":"/ˈmiːtɪŋ/","level":"A1","meanings":[{"def":"an occasion when people come together to discuss or decide something","examples":["A hundred people attended the public meeting.","The meeting will be held in the school hall.","to schedule/convene/arrange/organize/call a meeting","Helen will chair the meeting (= be in charge of it).","The meeting was postponed.","an annual meeting","a board/council/committee/public meeting","a series of meetings","What time is the meeting?","Three speakers addressed the meeting.","in a meeting I'll be in a meeting all morning—can you take my calls?","at a meeting The issue will be discussed at the next board meeting.","meeting of somebody/something a meeting of the United Nations Security Council","meeting with somebody She is due to have a meeting with senior government officials.","meeting about something A public meeting about the proposal takes place on Monday.","meeting between A and B This will be the first meeting between the two leaders since they took office.","Facilities include nine meeting rooms.","They rely on videoconferencing for virtual meetings.","He was summoned to a meeting with the head of the department.","It is unclear whether the meeting will go ahead as planned.","Management have called a joint meeting with staff and unions.","Opposition has been expressed at community meetings.","Our group meetings take place on Saturdays.","She headed off to her budget meeting.","The chairperson opened the meeting.","The meeting adjourned for coffee at eleven.","The meeting broke up after a row over whether to allow cameras in.","The meeting closed on a sour note.","The meeting dragged into the early hours of the next day.","The organization holds various regional meetings.","We had an editorial meeting about it."],"opposite":"","synonyms":""},{"def":"the people at a meeting","examples":["The meeting will discuss how to resolve the ongoing crisis in this region.","The meeting voted to accept the pay offer.","Mr Wade told the meeting that a one-way system would make the town safer.","The meeting expressed concern that the problem had still not been addressed.","The meeting heard that two workers had been fired with no official reason given.","The meeting voted 423–133 in favour of a strike.","This meeting urges the company to reconsider its decision to close the factory."],"opposite":"","synonyms":""},{"def":"a situation in which two or more people meet together, because they have arranged it or by chance","examples":["at a meeting At our first meeting I was nervous.","It was a chance meeting that would change my life.","He remembered their childhood meetings with nostalgia.","meeting of/between A and B The meeting of father and son after so long was a joyous occasion.","meeting with somebody This was only my second meeting with him.","Jay drove to the meeting spot.","The arts space serves as a meeting ground for professional artists."],"opposite":"","synonyms":""},{"def":"a sports event or set of races, especially for horses","examples":["an athletics meeting","a race meeting","The horse has won at all of his previous meetings this season."],"opposite":"","synonyms":""},{"def":"an occasion when people, especially Quakers, come together for worship","examples":["Quaker meetings are held here every week."],"opposite":"","synonyms":""},{"def":"a close understanding between people with similar ideas, especially when they meet to do something or meet for the first time","examples":["a meeting of minds between the two artists"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a meeting of minds","def":"a close understanding between people with similar ideas, especially when they meet to do something or meet for the first time","examples":["a meeting of minds between the two artists"]}],"phrasal":[],"related":["meeting house","meeting place","race meeting","town meeting","prayer meeting","annual general meeting","Friends' Meeting House","Commonwealth Heads of Government Meeting","meeting houses"]}]