[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mee/meet_/meet__us_1.mp3","phonsUS":"/miːt/","level":"A1","meanings":[{"def":"to be in the same place as somebody by chance and talk to them","examples":["Maybe we'll meet again some time.","meet somebody Did you meet anyone in town?","I've never met anyone like her.","A year or so later I happened to meet him again.","I hope we'll meet again soon."],"opposite":"","synonyms":""},{"def":"to come together formally in order to discuss something","examples":["The committee meets on Fridays.","meet somebody The Prime Minister met other European leaders for talks.","meet with somebody The President met with senior White House aides.","The evening gave collectors the opportunity to meet with leading art dealers.","meet to do something They met to discuss the project while both were in Paris."],"opposite":"","synonyms":""},{"def":"to come together socially after you have arranged it","examples":["The town needs a space where young people can meet.","meet for something Let's meet for a drink after work.","meet somebody We're meeting them outside the theatre at 7.","meet somebody for something I met a friend for a walk round the lake.","The three sisters rarely meet in person, but spend hours on the phone.","We met the next day at a local bar.","I arranged to meet her for lunch."],"opposite":"","synonyms":""},{"def":"to go to a place and wait there for a particular person or thing to arrive","examples":["meet somebody/something Will you meet me at the airport?","The hotel bus meets all incoming flights.","meet somebody off something I met him off the train.","I won't have any meat, thank you—I'm a vegetarian.","I'll meet you at the station when your train gets in."],"opposite":"","synonyms":""},{"def":"to see and know somebody for the first time; to be introduced to somebody","examples":["I don't think we've met.","meet somebody Where did you first meet your husband?","(especially British English) Pleased to meet you (= when you first meet somebody).","Nice meeting you (= when you leave somebody after meeting them for the first time).","There's someone I want you to meet.","Have you met Miranda?","I love meeting people.","When these two finally met, the connection was electric.","the place where they had first met","an interactive site where people can meet online","Jasper Johns worked at various jobs before meeting Rauschenberg in 1954."],"opposite":"","synonyms":""},{"def":"to do or satisfy what is needed or what somebody asks for","examples":["How can we best meet the needs of all the different groups?","The airport must be expanded to meet demand.","He had failed to meet his performance targets.","to meet a challenge/goal","The oil industry is working to meet clean air requirements.","Patients were included in the study if they met the following criteria.","50% of the candidates failed to meet the standard required.","Until these conditions are met, we cannot proceed with the sale.","I can't possibly meet that deadline.","California faces a further round of rolling blackouts today as the state struggles to meet demand for electrical power.","The workforce work extremely hard to ensure all boats meet the exacting demands of the customer.","Local authorities also have an important role to play in meeting the rural housing challenge.","It's not a matter of meeting a short-term financial goal."],"opposite":"","synonyms":""},{"def":"to play, fight, etc. together as opponents in a competition","examples":["Smith and Jones met in last year's final.","meet somebody Smith met Jones in last year's final."],"opposite":"","synonyms":""},{"def":"to experience something, often something unpleasant","examples":["Others have met similar problems.","How she met her death will probably never be known.","They were determined to meet the challenge head-on."],"opposite":"","synonyms":""},{"def":"to be received or treated by somebody in a particular way","examples":["The announcement was met by loud boos from fans."],"opposite":"","synonyms":""},{"def":"to touch something; to join","examples":["The curtains don't meet in the middle.","meet something That's where the river meets the sea.","His hand met hers."],"opposite":"","synonyms":""},{"def":"to pay something","examples":["The cost will be met by the company.","Many families on these estates are struggling to meet their financial commitments.","The company will meet the cost of the journey.","The school had to sell off its playing fields to meet its debt repayments."],"opposite":"","synonyms":""},{"def":"to meet somebody who is equal to or even better than you in strength, skill or intelligence","examples":["He thought he could beat anyone at chess but he’s met his match in Peter.","I think he's finally met his match in Lisa.","She knew she had met her match and tried to retreat."],"opposite":"","synonyms":""},{"def":"to earn just enough money to be able to buy the things you need","examples":["Many families struggle to make ends meet."],"opposite":"","synonyms":""},{"def":"if you meet somebody’s eye(s), you look directly at them as they look at you; if two people’s eyes meet, they look directly at each other","examples":["She was afraid to meet my eye.","Their eyes met across the crowded room.","She met his gaze without flinching."],"opposite":"","synonyms":""},{"def":"if a sight meets your eyes, you see it","examples":["A terrible sight met their eyes."],"opposite":"","synonyms":""},{"def":"to reach an agreement with somebody by giving them part of what they want","examples":["If he was prepared to apologize, the least she could do was meet him halfway and accept some of the blame."],"opposite":"","synonyms":""},{"def":"to die","examples":[],"opposite":"","synonyms":""},{"def":"used to say that two things are so different that they cannot exist together","examples":[],"opposite":"","synonyms":""},{"def":"a person or thing is more complicated or interesting than you might think at first","examples":[],"opposite":"","synonyms":""},{"def":"the point at which something is tested and you really find out whether it is successful or true","examples":["Here's where the rubber meets the road: will consumers actually buy the product?"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"find/meet your match (in somebody)","def":"to meet somebody who is equal to or even better than you in strength, skill or intelligence","examples":["He thought he could beat anyone at chess but he’s met his match in Peter.","I think he's finally met his match in Lisa.","She knew she had met her match and tried to retreat."]},{"idiom":"make (both) ends meet","def":"to earn just enough money to be able to buy the things you need","examples":["Many families struggle to make ends meet."]},{"idiom":"meet somebody’s eye(s) | meet somebody’s gaze, look, etc. | people’s eyes meet","def":"if you meet somebody’s eye(s), you look directly at them as they look at you; if two people’s eyes meet, they look directly at each other","examples":["She was afraid to meet my eye.","Their eyes met across the crowded room.","She met his gaze without flinching.","A terrible sight met their eyes."]},{"idiom":"meet somebody halfway","def":"to reach an agreement with somebody by giving them part of what they want","examples":["If he was prepared to apologize, the least she could do was meet him halfway and accept some of the blame."]},{"idiom":"meet your Maker","def":"to die","examples":[]},{"idiom":"never the twain shall meet","def":"used to say that two things are so different that they cannot exist together","examples":[]},{"idiom":"there is more to somebody/something than meets the eye","def":"a person or thing is more complicated or interesting than you might think at first","examples":[]},{"idiom":"where the rubber meets the road","def":"the point at which something is tested and you really find out whether it is successful or true","examples":["Here's where the rubber meets the road: will consumers actually buy the product?"]}],"phrasal":["meet up","meet with"],"related":["meet up","meet with","swap meet","meet and greet","meet-and-greet","Meet the Press","We'll Meet Again","would like to meet","meet with somebody","meet up (with somebody)","meet something with something","meet your Maker","people’s eyes meet","meet somebody halfway","make (both) ends meet","meet somebody’s eye(s)","meet somebody’s gaze, look, etc.","find/meet your match (in somebody)"]},{"pos":"noun","level":"","meanings":[{"def":"a sports competition","examples":["a track meet","Brooke missed the meet due to illness.","I swam faster at the last meet.","This year's meet was held in Anchorage, Alaska."],"opposite":"","synonyms":""},{"def":"an event at which horse riders and dogs meet to go hunting. Fox hunting with dogs is now illegal in the UK but people still ride out with dogs following a scent trail, without an actual fox.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]