[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mem/membe/member__us_1.mp3","phonsUS":"/ˈmembər/","level":"A1","meanings":[{"def":"a person, an animal or a plant that belongs to a particular group","examples":["member of something a member of the family/community","He is an important member of our team.","a member of the human race","Members of the public are invited to come and view the work","characteristics common to all members of the species","You are welcome to bring along a family member or friend.","Every staff member is offered training in customer care.","The android could pass as a normal member of the human race.","Audience members voted on their favorite presentations.","Biographies are available for the cast members.","This climbing fern is a well-behaved member of the plant community.","They rely on information from close friends or family members.","The band members all wore wraparound shades."],"opposite":"","synonyms":""},{"def":"a person, a country or an organization that has joined a particular group, club or team","examples":["party/union members","a meeting of member states/countries","How much does it cost to become a member?","New members are always welcome.","member of something an active member of the local church","a founder member of the conservation group","She served as a member of the board of trustees.","Little is known about the third member of the band.","Subscriptions are cheaper for individual members.","10% of club members participated in this year's election.","Future plans will depend on member participation and input in the coming months.","He was a paid-up member of the Communist Party.","I've become a member of our local sports club.","a life member of the Red Cross","a minority member of the Senate Judiciary Committee","the five permanent members of the UN Security Council","the member churches of the Baptist Union","Ireland will share the currency with eleven other member states of the EU.","The university nominates four of the foundation's five board members."],"opposite":"","synonyms":""},{"def":"(in the UK) a Member of Parliament","examples":["the Hon. Member for Brent North","‘I am grateful to the honourable member for his kind remarks.’","In 1956, he returned to Parliament as member for Hampstead."],"opposite":"","synonyms":""},{"def":"a person who has been given an honour","examples":["Murray was made a Member of the Order of Australia for his services to Association Football."],"opposite":"","synonyms":""},{"def":"a part of the body, especially an arm or a leg","examples":[],"opposite":"","synonyms":""},{"def":"a penis. People say ‘member’ to avoid saying ‘penis’.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Assembly Member","charter member","founder member","founding member","private member","regional member","service member","Member of Congress","Member of Parliament","Member of the European Parliament","Member of the National Assembly","Member of the Legislative Assembly","Member of the House of Assembly","Member of the Provincial Parliament"]}]