[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/men/menti/mention__us_1.mp3","phonsUS":"/ˈmenʃn/","level":"A2","meanings":[{"def":"to write or speak about something/somebody, especially without giving much information","examples":["mention something/somebody Sorry, I won't mention it again.","The newspaper failed to mention a word of Johnson's speech.","The doctor mentioned the possibility of going to Nairobi for special treatment.","The disease is rarely mentioned by Western media.","Now that you mention it, she did seem to be in a strange mood.","mention something/somebody to somebody Nobody mentioned anything to me about it.","mention where, why, etc… Did she mention where she was going?","mention that… You mentioned in your letter that you might be moving abroad.","He failed to mention that he was the one who started the fight.","mention doing something Did I mention going to see Vicky on Sunday?","mention something/somebody in something The cruise visits most places mentioned in the article.","Nobody mentioned anything to me about it.","I promised not to refer to the matter again.","Witnesses spoke of a great ball of flame.","He cited his heavy workload as the reason for his breakdown.","Can you quote me an instance of when this happened?","Although she didn't actually mention the move, I am sure that was in her mind.","Incidents like those mentioned above are becoming more common.","Did I mention the fact that I'm now single?","He avoided mentioning his family.","In the example mentioned above, either method of construction could have been used.","He only mentioned his work in passing.","She didn't mention the economy in her speech.","He was the first to publicly mention this.","My name wasn't mentioned at all.","Wounded in action, he was twice mentioned in dispatches.","I just never thought to mention it to you.","Please don't mention this to Sally.","Next spring has been mentioned as a possible time for the event.","I casually mentioned that I might be interested in working abroad.","Did he happen to mention putting you in his will?"],"opposite":"","synonyms":"mention"},{"def":"to refer to somebody/something as being interesting, especially as a possible candidate for a job or position","examples":["His name has been mentioned as a future MP."],"opposite":"","synonyms":""},{"def":"used as a polite answer when somebody has thanked you for something","examples":["‘Thanks for all your help.’ ‘Don't mention it.’"],"opposite":"","synonyms":""},{"def":"used to introduce extra information and emphasize what you are saying","examples":["He has two big houses in this country, not to mention his villa in France.","I admired her confidence, not to mention the fact that she was intelligent and well spoken."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"don’t mention it","def":"used as a polite answer when somebody has thanked you for something","examples":["‘Thanks for all your help.’ ‘Don't mention it.’"]},{"idiom":"not to mention","def":"used to introduce extra information and emphasize what you are saying","examples":["He has two big houses in this country, not to mention his villa in France.","I admired her confidence, not to mention the fact that she was intelligent and well spoken."]}],"phrasal":[],"related":["honourable mention","honorable mention"]},{"pos":"noun","level":"B1","meanings":[{"def":"an act of referring to somebody/something in speech or writing","examples":["He made no mention of her work.","The concert didn't even get a mention in the newspapers.","We have several other products worthy of mention.","at the mention of something/somebody I went white at the mention of her name.","I've heard no mention of a salary increase this year.","No explicit mention of a sexual relationship is made.","The earliest mention of the town is in a 16th-century manuscript.","The war barely rates a mention in this book.","There is scant mention of her in the literature."],"opposite":"","synonyms":""},{"def":"an act of acknowledging somebody/something as deserving praise","examples":["Phil deserves (a) special mention for all the help he gave us.","Special mention must be made of Watson's wonderful performance as the doctor."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]