[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/men/menta/mental__us_1.mp3","phonsUS":"/ˈmentl/","level":"B1","meanings":[{"def":"connected with or happening in the mind; involving the process of thinking","examples":["the mental process of remembering","Do you have a mental picture of what it will look like?","The actor doesn't match the mental image I had of the character.","I made a mental note to talk to her about it.","He has a complete mental block (= difficulty in understanding or remembering) when it comes to physics.","These musicians have prodigious mental capacities.","The experience caused her huge amounts of mental suffering.","Dehydration can affect your mental processes.","The elderly woman has the mental capacity of a child.","Mental performance can be seriously impaired by alcohol."],"opposite":"","synonyms":""},{"def":"connected with the state of health of the mind or with the treatment of illnesses of the mind","examples":["a mental disorder/illness","He had a history of mental problems.","She was suffering from physical and mental exhaustion.","The analysis of dreams can reveal details of a person's mental state.","(old-fashioned) a mental hospital/patient The use of mental in these compounds is now considered old-fashioned, sometimes even offensive. The preferred terms now are psychiatric hospital/patient.","She suffered a mental breakdown after her son's death.","His family had concerns for his physical and mental well-being.","It is a sport that requires physical and mental toughness."],"opposite":"","synonyms":""},{"def":"crazy","examples":["Watch him. He's mental.","My dad will go mental (= be very angry) when he finds out.","We were just losing so much money—it was mental.","It was mental, but a brilliant ending to the film."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["-mental","mental age","mental health","mental arithmetic","mental ages"]},{"pos":"suffix","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/_/_me/_ment/_mental_1_us_1.mp3","phonsUS":"/mentl/","level":"","meanings":[{"def":"doing the action of; having the result of","examples":["governmental","judgemental"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]