[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mer/merit/merit__us_1.mp3","phonsUS":"/ˈmerɪt/","level":"C1","meanings":[{"def":"the quality of being good and of deserving praise or reward","examples":["a work of outstanding artistic merit","without merit The plan is entirely without merit.","on merit I want to get the job on merit.","He was awarded a certificate of merit for his piano playing.","Films are given a rating of one to five stars according to merit.","I can see no merit in excluding the child from school.","Prizes are awarded entirely on merit.","She proved her merit as a serious actress.","She was elected on personal merit.","The winners are ranked in order of merit.","There is lots of merit to the idea.","There is some merit in his argument."],"opposite":"","synonyms":""},{"def":"a good feature that deserves praise or reward","examples":["We will consider each case on its (own) merits (= without considering any other issues, feelings, etc.).","They weighed up the relative merits of the four candidates.","I began to question the merits of these new technologies.","We need to assess the merits of both proposals before making our decision.","Whatever the artist's individual merits, he really can't compete with the great painters."],"opposite":"","synonyms":""},{"def":"a grade in an exam or for a piece of work at school or university that is very good","examples":[],"opposite":"","synonyms":""},{"def":"a special mark or award given as a reward for good behaviour at school","examples":["Other schools already have merit systems in place that reward good behaviour and attitudes."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["merit badge","Order of Merit"]},{"pos":"verb","level":"","meanings":[{"def":"to deserve praise, attention, etc.","examples":["He claims that their success was not merited.","The case does not merit further investigation.","The question hardly merits an answer.","His discussion paper merits further consideration.","Their efforts merit recognition.","This problem merits expert advice."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]