[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mes/messa/message__us_1.mp3","phonsUS":"/ˈmesɪdʒ/","level":"A1","meanings":[{"def":"a written or spoken piece of information, etc. that you send to somebody or leave for somebody when you cannot speak to them yourself","examples":["There were no messages for me at the hotel.","I never got your message.","We've had an urgent message saying that your father's ill.","Jenny's not here at the moment. Can I take a message?","I left a message on her voicemail.","I've been trying to get you all day—don't you ever listen to your messages?","message (from somebody) (to somebody) Messages of support have been arriving from all over the country.","a televised message from the president to the American people","A radio message was sent out to all ships in the area.","Could I speak to Jay Black, please?","Could you give him a message?","Is there a time that might be good for me to try him again?","Can you let him know I’ll call back?","Could you ask him to call me back? My number is…","I called him and received a message on my voice mail the next day.","Are there any messages for me?","He's not here—I'll pass on the message.","The family sent a heartfelt message of thanks to everyone who helped.","They sent messages of hope to the prisoners of war."],"opposite":"","synonyms":""},{"def":"a piece of information sent in electronic form, for example by email or mobile phone","examples":["an email/a text/an SMS message","There were four messages in my inbox.","He sent me a message.","I turned on my cell phone to check my messages.","Fans post messages on her website.","I keep getting an error message when I try to connect to the internet.","I got an anonymous text message.","The email message contains an attachment.","Who wants spam messages appearing on their website?","A message pops up on the screen."],"opposite":"","synonyms":""},{"def":"an important moral, social or political idea that a book, speech, etc. is trying to communicate","examples":["a film with a strong religious message","The campaign is trying to get the message across to young people that drugs are dangerous.","The clear message coming from the government is that they are getting tough on crime.","I think this movie sends the wrong message to her young fans.","He uses his art to convey a political message.","Does this send the right message to our target audience?","He presents a truly chilling message in this article.","He tries to spread the message of safe sex.","The president toured the country spreading the message of national unity.","The take-home message is: be willing to negotiate.","They found a way to transform their ideas into a marketing message that everyone relates to.","This allowed us to bring our message to a different, younger audience.","This is sending a strong message about the importance of climate change.","This song has a universal message that everybody can relate to.","a novel with a serious message","a song with a simple message","spreading the message of the Bible","stories with hidden moral messages","the negative messages we send out","the subversive messages their films carry"],"opposite":"","synonyms":""},{"def":"a piece of information that is sent from the brain to a part of the body, or from a part of the body to the brain","examples":["The message arrives in your brain in a fraction of a second."],"opposite":"","synonyms":""},{"def":"shopping","examples":["to do the messages","to go for the messages","You can leave your messages (= the things that you have bought) here."],"opposite":"","synonyms":""},{"def":"to understand what somebody is trying to tell you indirectly","examples":["When he started looking at his watch, I got the message and left."],"opposite":"","synonyms":""},{"def":"stating/not stating the official view of the political party or organization you represent","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"get the message","def":"to understand what somebody is trying to tell you indirectly","examples":["When he started looking at his watch, I got the message and left."]},{"idiom":"on/off message","def":"stating/not stating the official view of the political party or organization you represent","examples":[]}],"phrasal":[],"related":["error message","message board","mixed message","text message","text-message","voice message","direct message","instant message","instant-message","message boards","private message"]},{"pos":"verb","level":"","meanings":[{"def":"to send a text message, or a message through an instant messaging service, etc. to somebody","examples":["message somebody Fiona just messaged me.","message somebody something Brian messaged me the news."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]