[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/met/metho/method__us_1.mp3","phonsUS":"/ˈmeθəd/","level":"A2","meanings":[{"def":"a particular way of doing something","examples":["Which method is the most effective?","traditional/alternative methods","method of something a scientific method of data analysis","method of doing something a reliable method of measuring blood pressure","method for (doing) something the best method for arriving at an accurate prediction of the costs","method to do something Developing new methods to keep insects out of food packages is critical.","to use/employ/apply a method","to devise/propose/adopt a method","He's quite critical of modern teaching methods.","This is the best method of settling such arguments.","This is a simpler method for making bread.","Farmers are seeking less toxic methods of pest control.","Scientists have developed two new methods of detecting the chemical.","Various methods were used in these studies.","We can apply these methods to a wide range of problems.","This method involves cutting a very thin slice from the object.","This illustrates how experimental methods can be used to explore these issues.","a range of contraceptive methods","Methods were described for growing this vegetable in 200 BC."],"opposite":"","synonyms":""},{"def":"the quality of being well planned and organized","examples":["There's very little method in his approach.","We have to apply some method to this investigation."],"opposite":"","synonyms":""},{"def":"there is a reason for somebody’s behaviour and it is not as strange or as stupid as it seems","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"there’s (a) method in somebody’s madness","def":"there is a reason for somebody’s behaviour and it is not as strange or as stupid as it seems","examples":[]}],"phrasal":[],"related":["method acting","method actor","barrier method","direct method","rhythm method","grammar translation method","method actors","there’s (a) method in somebody’s madness"]}]