[{"pos":"adverb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/min/minim/minimum__us_2.mp3","phonsUS":"/ˈmɪnɪməm/","level":"","meanings":[{"def":"used after amounts to show that the amount is the lowest possible","examples":["You'll need £200 minimum for your holiday expenses."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["minimum wage","minimum security prison","minimum wages","minimum viable product"]},{"pos":"adjective","level":"B2","meanings":[{"def":"the smallest that is possible or allowed; extremely small","examples":["a minimum charge/price","the minimum number/level","the minimum age for retirement","The trust failed to meet the minimum standards expected.","What are your minimum requirements for the job?","The work was done with the minimum amount of effort.","Reservists are required to work a minimum number of hours each month.","The crime carries a minimum sentence of five years.","The test ensures a minimum level of competency."],"opposite":"maximum","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"B2","meanings":[{"def":"the smallest or lowest amount that is possible, required or recorded","examples":["The class needs a minimum of six students to continue.","to a minimum Costs should be kept to a minimum.","Temperatures will fall to a minimum of 10 degrees.","as a… minimum As an absolute minimum, you should spend two hours in the evening studying.","at a minimum Candidates must have a degree at a minimum.","He's always done the minimum possible to pass his exams.","Many people pay the minimum on their credit cards.","Many states impose an age minimum of eighteen for the death penalty.","Two fire crews managed to keep damage to a minimum.","We tried to keep costs down to a minimum.","Most property funds require a minimum of $25 000 to invest."],"opposite":"","synonyms":""},{"def":"an extremely small amount","examples":["He passed the exams with the minimum of effort.","They had military experience, but a bare minimum of police training.","The room had a minimum of furniture.","The tent can be put up with the minimum of effort.","Operations were conducted efficiently, safely and with a minimum of fuss."],"opposite":"maximum","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]