[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/min/minor/minor__us_2.mp3","phonsUS":"/ˈmaɪnər/","level":"B2","meanings":[{"def":"not very large, important or serious","examples":["The new plan involves widening a minor road through the valley.","Both the driver and the passenger suffered minor injuries.","You may need to undergo minor surgery.","Most of these youths are in prison for minor offences.","minor modifications/adjustments","There may be some minor changes to the schedule.","Women played a relatively minor role in the organization.","The minor characters in the story are all well drawn.","When you drive a classic car, you expect a few minor problems.","He started work as a coal miner at 14.","The novel is now regarded as a minor classic.","She arrived in the country as an unaccompanied minor.","That's a relatively minor matter. We can leave it till later.","This is a very minor operation and there is very little risk involved.","A minor snag is that it's expensive.","His only injuries were some minor scratches above his eye.","Minor skirmishes broke out all along the border.","The CD contains a number of delightful short pieces by minor composers.","The letter's survival is something of a minor miracle.","These are minor quibbles in a film that really works for me.","Adverse weather had been a minor inconvenience at times.","In many ways this film is a minor miracle."],"opposite":"major","synonyms":""},{"def":"based on a scale in which the third note is a semitone / half step higher than the second note","examples":["the key of C minor"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["minor in","Asia Minor","Ursa Minor","minor league","minor-league","Morris Minor™","minor leagues","Minor league","minor in something"]},{"pos":"noun","level":"","meanings":[{"def":"a person who is under the age at which you legally become an adult and are responsible for your actions","examples":["It is an offence to serve alcohol to minors.","He started work as a coal miner at 14.","The novel is now regarded as a minor classic.","She arrived in the country as an unaccompanied minor."],"opposite":"","synonyms":""},{"def":"a subject that you study at university in addition to your major","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[],"idioms":[],"phrasal":["minor in"],"related":[]}]