[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mir/mirro/mirror__us_2.mp3","phonsUS":"/ˈmɪrər/","level":"A2","meanings":[{"def":"a piece of special flat glass that reflects images, so that you can see yourself when you look in it","examples":["in the mirror He looked at himself in the mirror.","Remember to look in the mirror (= in a car, when driving) before signalling.","the bathroom mirror","He was busy admiring himself in the mirror.","She stared at her face in the mirror.","We hung a mirror over the fireplace.","a large mirror hanging on the wall behind him","She glanced at her reflection in the mirror."],"opposite":"","synonyms":""},{"def":"something that shows what something else is like","examples":["The face is the mirror of the soul.","Dickens' novels are a mirror of his times."],"opposite":"","synonyms":""},{"def":"a website that is a copy of another website but that has a different address on the internet","examples":[],"opposite":"","synonyms":""},{"def":"the fact of hiding the truth with information that is not important or relevant","examples":["There's a lot of smoke and mirrors in the financing of this film."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"smoke and mirrors","def":"the fact of hiding the truth with information that is not important or relevant","examples":["There's a lot of smoke and mirrors in the financing of this film."]}],"phrasal":[],"related":["Mirror","mirror site","wing mirror","mirror image","mirror writing","one-way mirror","two-way mirror","rear-view mirror","Daily Mirror","Sunday Mirror","Mirror Group Newspapers","The Mirror","mirror images","mirror sites"]},{"pos":"verb","level":"","meanings":[{"def":"to have features that are similar to somebody/something else and that show what it is like","examples":["As brothers, they mirror one another in body and face.","The music of the time mirrored the feeling of optimism in the country.","Those findings are mirrored by surveys in other European cities.","The jump in business confidence has been mirrored by the increase in employment.","The shock was mirrored on her face.","The trends here closely mirror those in America.","The plot closely mirrors the love lives of two of my friends."],"opposite":"","synonyms":""},{"def":"to show the image of somebody/something on the surface of water, glass, etc.","examples":["She saw herself mirrored in the window.","The houses lining the fjord were mirrored in its calm surface."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]