[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mis/missi/mission__us_2.mp3","phonsUS":"/ˈmɪʃn/","level":"B2","meanings":[{"def":"an important official job that a person or group of people is given to do, especially when they are sent to another country","examples":["She led a recent trade mission to China.","Thomas More toured Antwerp on a diplomatic mission for the king.","It was too late to launch a rescue mission.","They undertook a fact-finding mission in the region.","a mercy mission to aid homeless refugees","The mission of the Centre is to provide professional educational support to teachers and students.","An aid team will be sent on a mission to the earthquake zone.","The US is sending a trade mission to China.","Their mission ended in failure.","a joint Anglo-American mission","Do not return until you have accomplished your mission.","It was a joint mission between France and Germany.","He has been appointed to head a UN fact-finding mission in the region."],"opposite":"","synonyms":""},{"def":"a group of people doing such a job; the place where they work","examples":["He is the head of the British mission in Berlin."],"opposite":"","synonyms":""},{"def":"the work of teaching people about Christianity, especially in a foreign country; a group of people doing such work","examples":["Gandhi’s attitude to mission and conversion","a Catholic mission in Africa","She took up a position as a school teacher at St Peter's mission in Montana."],"opposite":"","synonyms":""},{"def":"a building or group of buildings used by a Christian mission","examples":[],"opposite":"","synonyms":""},{"def":"particular work that you feel it is your duty to do","examples":["Her mission in life was to work with the homeless.","We are committed to the mission of helping students realize their full potential.","You can tell by the determined way he talks that he is a man with a mission.","One of the missions of academic institutions is to improve the quality of life of our citizens.","He now has a mission in life: to expand the horizons of those around him.","We will continue our mission to close the gap between customers' expectations and the reality."],"opposite":"","synonyms":""},{"def":"an important job that is done by a soldier, group of soldiers, etc.","examples":["The squadron flew on a reconnaissance mission.","The military are fulfilling an important peacekeeping mission.","He was sent on a secret mission approved by the Pentagon.","He flew a total of 41 missions over Britain.","UN troops were sent on a mercy mission to the disaster site.","The captain instructed them to abort the mission."],"opposite":"","synonyms":""},{"def":"a flight into space","examples":["a US space mission","He's been on several shuttle missions over the last decade.","a successful spacecraft mission to Venus","experiments conducted on a space mission"],"opposite":"","synonyms":""},{"def":"a task or journey that is very difficult and takes a long time to complete","examples":["It's a mission to get there."],"opposite":"","synonyms":""},{"def":"used when you have successfully completed what you have had to do","examples":["Mission accomplished, we headed for home."],"opposite":"","synonyms":""},{"def":"a difficult or impossible task","examples":["Many regard this task as mission impossible."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"mission accomplished","def":"used when you have successfully completed what you have had to do","examples":["Mission accomplished, we headed for home."]},{"idiom":"mission impossible","def":"a difficult or impossible task","examples":["Many regard this task as mission impossible."]}],"phrasal":[],"related":["Mission Control","mission-critical","mission statement","mission impossible","Church Mission Society","mission statements"]}]