[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mis/missi/missing__us_3.mp3","phonsUS":"/ˈmɪsɪŋ/","level":"A2","meanings":[{"def":"that cannot be found or that is not in its usual place; that has been removed, lost or destroyed","examples":["I never found the missing piece.","Cases with missing data are excluded from the report.","My gloves have been missing for ages.","Two files have gone missing.","(especially British English) Our cat's gone missing again.","The book has two pages missing.","The book has two missing pages,","missing from something He didn't notice there was anything missing from his room until later on.","a 5 000-piece jigsaw with one piece missing","The file was missing from its place.","The eighth rung of the ladder was missing altogether.","The missing painting was never recovered."],"opposite":"","synonyms":""},{"def":"not at home; not found","examples":["a missing four-year-old girl","They still hoped to find their missing son.","a woman who went missing three months ago","Posters of missing persons lined the walls."],"opposite":"","synonyms":""},{"def":"not present after an accident, battle, etc. but not known to have been killed","examples":["He was reported missing, presumed dead.","Many soldiers were listed as missing in action.","It was six hours before the seamen were discovered missing."],"opposite":"","synonyms":""},{"def":"not included, often when it should have been","examples":["Fill in the missing words in this text.","missing from something There were several candidates missing from the list.","What is missing from the production is any sense of emotional commitment.","The spirit of fair play is sadly missing from the sport these days.","The study of housework as work is a topic entirely missing from sociology.","a quality that's largely missing in young people today"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["missing link","missing person","missing links","missing in action","the missing link","joy of missing out","fear of missing out"]}]