[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mix/mix__/mix__us_1.mp3","phonsUS":"/mɪks/","level":"B1","meanings":[{"def":"if two or more substances or things mix or you mix them, they combine, usually in a way that means they cannot easily be separated","examples":["Oil and water do not mix.","mix with something Oil does not mix with water.","Grief mixed with fear and rage as the people surveyed the ruins of their homes.","mix A and B (together) Mix all the ingredients together in a bowl.","If you mix blue and yellow, you get green.","mix A with B I don't like to mix business with pleasure (= combine social events with doing business).","mix A into B Smith often mixed sand into her paint to create a textured surface.","His tears were mixing with the warm water.","Mix yellow with blue to make green.","The students have tried to mix creativity with a social message.","In his world view, art and religion were inextricably mixed.","Leather mixes with velvet and silk as if it were the most natural thing in the world."],"opposite":"","synonyms":""},{"def":"to prepare something by combining two or more different substances","examples":["mix something With this range of paints, you can mix your own colours.","Be sure to mix the solution properly .","mix something for somebody Why don't you mix a cocktail for our guests?","mix somebody something Why don't you mix our guests a cocktail?","Mix all the ingredients together in a bowl.","Oil and water do not mix.","She stirred her tea.","Blend the flour with the milk to make a smooth paste."],"opposite":"","synonyms":"mix"},{"def":"if two or more things, people or activities do not mix, they are likely to cause problems or danger if they are combined","examples":["Children and fireworks don't mix.","These pills won't mix well with alcohol."],"opposite":"","synonyms":""},{"def":"to meet and talk to different people, especially at social events","examples":["We've worked together for years but never mixed socially.","mix with somebody They don't mix much with the neighbours.","She mixed happily with the other children.","I don't really mix with people my own age.","a child who mixes well at school","They had attended university together and often mixed socially.","Tourists have the opportunity to mix with the locals."],"opposite":"","synonyms":""},{"def":"to combine different recordings of voices and/or instruments to produce a single piece of music","examples":["Up to eight tracks can be mixed simultaneously."],"opposite":"","synonyms":""},{"def":"to be/become involved in something, especially something illegal or dishonest","examples":["Don't tell me you're mixed up in all of this?"],"opposite":"","synonyms":""},{"def":"to be/become friendly with or involved with somebody that other people do not approve of","examples":["He got mixed up with a crowd who were into drugs and crime."],"opposite":"","synonyms":""},{"def":"to combine things in different ways for different purposes","examples":["You can mix and match courses to suit your requirements.","This mix-and-match approach will appeal to a variety of players."],"opposite":"","synonyms":""},{"def":"to argue with somebody or cause trouble","examples":[],"opposite":"","synonyms":""},{"def":"to do something differently from the way it is usually done","examples":["The show has been the same for ten years, so it’s time to mix it up."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be/get mixed up in something","def":"to be/become involved in something, especially something illegal or dishonest","examples":["Don't tell me you're mixed up in all of this?"]},{"idiom":"be/get mixed up with somebody","def":"to be/become friendly with or involved with somebody that other people do not approve of","examples":["He got mixed up with a crowd who were into drugs and crime."]},{"idiom":"mix and match","def":"to combine things in different ways for different purposes","examples":["You can mix and match courses to suit your requirements.","This mix-and-match approach will appeal to a variety of players."]},{"idiom":"mix it (with somebody)","def":"to argue with somebody or cause trouble","examples":[]},{"idiom":"mix it up","def":"to do something differently from the way it is usually done","examples":["The show has been the same for ten years, so it’s time to mix it up."]}],"phrasal":["mix in","mix into","mix to","mix up"],"related":["mix in","mix to","mix up","mix-up","Mix","mix into","Bombay mix","marketing mix","pick-and-mix","mix-ups","pick 'n' mix","mix something","mix something into something","mix something to something","mix and match","mix somebody/something up (with somebody/something)","throw, etc. something in/into the mix"]},{"pos":"noun","level":"B1","meanings":[{"def":"a combination of different people or things","examples":["It's a school with a good social and ethnic mix of children.","The town offers a fascinating mix of old and new.","Their music is an eclectic mix of regional styles.","I love the city's heady mix of cultures.","a pair of wool mix socks (= made of wool and other materials)","a party with just the right mix of people","The college has a broad mix of students.","The new Oak Hill development offers a mix of housing.","The precise mix will vary.","an eclectic mix of theatrical styles","The Palace was built in a mix of Gothic and Renaissance styles.","Organic farmers mentor a diverse mix of people."],"opposite":"","synonyms":""},{"def":"a combination of things that you need to make something, often sold as a powder to which you add water, etc.","examples":["a cake mix","cement mix","The mortar mix should be one part cement to two parts sand.","Plant the seedlings in well-drained potting mix.","The mix contains soil, peat and sand."],"opposite":"","synonyms":""},{"def":"a new version of a recorded piece of music made by using a machine to arrange the separate parts of the recording in a different way, add new parts, etc.","examples":[],"opposite":"","synonyms":""},{"def":"the particular way that instruments and voices are arranged in a piece of music","examples":["The movie's sound mix is excellent.","They have created a unique mix of sounds."],"opposite":"","synonyms":""},{"def":"an arrangement of several songs or pieces of music into one continuous piece, especially for dancing","examples":[],"opposite":"","synonyms":""},{"def":"to add something that has an effect on a situation","examples":["When you throw into the mix the passion and energy of a young artist, you have a recipe for success."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"throw, etc. something in/into the mix","def":"to add something that has an effect on a situation","examples":["When you throw into the mix the passion and energy of a young artist, you have a recipe for success."]}],"phrasal":[],"related":[]}]