[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mod/moder/modern__us_2.mp3","phonsUS":"/ˈmɑːdərn/","level":"A1","meanings":[{"def":"of the present time or recent times","examples":["the modern industrial world","the wonders of modern science","modern society","In modern times, advances in technology have made the world smaller.","They are modern day heroes, battling for change.","Modern European history","modern Greek","Stress is a major problem of modern life.","Shakespeare's language can be a problem for modern readers.","The modern era has witnessed great change.","She studies the early modern period from the 15th to the 18th century.","It was the largest strike in the history of modern societies.","In modern times we have been bombarded with an array of diets.","Her intention was to draw parallels between ancient and modern concepts of punishment."],"opposite":"","synonyms":""},{"def":"new and intended to be different from traditional styles","examples":["The gallery has regular exhibitions of modern art.","modern architecture/dance/drama/jazz","modern American cinema","modern and contemporary sculpture","The museum houses both ancient and modern art.","She is one of the great presences of the modern American cinema.","The Tugendhadt Villa is a key work in early modern architecture.","The new art fair shows modern and contemporary art from many of the world's best galleries."],"opposite":"","synonyms":""},{"def":"using the latest technology, designs, materials, ideas, etc.","examples":["The company needs to invest in a modern computer system.","Modern methods of farming are destroying the countryside.","It is the most modern, well-equipped hospital in the country.","Today modern aircraft technology got me from Indianapolis to Boston in six hours.","The school is thoroughly modern in its approach."],"opposite":"","synonyms":""},{"def":"new and not always accepted by most members of society","examples":["She has very modern ideas about educating her children."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["modern-day","Tate Modern","modern dance","Modern Times","modern English","modern language","modern slavery","secondary modern","Hymns Ancient and Modern","Museum of Modern Art","Dictionary of Modern English Usage"]}]