[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mod/model/model__us_2.mp3","phonsUS":"/ˈmɑːdl/","level":"A1","meanings":[{"def":"a copy of something, usually smaller than the original object","examples":["a working model (= one in which the parts move) of a fire engine","I used to build model aeroplanes.","The architect had produced a scale model of the proposed shopping complex.","They have a working model of a water mill.","She made a fantastic clay model of her dog."],"opposite":"","synonyms":""},{"def":"something such as a text or a system that can be used as an example for other people to copy","examples":["Look at the writing model on page 58.","a model text/essay","The nation's constitution provided a model that other countries followed.","Different funding models are used in schools.","The plans serve as a model for future housing developments.","Successful schools must be used as models for the rest.","The audio provides a model for students to copy.","They offer an alternative model of married life.","The book fits the classic model of a postmodern narrative.","He proposes a leadership model based upon vision and strategy."],"opposite":"","synonyms":""},{"def":"a person or thing that is considered an excellent example of something","examples":["It was a model of clarity.","He's a model student.","a model farm (= one that has been specially designed to work well)","She was a model of restraint.","Her essay was a model of clarity."],"opposite":"","synonyms":""},{"def":"a person whose job is to wear and show new styles of clothes and be photographed wearing them","examples":["She had a successful career as a fashion model.","He was a former male model who became a movie star."],"opposite":"","synonyms":""},{"def":"a person who is employed to be painted, drawn, photographed, etc. by an artist or photographer","examples":["The model sits for me for three hours every day."],"opposite":"","synonyms":""},{"def":"a particular design or type of product","examples":["The latest models will be on display at the motor show.","Later that year, IBM released a similar model at a lower price.","They do several other models of washing machine.","They're recalling their new model for modifications to the engine."],"opposite":"","synonyms":""},{"def":"a way of running a business, based on a particular way of getting the money you need and identifying and reaching your customers; a type of business model","examples":["They may abandon the traditional cooperative model.","under a… model Under a subscription model, consumers will typically pay a monthly fee to access the online library."],"opposite":"","synonyms":""},{"def":"a simple description of a system, used for explaining how something works or calculating what might happen, etc.","examples":["the standard economic model of supply and demand","to propose/construct/test a model","She developed a computer model to help farmers with pest control.","a mathematical model for determining the safe level of pesticides in food","according to a model According to this model, by the middle of the century temperatures will rise by 1–3℃.","We follow a simple accounting model.","Most studies applied the theoretical model developed by Dornsbusch.","The data stopped fitting our model at this point.","The model predicts no change in quality or price."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["model on","Model T","model after","model home","model upon","role model","glamour model","model village","business model","model yourself on","Model Parliament","New Model Army","model homes","rôle model","model villages","model yourself on somebody","model something on/after something"]},{"pos":"verb","level":"B2","meanings":[{"def":"to create a copy or description of an activity, a situation, etc. so that you can study it before dealing with the real thing","examples":["The program can model a typical home page for you.","We can accurately model the development process.","Air quality planners can model the effects of tree on air pollution."],"opposite":"","synonyms":""},{"def":"to represent something, especially in a diagram","examples":["This finite set of data can be modelled by a growth curve."],"opposite":"","synonyms":""},{"def":"to shape clay, etc. in order to make something","examples":["a statue modelled in bronze","a simple souvenir, modelled in the shape of a horse"],"opposite":"","synonyms":""},{"def":"to wear clothes in order to show them to people who might want to buy them","examples":["The wedding gown is being modelled for us by the designer's daughter.","Brad and Cindy are modelling chunky knitwear on the beach."],"opposite":"","synonyms":""},{"def":"to work as a model for an artist or in the fashion industry","examples":["Ralph's been modelling since he was 16."],"opposite":"","synonyms":""},{"def":"to set an example of behaviour that you want other people to copy","examples":["Managers must model behaviour that is open and vulnerable.","Teachers may need to model appropriate discussion behaviours."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["model after","model on","model upon","model yourself on"],"related":[]}]