[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mon/monit/monitor__us_1.mp3","phonsUS":"/ˈmɑːnɪtər/","level":"B2","meanings":[{"def":"a screen that shows information from a computer; a television screen used to show particular kinds of information","examples":["The details of today's flights are displayed on the monitor.","The pages are designed to be viewed on a computer monitor.","We included the costs of monitor, keyboard, mouse and speakers.","The security staff can see all the outside of the building on their CCTV monitors.","the display quality on LCD monitors has greatly improved.","The laboratory is replete with banks of video monitors."],"opposite":"","synonyms":""},{"def":"a piece of equipment used to check or record something","examples":["He was lying there hooked up to a heart monitor.","Mia kept a two-way baby monitor in the living room so Harry's cries could be heard.","A nurse checked his monitor for changes in ECG rhythms, pulse and oxygen saturation.","The heart monitor shows the strength of your pulse."],"opposite":"","synonyms":""},{"def":"a person whose job is to check that something is done fairly and honestly, especially in a foreign country","examples":["UN monitors declared the referendum fair.","The EU has agreed to provide monitors for the crossing.","Monitors or observers help to build trust between the two sides."],"opposite":"","synonyms":""},{"def":"a student in a school who performs special duties, such as helping the teacher","examples":["He was a star pupil and the class monitor."],"opposite":"","synonyms":""},{"def":"a large tropical lizard (= a type of reptile)","examples":["A large monitor lizard, prehistoric in its beauty, stared at us."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Monitor and Merrimack","Christian Science Monitor"]},{"pos":"verb","level":"B2","meanings":[{"def":"to watch and check something over a period of time in order to see how it develops, so that you can make any necessary changes","examples":["monitor something Each student's progress is closely monitored.","The authorities will continue to monitor the situation.","monitor somebody The patient is carefully monitored.","monitor what, how, etc… We need to monitor how the situation develops.","The patient is carefully monitored throughout the procedure.","Television advertising is strictly monitored.","The workers are constantly monitored for exposure to radiation.","We will now be able to monitor its progress more closely.","Foreign observers monitored voting at polling stations around the country.","The animals' temperature and heartbeat are regularly monitored.","Uniformed and undercover police officers monitored the demonstration closely."],"opposite":"","synonyms":""},{"def":"to use technology to watch somebody/something, especially for reasons of security","examples":["A police helicopter will be used to monitor crime hotspots.","The security cameras are monitored by a CCTV control centre, staffed 24 hours a day.","The exhibit will be constantly monitored by video cameras."],"opposite":"","synonyms":""},{"def":"to listen to phone calls, foreign radio broadcasts, etc. in order to find out information that might be useful","examples":["a police state where every activity is monitored","We were warned by a friend in the government that our phone calls were being monitored.","The company routinely monitors all its employees' emails.","During the war his job was to monitor enemy radio broadcasts."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]