[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mon/month/month__us_1.mp3","phonsUS":"/mʌnθ/","level":"A1","meanings":[{"def":"any of the twelve periods of time into which the year is divided, for example May or June","examples":["The months of July and August are the hottest.","May and June are the two wettest months of the year in Nebraska.","during the summer/winter months","We're moving house next month.","Last month I went on a school trip to Germany.","We got married two months ago.","a/per month She earns $2 000 a month.","The rent is £800 per month.","Have you read this month's ‘Physics World’?","Prices continue to rise month after month (= over a period of several months).","Her anxiety mounted month by month (= as each month passed).","Our money's usually running low by this time of the month.","Performances were banned for the entire month of June.","The festival is always held in the month of May.","This has been a record month for sales.","What does the salary work out as per month?","Winning stories will be published in the magazine in future months.","paid by the month","the Muslim holy month of Ramadan","the early months of 2021"],"opposite":"","synonyms":""},{"def":"a period of about 30 days, for example, 3 June to 3 July","examples":["The baby is three months old.","a three-month-old baby","They lived in Toronto during their first few months of marriage.","The past few months have been hectic.","several months later","a six-month contract","a month-long strike","He visits Paris once or twice a month.","In recent months the company has launched three new products.","He spent about a month decorating the house.","Children between one and 24 months of age were eligible.","I waited six months for them to reply to my letter.","I've been working on the illustration for over a month.","In just a few short months he was promoted to manager.","Laura is in the final months of pregnancy with her first child.","We've been here five whole months now.","We're getting married in a month/​in a month's time.","To occupy the intervening months she took a temporary job.","The President was involved in discussions in the months leading up to the war."],"opposite":"","synonyms":""},{"def":"a long time, especially a period of several months","examples":["He had to wait for months for the visas to come through.","It will be months before we get the results.","It took months to find another job.","for months It hasn't rained for months."],"opposite":"","synonyms":""},{"def":"a person or thing that is very popular at a particular time","examples":["Environmental issues are no longer the flavour of the month.","I’m not exactly flavour of the month around here at the moment."],"opposite":"","synonyms":""},{"def":"used to emphasize that something will never happen or will take a very long time","examples":["You won't find it, not in a month of Sundays.","It is possible to learn to skydive in Britain, but with our weather it might take a month of Sundays to do it."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"flavour of the month","def":"a person or thing that is very popular at a particular time","examples":["Environmental issues are no longer the flavour of the month.","I’m not exactly flavour of the month around here at the moment."]},{"idiom":"(in) a month of Sundays","def":"used to emphasize that something will never happen or will take a very long time","examples":["You won't find it, not in a month of Sundays.","It is possible to learn to skydive in Britain, but with our weather it might take a month of Sundays to do it."]}],"phrasal":[],"related":["lunar month","calendar month","Book of the Month Club","flavour of the month","the day, week, month, etc. before last"]}]