[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/moo/mood_/mood__us_1.mp3","phonsUS":"/muːd/","level":"B1","meanings":[{"def":"the way you are feeling at a particular time","examples":["in a … mood She's in a good mood today (= happy and friendly).","He's always in a bad mood (= unhappy, or angry and impatient).","to be in a foul/festive mood","Wait until he’s in a better mood before you ask him.","in the mood for (doing) something I'm just not in the mood for a party tonight.","He was in no mood for being polite to visitors.","in the mood (to do something) I'm not really in the mood to go out tonight.","Let’s not talk about it now. I’m not in the mood.","Some addicts suffer violent mood swings (= changes of mood) if deprived of the drug.","Choose clothes to match your mood.","Don't talk to Miranda today—she's in a terrible mood!","He could sense her gloomy mood.","He's in a funny mood today—who knows how he'll react?","His mood lifted as he concentrated on his driving.","I can't keep up with his constantly changing moods.","I tried to make him laugh, but he was in no mood for jokes.","Instantly he felt her change of mood.","It immediately brightened her mood and brought a smile to her face.","It was Christmas and everyone was in a festive mood.","Mood disorders can disrupt relationships.","Nicky seemed able to read her mood.","Not wanting to dampen her good mood, I quickly changed the subject.","She could be a very funny girl when the mood struck her.","She was in a bullish mood about the future of the company.","She was not in the best of moods.","The music helped to put them in a more relaxed mood.","The weather seemed to reflect his dark mood.","the challenge of coping with negative mood states","Helen was in a relatively confident mood.","The news had put Michelle in a foul mood."],"opposite":"","synonyms":""},{"def":"a period of being angry or impatient","examples":["in a mood I wonder why he's in such a mood today.","She was in one of her moods (= one of her regular periods of being angry or impatient)."],"opposite":"","synonyms":""},{"def":"the way a group of people feel about something; the atmosphere in a place or among a group of people","examples":["The mood of the meeting was distinctly pessimistic.","The movie captures the mood of the interwar years perfectly.","He threw in some jokes to lighten the mood.","But the mood of the country has changed.","Haunting music greatly adds to the mood of the film.","The killings produced a sombre mood at the rally.","The prevailing mood of public opinion remained hostile.","We need a leader who can gauge the popular mood.","the prevailing mood in the country at the time","a film that has captured the mood of the moment","The crowd's mood abruptly turned violent.","The overall mood was optimistic.","His comments pretty much killed the mood for the rest of the show.","The right music sets the mood for such a great moment.","The sacked workers were in defiant mood as they entered the tribunal."],"opposite":"","synonyms":""},{"def":"one of the sets of verb forms or categories of verb use that expresses facts, orders, questions, wishes or conditions","examples":["the indicative/imperative/subjunctive mood"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["mood board","mood music","mood-altering","mood boards"]}]