[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mor/moral/moral__us_1_rr.mp3","phonsUS":"/ˈmɔːrəl/","level":"B2","meanings":[{"def":"connected with principles of right and wrong behaviour","examples":["a moral issue/dilemma","traditional moral values","a decline in moral standards","moral and ethical questions","The basic moral philosophies of most world religions are remarkably similar.","He was a deeply religious man with a highly developed moral sense.","The newspapers were full of moral outrage at the weakness of other countries.","She's always lamenting what she sees as the decline in moral standards.","The colonel stumped out, his face flushed with moral indignation.","The press whipped up a moral panic over these so-called ‘welfare scroungers’."],"opposite":"","synonyms":""},{"def":"based on your own sense of what is right and fair, not on legal rights or duties","examples":["moral responsibility/duty/authority","We have a moral imperative to help whenever we can.","I make no moral judgement on this decision.","Governments have at least a moral obligation to answer these questions.","Children learn to develop their own moral code for adulthood.","The job was to call on all her diplomatic skills and moral courage (= the courage to do what you think is right).","He brings that moral authority of someone who fought for human rights.","Politicians have a moral obligation to address the needs of the poorest.","She felt she had a moral duty to look after her elderly parents."],"opposite":"","synonyms":""},{"def":"following the standards of behaviour considered acceptable and right by most people","examples":["He led a very moral life.","a very moral person","We try to teach our students to be conscientious, moral young people."],"opposite":"","synonyms":""},{"def":"able to understand the difference between right and wrong","examples":["Children are not naturally moral beings."],"opposite":"","synonyms":""},{"def":"to claim that your side of an argument is morally better than your opponents’ side; to argue in a way that makes your side seem morally better","examples":["I was angry with his blatant attempt to take the moral high ground."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"take, claim, seize, etc. the moral high ground","def":"to claim that your side of an argument is morally better than your opponents’ side; to argue in a way that makes your side seem morally better","examples":["I was angry with his blatant attempt to take the moral high ground."]}],"phrasal":[],"related":["moral fibre","moral compass","moral hazard","moral support","moral victory","moral philosophy","Moral Maze","moral majority","moral fiber","moral fibres","moral compasses","moral victories","take, claim, seize, etc. the moral high ground"]},{"pos":"noun","level":"B2","meanings":[{"def":"standards or principles of good behaviour, especially in matters of sexual relationships","examples":["Young people these days have no morals.","The play was considered an affront to public morals.","The question is one of manners rather than morals.","(old-fashioned) a woman of loose morals (= with a low standard of sexual behaviour)","He has absolutely no morals, that man!","She had tried her best to instil morals into her daughters.","Women who went to pubs alone would sometimes be assumed to have loose morals."],"opposite":"","synonyms":""},{"def":"a practical lesson that a story, an event or an experience teaches you","examples":["The moral of the story is always stick to what you do best.","And the moral is that crime doesn't pay.","There are clear morals to be drawn from the failure of these companies.","There is a clear moral to all this."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]