[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mot/motio/motion__us_1.mp3","phonsUS":"/ˈməʊʃn/","level":"B2","meanings":[{"def":"the act or process of moving or the way something moves","examples":["What was Newton's first law of motion?","The swaying motion of the ship was making me feel seasick.","Rub the cream in with a circular motion.","in motion (formal) Do not alight while the train is still in motion (= moving).","Do not open the door when the train is in motion.","She could feel the rolling motion of the ship under her feet.","The insects are stirred into motion by the heat of the sun.","Too tight a grip will restrict the natural motion in your hands.","Please don't stand while the bus is in motion."],"opposite":"","synonyms":""},{"def":"a particular movement made usually with your hand or your head, especially to communicate something","examples":["At a single motion of his hand, the room fell silent.","She made a sawing motion with her hand.","He made little flapping motions with his arms.","She made a slight motion with her hand."],"opposite":"","synonyms":""},{"def":"a formal proposal that is discussed and voted on at a meeting","examples":["to table/put forward a motion","to propose a motion (= to be the main speaker in favour of a motion)","The motion was adopted/carried by six votes to one.","The Opposition tabled a motion calling for the prime minister's resignation.","The board tabled a motion calling for her resignation.","The motion was defeated by 51 votes to 43.","The motion was passed by 165 votes to 78.","The motion was put before the conference.","The motion was put to the conference and fully debated.","The motion will be debated later today.","He proposed a motion of no confidence in the government.","Only delegates may introduce motions and vote."],"opposite":"","synonyms":""},{"def":"an act of emptying the bowels; the waste matter that is emptied from the bowels","examples":[],"opposite":"","synonyms":""},{"def":"to do or say something because you have to, not because you really want to","examples":[],"opposite":"","synonyms":""},{"def":"to start something moving","examples":["They set the machinery in motion.","(figurative) The wheels of change have been set in motion.","He wound the key and set the toy in motion."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"go through the motions (of doing something)","def":"to do or say something because you have to, not because you really want to","examples":[]},{"idiom":"set/put something in motion","def":"to start something moving","examples":["They set the machinery in motion.","(figurative) The wheels of change have been set in motion.","He wound the key and set the toy in motion."]}],"phrasal":[],"related":["slow motion","stop-motion","Brownian motion","motion picture","motion sickness","perpetual motion","time-and-motion study","Academy of Motion Picture Arts and Sciences","motion pictures","time-and-motion studies"]},{"pos":"verb","level":"","meanings":[{"def":"to make a movement, usually with your hand or head, to show somebody what you want them to do","examples":["motion to somebody (to do something) I motioned to the waiter.","motion (for) somebody to do something He motioned for us to follow him.","motion somebody + adv./prep. She motioned him into her office.","Ellie motioned towards a house across the road.","He motioned to them to sit down.","She motioned with her head for Paul to follow her.","He motioned them to the row of chairs."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]