[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mot/motiv/motive__us_1.mp3","phonsUS":"/ˈməʊtɪv/","level":"C1","meanings":[{"def":"a reason for doing something","examples":["There seemed to be no motive for the murder.","I'm suspicious of his motives.","the profit motive (= the desire to make a profit)","I have an ulterior motive in offering to help you.","He said no but he didn’t give a reason.","The most likely explanation is that his plane was delayed.","She left the room abruptly without explanation.","You have no grounds for complaint.","On what basis will this decision be made?","Late again! What’s your excuse this time?","It gave me an excuse to take the car.","There seemed to be no motive for the murder.","I can see no possible justification for any further tax increases.","He left the party early on the pretext of having to work.","He was acting from the highest motives when he offered her money.","He was suspicious of her motives in inviting him into the house.","However you explain the motives behind his actions, he was still wrong.","I did it for a variety of motives.","I'd say he had a very strong motive for wanting her dead.","It it is clear that they were acting from motives of revenge.","She knew that he was inspired by base motives.","She should examine her motives for marrying him.","She was not sure what his underlying motives were.","The police are still trying to establish a motive for the attack.","There is no doubt about the motive behind it all.","There may be a hidden motive for his departure.","There must be something which provided a motive for these killings.","There seemed to be no clear motive for the attack.","We give aid to other countries with mixed motives.","We've become adept at hiding our true motives.","What was their motive in setting fire to the building?","speculation that less noble motives were driving the country's foreign policy"],"opposite":"","synonyms":"reason"}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adjective","level":"","meanings":[{"def":"causing movement or action","examples":["motive power/force (= for example electricity to operate machinery)"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]