[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mov/movie/movie__us_1.mp3","phonsUS":"/ˈmuːvi/","level":"A1","meanings":[{"def":"a series of moving pictures recorded with sound that tells a story, watched at a movie theater or on a television or other device","examples":["You'll love this movie.","Let's watch a movie tonight.","Have you seen the latest Miyazaki movie?","to rent/download a movie","to make a horror movie","a movie starring Jennifer Lawrence","a famous movie director","the Hollywood movie industry","a movie studio","He's made two movies this year.","Then we'd go watch horror movies and sci-fi flicks.","Her father played all the old home movies.","I'd never go to a movie alone.","Johnson really steals this movie as Cassius.","The former footballer is now mixing with movie people in Hollywood.","The movie contains a lengthy car chase through the streets of Paris.","The movie follows their lives on a small Arkansas farm.","The movie is set in a New England school.","The movie opens with a quote from the Buddha.","We watched a home movie of my second birthday party.","We're having a movie night with pizza and beer.","a movie about the life of Castro","a movie based on the novel by Betty Munn","a movie entitled ‘Short Legs’","an excellent actor who could easily carry the movie all on his own","the movie rights to her autobiography","the movie version of the well-known novel"],"opposite":"","synonyms":""},{"def":"when you go to the movies, you go to a movie theater to see a movie","examples":["Let's go to the movies.","This weekend at the movies I felt like a kid again."],"opposite":"","synonyms":""},{"def":"movies as an art or an industry","examples":["I've always wanted to work in the movies.","Is it glamorous like in the movies?"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["B-movie","buddy movie","movie star","road movie","snuff movie","action movie","movie rating","movie theater","movie house","movie stars","movie theatre","slasher movie","movie theatres","movie theaters"]}]