[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mus/muscl/muscle__us_2.mp3","phonsUS":"/ˈmʌsl/","level":"B1","meanings":[{"def":"a piece of body tissue that you make tight and relax in order to move a particular part of the body; the tissue that forms the muscles of the body","examples":["a calf/neck/thigh muscle","All of this put strain on the heart muscle.","to pull/tear/strain a muscle","He poses and flexes his muscles in the mirror.","This exercise will work the muscles of the lower back.","Contract and relax the muscles in your fingers a few times.","She tried to relax her tense muscles.","He felt every muscle in his body tighten.","He didn't move a muscle (= stood completely still).","Lift weights to build muscle.","muscle fibre/tissue/mass","You should stretch before exercise to avoid muscle injuries.","Don't let that bully muscle in on your success!","Grandad's mussel linguine recipe was absolutely mouth-watering.","The disease puts strain on the heart muscle.","His muscles rippled beneath his T-shirt as he worked.","I laughed so hard I almost pulled a muscle.","I walked up and down the aisle to stretch my cramped muscles.","Learn how to relax tense muscles.","Lifting weights sculpts muscle.","Suddenly my sore muscles protested and I let out a groan.","The muscles in my face tensed.","diet supplements to build muscle","the muscles controlling speech production"],"opposite":"","synonyms":""},{"def":"physical strength","examples":["He's an intelligent player but lacks the muscle of older competitors.","I exerted every ounce of my miserable muscle power."],"opposite":"","synonyms":""},{"def":"the power and influence to make others do what you want","examples":["to exercise political/industrial/financial muscle","The countries tried to flex their collective muscle.","This show gives the artist the chance to flex his creative muscle."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["muscle in","muscle-bound","muscle memory","smooth muscle","ciliary muscle","skeletal muscle","flexor muscle","abductor muscle","adductor muscle","extensor muscle","gluteus muscle","muscle in (on somebody/something)"]},{"pos":"verb","level":"","meanings":[{"def":"to move or move something in a particular direction by using your physical strength","examples":["+ adv./prep. He tried to muscle to the front of the line, but was forced back by security staff.","muscle somebody/something + adv./prep. He muscled the ball up between two defenders."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["muscle in"],"related":[]}]