[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mus/music/music__us_2.mp3","phonsUS":"/ˈmjuːzɪk/","level":"A1","meanings":[{"def":"sounds that are arranged in a way that is pleasant or exciting to listen to. People sing music or play it on instruments.","examples":["I like any kind of pop or dance music.","He plays traditional Korean music.","People often choose to listen to music that suits their moods and activities.","She could hear music playing somewhere.","to stream/share/download music","to write/compose music","to perform/record music","Every week they get together to make music (= to play music or sing).","the popularity of Mozart’s music","It was a charming piece of music.","The poem has been set to music (= music has been written for it)","Birmingham's live music scene","music lovers/fans","Every summer he runs a three-day music festival.","The band released a music video on YouTube today.","He wrote the music but I don't know who wrote the words.","You can stream music wirelessly from your files.","It's a great way to share music across services on the web.","She worked as a music critic for The Times.","Some of the biggest names in music will be there.","Calypso music played faintly in the distance.","Could you turn that music down?","Heavy music thundered from the basement.","Her taste in music was eclectic.","Listening to music is a great way to relax.","Music filled the air.","Put some music on, would you?","Schubert set several poems by Goethe to music.","She could hear loud music from the party upstairs.","She's really into indie music.","The ability to appreciate music is largely learnt.","The city has produced a lot of good music.","The movie uses appropriate period music.","The music sounded vibrant and loud.","The music was coming from next door.","The soft background music made her feel sleepy.","The sound of pop music drifted through the open window.","They did their exercises in time to the music.","We love to make music as a family.","With the guidance of the conductor, an orchestra creates music and harmonies.","a beach party with music provided by a local band","an evening of Scottish music and song","bars and nightclubs blaring music late into the night","disco music blaring out of the open windows of a car","the incidental music for a radio play","the music emerging from the cities of America","the music that accompanied the dance","to dance to the music","Many people believe that listening to Mozart's music can improve memory and learning.","He made up the words and music for the song."],"opposite":"","synonyms":""},{"def":"the art of writing or playing music","examples":["He studied music in Moscow.","a career in music","a music teacher","music lessons","the music business/industry","music legend, Elvis Presley","the choir's music director","She is a rising star in the music world.","The band are number one in the music charts.","The album has been praised in the music press.","He got into music by chance."],"opposite":"","synonyms":""},{"def":"the written or printed signs that represent the sounds to be played or sung in a piece of music","examples":["Can you read music (= understand the signs in order to play or sing a piece of music)?","I had to play it without the music.","The music (= the paper or book with the musical notes on it) was still open on the piano.","He played the piece without music.","Put your music on the music stand.","music for piano, cello and voice"],"opposite":"","synonyms":""},{"def":"to accept and deal with criticism or punishment for something you have done","examples":["The others all ran off, leaving me to face the music."],"opposite":"","synonyms":""},{"def":"news or information that you are very pleased to hear","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"face the music","def":"to accept and deal with criticism or punishment for something you have done","examples":["The others all ran off, leaving me to face the music."]},{"idiom":"music to your ears","def":"news or information that you are very pleased to hear","examples":[]}],"phrasal":[],"related":["music box","pop music","dance music","disco music","early music","folk music","house music","indie music","mood music","music hall","music stand","music video","piped music","rock music","sheet music","soul music","theme music","Water Music","world music","chamber music"]}]