[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/m/mys/myste/mystery__us_2.mp3","phonsUS":"/ˈmɪstəri/","level":"B1","meanings":[{"def":"something that is difficult to understand or to explain","examples":["It is one of the great unsolved mysteries of this century.","Their motives remain a mystery.","She tried to solve the mystery of the boy's sudden death.","It is a mystery to somebody why, how, etc… It's a complete mystery to me why they chose him.","He had found the clue to unlock the whole mystery","Her poetry attempts to penetrate the dark mystery of death.","How the disease started is one of medicine's great mysteries.","How these insects actually communicate presents something of a mystery.","It remains a mystery as to where he was buried.","It was easy to believe that the house held some great mystery.","She pondered the mystery of the disappearing thief.","The mystery deepened when the police's only suspect was found murdered.","The police are close to solving the mystery of the missing murder weapon.","The silence has deepened the mystery surrounding his work.","The witness could shed no light on the mystery of the deceased's identity.","There's a bit of a mystery about this child.","one of life's little mysteries","the central mystery of the story"],"opposite":"","synonyms":""},{"def":"a person or thing that is strange and interesting because you do not know much about them or it","examples":["He's a bit of a mystery.","There was a mystery guest on the programme.","The mystery man's identity remains hidden.","a mystery disease/illness/virus","(British English) a mystery tour (= when you do not know where you are going)","mystery to somebody My sister is a complete mystery to me.","The band was financed by a mystery backer.","Next on the programme, Dan Green takes us on a magical mystery tour of Cumbria's music scene.","Their suspect was a mystery man: a quiet, happily married man with no enemies.","She was a total mystery to him despite their long association."],"opposite":"","synonyms":""},{"def":"the quality of being difficult to understand or to explain, especially when this makes somebody/something seem interesting and exciting","examples":["Mystery surrounds her disappearance.","His past is shrouded in mystery (= not much is known about it).","The dark glasses give her an air of mystery.","She’s a woman of mystery.","Mystery remains over who will star in the film.","Modern weather forecasts try to take the mystery out of meteorology.","The whole incident was shrouded in mystery.","a place of deep mystery and enchantment","Her blue eyes had a certain mystery.","the mystery surrounding her resignation"],"opposite":"","synonyms":""},{"def":"a story, a film or a play in which crimes and strange events are only explained at the end","examples":["He is the author of several murder mysteries.","The film is based on Daphne DuMaurier's mystery novel, ‘Rebecca’."],"opposite":"","synonyms":""},{"def":"secret religious ceremonies; secret knowledge","examples":["(figurative) the teacher who initiated me into the mysteries of mathematics"],"opposite":"","synonyms":""},{"def":"a religious belief that cannot be explained or proved in a scientific way","examples":["the mystery of creation"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["mystery play","mystery shopper","mystery shopping","mystery plays","mystery shoppers"]}]