[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/n/nar/narra/narrative__us_1.mp3","phonsUS":"/ˈnærətɪv/","level":"B1","meanings":[{"def":"a description of events","examples":["a gripping narrative of their journey up the Amazon","a collection of personal narratives","She has woven a strong personal narrative filled with lively anecdotes.","a historical narrative of the United States","The film lacks a coherent, compelling narrative.","the grand narratives of history","events in the narrative","People have always tried to create narratives through stories and painting.","Wong's character is a key part of the narrative.","The movie has a very traditional linear narrative.","It's difficult to construct a narrative out of a series of fast-moving events.","The book includes a collection of personal narratives from elderly Kikuyu women and men.","The author interrupts her narrative to tell us that the idea for the book had not been well received.","The author weaves into this narrative many entertaining historical facts.","This book offers no coherent narrative of the American Civil War.","the dominant narrative of the Cold War","We need to think differently about the standard historical narrative of the United States.","This poetry emulates the slave narrative, a nineteenth century literary form."],"opposite":"","synonyms":""},{"def":"the part of a novel that tells the story, rather than the dialogue","examples":["The novel contains too much dialogue and not enough narrative.","The book is written in the style of first-person narrative.","interruptions to the narrative flow"],"opposite":"","synonyms":""},{"def":"a way of explaining events to illustrate a set of aims or values","examples":["a new narrative about economic globalization","How do we construct a new narrative about economic globalization?","Politicians create narrative from scant facts on a daily basis."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adjective","level":"B1","meanings":[{"def":"describing events or telling a story","examples":["narrative fiction","Discuss the role of time in the narrative structure of the Iliad.","He is best known for his narrative poem of the Civil War."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]