[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/n/nar/narro/narrow__us_2.mp3","phonsUS":"/ˈnærəʊ/","level":"A2","meanings":[{"def":"measuring a short distance from one side to the other, especially in relation to length","examples":["Stray dogs wander the steep narrow lanes of the old town.","The road soon became narrower and steeper.","a narrow bed/doorway/shelf","Tall narrow windows admit only slivers of light.","narrow shoulders/hips","There was only a narrow gap between the bed and the wall.","Farming is confined to a narrow strip of land between the mountains and the sea.","(figurative) the narrow confines of prison life","The pass gets quite narrow towards the east.","The rear part of the casing is slightly narrower than the front.","I sat next to him on the narrow bed.","The jacket looked very large across his narrow shoulders.","(figurative) The producer has a narrow window each year to implement changes."],"opposite":"broad","synonyms":""},{"def":"only just achieved or avoided","examples":["a narrow victory","She was elected by a narrow majority.","He had a narrow escape when his car skidded on the ice.","He lost the race by the narrowest of margins.","He blamed the goalkeeper for the narrow defeat against Ireland.","He secured a narrow victory in the presidential elections."],"opposite":"","synonyms":""},{"def":"limited in variety or numbers","examples":["The shop sells only a narrow range of goods.","She only has a narrow circle of friends.","The exhibition is disappointingly narrow in scope."],"opposite":"wide","synonyms":""},{"def":"limited in a way that ignores important issues or the opinions of other people","examples":["narrow interests","She has a very narrow view of the world.","I found the focus of the debate too narrow.","Teachers feel that the present curriculum is too narrow.","His specialization is too narrow to be of interest to more than a handful of students.","people who are rather narrow in outlook","The party has a rather narrow political agenda."],"opposite":"broad","synonyms":""},{"def":"limited in meaning; exact","examples":["I am using the word ‘education’ in the narrower sense."],"opposite":"broad","synonyms":""},{"def":"the honest and morally acceptable way of living","examples":["His friends try to keep him on the straight and narrow."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the straight and narrow","def":"the honest and morally acceptable way of living","examples":["His friends try to keep him on the straight and narrow."]}],"phrasal":[],"related":["narrow down","narrow gauge","narrow-minded","narrow-mindedness","narrow gauges","narrow something"]},{"pos":"verb","level":"B2","meanings":[{"def":"to become or make something less wide","examples":["This is where the river narrows.","Her eyes narrowed (= almost closed) menacingly.","narrow to something His eyes narrowed to slits.","narrow something He narrowed his eyes at her.","Her eyes narrowed against the sun.","Her eyes narrowed in anger.","Her eyes narrowed slightly as she studied the woman.","His blue eyes narrowed suspiciously.","His eyes narrowed with suspicion.","His eyes suddenly narrowed at the sight of her.","Lee's eyes narrowed against the harsh glare of the sun.","Left untreated, the arteries will gradually narrow, restricting the flow of blood.","The blue eyes narrowed thoughtfully.","The river narrows a little here.","Though her eyes narrowed fractionally, she made no comment."],"opposite":"","synonyms":""},{"def":"to become or make something more limited in range or extent","examples":["The gap between the candidates has narrowed significantly.","The company has narrowed the gap between premium and discount brands.","We need to try and narrow the health divide between rich and poor.","The author has chosen to narrow her focus on particular areas.","The gap between the two teams has narrowed to three points.","By the final round the gap had narrowed to three votes.","After the initial interviews, we narrowed the field to three finalists.","The gap between the two parties narrowed sharply in the days before the election.","The trade deficit with China narrowed slightly."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["narrow down"],"related":[]}]