[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/n/nat/natio/national__us_3.mp3","phonsUS":"/ˈnæʃnəl/","level":"A2","meanings":[{"def":"connected with a particular nation; shared by a whole nation","examples":["Decide whether it would be better to advertise in a national or a local newspaper.","national and international news","national and regional politics","decisions made at a local rather than national level","a national election","a coach for the national basketball team","The protection of public health is a matter of national security.","It is in the national interest to have a public enquiry.","The national average is just over two children per family.","They are afraid of losing their national identity.","These buildings are part of our national heritage.","During your visit, you should take the opportunity to sample the national dish.","He has won medals in both national and international competitions.","The Queen was greeted by dancers in national costume.","The country faces the huge task of national reconstruction following the war.","The state of our hospitals is a national disgrace.","The statement was broadcast live on national radio.","There have been calls for a national strike.","There needs to be a national debate on the issue.","This is not just a sporting event; for many it is a matter of national pride.","the National Union of Teachers"],"opposite":"","synonyms":""},{"def":"owned, controlled or paid for by the government","examples":["a national airline/museum/theatre","the National Health Service","The Romanian national airline has ordered seven of the new aircraft.","He designed the new wing of the national library in London.","The collection is housed at the national museum."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["National","national debt","national grid","national park","National Academy","national anthem","national costume","National Forest","national service","national trail","national convention","National Geographic","National Insurance","National Socialism","National Socialist","National Hunt","Zion National Park","Grand National"]},{"pos":"noun","level":"B2","meanings":[{"def":"a citizen of a particular country","examples":["Polish nationals living in Germany","Foreign nationals are now being evacuated from the city.","There is concern for the safety of British nationals in the region.","There's no scrutiny of how a state treats its own nationals.","Applications for asylum from nationals of certain countries are routinely rejected.","Portugal has an estimated 40 000 nationals in Angola.","Two British nationals were involved in the accident.","An English national was arrested at the scene.","The government has advised British nationals to leave the area."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]