[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/n/nat/nativ/native__us_2.mp3","phonsUS":"/ˈneɪtɪv/","level":"B1","meanings":[{"def":"connected with the place where you were born and lived for the first years of your life","examples":["your native land/country/city","Her native language is Korean.","It is a long time since he has visited his native Chile.","His work is barely known in his native country of Sweden.","I returned to my native city last year to find it little changed since my childhood."],"opposite":"","synonyms":""},{"def":"connected with the place where you have always lived or have lived for a long time","examples":["native Berliners"],"opposite":"","synonyms":""},{"def":"connected with the people who originally lived in a country before other people, especially white people, came there","examples":["The native peoples depend on the forest for their livelihoods.","The island's native population began disappearing due to exposure to diseases.","native art","The festival is a celebration of native art and culture.","a record of Native American life"],"opposite":"","synonyms":""},{"def":"existing naturally in a place","examples":["the native plants of America","native species","native to… The tiger is native to India.","Some animals are in danger because their native habitat is being destroyed.","Starlings do serious damage to native bird populations.","Introduced species are often a threat to native plants.","There are about 17 hedgehog species native to Europe, Asia and Africa."],"opposite":"","synonyms":""},{"def":"that you have naturally without having to learn it","examples":["native cunning","He had to rely on his native wit."],"opposite":"","synonyms":""},{"def":"found in a pure state","examples":["native gold/silver/copper","Native copper was probably the first metal to be made into tools and weapons."],"opposite":"","synonyms":""},{"def":"designed for or built into a particular system, especially using the language or computer code associated with a particular computer or processor","examples":["Native apps still generally perform better than web apps, but the gap is shrinking.","Early programmers worked in native computer code or machine language."],"opposite":"","synonyms":""},{"def":"to try to live and behave like the local people","examples":["You will be able to meet local people, eat local food and ‘go native’."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"go native","def":"to try to live and behave like the local people","examples":["You will be able to meet local people, eat local food and ‘go native’."]}],"phrasal":[],"related":["Native Son","non-native","digital native","Native American","Native Canadian","native speaker","native speakers","Native Americans"]},{"pos":"noun","level":"B1","meanings":[{"def":"a person who was born in a particular country or area","examples":["a native of New York","The 18 year-old Rome native excels in ballet, hip-hop and tap.","She was a native of Edinburgh, born and bred.","A native of Austria, he emigrated to London in 1956.","She was not a native of the island, but had lived there for many years."],"opposite":"","synonyms":""},{"def":"a person who lives in a particular place, especially somebody who has lived there a long time","examples":["You can always tell the difference between the tourists and the natives.","She speaks Italian like a native.","Athens in the summer is too hot even for the natives."],"opposite":"","synonyms":""},{"def":"a word used in the past by Europeans to describe a person who lived in a place originally, before white people arrived there","examples":["disputes between early settlers and natives"],"opposite":"","synonyms":""},{"def":"an animal or a plant that lives or grows naturally in a particular area","examples":["The kangaroo is a native of Australia.","The plants are natives of southern European limestone mountains."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]