[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/n/nat/natio/nation__us_2.mp3","phonsUS":"/ˈneɪʃn/","level":"B1","meanings":[{"def":"a country considered as a group of people with the same language, culture and history, who live in a particular area under one government","examples":["European/Arab/Asian nations","The West African notion of Togo has presidential elections this week.","Developing nations need affordable access to drugs and medication.","Fewer and fewer people in industrialized nations actually know where their food comes from.","Leaders of the nations signed a declaration of support.","This is an important moment in our nation's history.","Germans celebrated yesterday in Berlin, the nation's capital.","The Soviet Union sent aid to the island nation of Cuba.","They discussed how to revive the nation's economy.","The Republic of Surinam was established as an independent nation in 1985.","Russia was host nation for the 2018 World Cup.","In 1950 the UK was the world's largest debtor nation and the US the largest creditor.","The biggest task of the government was to address national unity and nation building.","They hoped that the exhibition would enhance the cultural life of the nation.","They wanted to create a new nation.","economic inequality among the nations of the world","swings in public opinion across the nation","the imperialist expansion of Western nations in the 1880s","the member nations of the UN","the richest nation on earth","the threat of attack from terrorists or rogue nations","Leaders of the G8 leading industrial nations backed the plan.","Tanzania, Kenya and other east African nations have been particularly affected.","The leaders of some of the world's most powerful nations attended the meeting.","The programme is aimed at training more doctors in developing nations.","Sovereign nations have the right to control over their own natural resources."],"opposite":"","synonyms":""},{"def":"all the people in a country","examples":["The entire nation, it seemed, was watching TV.","They are a nation of food lovers.","The entire nation mourned her death.","the savage murder that shocked the nation","The fight against terrorism seemed to unite the nation.","In the nation as a whole there is no desire for war.","The new economic policies were in the best interests of the nation at large."],"opposite":"","synonyms":""},{"def":"a native North American people","examples":["Minnesota is home to 11 tribal nations.","the Dakota/Cheyenne nation","The team is made up of riders from Navajo, Cherokee, Sioux and Chippewa tribal nations.","Indigenous nations had been left out of the planning and delivery of the project."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Nation","First Nation","nation state","Video Nation","rainbow nation","Face The Nation","most favoured nation","Birth of a Nation","first nation","nation states","most favored nation"]}]