[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/n/nat/natur/natural__us_1_rr.mp3","phonsUS":"/ˈnætʃrəl/","level":"A1","meanings":[{"def":"existing in nature; not made or caused by humans","examples":["the natural world (= of trees, rivers, animals and birds)","We should respect animals and the natural environment, which is their home.","a country’s natural resources (= its coal, oil, forests, etc.)","wildlife in its natural habitat","The natural beauty of flowers inspired Monet's experiments in colour.","All the materials used are natural.","My hair soon grew back to its natural colour (= after being dyed).","The clothes are available in warm natural colours.","The building is designed to let in as much natural light as possible.","Your highlights look really natural.","The lovely natural setting was undisturbed.","It is important to preserve our country's natural heritage.","The designers were keen to respect the natural landscape.","Cooking is all about capturing the natural flavour of the food.","Only ochre and other natural colours are used in the wall paintings."],"opposite":"","synonyms":""},{"def":"having little or no processing","examples":["natural yogurt (= with no flavour added)","I try to eat a sugar-free, natural food diet.","Natural treatments have no unwanted side effects.","We made bread with a natural raising agent."],"opposite":"","synonyms":""},{"def":"normal; as you would expect","examples":["to die of natural causes (= not by violence, but normally, of old age)","Singing for her was as natural as breathing.","He thought social inequality was all part of the natural order of things.","She was the natural choice for the job.","it is natural (for somebody) to do something It's only natural to worry about your children.","It's perfectly natural for you to feel annoyed.","it is natural that… It's natural that he would want to see his own son.","The man died of natural causes.","I had a quite natural desire to hit him.","They seemed to be the natural party of government.","It's only natural that she should feel upset."],"opposite":"","synonyms":""},{"def":"used to describe behaviour or abilities that are part of the character that a person or an animal was born with","examples":["the natural agility of a cat","the natural processes of language learning","She has a natural ability with children.","Daniel's natural talent is for engineering.","It was my natural instinct to defend myself.","When body temperature is beginning to fall there is a natural tendency to fall asleep.","Children have a natural desire for affection and security.","Hunting is one of a cat's natural instincts.","Extreme shyness seemed to be part of her natural character.","His natural gifts as a preacher meant he was in great demand."],"opposite":"","synonyms":""},{"def":"having an ability that you were born with","examples":["He's a natural leader.","She's a natural rebel."],"opposite":"","synonyms":""},{"def":"relaxed and not pretending to be somebody/something different","examples":["It's difficult to look natural when you're feeling nervous.","There's something really natural about her."],"opposite":"","synonyms":""},{"def":"related by blood","examples":["His natural mother was unable to care for him so he was raised by an aunt."],"opposite":"","synonyms":""},{"def":"born to parents who are not married","examples":["She was a natural daughter of King James II."],"opposite":"","synonyms":""},{"def":"based on human reason alone","examples":["I am a firm believer in human rights and natural law.","It goes against natural justice to punish a child for the crimes of its parents."],"opposite":"","synonyms":""},{"def":"used after the name of a note to show that the note is neither sharp nor flat. The written symbol is (♮).","examples":["B natural"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["natural gas","natural law","natural-born","natural disaster","Natural England","natural history","natural language","natural number","natural science","natural selection","natural wastage","natural childbirth","natural philosophy","natural language processing","Natural History Museum","Area of Outstanding Natural Beauty","natural gases","natural laws"]},{"pos":"noun","level":"","meanings":[{"def":"a person who is very good at something without having to learn how to do it, or who has all the right qualities for a particular job","examples":["She took to flying like a natural.","He's a natural for the role."],"opposite":"","synonyms":""},{"def":"a normal musical note, not its sharp or flat form. The written symbol is (♮).","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]