[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/n/nec/neces/necessity__us_1.mp3","phonsUS":"/nəˈsesəti/","level":"B2","meanings":[{"def":"the fact that something must happen or be done; the need for something","examples":["necessity for something We recognize the necessity for a written agreement.","necessity of (doing) something We were discussing the necessity of employing more staff.","necessity (for somebody) to do something There had never been any necessity for her to go out to work.","There is absolutely no necessity for you to be involved.","of necessity This is, of necessity, a brief and incomplete account.","out of necessity He is changing job out of necessity, not because he particularly wants to.","These animals don't like water but will swim if the necessity arises.","Culling of the animals was born out of the necessity for successful conservation.","Driven by financial necessity, she decided to give up her writing career.","I've never felt the necessity to rely on such a strict rule.","Most disputes can be resolved without the necessity of going to court.","Most of the women are forced, through economic necessity, to work in part-time low-paid jobs.","Mrs R has been spared the necessity of having to give evidence.","Necessity forced an urgent solution.","Observers stressed the necessity for the ceasefire to be observed.","She saw the necessity to make an immediate impression on him.","The company sees no necessity for a more cautious approach to investment.","The visit will, of necessity, be brief.","There's no necessity for you to come.","They have accepted the necessity of greater state intervention.","This rule is carried no farther than necessity requires.","Where necessity demands, we can seat more guests in the gallery.","You can dial direct without the necessity of going through the operator.","the necessity to earn a living"],"opposite":"","synonyms":""},{"def":"a thing that you must have and cannot manage without","examples":["Many people cannot even afford basic necessities such as food and clothing.","Air-conditioning is an absolute necessity in this climate.","They have nothing but the barest necessities.","The people in the rural areas use mud bricks only as an immediate, practical necessity.","Sleep is an absolute necessity for life.","Food is a necessity of life.","He argued that nuclear weapons were a political necessity.","Policies which address these issues are an urgent necessity."],"opposite":"","synonyms":""},{"def":"a situation that must happen and that cannot be avoided","examples":["Living in London, he felt, was an unfortunate necessity."],"opposite":"","synonyms":""},{"def":"to manage to gain an advantage from something that you have to do and cannot avoid","examples":["She decided to make a virtue of necessity and combined a business trip to Paris with a visit to her cousins there."],"opposite":"","synonyms":""},{"def":"a difficult new problem forces people to think of a solution to it","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"make a virtue of necessity","def":"to manage to gain an advantage from something that you have to do and cannot avoid","examples":["She decided to make a virtue of necessity and combined a business trip to Paris with a visit to her cousins there."]},{"idiom":"necessity is the mother of invention","def":"a difficult new problem forces people to think of a solution to it","examples":[]}],"phrasal":[],"related":["necessity is the mother of invention"]}]