[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/n/nee/need_/need__us_1.mp3","phonsUS":"/niːd/","level":"A1","meanings":[{"def":"to require something/somebody because they are essential or very important, not just because you would like to have them","examples":["need something/somebody Do you need any help?","It's here if you need it.","Don't go—I might need you.","They badly needed a change.","We desperately need hard facts on this disease.","Food aid is urgently needed.","What do you need your own computer for? You can use ours.","She needs more time to recover.","People need income not handouts.","More new housing is needed in the city.","I don't need your comments, thank you.","need to do something I need to get some sleep.","He needs to win this game to stay in the match.","You don't need to leave yet, do you?","You need to know how toxic the product is.","This shirt needs to be washed.","something needs doing This shirt needs washing.","He said no but he didn’t give a reason.","The most likely explanation is that his plane was delayed.","She left the room abruptly without explanation.","You have no grounds for complaint.","On what basis will this decision be made?","Late again! What’s your excuse this time?","It gave me an excuse to take the car.","There seemed to be no motive for the murder.","I can see no possible justification for any further tax increases.","He left the party early on the pretext of having to work.","How much time is needed for maintenance and repairs?","They question whether American consumers really need the product.","I just need some information.","Research is urgently needed into the causes of this illness.","She needed some money badly.","These people may need 24-hour attention, but they do not necessarily need to be in hospital.","You hardly need me to tell you that your father is still very frail and must not be upset."],"opposite":"","synonyms":"reason"},{"def":"used to show what you should or have to do","examples":["All you need to do is complete this form.","I didn't need to go to the bank after all—Mary lent me the money.","You may well need to look outside your preferred area to find affordable accommodation.","Do you need any help?","I needed to get some sleep.","Will we need to show our passports?","Need I pay the whole amount now?"],"opposite":"","synonyms":""},{"def":"to be crazy","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"need (to have) your head examined","def":"to be crazy","examples":[]}],"phrasal":[],"related":["need-blind","need-to-know","Children in Need","if need be","on a need-to-know basis","a crying need (for something)","need (to have) your head examined","a friend in need (is a friend indeed)"]},{"pos":"noun","level":"A2","meanings":[{"def":"a situation when something is necessary or must be done","examples":["to satisfy/meet/fulfil a need","need for something There is an urgent need for qualified teachers.","a desperate/pressing need for something","They identified a need for further training.","need for somebody/something to do something There is no need for you to get up early tomorrow.","need to do something There's no need to cry (= stop crying).","I had no need to open the letter—I knew what it would say.","in need of something The house is in need of a thorough clean.","We will contact you again if the need arises.","A need exists to bridge the gap between theory and practice in nursing.","Early intervention frequently eliminates the need for surgery.","He's in constant need of treatment.","I avoid the need to travel by plane.","I see no need to do anything hasty.","I understand and support their need to make a living.","Research is currently driven by the need to reduce pollution.","Several governments have expressed the need for a cautious approach to the conflict.","She stressed the need for cooperation with the authorities.","The government has denied the need for economic reform.","The incident proved the need for a continuing military presence in the area.","The room was sorely in need of a fresh coat of paint.","The system can be switched to emergency power should the need arise.","The war created a need for national unity.","There is a great need for English language classes.","There is a special need for well-trained teachers.","There's no need to worry.","a crying need for skilled workers","a law reflecting a need for better social conditions"],"opposite":"","synonyms":""},{"def":"a strong feeling that you want somebody/something or must have something","examples":["to fulfil an emotional need","It’s difficult to express our needs and desires.","need to do something She felt the need to talk to someone.","in need of somebody/something I'm in need of some fresh air.","She had no more need of me.","I felt the need to do something.","our common need for self-preservation","the human need to order existence","the need for change","Our staff will cater to your every need."],"opposite":"","synonyms":""},{"def":"the things that somebody requires in order to live in a comfortable way or achieve what they want","examples":["First we will assess your financial needs.","Food, clothing and shelter are basic human needs.","We will devise a programme to suit your individual needs.","Your role will be to support children with special educational needs.","We try to balance the needs of all our customers.","material needs of food and drink","a new union set up to address the needs of seasonal labourers","We have now met most of the humanitarian needs of the refugees.","The coaching is informal and tailored to individual needs.","£10 a day was enough to cover all his needs."],"opposite":"","synonyms":""},{"def":"the state of not having enough food, money or support","examples":["in need The charity aims to provide assistance to people in need.","These children are in dire need.","He helped me in my hour of need (= at the time when I really needed help)."],"opposite":"","synonyms":""},{"def":"a great and desperate need for something","examples":["There is a crying need for more funds."],"opposite":"","synonyms":""},{"def":"a friend who gives you help when you need it (is a true friend)","examples":[],"opposite":"","synonyms":""},{"def":"if necessary","examples":["There's always food in the freezer if need be."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a crying need (for something)","def":"a great and desperate need for something","examples":["There is a crying need for more funds."]},{"idiom":"a friend in need (is a friend indeed)","def":"a friend who gives you help when you need it (is a true friend)","examples":[]},{"idiom":"if need be","def":"if necessary","examples":["There's always food in the freezer if need be."]}],"phrasal":[],"related":[]},{"pos":"modal verb","level":"B1","meanings":[{"def":"used to state that something is/was not necessary or that only very little is/was necessary; used to ask if something is/was necessary","examples":["need (not) do something You needn't bother asking Rick—I know he's too busy.","I need hardly tell you (= you must already know) that the work is dangerous.","If she wants anything, she need only ask.","All you need bring are sheets.","need (not) have done something You needn't have worried (= it was not necessary for you to worry, but you did)—it all turned out fine.","Need you have paid so much?","He can speak three languages.","She will try and visit tomorrow.","You must find a job.","You ought to stop smoking.","I used to smoke but I gave up two years ago.","Can I invite Mary?","Should I have invited Mary?"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]