[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/n/neg/negat/negative__us_1.mp3","phonsUS":"/ˈneɡətɪv/","level":"A1","meanings":[{"def":"bad or harmful","examples":["The crisis had a negative effect on trade.","Government cuts will have a negative impact on public services.","The whole experience was definitely more positive than negative.","Few patients reported any lasting negative consequences.","On the negative side, the labour market is still weak.","the strongly negative implications of these survey results","Negative side effects of the drug can occur and include drowsiness and headaches."],"opposite":"positive","synonyms":""},{"def":"containing a word such as ‘no’, ‘not’, ‘never’, etc.","examples":["a negative form/sentence"],"opposite":"affirmative","synonyms":""},{"def":"expressing the answer ‘no’","examples":["His response was negative.","They received a negative reply."],"opposite":"affirmative","synonyms":""},{"def":"considering only the bad side of something/somebody; having no enthusiasm or hope","examples":["Scientists have a fairly negative attitude to the theory.","The developers' proposal received negative feedback from neighbours.","‘He probably won't show up.’ ‘Don't be so negative.’","negative about something She's been rather negative about the idea.","negative in something He was too negative in his thinking.","The response from the critics was overwhelmingly negative.","I don't have many negative comments to make about the movie.","Reaction to last night's attack was uniformly negative.","She spoke in entirely negative terms.","Some people have accused me of being overly negative.","Their attitude was highly negative.","I don't want to sound unduly negative, but I simply couldn't see the point.","We try to pinpoint the cause of any negative feelings."],"opposite":"positive","synonyms":""},{"def":"not showing any evidence of a particular substance or medical condition","examples":["Her pregnancy test was negative.","Negative results are not a guarantee of a safe water supply.","He tested negative for HIV infection.","90 out of 100 patients with a negative result will not have the disease.","The antibody test proved negative.","The urine tests were negative for protein."],"opposite":"positive","synonyms":""},{"def":"containing or producing the type of electricity that is carried by an electron","examples":["a negative charge/current","the negative terminal of a battery"],"opposite":"positive","synonyms":""},{"def":"less than zero","examples":["a negative trade balance","The industry suffered negative growth (= a decline) throughout the decade."],"opposite":"positive","synonyms":""},{"def":"showing light and shade, or colours, in the opposite way to the original","examples":["In a negative image of the photograph, dark is light and right is left.","Look at a bright light and look away, and you see the negative image of it.","The artist creates an interplay of positive and negative space in acrylic."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["double negative","negative equity","negative gearing","the negative"]},{"pos":"noun","level":"B2","meanings":[{"def":"a word or statement that means ‘no’; an act of refusing to do something or of denying something","examples":["in the negative She answered in the negative (= said ‘no’)."],"opposite":"affirmative","synonyms":""},{"def":"a bad quality or aspect of a situation","examples":["Try not to focus on the negative.","The positives outweigh the negatives."],"opposite":"","synonyms":""},{"def":"the result of a test or an experiment that shows that a substance or condition is not present","examples":["The percentage of false negatives generated by the cancer test is of great concern."],"opposite":"positive","synonyms":""},{"def":"a word such as ‘no’, ‘not’, ‘never’, etc.","examples":["Double negatives, as in ‘I don't want no dinner’, are considered an error in English."],"opposite":"","synonyms":""},{"def":"a developed film showing the dark areas of an actual scene as light and the light areas as dark","examples":["Keep the negatives in case you want more prints later.","His interest in photography started with him developing negatives that he found lying around the house.","We must assume that the spy kept the negatives."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to refuse to agree to a proposal or a request","examples":[],"opposite":"","synonyms":""},{"def":"to prove that something is not true","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]