[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/n/neg/negle/neglect__us_1.mp3","phonsUS":"/nɪˈɡlekt/","level":"C1","meanings":[{"def":"to fail to take care of somebody/something","examples":["She denies neglecting her baby.","The buildings had been neglected for years.","Don’t neglect your health.","Local communities have been neglected in favour of private sector interests."],"opposite":"","synonyms":""},{"def":"to not give enough attention to something","examples":["Dance has been neglected by television.","She has neglected her studies.","They are neglecting their duty as elected representatives.","These are subjects generally neglected by historians.","This sector is one of the major growth areas and we cannot afford to neglect it.","an aspect of the problem conspicuously neglected by social scientists","They conveniently neglected their responsibilities."],"opposite":"","synonyms":""},{"def":"to fail or forget to do something that you ought to do","examples":["You neglected to mention the name of your previous employer."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"C1","meanings":[{"def":"the fact of not giving enough care or attention to something/somebody; the state of not receiving enough care or attention","examples":["The buildings are crumbling from years of neglect.","The place smelled of decay and neglect.","The gardens sadly fell into neglect and disrepair.","neglect of something/somebody The law imposes penalties for the neglect of children.","After years of neglect the house is at last being restored.","He was reprimanded for neglect of duty.","Medical neglect occurs when medical care is withheld.","She had concentrated on her music to the neglect of her other studies.","The 18th-century interior of the building has survived through benign neglect.","The buildings suffered neglect for centuries.","The doctor was guilty of serious neglect of duty.","The maximum penalty for child neglect is ten years' imprisonment.","children who are victims of deliberate parental neglect","cruelty by neglect","the suffering of children through neglect","Government neglect of public services has led to serious problems.","The case will collapse without evidence of criminal neglect.","The focus on extracurricular activities has led to a neglect of academic work."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]