[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/n/neg/negot/negotiate__us_1.mp3","phonsUS":"/nɪˈɡəʊʃieɪt/","level":"B2","meanings":[{"def":"to try to reach an agreement by formal discussion","examples":["negotiate (with somebody) (for something) The government will not negotiate with terrorists.","We have been negotiating for more pay.","negotiate (with somebody) about/on something They have refused to negotiate on this issue.","a strong negotiating position","negotiating skills","negotiate between A and B to negotiate between the two sides","I managed to negotiate successfully with the authorities.","They were forced to negotiate directly with the rebels.","We are negotiating for the release of the prisoners.","negotiating on behalf of Britain","those negotiating on behalf of the government","Her financial adviser is negotiating on her behalf."],"opposite":"","synonyms":""},{"def":"to arrange or agree something by formal discussion","examples":["to negotiate a deal/contract/treaty/settlement","We successfully negotiated the release of the hostages.","a carefully negotiated series of concessions","She managed to negotiate a permanent contract with the firm.","We still need to negotiate the details of the contract.","The parameters of the job are being continually negotiated.","Rents are individually negotiated between landlord and tenant."],"opposite":"","synonyms":""},{"def":"to successfully get over or past a difficult part on a path or route","examples":["The climbers had to negotiate a steep rock face.","He safely negotiated the slippery stepping stones.","He successfully negotiated the slippery steps.","The flight of steps was quite difficult to negotiate with a heavy suitcase.","I had just negotiated the entire length of Oxford Street.","She negotiated her way past the hot ovens.","The car negotiated the bends of the twisting mountain road.","The rats had to negotiate the mazes to obtain food.","Up to 10 000 vehicles a day negotiate this narrow, winding road.","You have to negotiate two rather sharp corners."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]