[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/n/nei/neigh/neighbourhood__us_1.mp3","phonsUS":"/ˈneɪbərhʊd/","level":"B1","meanings":[{"def":"a district or an area of a town; the people who live there","examples":["We grew up in the same neighbourhood.","a poor/quiet/residential neighbourhood","an old working-class neighbourhood","Manhattan is divided into distinct neighborhoods.","the neighbourhood police","He shouted so loudly that the whole neighbourhood could hear him.","Before long the whole neighbourhood knew about it.","The school is situated in the most affluent neighbourhood of the city.","I lived in a tough neighbourhood.","Our health depends on creating neighbourhoods that are conducive to walking.","She volunteered to make a potato salad for the neighbourhood party.","The place feels like a real neighbourhood.","There was a large school in the neighbourhood.","There were various parks around the neighbourhood.","They hired a private police force to patrol the neighbourhood.","They often got together with other parents in the local neighbourhood.","Tourists rarely visit that neighbourhood.","We used to ride bikes around the neighbourhood.","a bar located in the middle of Chicago's gay neighbourhood","a neighbourhood populated mainly by Mexican Americans","stray dogs who roam the neighbourhood","the criminals who are destroying our neighbourhood","We live in a quiet, residential neighbourhood in the south of the city."],"opposite":"","synonyms":""},{"def":"the area that you are in or the area near a particular place","examples":["We searched the surrounding neighbourhood for the missing boy.","It was a car from outside the immediate neighbourhood.","in the neighbourhood of… Houses in the neighbourhood of Paris are extremely expensive."],"opposite":"","synonyms":""},{"def":"approximately; not exactly","examples":["It cost in the neighbourhood of $500."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in the neighbourhood of","def":"approximately; not exactly","examples":["It cost in the neighbourhood of $500."]}],"phrasal":[],"related":["neighbourhood watch","neighbourhood watches"]}]