[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/n/ner/nerve/nerve__us_1.mp3","phonsUS":"/nɜːrv/","level":"B2","meanings":[{"def":"any of the long fibres that carry messages between the brain and parts of the body, enabling you to move, feel pain, etc.","examples":["the optic nerve","He's off work with a trapped nerve in his neck.","Every nerve in her body was tense.","The illness kills nerve cells and causes chronic fatigue.","Pain occurs when the nerve fibres are damaged.","Signals are transmitted from the nerve endings to the brain.","The disease can also cause nerve damage.","Cutting the nerves to the stomach does not affect hunger.","He damaged a nerve in his spine.","I've trapped a nerve in my spine.","Intense pain shot through every nerve in his body.","The message travels along the nerve to the brain.","The nerve runs from the eye to the brain.","The nerves transmit pain.","The vagus nerve controls heart rate and breathing."],"opposite":"","synonyms":""},{"def":"feelings of worry or stress","examples":["Even after years as a singer, he still suffers from nerves before a performance.","I need something to calm my nerves.","to settle/soothe/steady your nerves","Everyone's nerves were on edge (= everyone felt tense).","He lives on his nerves (= is always worried).","By the end of the meal her nerves were completely frayed.","She took a few deep breaths to calm her nerves.","Have some herbal tea to settle your nerves.","At the end of a day's teaching, her nerves were absolutely shattered.","Caring for him while he was so ill has been a great strain on her nerves.","He uncharacteristically allowed nerves to get the better of him in yesterday's game.","Her nerves were shot from all the things happening around her.","Her nerves were stretched to breaking point.","His nerves jangled every time the phone rang.","I had an attack of nerves just before I went on stage.","I'm not sure my nerves can stand another night like this.","I've never suffered from first-night nerves.","It gave me time to calm my jittery nerves before meeting her.","He lay awake, his nerves throbbing."],"opposite":"","synonyms":""},{"def":"the courage to do something difficult or dangerous","examples":["It took a lot of nerve to take the company to court.","I was going to have a go at parachuting but lost my nerve at the last minute.","He held his nerve to win the final set 6–4.","Investors largely kept their nerve and stayed with the company.","It was an amazing journey which tested her nerves to the full.","You must find the nerve to ask for more money.","Steeling my nerve, I jumped the first bar.","Singing in front of so many people was a real test of nerve.","At the last minute she almost lost her nerve.","He kept his nerve to win a thrilling game.","I didn't have the nerve to ask.","It took a lot of nerve to stand up and speak.","Skydiving is all right for people who've got the nerves for it."],"opposite":"","synonyms":""},{"def":"a way of behaving that other people think is rude or not appropriate","examples":["I don't know how you have the nerve to show your face after what you said!","He's got a nerve asking us for money!","‘Then she demanded to see the manager!’ ‘What a nerve!’","He had some nerve to insult Mina's cooking."],"opposite":"","synonyms":""},{"def":"to be very nervous","examples":["By the time of the interview, I was a bundle of nerves."],"opposite":"","synonyms":""},{"def":"to annoy somebody","examples":["That music is starting to get on my nerves.","It really gets on my nerves when people talk loudly on the phone in public.","His endless whining really gets on my nerves."],"opposite":"","synonyms":""},{"def":"to be able to remain calm in a difficult or dangerous situation","examples":["You need nerves of steel to be a good poker player."],"opposite":"","synonyms":""},{"def":"to mention a subject that makes somebody feel angry, upset, embarrassed, etc.","examples":["You touched a raw nerve when you mentioned his first wife.","My remarks about divorce had unwittingly touched a raw nerve.","The article struck a raw nerve as it revived unpleasant memories."],"opposite":"","synonyms":""},{"def":"to try as hard as you can to do something","examples":["He strained every nerve to snatch victory from defeat."],"opposite":"","synonyms":""},{"def":"to have a strong effect","examples":["His work strikes a nerve with people who are attracted to nostalgia.","It seems I struck a nerve with my last post about cell phones.","Nissan may well strike a popular nerve here."],"opposite":"","synonyms":""},{"def":"an attempt to defeat your opponents by putting pressure on them so that they lose courage or confidence","examples":["The union has been fighting a war of nerves with the management over pay."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be a bag/bundle of nerves","def":"to be very nervous","examples":["By the time of the interview, I was a bundle of nerves."]},{"idiom":"get on somebody’s nerves","def":"to annoy somebody","examples":["That music is starting to get on my nerves.","It really gets on my nerves when people talk loudly on the phone in public.","His endless whining really gets on my nerves."]},{"idiom":"have nerves of steel","def":"to be able to remain calm in a difficult or dangerous situation","examples":["You need nerves of steel to be a good poker player."]},{"idiom":"hit/touch/strike a (raw/sensitive) nerve","def":"to mention a subject that makes somebody feel angry, upset, embarrassed, etc.","examples":["You touched a raw nerve when you mentioned his first wife.","My remarks about divorce had unwittingly touched a raw nerve.","The article struck a raw nerve as it revived unpleasant memories."]},{"idiom":"strain every nerve/sinew (to do something)","def":"to try as hard as you can to do something","examples":["He strained every nerve to snatch victory from defeat."]},{"idiom":"strike a nerve (with somebody)","def":"to have a strong effect","examples":["His work strikes a nerve with people who are attracted to nostalgia.","It seems I struck a nerve with my last post about cell phones.","Nissan may well strike a popular nerve here."]},{"idiom":"a war of nerves","def":"an attempt to defeat your opponents by putting pressure on them so that they lose courage or confidence","examples":["The union has been fighting a war of nerves with the management over pay."]}],"phrasal":[],"related":["nerve gas","nerve agent","nerve cell","nerve centre","nerve-racking","nerve cells","nerve centres","nerve center","nerve centers","nerve-wracking","hit/touch/strike a (raw/sensitive) nerve","strain every sinew/nerve (to do something)"]},{"pos":"verb","level":"","meanings":[{"def":"to give yourself the courage or strength to do something difficult or unpleasant","examples":["He nerved himself to ask her out."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]