[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/n/net/netwo/network__us_1.mp3","phonsUS":"/ˈnetwɜːrk/","level":"A2","meanings":[{"def":"a complicated system of roads, lines, tubes, nerves, etc. that are connected to each other and operate together","examples":["a rail/road/canal network","The new rail services will form a network connecting the capital and major cities.","Europe's mobile phone networks are controlled by five dominant players.","network of something a network of veins","an extensive network of underground tunnels","Drinking water is brought to the town through a network of underground pipes.","They are establishing a network of pumps and pipelines to move the oil.","the structure of the brain's neural networks","(figurative) They were caught in a complex network of red tape."],"opposite":"","synonyms":""},{"def":"a closely connected group of people, companies, etc. that exchange information, etc.","examples":["They have one of the most efficient distribution networks in Europe.","These corporations control TV, radio and global communications networks.","to build/create/develop a network","network of somebody/something She has a supportive network of close friends.","Expand your network of contacts beyond your usual circles.","To do business in Asia, it is essential to build network of personal friends.","The organization controlled a network of spies in the decades after the war.","The company has a network of regional offices.","a network of research centres in more than 70 countries","Elderly people were once supported by an extensive family network.","An informal network of self-employed people exists in the area.","We must fight terrorist networks and all those who support them.","Members are all linked together in a network.","Once a supplier joins the network, its shipping systems are integrated with the others.","The newspapers are sent out via a national distribution network.","We are dismantling the financial networks that have funded terrorism.","one of the depots in the company's network"],"opposite":"","synonyms":""},{"def":"a number of computers and other devices that are connected together so that equipment and information can be shared","examples":["The office network allows users to share files and software, and to use a central printer.","across/over/via a network Users can access data across a network.","The files are accessible over a network.","You can print and scan from your device via a wireless network.","Administrators can secure the network by segmenting it into zones.","All computer users are connected on a network.","They were unable to run the telephone network economically.","laptops connected to wireless networks","software to help you manage your network"],"opposite":"","synonyms":""},{"def":"a group of radio or television stations in different places that are connected and that broadcast the same programmes at the same time","examples":["the four big US television networks","The report was broadcast across several radio networks.","The show was first aired on the cable network Showtime.","network of something He's chairman of a network of radio stations."],"opposite":"","synonyms":""},{"def":"the situation in many British companies, government departments and branches of the armed forces where people give jobs to former students of the school or university that they went to","examples":["Recruiting staff used to be done by means of the old boy network.","Most of the managers were chosen by the old boy network and many of them turned out to be incompetent."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the old boy network","def":"the situation in many British companies, government departments and branches of the armed forces where people give jobs to former students of the school or university that they went to","examples":["Recruiting staff used to be done by means of the old boy network.","Most of the managers were chosen by the old boy network and many of them turned out to be incompetent."]}],"phrasal":[],"related":["USA Network","Network Rail","network effect","neural network","social network","network neutrality","local area network","wide area network","old boy network","virtual private network","American Forces Network","National Cycle Network","network effects","Cable News Network","wireless local area network"]},{"pos":"verb","level":"","meanings":[{"def":"to connect a number of computers and other devices together so that equipment and information can be shared","examples":["networked computer systems"],"opposite":"","synonyms":""},{"def":"to broadcast a television or radio programme on stations in several different areas at the same time","examples":["nationally networked TV"],"opposite":"","synonyms":""},{"def":"to try to meet and talk to people who may be useful to you in your work","examples":["Conferences are a good place to network."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]