[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/n/new/newsp/newspaper__us_1.mp3","phonsUS":"/ˈnuːzpeɪpər/","level":"A1","meanings":[{"def":"a set of large printed sheets of paper, or a website, containing news, articles, advertisements, etc. and published every day or every week; the organization responsible for producing this","examples":["a daily/weekly newspaper","a local/national newspaper","an online newspaper","a tabloid/broadsheet newspaper","a newspaper article/report/headline","a newspaper cutting/clipping","a newspaper editor/reporter/columnist","newspapers and news websites","British newspapers and their websites carried no photos of the event.","Which newspaper do you read?","to publish/own/print a newspaper","The newspaper reported on Friday that the boy had been found.","in the newspaper I read about it in the newspaper.","according to the newspaper The company is considering up to 4000 job losses, according to The Times newspaper.","She works for the local newspaper (= the company that produces it).","Do you take a daily newspaper?","A Seattle newspaper headline blared, ‘Summit Ends in Failure’.","She told the newspaper that the airline was committed to improving its customer service.","He pulled out a box of newspaper clippings from around the world.","Have you got a copy of yesterday's newspaper?","He launched a weekly newspaper called ‘The Challenge’.","Her article appeared in the Saturday newspaper.","Savage, writing in an Auckland newspaper, quotes an eminent academic.","She got a job on a national newspaper.","She sued the newspaper for publishing photos of her on the beach.","The company is a strong contender in the race for the Scottish newspaper group.","The newspaper carried advertisements for several products.","The newspaper comes out every Saturday.","The newspapers speculated that the star was about to propose to his girlfriend.","Which newspaper do you buy?","an article in a local newspaper","newspapers owned by the Tribune Company","today's edition of the newspaper","In an interview published in the newspaper today, Douglas revealed the reason for his retirement.","There has always been concern about newspaper proprietors owning television stations."],"opposite":"","synonyms":""},{"def":"paper taken from old newspapers","examples":["Wrap all your glasses in newspaper.","Use old newspaper to wipe windows clean and dry."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["quality newspaper"]}]