[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/n/new/news_/news__us_1.mp3","phonsUS":"/nuːz/","level":"A1","meanings":[{"def":"new information about something that has happened recently","examples":["What's the latest news?","Have you heard the news? Pat's leaving!","That's great news.","Tell me all your news.","Do you want the good news or the bad news first?","saddened/shocked/surprised by the news","Here's a piece of news that may interest you.","We've had a bit of good news.","news of somebody/something Have you had any news of Patrick?","news on something Any news on the deal?","news about somebody/something He gave me some news about the office move.","news that… Messengers brought news that the battle had been lost.","(informal) It's news to me (= I haven't heard it before).","Great news! We've bought the house.","He took a moment to digest the unbelievable news.","He shared his good news with everyone else in the office.","I don't really have any news to report.","I want to catch up on all your news.","They are waiting for news of their relatives.","It was news to me that they were married.","Joan came in with the news that a pay rise had been agreed.","Mrs Trowsdale will be celebrating the news with her family.","She ran from office to office, spreading the news.","She went completely to pieces at the news of his death.","The good news is that we've all been given an extra day's leave.","The news spread like wildfire.","The news was greeted with astonishment.","The company refused to confirm the news.","Investors welcomed the news, pushing shares up 6.1%."],"opposite":"","synonyms":""},{"def":"reports of recent events that appear in newspapers or on television, radio or the internet","examples":["national/international/local news","a news story/item/report","a TV/radio news bulletin","news media/coverage","You can catch all the latest news on our website.","breaking news (= news that is arriving about events that have just happened)","The wedding was front-page news.","news of something News of a serious road accident is just coming in.","news on something Is there any news on the car bomb attack?","news about somebody/something I'm not interested in news about celebrities.","in the news She is always in the news.","I work for a 24-hour news channel.","And now with news from the Games, over to our Olympic correspondent.","Drug companies tend to bury news of drug failures.","I follow food industry news fairly closely.","If you're a news junkie, you can get updates mailed to you.","It was front-page news at the time.","It's the reporter's job to go out and gather news.","News coverage of the fighting was extremely biased.","News is coming in of a large fire in central London.","News of their engagement was leaked to the press.","She's been in the news a lot lately.","Some late news has just come in.","The actor's family released news of his death last night.","The news broke while we were away.","The news was posted on the band's website.","You can get news alerts through your cell phone.","a downloadable news digest","news of fresh killings","He gave his first news briefing since being appointed.","Every news channel covered the story.","Our school was mentioned in the news."],"opposite":"","synonyms":""},{"def":"a regular television or radio broadcast of the latest news","examples":["to listen to/watch the news","Can you put the news on?","the nine o’clock news","on the news I saw it on the news.","I heard it on the ten o'clock news.","I heard it on the evening news.","California's energy crisis dominated the news.","It was a very minor incident and barely made the news.","The news is read by Harriet Daly."],"opposite":"","synonyms":""},{"def":"a person, thing or event that is considered to be interesting enough to be reported as news","examples":["Pop stars are always news."],"opposite":"","synonyms":""},{"def":"to be likely to cause problems","examples":["Central heating is bad news for indoor plants."],"opposite":"","synonyms":""},{"def":"to be likely to be helpful or give an advantage","examples":["The cut in interest rates is good news for homeowners.","The good news is that there's still plenty of money available."],"opposite":"","synonyms":""},{"def":"to be the first to tell somebody some bad news","examples":["There's no easy way to break the news.","The police had to break the news to the boy's parents."],"opposite":"","synonyms":""},{"def":"if there were bad news we would hear it, so as we have heard nothing, it is likely that nothing bad has happened","examples":["I still haven't heard anything about the job, but no news is good news."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be bad news (for somebody/something)","def":"to be likely to cause problems","examples":["Central heating is bad news for indoor plants."]},{"idiom":"be good news (for somebody/something)","def":"to be likely to be helpful or give an advantage","examples":["The cut in interest rates is good news for homeowners.","The good news is that there's still plenty of money available."]},{"idiom":"break the news (to somebody)","def":"to be the first to tell somebody some bad news","examples":["There's no easy way to break the news.","The police had to break the news to the boy's parents."]},{"idiom":"no news is good news","def":"if there were bad news we would hear it, so as we have heard nothing, it is likely that nothing bad has happened","examples":["I still haven't heard anything about the job, but no news is good news."]}],"phrasal":[],"related":["fake news","hard news","News Corp","news desk","news agency","news-sheet","news stand","news ticker","shipping news","BBC World News","news conference","Daily News","Fox News Channel","Good News Bible","Manchester Evening News","News of the World","Illustrated London News","New York Daily News","US News and World Report","Fox News"]}]