[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/n/nor/norma/normal__us_1.mp3","phonsUS":"/ˈnɔːrml/","level":"A2","meanings":[{"def":"typical, usual or ordinary; what you would expect","examples":["quite/perfectly (= completely) normal","Her temperature is normal.","They are just quiet, normal people.","it is normal (for somebody) to do something It's normal to feel tired after such a long trip.","It is now regarded as normal for women to work outside the home.","He should be able to lead a perfectly normal life.","Divorce is complicated enough in normal circumstances, but this situation is even worse.","Under normal circumstances, I would say ‘yes’.","In the normal course of events I wouldn't go to that part of town.","Statistically, in a normal distribution, 68 per cent of the scores fall fairly close.","The unemployment rate was above normal levels.","Temperatures are expected to be in the normal range for May.","We are open during normal office hours.","It is normal practice to inform somebody if you want to leave early.","My day began in the normal way, and then I received a very strange phone call.","During normal conditions the road is clear of stones and mud.","Go for your check-ups in the normal way until you are six months pregnant.","I'd say it was pretty normal to be upset if your house burned down.","It started out as a perfectly normal day.","Mandy doesn't seem her normal self today.","The temperature is near normal for spring.","Under normal circumstances Martin would probably have gone to college.","In normal circumstances she would have tested the machine first.","In the normal course of events these things take months.","Slavery was once seen as normal and natural.","The help desk is available during normal office hours.","The skin surface is resistant to infection under normal circumstances."],"opposite":"","synonyms":""},{"def":"not suffering from any mental or physical disorder","examples":["People who commit such crimes aren't normal.","Rebecca was born a normal, healthy baby.","She seemed perfectly normal to me.","People who commit these crimes can't be normal, can they?","No normal person would do a thing like that.","I don't see how otherwise normal, sane people can agree with such a policy.","He had been a completely normal, healthy little boy."],"opposite":"","synonyms":""},{"def":"in the way that is normal or usual; as often happens","examples":["Everyone blamed me as per usual."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"as per normal/usual","def":"in the way that is normal or usual; as often happens","examples":["Everyone blamed me as per usual."]}],"phrasal":[],"related":["normal distribution","normal distributions","the new normal","in the ordinary, normal, etc. course of events, things, etc."]},{"pos":"noun","level":"B1","meanings":[{"def":"the usual or average state, level or standard","examples":["above/below normal The rainfall has been above normal for the time of year.","Sales to December are well below normal.","(back) to normal Things soon returned to normal.","The service will be back to normal next week.","as normal Life continued as normal.","After the disruption, everyone tried to carry on as normal.","After a week of festivities, life returned to normal.","His pulse rate had slowed to somewhere near normal."],"opposite":"","synonyms":""},{"def":"a person who is ordinary or healthy","examples":["Loads of people, from celebrities to normals, can be funny on Twitter.","The risk of disease in these patients is 8  000 times that of normals."],"opposite":"","synonyms":""},{"def":"a situation that used to be unusual but is now what you should expect","examples":["This is not a temporary blip—this is the new normal.","Scientists say these weather patterns could be the new normal for Florida."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the new normal","def":"a situation that used to be unusual but is now what you should expect","examples":["This is not a temporary blip—this is the new normal.","Scientists say these weather patterns could be the new normal for Florida."]}],"phrasal":[],"related":[]}]