[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/n/not/note_/note__us_1.mp3","phonsUS":"/nəʊt/","level":"A1","meanings":[{"def":"a short piece of writing to help you remember something","examples":["Please make a note of the dates.","She made a mental note (= decided that she must remember) to ask Alan about it.","Note to self (= a mental instruction): book more holidays.","I've made a note of the book's title.","She kept detailed notes of her travels.","She made a mental note to call them in the morning."],"opposite":"","synonyms":""},{"def":"a short informal letter","examples":["Just a quick note to say thank you for a wonderful evening.","She left a note for Ben on the kitchen table.","He wrote a note to his parents saying he was leaving.","I left a note for Judith on her desk.","She left me a note to say my dinner was in the oven.","I saw you two passing notes during class.","Just a quick note to wish you luck.","He gave a handwritten note to the principal."],"opposite":"","synonyms":""},{"def":"information that you write down when somebody is speaking, or when you are reading a book, etc.","examples":["He sat taking notes of everything that was said.","Can I borrow your lecture notes?"],"opposite":"","synonyms":""},{"def":"detailed information that is kept about a particular person, topic or situation","examples":["Patients' medical notes have gone missing.","notes on something He kept notes on the birds, mammals, reptiles and plants he saw on walks."],"opposite":"","synonyms":""},{"def":"information about a performance, an actor’s career, a piece of music, etc. printed in a special book or on a record cover, etc.","examples":["The booklet has full notes on each artist.","The catalogue contains detailed notes on each painting.","(British English, becoming old-fashioned) The sleeve notes include a short biography of the performers on this recording."],"opposite":"","synonyms":""},{"def":"a short comment on a word or passage in a book","examples":["a new edition of ‘Hamlet’, with explanatory notes","See note 3, page 259."],"opposite":"","synonyms":""},{"def":"a piece of paper money","examples":["a £5 note","We only exchange notes and traveller's cheques.","a thick wad of notes"],"opposite":"","synonyms":""},{"def":"a single sound of a particular length and pitch (= how high or low a sound is), made by the voice or a musical instrument; the written or printed sign for a musical note","examples":["He played the first few notes of the tune.","high/low notes","I played a lot of wrong notes because I was so nervous.","Some of the high notes were difficult for him to sing.","She's a bit wobbly on the top notes."],"opposite":"","synonyms":""},{"def":"a particular quality in something, for example in somebody’s voice or the atmosphere at an event; a comment on something with a particular quality","examples":["note of something There was a note of amusement in his voice.","on a… note It's good to finish on a positive note.","On a more serious note (= speaking more seriously)…","On a slightly different note (= changing the subject slightly), let’s talk about…","The year ended on an optimistic note.","As a side note, the entire festival is free.","His remarks injected a note of levity into the proceedings.","I detected a faint note of weariness in his voice.","On a brighter note…","On a completely unrelated note…","The conference ended on an optimistic note.","There was a sad note in her voice."],"opposite":"","synonyms":""},{"def":"an official document with a particular purpose","examples":["a sick note from your doctor","The buyer has to sign a delivery note as proof of receipt.","Students returning to school after absence must bring a note from their parents."],"opposite":"","synonyms":""},{"def":"an official letter from the representative of one government to another","examples":["an exchange of diplomatic notes"],"opposite":"","synonyms":""},{"def":"if two or more people compare notes, they each say what they think about the same event, situation, etc.","examples":["We saw the play separately and compared notes afterwards.","Let's compare notes on our experiences."],"opposite":"","synonyms":""},{"def":"to do, say or write something that is suitable/not suitable for a particular occasion","examples":["It is a bizarre tale and the author hits just the right note of horror and disbelief.","Unfortunately, the president struck the wrong note in his speech, ignoring the public mood."],"opposite":"","synonyms":""},{"def":"of importance or of great interest","examples":["a scientist of note","The museum contains nothing of great note.","The frescoes are worthy of note."],"opposite":"","synonyms":""},{"def":"to express feelings or opinions of a particular kind","examples":["She sounded a note of warning in her speech.","The touch of cynicism struck a slightly sour note.","He sounded a cautionary note.","His opening remarks struck the right note."],"opposite":"","synonyms":""},{"def":"to pay attention to something and be sure to remember it","examples":["Take note of what he says.","Under the new rules the penalty for illegal play is increased. Players take note.","He took careful note of the suspicious-looking man in the corner of the bar."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"compare notes (with somebody)","def":"if two or more people compare notes, they each say what they think about the same event, situation, etc.","examples":["We saw the play separately and compared notes afterwards.","Let's compare notes on our experiences."]},{"idiom":"hit/strike the right/wrong note","def":"to do, say or write something that is suitable/not suitable for a particular occasion","examples":["It is a bizarre tale and the author hits just the right note of horror and disbelief.","Unfortunately, the president struck the wrong note in his speech, ignoring the public mood."]},{"idiom":"of note","def":"of importance or of great interest","examples":["a scientist of note","The museum contains nothing of great note.","The frescoes are worthy of note."]},{"idiom":"sound/strike a note (of something)","def":"to express feelings or opinions of a particular kind","examples":["She sounded a note of warning in her speech.","The touch of cynicism struck a slightly sour note.","He sounded a cautionary note.","His opening remarks struck the right note."]},{"idiom":"take note (of something)","def":"to pay attention to something and be sure to remember it","examples":["Take note of what he says.","Under the new rules the penalty for illegal play is increased. Players take note.","He took careful note of the suspicious-looking man in the corner of the bar."]}],"phrasal":[],"related":["blue note","half note","note down","side note","credit note","eighth note","grace note","liner note","sleeve note","twelve-note","whole note","quarter note","suicide note","promissory note","sixteenth note","sixty-fourth note","thirty-second note"]},{"pos":"verb","level":"B1","meanings":[{"def":"to notice or pay careful attention to something","examples":["note something Note the fine early Baroque altar inside the chapel.","note (that)… Please note (that) the office will be closed on Monday.","note how, where, etc… Note how these animals sometimes walk with their tails up in the air.","it is noted that… It should be noted that dissertations submitted late will not be accepted.","be noted for something We are also noted for our delicious home-made patisserie.","The first thing I noticed about the room was the smell.","Please note (that) the office will be closed on Monday.","The tests are designed to detect the disease early.","Have you observed any changes lately?","The police observed a man enter the bank.","Police have appealed for anyone who witnessed the incident to contact them.","This case emphasizes/highlights the importance of honest communication between managers and employees.","Effective communication skills are essential/crucial/vital.","It should be noted that this study considers only verbal communication. Non-verbal communication is not dealt with here.","It is important to remember that/An important point to remember is that non-verbal communication plays a key role in getting your message across.","Communication is not only about the words you use but also your body language and, especially/above all, the effectiveness with which you listen.","I would like to draw attention to the role of listening in effective communication.","Choose your words carefully: in particular, avoid confusing and ambiguous language.","Finally, and perhaps most importantly, you must learn to listen as well as to speak.","Her lapse was duly noted by the stage manager and reported to the director.","I was pleased to note that my name had been spelled correctly for once.","Visitors should note that the tower is not open to the public.","Your objections have been duly noted.","Note that the prices are inclusive of VAT.","We note your concerns regarding an increase in costs."],"opposite":"","synonyms":"notice"},{"def":"to mention something because it is important or interesting","examples":["note something There are a few points here that are worth noting.","note that… The report noted that deaths on the roads had fallen by 2 per cent in 2017.","It is worth noting that the most successful companies had the lowest prices.","note how, where, etc… The author notes how journalists must, inevitably, simplify complex issues.","it is noted that… It is noted that the available treatments for this condition remain expensive.","Unless otherwise noted, the translations are mine.","These policies, as noted above, are not always successful.","He refused to comment until after the trial.","He noted in passing that the company’s record on safety issues was not good.","Critics remarked that the play was not original.","She observed that it was getting late.","Some critics argue that Picasso remained a great master all his life.","Others maintain that there is a significant deterioration in quality in his post-war work.","Picasso himself claimed that good art is created, but great art is stolen.","As Smith has noted, Picasso borrowed imagery from African art.","As the author points out, Picasso borrowed imagery from African art.","The writer challenges the notion that Picasso’s sculpture was secondary to his painting.","It has been suggested that Picasso’s painting was influenced by jazz music.","As noted earlier, blackbirds are common pests of wild rice crops.","Griesbach notes the difference between this product and one that is freeze-dried.","He noted in passing that the government's record on unemployment was not very good.","There are two other points to note from this graph."],"opposite":"","synonyms":"comment"},{"def":"to record something in writing","examples":["As he noted in his diary on 19 November…"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["note down"],"related":[]}]