[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/n/not/notic/notice__us_1.mp3","phonsUS":"/ˈnəʊtɪs/","level":"A2","meanings":[{"def":"to see or hear somebody/something; to become aware of somebody/something","examples":["People were making fun of him but he didn't seem to notice.","notice somebody/something The first thing I noticed about the room was the smell.","I began to notice something strange.","You can't fail to notice the poverty of the region.","to barely/hardly/scarcely notice something","Most people never notice these details.","notice (that)… I couldn’t help noticing (that) she was wearing a wig.","He won't even notice I'm gone.","notice how, what, etc… Did you notice how Rachel kept looking at her watch?","notice somebody/something do something I noticed them come in.","notice somebody/something doing something I didn't notice him leaving.","The first thing I noticed about the room was the smell.","Please note (that) the office will be closed on Monday.","The tests are designed to detect the disease early.","Have you observed any changes lately?","The police observed a man enter the bank.","Police have appealed for anyone who witnessed the incident to contact them.","He didn't seem to notice her.","He noticed at once that something was wrong.","I must go! I've only just noticed how late it is.","Nobody really noticed the changes.","The first thing I noticed about him was his eyes.","You couldn't help noticing how his eyes kept following her.","His parents hardly seemed to notice him most of the time."],"opposite":"","synonyms":"notice"},{"def":"to pay attention to somebody/something","examples":["Notice the way the bridge is supported by its suspension cables."],"opposite":"","synonyms":""},{"def":"to get attention from other people","examples":["She wears those strange clothes just to get herself noticed."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["D-notice","DA-notice","DSMA-notice","on short notice","at short notice","at a moment’s notice"]},{"pos":"noun","level":"A2","meanings":[{"def":"a sheet of paper giving written or printed information, usually put in a public place","examples":["There was a notice on the board saying the class had been cancelled.","A public notice about the planned development was pinned to the wall.","The company has issued warning notices saying that all water should be boiled.","The notice about his resignation went up this morning."],"opposite":"","synonyms":""},{"def":"a board or sign giving information, an instruction or a warning","examples":["There was a notice saying ‘Keep off the Grass’.","There are notices about where to park."],"opposite":"","synonyms":""},{"def":"a small advertisement or announcement in a newspaper or magazine","examples":["notices of births, marriages and deaths"],"opposite":"","synonyms":""},{"def":"a short announcement made at the beginning or end of a meeting, a church service, etc.","examples":["There are just two notices this week."],"opposite":"","synonyms":""},{"def":"the fact of somebody paying attention to somebody/something or knowing about something","examples":["Don't take any notice of what you read in the papers.","Take no notice of what he says.","These protests have really made the government sit up and take notice (= realize the importance of the situation).","It was Susan who brought the problem to my notice (= told me about it).","Normally, the letter would not have come to my notice (= I would not have known about it).","The work received little notice in the national media.","(formal) It will not have escaped your notice that there have been some major changes in the company.","It won't have escaped your notice that I'm feeling rather pleased with myself.","Normally such matters would not come to my notice.","Take no notice of what you read in the papers.","The change was too subtle to attract much notice.","The disease came to public notice in the 80s."],"opposite":"","synonyms":""},{"def":"information or a warning given in advance of something that is going to happen","examples":["You are welcome to come and stay as long as you give us plenty of notice.","With this account, you must give 90 days' notice if you want to withdraw money.","I'm sorry it's such short notice—we didn't know ourselves until today.","without notice Prices may be altered without notice.","The bar is closed until further notice (= until you are told that it is open again).","Councils can issue fixed penalty notices (= sums of money that must be paid) for litter and graffiti.","notice that… This new law serves notice that criminals will not go unpunished.","The bank requires three days' notice.","They cut off the electricity without notice."],"opposite":"","synonyms":""},{"def":"a formal letter or statement saying that you will or must leave your job or house at the end of a particular period of time","examples":["He has handed in his notice.","They gave her two weeks' notice.","We received an eviction notice today.","500 workers have been issued with redundancy notices.","Tenants must give written notice to the landlord of their intention to move out of the property.","Dozens of families on the estate have been given notice to quit (= told to leave their homes).","on… notice (North American English) She's on a week's notice, which doesn't give her long to find another job.","You must give one month's notice of your intention to move out of the property.","His landlord gave him two months' notice to quit.","She's given notice that she intends to leave.","The tenants could soon be served with eviction notices."],"opposite":"","synonyms":""},{"def":"a short article in a newspaper or magazine, giving an opinion about a book, play, etc.","examples":["The play got good notices in the national press."],"opposite":"","synonyms":""},{"def":"not long in advance; without warning or time for preparation","examples":["This was the best room we could get at such short notice.","You must be ready to leave at a moment's notice.","It's the best we can do at such short notice.","The team is ready to go anywhere in the world at a moment's notice."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"at short notice | at a moment’s notice","def":"not long in advance; without warning or time for preparation","examples":["This was the best room we could get at such short notice.","You must be ready to leave at a moment's notice.","It's the best we can do at such short notice.","The team is ready to go anywhere in the world at a moment's notice."]}],"phrasal":[],"related":[]}]