[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/n/nur/nurse/nurse__us_1.mp3","phonsUS":"/nɜːrs/","level":"A1","meanings":[{"def":"a person whose job is to take care of sick or injured people, usually in a hospital","examples":["a registered nurse","a qualified/trained nurse","She trained as a nurse in Korea.","student nurses","a male nurse","a dental nurse (= one who helps a dentist)","a psychiatric nurse (= one who works in a hospital for people with mental illnesses)","a team of doctors and nurses","a nurses' station (= an office for nurses in a hospital)","Nurse Bennett","Nurse, come quickly!","I work as a nurse in a busy hospital.","The country faces a growing shortage of nurses.","The school nurse provides excellent first aid.","She led them to a nurses' station and consulted with the sister","He went to the South Bank University to become a qualified nurse."],"opposite":"","synonyms":""},{"def":"(in the past) a woman or girl whose job was to take care of babies or small children in their own homes","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["wet nurse","scrub nurse","staff nurse","charge nurse","nursery nurse","theatre nurse","district nurse","practical nurse","registered nurse","visiting nurse","nurse practitioner","nurse practitioners","licensed practical nurse","registered general nurse","registered enrolled nurse"]},{"pos":"verb","level":"","meanings":[{"def":"to care for somebody who is ill or injured","examples":["He worked in a hospital for ten years nursing cancer patients.","She nursed her daughter back to health.","She nursed her husband devotedly through his last illness.","He was nursed back to health by his devoted servant."],"opposite":"","synonyms":""},{"def":"to take care of an injury or illness, especially by resting and not trying to do too much","examples":["Several weeks after the match, he was still nursing a shoulder injury.","You'd better go to bed and nurse that cold.","(figurative) She was nursing her hurt pride.","(figurative) European markets were still nursing their wounds after Monday's losses.","I'm nursing a mild hangover from last night's party.","She's still nursing a broken heart at the sudden break-up of her marriage."],"opposite":"","synonyms":""},{"def":"to have a strong feeling or idea in your mind for a long time","examples":["to nurse an ambition/a grievance/a grudge","She had been nursing a secret desire to see him again."],"opposite":"","synonyms":""},{"def":"to give special care or attention to somebody/something","examples":["to nurse tender young plants","He nursed the car up the steep hill."],"opposite":"","synonyms":""},{"def":"to hold a drink for a long time, drinking it slowly","examples":["He sat nursing his cup of coffee."],"opposite":"","synonyms":""},{"def":"to feed a baby with milk from the breast","examples":["a nursing mother","nurse somebody/something The lioness is still nursing her cubs."],"opposite":"","synonyms":""},{"def":"to drink milk from its mother’s breast","examples":["Babies nurse more at night in the first three weeks."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]