[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/obj/objec/objective__us_1.mp3","phonsUS":"/əbˈdʒektɪv/","level":"B2","meanings":[{"def":"something that you are trying to achieve","examples":["the primary/principal/key objective","The main objective of this meeting is to give more information on our plans.","How does the project fit with our strategic objectives?","the government's policy objectives","to achieve/meet/accomplish your objectives","to set/state/define your objectives","You must set realistic aims and objectives for yourself.","What are the organization's goals and objectives?","Set yourself targets that you can reasonably hope to achieve.","attainment targets in schools","What is the main objective of this project?","He continued to pursue his goal of becoming an actor.","The object is to educate people about road safety.","He joined the society for political ends.","That’s only OK if you believe that the end justifies the means (= bad methods of doing something are acceptable if the final result is good).","The review sought to establish key objectives.","The party is radical in its objectives.","The two groups are pursuing a common objective.","We need to establish a clear objective.","We succeeded in our prime objective of cutting costs.","a set of agreed objectives","I was afraid of failing to achieve my objectives.","What is the main objective of this project?","The objective of this study is to investigate the effects of monetary policy on agricultural prices in four Asian countries."],"opposite":"","synonyms":"target"},{"def":"the lens in a telescope or microscope that is nearest to the object being looked at","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adjective","level":"B2","meanings":[{"def":"not influenced by personal feelings or opinions; considering only facts","examples":["an objective assessment of the situation","objective truth/facts/reality","objective criteria/measures/measurements","He doesn't even pretend to be impartial and objective.","It's hard to remain completely objective.","It's hard for parents to be objective about their own children.","There's little objective evidence to suggest that he is guilty.","We need to have an independent and objective assessment of the candidate's abilities.","In the 19th century, scientists began to adopt a much more objective approach to their subject.","These figures are a reliable and objective indicator of changing trends in people's lifestyles.","I find it difficult to be objective where he's concerned."],"opposite":"subjective","synonyms":""},{"def":"existing outside the mind; based on facts that can be proved","examples":["objective reality"],"opposite":"subjective","synonyms":""},{"def":"the objective case is the one which is used for the object of a sentence","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]