[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/obj/objec/object__us_2_rr.mp3","phonsUS":"/ˈɑːbdʒɪkt/","level":"A1","meanings":[{"def":"a thing that can be seen and touched, but is not alive","examples":["everyday objects such as cups and saucers","inanimate objects (= things that are not alive)","a physical/material object (= that you can see and touch)","The scanner detected a metal object.","We now know that solid objects are largely made up of empty space.","art objects from the ancient world","There is a new device for cars that warns drivers of traffic jams ahead.","His kitchen is full of gadgets he never uses.","‘What do you call the instrument that measures temperature?’ ‘A thermometer.’","‘Have you got one of those tools for turning screws?’ ‘Do you mean a screwdriver?’","‘What’s a blender?’ ‘It’s an electric machine for mixing soft food or liquid.’","climbing equipment.","firefighters wearing breathing apparatus.","Furniture and other household objects were piled up outside the house.","This looks a very unusual object. What is it exactly?","He looked down at the drumsticks as if turning to inanimate objects for emotional support.","The internet cannot replace the thrill of holding the physical object of a book in your hands.","Glass and plastic objects lined the shelves.","books, paintings, sculpture and other precious objects"],"opposite":"","synonyms":""},{"def":"a person or thing that somebody desires, studies, pays attention to, etc.","examples":["He felt he was nothing more to her than an object of desire.","Her objects of study are all paintings.","an object of affection/ridicule/worship","The Rolls Royce was an object of desire, and I desired one.","Such a product aims to become an object of desire.","The strange creature became the object of much curiosity."],"opposite":"","synonyms":""},{"def":"an aim or a purpose","examples":["Her sole object in life is to become a travel writer.","The object is to educate people about road safety.","The object of the game is to score points by combining cards.","If you're late, you'll defeat the whole object of the exercise.","with the object of doing something He put together an army with the object of taking back the lost territory.","Set yourself targets that you can reasonably hope to achieve.","attainment targets in schools","What is the main objective of this project?","He continued to pursue his goal of becoming an actor.","The object is to educate people about road safety.","He joined the society for political ends.","That’s only OK if you believe that the end justifies the means (= bad methods of doing something are acceptable if the final result is good)."],"opposite":"","synonyms":"target"},{"def":"a noun, noun phrase or pronoun that refers to a person or thing that is affected by the action of the verb (called the direct object), or that the action is done to or for (called the indirect object)","examples":[],"opposite":"","synonyms":""},{"def":"money is not something that needs to be considered, because there is plenty of it available","examples":["She travels around the world as if money is no object."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"money is no object","def":"money is not something that needs to be considered, because there is plenty of it available","examples":["She travels around the world as if money is no object."]}],"phrasal":[],"related":["object code","sex object","direct object","object lesson","indirect object","learning object","object language","object-oriented","object program","object lessons","object programs","object languages","digital object identifier","money is no object"]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/obj/objec/object__us_3.mp3","phonsUS":"/əbˈdʒekt/","level":"B2","meanings":[{"def":"to say that you disagree with or oppose something","examples":["If nobody objects, we'll postpone the meeting till next week.","object to somebody/something Members of the council strongly objected to plans to sell off the land.","Many local people object to the building of the new airport.","object to doing something I really object to being charged for parking.","object to somebody doing something Who could object to people having fun?","I objected on the grounds that it was unkind to the animals.","It was your own idea in the first place, so you can hardly object now.","The tribes object to plans to widen the highway to four lanes."],"opposite":"","synonyms":""},{"def":"to give something as a reason for opposing something","examples":["object that… He objected that the police had arrested him without sufficient evidence.","+ speech ‘But that's not fair!’ she objected."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]