[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/obs/obser/observe__us_1.mp3","phonsUS":"/əbˈzɜːrv/","level":"B2","meanings":[{"def":"to see or notice somebody/something","examples":["observe somebody/something Have you observed any changes lately?","All the characters in the novel are closely observed (= seem like people in real life).","I want you to observe all the details.","The patterns observed in our study may represent a general rule.","observe somebody/something do something The police observed a man enter the bank.","observe somebody/something doing something They observed him entering the bank.","observe that… She observed that all the chairs were already occupied.","be observed to do something He was observed to follow her closely.","He refused to comment until after the trial.","He noted in passing that the company’s record on safety issues was not good.","Critics remarked that the play was not original.","She observed that it was getting late.","The first thing I noticed about the room was the smell.","Please note (that) the office will be closed on Monday.","The tests are designed to detect the disease early.","Have you observed any changes lately?","The police observed a man enter the bank.","Police have appealed for anyone who witnessed the incident to contact them.","It is the parents who actually observe these behavioural problems in their children.","She correctly observed that there was very little difference between the two parties on domestic policies.","This behaviour is commonly observed among several species of finch."],"opposite":"","synonyms":"comment"},{"def":"to watch somebody/something carefully, especially to learn more about them","examples":["He observes keenly, but says little.","observe somebody/something I felt he was observing everything I did.","The patients were observed over a period of several months.","an observed decrease in rainfall in the area","The program provided an opportunity to observe the effects of treatment.","The cells were observed under a microscope.","observe somebody/something for something The patient should be observed for signs of an allergic reaction.","observe how, what, etc… They observed how the parts of the machine fitted together.","If you look carefully you can just see our house from here.","She looked at me and smiled.","to watch television","Watch what I do, then you try.","In the evening we went to see a movie.","People came from all over the world to view her work.","The patients were observed over a period of several months.","You can learn a lot by simply observing.","She was unaware that she was being observed from the window.","It is interesting to observe the reaction of the children to these changes.","She stood there, quietly observing the domestic scene."],"opposite":"","synonyms":"look"},{"def":"to make a remark","examples":["She observed that it was getting late.","‘It's easy to say that,’ she observed to Michael, ‘but can you prove it?’","‘You took your time, ’ he observed coolly.","The only certainties in this world, as Benjamin Franklin famously observed, are death and taxes.","The Area Manager observed that takings were down and decided to pay a visit."],"opposite":"","synonyms":""},{"def":"to obey rules, laws, etc.","examples":["Will the rebels observe the ceasefire?","The crowd observed a minute's silence (= were silent for one minute) in memory of those who had died.","Failure to observe club rules may result in expulsion.","This procedure must be correctly observed."],"opposite":"","synonyms":""},{"def":"to celebrate festivals, birthdays, etc.","examples":["Do they observe Christmas?"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]