[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/obv/obvio/obvious__us_1.mp3","phonsUS":"/ˈɑːbviəs/","level":"B1","meanings":[{"def":"easy to see or understand","examples":["I know you don't like her but try not to make it so obvious.","He agreed with obvious pleasure.","obvious (that…) It soon became obvious that the machine did not work.","It's painfully obvious that the budget was low for this movie.","It's obvious a change is needed.","obvious to somebody that… It was obvious to everyone that the child had been badly treated.","obvious to somebody The lessons seem fairly obvious to anyone who doesn't work in the Administration.","obvious from something that… It's obvious from what she said that something is wrong.","For obvious reasons, I'd prefer not to give my name.","The reasons for this decision were not immediately obvious.","The solution to weight loss is also blindingly obvious - whatever you eat, eat less.","obvious how, what, etc. It was far from obvious how they were going to get off the island.","It was quite clear to me that she was lying.","It’s obvious from what he said that something is wrong.","It was apparent from her face that she was really upset.","The orchestra played with evident enjoyment.","He made it very plain that he wanted us to leave.","I hope I make myself obvious.","Try not to make it so clear/​plain.","an evident case of something.","It is obvious to me that you're unhappy in your job.","It was becoming painfully obvious that the two of them had nothing in common.","It was immediately obvious that the bag was too heavy.","The ineptitude of the government was all too obvious.","He put his book down with obvious annoyance.","It's obvious that she'd be upset."],"opposite":"","synonyms":"clear"},{"def":"that most people would think of or agree to","examples":["She was the obvious choice for the job.","There's no obvious solution to the problem.","This seemed the most obvious thing to do.","an obvious example/answer/question"],"opposite":"","synonyms":""},{"def":"not interesting, new or showing imagination; unnecessary because it is clear to everyone","examples":["The ending was pretty obvious.","I may be stating the obvious but without more money the project cannot survive."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]