[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/occ/occas/occasion__us_2.mp3","phonsUS":"/əˈkeɪʒn/","level":"B1","meanings":[{"def":"a particular time when something happens","examples":["on an occasion on this/that occasion","I've met him on several occasions.","They have been seen together on two separate occasions.","On one occasion, she called me in the middle of the night.","Only on rare occasions do I go out socially.","occasion when… I can remember very few occasions when he had to cancel because of ill health.","He used the occasion to announce further tax cuts.","I have stated on numerous occasions what options are open.","Harry has mentioned this on many previous occasions.","I have stayed there on a number of occasions.","It was the first of many such occasions.","On this occasion, as it happens, the engine started immediately.","On this particular occasion, Joe wasn't there.","They came to visit us on the odd occasion, but only when they had nothing better to do.","I will overlook your lateness, on this occasion."],"opposite":"","synonyms":""},{"def":"a special event, ceremony or celebration","examples":["a great/memorable/happy/momentous occasion","Turn every meal into a special occasion.","They marked the occasion (= celebrated it) with an open-air concert.","Their wedding turned out to be quite an occasion.","We expect you to dress for the occasion.","on the occasion of something He was presented with the watch on the occasion of his retirement.","Every good wish to them on the occasion of their 40th anniversary.","I only wear my silk dress on special occasions.","Medals are usually worn only on ceremonial occasions.","The Queen's coach is only used for state occasions.","We sell cards and notepaper for all occasions.","It was certainly a memorable occasion!"],"opposite":"","synonyms":""},{"def":"a suitable time for something","examples":["occasion for doing something It should have been an occasion for rejoicing, but she could not feel any real joy.","These workshops provide an occasion for talking about art.","occasion for something This is not a time for specifics, but an occasion for vision.","Festivals were occasions for great celebration.","I’ll speak to him about it if the occasion arises (= if I get a chance)."],"opposite":"","synonyms":""},{"def":"a reason or cause","examples":["occasion to do something I've had no occasion to visit him recently.","She doesn’t have much occasion to speak French in her new job.","occasion of something Her death was the occasion of mass riots.","occasion for something Art here is an occasion for education and entertainment.","I'm willing to go to court over this if the occasion arises (= if it becomes necessary).","I bought the camera last year, but never had the occasion to use it.","Last year we had occasion to visit relatives in Cornwall."],"opposite":"","synonyms":""},{"def":"sometimes but not often","examples":["He has been known on occasion to lose his temper."],"opposite":"","synonyms":""},{"def":"a feeling or understanding that an event is important or special","examples":["Candles on the table gave the evening a sense of occasion."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"on occasion(s)","def":"sometimes but not often","examples":["He has been known on occasion to lose his temper."]},{"idiom":"a sense of occasion","def":"a feeling or understanding that an event is important or special","examples":["Candles on the table gave the evening a sense of occasion."]}],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to cause something","examples":["occasion something The flight delay was occasioned by the need for a further security check.","The injury was believed to have occasioned his death.","occasion somebody something The decision occasioned us much anxiety."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]