[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/occ/occup/occupation__us_1.mp3","phonsUS":"/ˌɑːkjuˈpeɪʃn/","level":"B2","meanings":[{"def":"a job or profession","examples":["Please state your name, age and occupation below.","It’s very difficult to find work at the moment.","Only half the people here are in paid employment.","He had a very distinguished career in the Foreign Office.","He hopes to enter the medical profession.","Please state your name, age, and occupation.","Carpentry is a highly skilled trade.","He gave up his occupation as a farmer and became a teacher.","He left the army in 1999 and chose a civilian occupation.","Her occupation is listed as ‘homemaker’.","The college provides training in a wide range of occupations.","The people interviewed followed a variety of occupations","service occupations such as cleaning and catering","Is your occupation full-time or part-time?","It's harder to lose weight when you have a sedentary occupation.","Why is nursing still seen as a female occupation?"],"opposite":"","synonyms":"work"},{"def":"the way in which you spend your time, especially when you are not working","examples":["Her main occupation seems to be shopping."],"opposite":"","synonyms":""},{"def":"the act of moving into a country, town, etc. and taking control of it using military force; the period of time during which a country, town, etc. is controlled in this way","examples":["the Roman occupation of Britain","under occupation The zones under occupation contained major industrial areas.","occupation forces","During the occupation, the church was used as a mosque.","The invaders have ended their occupation of large parts of the territories.","It is the duty of the occupation force to maintain civil order.","The military occupation has created anger and resentment."],"opposite":"","synonyms":""},{"def":"the act of living in or using a building, room, piece of land, etc.","examples":["The offices will be ready for occupation in June.","in occupation The following applies only to tenants in occupation after January 1, 2010.","The level of owner occupation (= people owning their homes) has increased rapidly in the last 30 years.","He intends to remain in occupation of the building for as long as possible.","The houses were judged to be unfit for human occupation.","You can only take up occupation once the tenancy has been signed.","illegal occupation of the building","the conversion of big old buildings to multiple occupation"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]