[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/off/offer/offer__us_1_rr.mp3","phonsUS":"/ˈɔːfər/","level":"A2","meanings":[{"def":"to say that you are willing to give something to somebody","examples":["offer (something) Josie had offered her services as a guide.","He offered some useful advice.","to offer support/protection/help","I don't think they need help, but I think I should offer anyway.","offer something for something He offered $4 000 for the car.","They are offering a reward for the return of their cat.","offer something to somebody They decided to offer the job to Jo.","offer somebody something They decided to offer Jo the job.","I gratefully took the cup of coffee she offered me.","offer somebody something to do something Taylor offered him 500 dollars to do the work.","Would you like a magazine to read?","Can I get you a coffee?","Can I offer you something to drink?","How about something to eat? I could make some sandwiches.","If you'd like to use/​If you need the bathroom, it's the second door on the right.","Feel free to go upstairs and have a rest if you'd like to.","That would be nice. I'd like a cup of tea, please.","Yes, please. A glass of orange juice would be lovely.","If you're sure it's no trouble, I'd love a coffee.","No, thank you. I'm fine for now.","Not for me, thanks.","I'm fine, thanks. Maybe later.","Would you like me to help you with that?","Can I give you a hand?","Can I help you with that?","Shall I carry that for you?","Would it help if I spoke to Julie before you call her?","Let me take your bag.","If there's anything I can do (to help), let me know.","That's very kind/​nice/​generous/​thoughtful of you. Thank you.","It's all right, thank you. I can manage/​do it.","Thanks. That would be very helpful.","Would they be prepared to offer any more?","I refer to your recent application and interview and am pleased to offer you the post of editor.","She offered drinks to her guests.","She felt obliged to offer him a bed for the night.","Hospitality was freely offered to refugees.","Her neighbour helps her with the children and offers support."],"opposite":"","synonyms":""},{"def":"to say that you are willing to do something for somebody","examples":["offer to do something The kids offered to do the dishes.","+ speech ‘I'll do it,’ she offered.","She graciously offered to get pizza so I wouldn't have to cook.","‘Do you need any help?’ he offered impulsively.","She offered to help him negotiate the purchase.","They offered to pay for a hotel."],"opposite":"","synonyms":""},{"def":"to make something available for sale or use","examples":["offer something The hotel offers excellent facilities for families.","Both companies offer a range of software.","Which lenders consistently offer the cheapest mortgages?","offer something for something The property will be offered for sale by auction on May 24.","The camp also offers boating, fishing, campfires and more.","They focus on offering quality products that consumers want.","The college offers free ICT training courses for beginners."],"opposite":"","synonyms":""},{"def":"to provide the opportunity for something; to provide access to something","examples":["offer something The job didn't offer any prospects for promotion.","He did not offer any explanation for his behaviour.","offer somebody something The program has offered her many opportunities for travel.","The plan seemed to offer real advantages.","This investment is likely to offer a higher return.","The bedroom suite offers access to an expansive terrace.","The exhibition offers important new insights into the artist's work.","When problems arise, these programs offer solutions.","They offer a trade discount of 10 to 25 per cent.","The sweepstake offers consumers the chance to win prizes."],"opposite":"","synonyms":""},{"def":"to show that you are ready to resist or attack somebody/something","examples":["Universities offered little resistance to these changes.","He never lost his temper or offered violence to anyone."],"opposite":"","synonyms":""},{"def":"to give something to God","examples":["We offered up our prayers for the men's safe return."],"opposite":"","synonyms":""},{"def":"to have something available that somebody wants","examples":["Oxford has a lot to offer visitors in the way of entertainment.","a young man with a great deal to offer (= who is intelligent, has many skills, etc.)","The open evening is a chance to see what the college has to offer students.","This player has proved that he still has a lot to offer."],"opposite":"","synonyms":""},{"def":"to hold out your hand for somebody to shake","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"have something to offer","def":"to have something available that somebody wants","examples":["Oxford has a lot to offer visitors in the way of entertainment.","a young man with a great deal to offer (= who is intelligent, has many skills, etc.)","The open evening is a chance to see what the college has to offer students.","This player has proved that he still has a lot to offer."]},{"idiom":"offer your hand","def":"to hold out your hand for somebody to shake","examples":[]}],"phrasal":[],"related":["special offer","on offer","under offer","offer your hand"]},{"pos":"noun","level":"A2","meanings":[{"def":"an act of saying that you are willing to do something for somebody or give something to somebody","examples":["to receive a job offer","to accept/reject/decline an offer","offer of something Thank you for your kind offer of help.","I took him up on his offer of a loan.","You can't just turn down offers of work like that.","an offer of marriage","offer to do something I accepted her offer to pay.","They refused our offer of assistance.","The Rams have made him a two-year contract offer.","I had to turn down a job offer from a publisher because the pay was too low.","She received a conditional offer from the University of Warwick.","The union has voted for industrial action after rejecting a pay offer.","I must decline your generous offer.","He accepted the offer by management to begin talks.","She's already received several offers of employment.","They declined an offer of humanitarian aid after the hurricane."],"opposite":"","synonyms":""},{"def":"an amount of money that somebody is willing to pay for something","examples":["offer for something I've had an offer of $2 500 for the car.","The museum received an offer for the painting of $19 million.","They've decided to accept our original offer.","The offer has been withdrawn.","offer (that)… They made me an offer I couldn't refuse.","The original price was £3 000, but I'm open to offers (= willing to consider offers that are less than that).","Don't just accept the first offer.","Excellent condition. $1 000 or best offer.","No one has made a firm offer.","Several people put in an offer for the house.","The company says it has made a good offer which cannot be improved upn.","They just kept upping their offer until I had to say yes.","We realized we would not get a higher offer.","We should be able to match their offer for the player.","‘How much do you want for it?’ ‘Make me an offer.’","Have you had any offers on the flat?"],"opposite":"","synonyms":""},{"def":"a reduction in the normal price of something, usually for a short period of time","examples":["This special offer is valid until the end of the month.","See next week's issue for details of more free offers.","offer on something They have an offer on new phones at the moment.","I got the conditioner in a free offer with my shampoo.","The council do cheap offers on compost bins.","Your first order is delivered free as an introductory offer."],"opposite":"","synonyms":""},{"def":"that can be bought, used, etc.","examples":["The following is a list of courses currently on offer.","Prizes worth more than £20 000 are on offer."],"opposite":"","synonyms":""},{"def":"on sale at a lower price than normal for a short period of time","examples":["Italian wines are on (special) offer this week.","We have a number of bargains on offer."],"opposite":"","synonyms":""},{"def":"if a house or other building is under offer, somebody has agreed to buy it at a particular price","examples":["The property is currently under offer to a client."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"on offer","def":"that can be bought, used, etc.","examples":["The following is a list of courses currently on offer.","Prizes worth more than £20 000 are on offer.","Italian wines are on (special) offer this week.","We have a number of bargains on offer."]},{"idiom":"under offer","def":"if a house or other building is under offer, somebody has agreed to buy it at a particular price","examples":["The property is currently under offer to a client."]}],"phrasal":[],"related":[]}]