[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/off/offic/official__us_4.mp3","phonsUS":"/əˈfɪʃl/","level":"B1","meanings":[{"def":"agreed to, said, done, etc. by somebody who is in a position of authority","examples":["an official announcement/decision/statement","according to official figures/statistics","The news is not yet official.","the official biography of the President","An official inquiry has been launched into the cause of the accident.","The country's official language is Spanish.","The film's official website is also very informative.","I intend to lodge an official complaint (= to complain to somebody in authority).","The report revealed official corruption in relation to road building.","The official news agency reported an attack by rebel soldiers.","Greater vigilance at the official and unofficial points of entry into the country is required.","The network's official launch is scheduled for this month.","The research used material from official documents and newspaper reports.","The views expressed in this essay are those of the author and do not necessarily reflect official government policy.","Rice prices are up by as much as 13 percent, according to official reports.","There have been rumours that he is resigning, and today he made it official."],"opposite":"","synonyms":""},{"def":"connected with the job of somebody who is in a position of authority","examples":["official duties/responsibilities","the Prime Minister’s official residence","He attended in his official capacity as mayor.","This was her first official engagement.","He made an official visit to Tokyo in March.","He stepped into the waiting official car.","The minister was in Berlin on official business.","The Prime Minister's official spokesman rejected calls for an inquiry."],"opposite":"","synonyms":""},{"def":"formal and attended by people in authority","examples":["an official function/reception","The official opening is planned for October."],"opposite":"","synonyms":""},{"def":"that is told to the public but may not be true","examples":["I only knew the official version of events.","The official line is that the date for the election has not yet been decided.","The official story has always been that they are just good friends."],"opposite":"","synonyms":""},{"def":"used to announce publicly something that you think is obvious or that everyone already knows","examples":["It's official: this is the worst zombie film ever."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"it's official","def":"used to announce publicly something that you think is obvious or that everyone already knows","examples":["It's official: this is the worst zombie film ever."]}],"phrasal":[],"related":["fourth official","official receiver","official secret","Official Birthday","Official Secrets Act","Official Unionist Party","Official Monster Raving Loony Party","official receivers","official secrets"]},{"pos":"noun","level":"B2","meanings":[{"def":"a person who is in a position of authority in a large organization","examples":["She is the government official in charge of the project.","a senior official in the State Department","a bank/company/court official","The newspaper quoted an unnamed FBI official as saying:…","according to an official This is still one of its top sellers, according to company officials.","Palace officials refused to comment on the royal divorce.","He attempted to bribe local officials.","Union officials are now seeking an early meeting with company directors.","the FBI and other law enforcement officials","the official responsible for handling the case","Administration officials say the nationwide organic standard may be in place by the end of the year.","Less than 15 per cent of all elected officials are women.","City officials supported residents' efforts to purchase the park.","The information comes from unnamed intelligence officials.","State officials are hoping for some help from the US Department of Agriculture.","Top trade officials gathered for a World Trade Organization meeting."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]