[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/off/offic/office__us_2_rr.mp3","phonsUS":"/ˈɑːfɪs/","level":"A1","meanings":[{"def":"a room, set of rooms or building where people work, usually sitting at desks","examples":["The company is moving to new offices on the other side of town.","Are you going to the office today?","in the office I'm sorry, Mr Anders is not in the office today.","at the office I've had a tough day at the office.","a regional/branch office","office workers","an office job","an office building","The new development will include housing and office space.","out of the office I'm going to be out of the office next week.","I sometimes go into the office on Saturdays when we're busy.","I sometimes have to stay late at the office.","The company set up its first permanent offices in Manhattan.","The old warehouses have been redeveloped as office buildings.","We have an office party every Christmas.","We plan to open a New York office in the near future.","What time do you usually leave the office?","Working in a busy office environment can be stressful.","You can contact our sales office at this number."],"opposite":"","synonyms":""},{"def":"a room in which a particular person works, usually at a desk","examples":["Some people have to share an office.","Come into my office.","The prime minister arranged a meeting in his private office.","an office overlooking the Hudson River"],"opposite":"","synonyms":""},{"def":"a place where a doctor, dentist or vet sees patients","examples":["a doctor’s/dentist’s office","the bill from an office visit to the doctor"],"opposite":"","synonyms":""},{"def":"a room or building used for a particular purpose, especially to provide information or a service","examples":["a ticket office"],"opposite":"","synonyms":""},{"def":"used in the names of some British government departments","examples":["the Home Office","the Foreign and Commonwealth Office","office of something the Office of Fair Trading","a research project carried out by the Welsh Office"],"opposite":"","synonyms":""},{"def":"an important position of authority, especially in government; the work and duties connected with this","examples":["She held office as a cabinet minister for ten years.","in office How long has he been in office?","Perhaps she remained in office too long.","The scandal cast a shadow over his time in office.","out of office The party has been out of office (= has not formed a government) for many years.","The present government took office in 2017.","He died three years after leaving office.","She has announced she will not run for office again.","He has never sought public office.","the office of something She held the office of treasurer for five years.","He ran for office in the last presidential election.","Martin was sworn into office as prime minister in March.","The government seemed likely to remain in office for the next five years.","The government was returned to office by a large majority.","The party has broken all the promises it made when out of office.","The president holds office for a period of four years.","She is considering standing for office herself.","the three great offices of state: the prime minister, the chancellor and the foreign secretary","to be re-elected for a second term of office"],"opposite":"","synonyms":""},{"def":"with somebody’s help","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"through somebody’s good offices","def":"with somebody’s help","examples":[]}],"phrasal":[],"related":["back office","box office","head office","home office","land office","Office","office boy","office girl","post office","Assay Office","front office","office block","office-holder","office hours","office party","office worker","press office","booking office","register office"]}]