[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/off/offic/officer__us_2_rr.mp3","phonsUS":"/ˈɑːfɪsər/","level":"A2","meanings":[{"def":"a person who is in a position of authority in the armed forces","examples":["army/military/naval officers","senior officers in the Royal Air Force","The matter was passed on to me, as your commanding officer.","He's a retired army intelligence officer.","The decision rests with the ranking officer.","a former army officer who served in Bosnia","the officer commanding the infantry","to salute a superior officer","The military academy trains officers for technical service in the army.","On Christmas Eve 1914 officers and soldiers put down their weapons to share wine and food."],"opposite":"","synonyms":""},{"def":"a member of the police","examples":["the officer in charge of the case","the investigating officer","Yes, officer, I saw what happened.","Officers arrested five suspects after a raid last night.","Two uniformed officers attended the scene of the accident.","100 officers swooped on various south Essex locations.","We spoke to the duty officer at the police station.","Officers raided an address in the Pittsburgh area.","Drug squad officers raided a warehouse near Heathrow.","The budget will pay for 200 extra police community support officers.","A team of undercover officers was deployed inside the club to catch the dealers.","The panel included law enforcement officers such as police and sheriffs."],"opposite":"","synonyms":""},{"def":"a title for a police officer","examples":["Officer Dibble"],"opposite":"","synonyms":""},{"def":"a person who is in a position of authority in the government or a large organization","examples":["an environmental health officer","a customs/prison/welfare officer","officers of state (= ministers in the government)","He was a former officer in the Secret Service.","Trading standards officers seized a large number of fake goods.","If you're concerned, you should go to a student welfare officer to discuss the problem.","All directors and other senior officers of the company will have a vote.","The corporation has shareholders, officers and board members.","airport security officers","The company's chief financial officer denied that the company had misled its shareholders.","Local council officers met to discuss the proposals.","They need to see the planning officer's report before commenting publicly.","The cooperative has elected the following officers to serve on the board of directors.","She owed a vast sum of money, and the sheriff's officers arrived to confiscate the family property."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["air officer","duty officer","field officer","first officer","house officer","peace officer","petty officer","pilot officer","press officer","staff officer","flight officer","flying officer","liaison officer","medical officer","nursing officer","police officer","presiding officer","probation officer","returning officer"]}]