[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/onl/onlin/online__us_1_rr.mp3","phonsUS":"/ˌɑːnˈlaɪn/","level":"A1","meanings":[{"def":"available on or done using the internet or other computer network","examples":["Online shopping is both cheap and convenient.","online stores/services/retailers","online dating/gaming/banking","He spends hours playing online games.","The online community is a place where customers with similar interests meet to interact.","All this information is now online.","This article has an online supplement, which is accessible from the table of contents.","Online auctions at places like eBay are offering amazing discounts.","an interactive online careers service","This site offers free online advertising.","online social networking"],"opposite":"offline","synonyms":""},{"def":"connected to the internet; able to connect to the internet","examples":["You can see which of your friends are online and send them messages.","It's estimated that five billion users are now online."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["online dating","America Online"]},{"pos":"adverb","level":"A1","meanings":[{"def":"onto the internet; using the internet or other computer network","examples":["Many children would rather go online than watch television.","Many people now do their banking online.","Some people are only happy to buy products online from businesses they know.","Your tax situation is the same whether you trade online or offline.","The dictionary is available online at www.oxfordlearnersdictionaries.com.","Since the company went online at the beginning of last year, it has attracted hundreds of subscribers.","In an effort to attract more suitable applicants, she posted jobs online.","I read most of my news online nowadays.","The company has just put its catalogue online.","They met online on a dating website.","She ordered groceries online and had them delivered to the holiday venue.","Parents are worried about how much time their children spend online.","When a major retail brand comes online, it immediately sees enormous traffic."],"opposite":"","synonyms":""},{"def":"in or into operation or existence","examples":["The new system will go online this month.","More renewable energy is coming online."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]