[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/ope/open_/open__us_1.mp3","phonsUS":"/ˈəʊpən/","level":"A1","meanings":[{"def":"allowing things or people to go through; not closed or blocked","examples":["A wasp flew in the open window.","She had left the door wide open.","The castle gates swung open.","The door burst open and the children rushed in.","She held the door open for them.","In spite of the snow, the roads remained open.","The mountain pass is kept open all year.","open borders","Borders between the countries are open and passports are not required.","Taylor headed the ball into the open goal."],"opposite":"closed","synonyms":""},{"def":"with eyelids or lips apart","examples":["She had difficulty keeping her eyes open (= because she was very tired).","He was breathing through his open mouth.","She stared at him, her mouth hanging open."],"opposite":"closed","synonyms":""},{"def":"spread out; with the edges apart","examples":["The flowers are all open now.","The book lay open on the table.","She put the money into his open hand.","She flipped open Chris's diary.","She held her open palms out in front of her.","This mechanism locks the blade in the open and closed position."],"opposite":"closed","synonyms":""},{"def":"not fastened or covered, so that things can easily come out or be put in","examples":["Leave the envelope open.","The bag burst open and everything fell out.","I tried to pry open the locket.","The children ripped open the presents excitedly."],"opposite":"","synonyms":""},{"def":"not fastened","examples":["Her coat was open."],"opposite":"","synonyms":""},{"def":"not surrounded by anything; not closed in","examples":["open country/countryside (= without forests, buildings, etc.)","a city with a lot of parks and wide open spaces","driving along the open road (= part of a road in the country, where you can drive fast)","We left port and headed for the open sea.","It's very open where they live.","fairly open countryside","The city has few parks and limited public open space.","We walked to the farm across the open fields.","The boat was stranded in the open water."],"opposite":"","synonyms":""},{"def":"with no cover or roof on","examples":["an open drain","people working in the open air (= not in a building)","open to something The hall of the old house was open to the sky.","an open wound (= with no skin covering it)","They were living in a tent, cooking their meals on an open fire.","She sliced open the side of her thumb cutting up a tomato.","(North American English) an open flame"],"opposite":"","synonyms":""},{"def":"if a shop, bank, business, etc. is open, it is ready for business and will allow customers or visitors to come in","examples":["Is the museum open on Sundays?","The new store will be open in the spring.","I declare this festival open.","The bank is open for business again.","The bridge is officially open now.","We want to keep the school open.","Some of the supermarkets stay open all night.","The exhibition is open from January until March."],"opposite":"closed","synonyms":""},{"def":"if a competition, meeting, etc. is open, anyone can enter, attend it, etc.","examples":["an open debate/championship/scholarship","She was tried in open court (= the public could go and listen to the trial).","The debate was thrown open to the audience.","The views of the public will be sought at a series of open meetings across Britain.","The concept of universal open access to university courses for all is of great importance to the government.","They will provide an open forum for the community to participate in the design sessions."],"opposite":"","synonyms":""},{"def":"if a competition, building, etc. is open to particular people, those people can enter it","examples":["The competition is open to young people under the age of 18.","The house is not open to the public.","The car park is only open to residents.","The advice service is open to all members.","The canal is open to walkers and cyclers.","The events are open to all.","The castle is open to visitors."],"opposite":"closed","synonyms":""},{"def":"to be available and ready to use","examples":["Is the offer still open?","I want to keep my Swiss bank account open.","open to somebody What options are open to us?","My advice is to keep your options open.","We have kept the door open for future discussions."],"opposite":"closed","synonyms":""},{"def":"if a phone line or other channel of communication is open, it is ready to take calls, receive requests, etc.","examples":["Lines are open 8 am to 7 pm weekdays.","It is important to keep communication channels open.","Nominations are now open for this year's Design Awards.","Lines are now open and viewers can vote by calling this number.","Entries are open for the Film Competition from 21 April to 31 May."],"opposite":"closed","synonyms":""},{"def":"likely to suffer something such as criticism, injury, etc.","examples":["open to something The system is open to abuse.","He has laid himself wide open to political attack.","Kasparov had left his bishop open (= not protected, in a game of chess)."],"opposite":"","synonyms":""},{"def":"known to everyone; not kept hidden","examples":["an open quarrel","We need more open government, starting with a Freedom of Information Act.","their open display of affection","His eyes showed open admiration as he looked at her.","One more border skirmish could lead to open war."],"opposite":"","synonyms":""},{"def":"honest; not keeping thoughts and feelings hidden","examples":["a frank and open discussion","open with somebody She was always open with her parents.","open about something He was quite open about his reasons for leaving.","Thank you for being so honest with me.","To be frank with you, I think your son has little chance of passing the exam.","You’ll have to get used to his direct manner.","He was quite open about his reasons for leaving.","She was outspoken in her criticism of the plan.","I don’t think you’re being straight with me.","She has a reputation for blunt speaking.","a(n) honest/​frank admission of guilt.","I’m a very open person.","The council has promised to create a more open and transparent process.","I don't think you've been completely open with me.","She's very open about her mistakes.","I am a very open person and get along with most people.","We will try to resolve any complaint you make in a fair and open manner.","a free and open society","They will help you if you are open and honest with them.","They're very open about the crimes they've committed in the past."],"opposite":"","synonyms":"honest"},{"def":"willing to listen to and think about new ideas","examples":["He was in an open frame of mind.","open to something They are very open to new ideas.","I'm open to suggestions for what you would like to do in our classes."],"opposite":"","synonyms":""},{"def":"not yet finally decided or settled","examples":["The race is still wide open (= anyone could win).","Which route is better remains an open question (= it is not decided).","In an interview try to ask open questions (= to which the answer is not just ‘yes’ or ‘no’)."],"opposite":"","synonyms":""},{"def":"allowing something; making something possible","examples":["The price is not open to negotiation.","Some phrases in the contract are open to interpretation.","What she means precisely is open to debate.","Jury decisions are sometimes open to question.","The firm could leave itself open to the accusation that it failed to act.","They have laid themselves open to the charge of being one-sided.","All donations to political parties should be open to public scrutiny."],"opposite":"","synonyms":""},{"def":"that does not have to be used on a particular day","examples":["I have an open ticket, so I can travel any day I like.","I didn't know how long I would be staying so I bought an open return."],"opposite":"","synonyms":""},{"def":"with wide spaces between the threads","examples":["an open weave"],"opposite":"","synonyms":""},{"def":"produced with the tongue in the lowest possible position","examples":[],"opposite":"","synonyms":""},{"def":"if something is an open secret, many people know about it, although it is supposed to be a secret","examples":[],"opposite":"","synonyms":""},{"def":"to open suddenly or violently; to make something open in this way","examples":["The door burst open.","Firefighters burst the door open and rescued them."],"opposite":"","synonyms":""},{"def":"(to provide) the means of getting or reaching something; (to create) the opportunity for something","examples":["The agreement will open the door to increased international trade.","Our courses are the door to success in English."],"opposite":"","synonyms":""},{"def":"to be willing to listen to or accept new ideas or suggestions","examples":["Try to keep an open mind until you've heard all the facts."],"opposite":"","synonyms":""},{"def":"to listen or look out for somebody/something that you might hear or see","examples":[],"opposite":"","synonyms":""},{"def":"to look for somebody/something while you are doing other things","examples":["Police have asked residents to keep an eye out for anything suspicious.","I walked around the store, keeping an eye out for bargains."],"opposite":"","synonyms":""},{"def":"to avoid making a decision now so that you still have a choice in the future","examples":["At the moment I'm keeping my options open and applying for as many different jobs as possible."],"opposite":"","synonyms":""},{"def":"available to buy without any limits","examples":[],"opposite":"","synonyms":""},{"def":"if you describe somebody or their life as an open book, you mean that you can easily understand them and know everything about them","examples":[],"opposite":"","synonyms":""},{"def":"an invitation to somebody to visit you at any time","examples":[],"opposite":"","synonyms":""},{"def":"if something is an open invitation to criminals, etc., it encourages them to commit a crime by making it easier","examples":["Leaving your camera on the seat in the car is an open invitation to thieves."],"opposite":"","synonyms":""},{"def":"fully aware of the possible problems or results of a particular course of action","examples":["I went into this with my eyes open so I guess I only have myself to blame."],"opposite":"","synonyms":""},{"def":"if you welcome somebody with open arms, you are extremely happy and pleased to see them","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be an open secret","def":"if something is an open secret, many people know about it, although it is supposed to be a secret","examples":[]},{"idiom":"burst open | burst something open","def":"to open suddenly or violently; to make something open in this way","examples":["The door burst open.","Firefighters burst the door open and rescued them."]},{"idiom":"(open) the door to something","def":"(to provide) the means of getting or reaching something; (to create) the opportunity for something","examples":["The agreement will open the door to increased international trade.","Our courses are the door to success in English."]},{"idiom":"have/keep an open mind (about/on something)","def":"to be willing to listen to or accept new ideas or suggestions","examples":["Try to keep an open mind until you've heard all the facts."]},{"idiom":"keep your ears/eyes open (for somebody/something)","def":"to listen or look out for somebody/something that you might hear or see","examples":[]},{"idiom":"keep an eye open/out (for somebody/something)","def":"to look for somebody/something while you are doing other things","examples":["Police have asked residents to keep an eye out for anything suspicious.","I walked around the store, keeping an eye out for bargains."]},{"idiom":"keep/leave your options open","def":"to avoid making a decision now so that you still have a choice in the future","examples":["At the moment I'm keeping my options open and applying for as many different jobs as possible."]},{"idiom":"on the open market","def":"available to buy without any limits","examples":[]},{"idiom":"an open book","def":"if you describe somebody or their life as an open book, you mean that you can easily understand them and know everything about them","examples":[]},{"idiom":"an open invitation (to somebody)","def":"an invitation to somebody to visit you at any time","examples":["Leaving your camera on the seat in the car is an open invitation to thieves."]},{"idiom":"with your eyes open","def":"fully aware of the possible problems or results of a particular course of action","examples":["I went into this with my eyes open so I guess I only have myself to blame."]},{"idiom":"with open arms","def":"if you welcome somebody with open arms, you are extremely happy and pleased to see them","examples":[]}],"phrasal":[],"related":["Open","open-air","open bar","open day","open-jaw","open mic","open out","open-pit","open-top","open up","open door","open line","open into","open onto"]},{"pos":"verb","level":"A1","meanings":[{"def":"to move a door, window, lid, etc. into a position that is no longer closed; to get into this position","examples":["Mr Chen opened the car door for his wife.","She opened all the windows wide to let some fresh air in.","He opened the lid of the piano.","Do you have a key that opens this gate?","The door opened and Alan walked in.","The doors of the bus open automatically.","When he opened the door of the wardrobe he found her hiding inside.","Nobody ever opens the door to the attic.","The train stops and the driver opens the doors.","Police told the driver to open the boot.","'Open this door!' he shouted.","I opened the front door and there stood Carl.","She opened the fridge door and looked inside.","Can we open a window please?","The gates open to let water out.","He was surprised when the elevator doors opened to see Gill standing there.","The door opens and the light comes on.","The window opens from the top.","The windows won't open.","The hatch opens and closes like this."],"opposite":"close","synonyms":""},{"def":"to remove or undo the top, cover, etc. of a container or package in order to see or get what is inside","examples":["Shall I open another bottle?","He opened the letter and read it.","She opened her bag and took out her passport.","Go on then, open the box.","I can't open this jar.","A customs official ordered him to open the suitcase.","Fred opened it gingerly and peered inside.","This is for you--you can open it later.","Someone had already opened the envelope.","He actually opens and reads his own fan mail.","She showed me how to open a bottle of champagne.","She opened her purse and took out a £20 note.","It appeared that the package had been opened.","The cupboard was full of opened jars going mouldy."],"opposite":"","synonyms":""},{"def":"if you open your eyes or your eyes open, you move your eyelids upwards so that you can see","examples":["When I opened my eyes a nurse was standing over me.","Her eyes opened and she smiled.","She couldn't open her eyes or respond.","The patient is able to open and close his eyes.","He opened one eye and then went back to sleep.","You can open your eyes now.","Witnesses saw him lying on the floor and saw his eyes open.","His eyes suddenly opened and he saw me.","Her eyes opened wider.","The cat purrs and its eyes open and close slowly."],"opposite":"close","synonyms":""},{"def":"if you open your mouth or your mouth opens, you move your lips, for example in order to speak","examples":["He hardly ever opens his mouth (= speaks).","I opened my mouth to call for help.","Her mouth opened but no sound came out.","I opened my mouth to say something, but thought better of it.","The dentist told me to open my mouth wide.","When she opens her mouth, everybody listens.","He barely even opened his mouth to defend himself.","Every time I open my mouth, I get into trouble.","The moment she opens her mouth people can tell she's from Glasgow.","Everything was fine until you opened your mouth.","People ought to think twice before opening their lips.","She opened her lips to sing.","Is the baby yawning, or simply opening and closing its mouth?","His mouth opened in astonishment.","Her mouth opened in a scream.","The fish's mouth opens and closes.","The creature's mouth opened very wide."],"opposite":"","synonyms":""},{"def":"to turn the cover or the pages of a book, newspaper, etc. so that it is no longer closed","examples":["Open your books at page 25.","When you open the pages of a magazine you are assailed by images of perfection.","The students sat down and opened their books.","I don't think he's ever opened a history book.","She opened the book at a picture of an elephant.","I opened my script to page 28.","You can't open a newspaper without seeing his name.","She opened her diary and made a note.","When I got home I opened the phone directory and looked him up.","He never even opened the instruction manual.","I do wish you would open a dictionary once in a while.","People opening the obituary pages in the local newspaper got a surprise.","I felt I understood the character from the moment I opened the page.","As soon as I opened the cover of this book, I was hooked.","She couldn't wait to get her library books home, open the covers and start to read.","I opened the test booklet and read the first question.","He would open his bible at a random page and read a verse."],"opposite":"close","synonyms":""},{"def":"to start a computer program or file so that you can use it on the screen; to become available on a computer screen","examples":["Open the camera app and tap ‘Options’.","to open a file/page/window/tab","The page opens in a new tab.","You can open the dictionary from the keyboard.","I can open our home page with a single tap.","If an employee opens an infected file, all the computers on the network could be locked.","You can open the file in a browser or copy the URL to your clipboard.","An email is like a letter in that it can be opened and read at any time.","Open a new tab on the spreadsheet.","Open the page in a new tab.","The web page asks you to open the document in Word.","Explorer defaults to this page every time you open a new window.","You don't have to open a separate app to edit the images.","Every time the app opens it asks for a PIN.","Start the app, and a document opens.","Your programs will open faster and your battery will last longer.","The contact's file opens in a separate window."],"opposite":"","synonyms":""},{"def":"to spread out or unfold; to spread something out or unfold it","examples":["What if the parachute doesn't open?","The flowers are starting to open.","open something Open the map on the table.","He opened his arms wide to embrace her.","The bird opens its wings and flies away.","Opening an umbrella indoors is said to bring bad luck.","The ladies opened their fans.","The plant opens its trumpet-shaped flowers during May.","A January thaw might trick the plant into thinking spring has arrived and cause it to open some blooms.","She opened her hand and I saw she was holding a coin.","He opens his shirt to reveal his chest hair.","When he opens the piece of cloth, a large gold nugget is inside.","This weekend the blossoms opened on the vines.","Soon the buds will open.","The cherry blossom trees will open in March.","She couldn't get her umbrella to open."],"opposite":"","synonyms":""},{"def":"to make it possible for people, cars, goods, etc. to pass through a place","examples":["open something When did the country open its borders?","The road will be opened again in a few hours after police have cleared it.","open something to something The bridge was opened to traffic in March 2017.","The agreement basically opened the borders between our two countries.","The Montenegrin President decided to open the frontier with Albania.","This week melting snow has opened the pass.","Two lanes that were closed on the M25 near Junction 9 have now been opened again.","The airline recently opened a new route from Australia to Los Angeles.","The collapse of the bridge, which had only been opened 19 months, shocked everyone.","The Trans-Siberian Railroad opened vast frontiers to development in the late 19th century.","The group advocates opening wetlands to development."],"opposite":"close","synonyms":""},{"def":"to start business for the day; to start business for the first time","examples":["What time does the bank open?","A theme park opened on the same site.","The store opens for business on Friday.","open something The company opened its doors for business a month ago.","His dream was to open a restaurant.","We just opened an office in Dallas.","Small shops are worried they'll be put out of business when the supermarket opens.","The town hopes to attract many more visitors when the convention center opens.","The museum is due to open next year.","The hotel opens for the season in March.","The library doesn't open until 9:30.","The shops open late on Thursdays.","I got to the ticket office before it opened.","She arrives early to open the restaurant.","Coffee bars are opening new branches everywhere.","The company recently opened a branch in Brussels.","Sam opened an art store in Manhattan.","She opened her own clothes shop.","They're opening a day care center.","He decided to open a gym but it was a failure.","Last year the school opened a new sixth form.","There was a debate about whether shops should open on Sunday."],"opposite":"close","synonyms":""},{"def":"to be ready for people to go to","examples":["The new hospital opens on July 1st.","When does the play open?","The building opened to the public in 2019.","The festival opens on Monday September 13.","The Annual General Meeting opens at 1pm on March 15th.","The exhibition opens this weekend with a private view.","The musical, which was a huge hit on Broadway, opens in the West End this spring.","The day the show opened at the National Gallery, there were queues around the block.","When the movie first opened it got great reviews.","The movie opened simultaneously in theaters across America.","When does the fishing season open?","the newly opened gallery of Western decorative art"],"opposite":"close","synonyms":""},{"def":"to start an activity or event; to begin using or doing something","examples":["You need just one pound to open an account with us.","Who is going to open the conference?","The police have opened an investigation into the death.","Troops opened fire on (= started shooting at) the crowd.","Sanches opened the scoring (= scored the first goal or point).","open something with something There will open the new season with a performance of ‘Carmen’.","Do you mind if I sit here?","Hello, is this seat taken?","May I join you? Can I get you a coffee?","Lovely weather we’re having!/Can you believe this rain/​wind/​cold/​sunshine?","Excuse me, could I ask you a question?","Shall we make a start? I think it's almost three o'clock.","Shall we get started? I'd like to introduce our speaker.","I think everyone's here, so I'd like to welcome you to this conference.","When does the class start?","When does the concert begin?","The discussion started off mildly enough.","Tom will kick off with a few comments.","The festival kicks off on Monday, September 13.","The meeting is scheduled to commence at noon.","The story opens with a murder.","The coroner has beeen informed of the accident and he will be opening an inquest.","The auctioneer opened the bidding at $4 million.","His grandmother opened a savings account for him.","A gunman opened fire, killing five people and wounding twelve.","The session will be opened by the director of policy.","“Stem Dance Theatre” from Bangalore opened the festival.","Opening the concert, comedian Lenny Henry addressed the crowd.","The West Indies team opened the tournament with a spectacular win against South Africa.","Grey opened the meeting with a brief account of the history of the project.","She opens her set with one of her best-known hits."],"opposite":"","synonyms":"start"},{"def":"to start in a particular way; to make something start in a particular way","examples":["How does the play open?","open with something The story opens with a murder.","He opened with a version of Elvis's ‘Can't Help Falling in Love’.","open on something The film opens on a close-up of her face.","open something with something I opened the story with Viola because I wanted the reader to ‘meet’ everybody through her eyes.","The movie opens with a voiceover.","Each chapter opens with a quotation.","Many writers struggle to find the perfect sentence to open their novel.","The series opens with a shocking scene.","The sixth season of his talk show opened with a live broadcast.","Our story opens on a dark night at sea.","The film opens on a troop of marching soldiers.","The scene opens on a sunny breakfast table.","We open on an empty hall. It appears to be an old railway waiting room.","The story opens in a late-19th century American village called Covington."],"opposite":"","synonyms":""},{"def":"to perform a ceremony showing that a building can start being used","examples":["The Queen officially opened the bridge in March.","The bridge was opened by the Queen.","People gathered to watch the Prime Minister officially open a new national exhibition centre.","The arts centre will be opened by the mayor.","The building was formally opened by Professor Gregory Walsh, the University's Vice-Chancellor.","Nelson Mandela gave a speech here when he opened the Robben Island Museum.","He plays a washed-up celebrity who makes a little bit of money opening supermarkets."],"opposite":"","synonyms":""},{"def":"to make it possible to reach, have, use or do something","examples":["This decision opens the possibility of a fresh election.","open something for somebody/something The bus pass has opened a new world for me.","Computer modelling opened new avenues for research.","open something to somebody/something The country opened its markets to the rest of the world for the first time.","He wants trade deals to open new markets for US goods.","to open the priesthood to women","to open the school to girls","a new law intended to open government jobs to people previously excluded"],"opposite":"","synonyms":""},{"def":"it begins to rain heavily","examples":["All at once the heavens opened and everyone rushed for cover."],"opposite":"","synonyms":""},{"def":"to provide opportunities for somebody to do something and be successful","examples":[],"opposite":"","synonyms":""},{"def":"to realize or make somebody realize the truth about something","examples":["Travelling really opens your eyes to other cultures."],"opposite":"","synonyms":""},{"def":"to become or make somebody aware of new ideas or experiences","examples":["He’s eager to open the minds of his audience to different kinds of music."],"opposite":"","synonyms":""},{"def":"to make it possible for somebody to do something or for something to happen","examples":["The agreement could open the way for the country to pay off its debts."],"opposite":"","synonyms":""},{"def":"to tell somebody all your problems, feelings, etc.","examples":["Finally, he broke down in tears and poured out his heart to her."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the heavens open","def":"it begins to rain heavily","examples":["All at once the heavens opened and everyone rushed for cover."]},{"idiom":"open doors for somebody","def":"to provide opportunities for somebody to do something and be successful","examples":[]},{"idiom":"open your/somebody’s eyes (to something)","def":"to realize or make somebody realize the truth about something","examples":["Travelling really opens your eyes to other cultures."]},{"idiom":"open your/somebody’s mind to something","def":"to become or make somebody aware of new ideas or experiences","examples":["He’s eager to open the minds of his audience to different kinds of music."]},{"idiom":"open the way for somebody/something (to do something)","def":"to make it possible for somebody to do something or for something to happen","examples":["The agreement could open the way for the country to pay off its debts."]},{"idiom":"pour out/open your heart to somebody","def":"to tell somebody all your problems, feelings, etc.","examples":["Finally, he broke down in tears and poured out his heart to her."]}],"phrasal":["open into","open onto","open out","open up"],"related":[]},{"pos":"noun","level":"","meanings":[{"def":"outdoors; the countryside","examples":["in the open Children need to play out in the open."],"opposite":"","synonyms":""},{"def":"not hidden or secret","examples":["Government officials do not want these comments in the open.","They intend to bring their complaints out into the open."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]