[{"pos":"","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/ope/opera/operation_desert_shield_1_us_1.mp3","phonsUS":"/ˌɑːpəreɪʃn ˌdezərt ˈʃiːld/","level":"","meanings":[{"def":"the name used for the military operation in which international armed forces, including British and US troops, were sent to protect Saudi Arabia after Iraq attacked Kuwait in 1990. The operation developed into the Gulf War.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/ope/opera/operation_desert_storm_1_us_1.mp3","phonsUS":"/ˌɑːpəreɪʃn ˌdezərt ˈstɔːrm/","level":"","meanings":[{"def":"the name used for the military operation in which international armed forces, including British and US troops, attacked Iraq in the Gulf War. It began on 16 January 1991 and lasted 100 days.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/ope/opera/operation__us_2.mp3","phonsUS":"/ˌɑːpəˈreɪʃn/","level":"B1","meanings":[{"def":"the process of cutting open a part of a person’s body in order to remove or repair a damaged part","examples":["Will I need to have an operation?","He underwent a three-hour heart operation.","operation to do something He had an operation to remove a growth.","operation on somebody/something (to do something) an operation on her lung to remove a tumour","operation for something Doctors performed an emergency operation for appendicitis last night.","We met the surgeon who performed the operation.","Robots can perform surgical operations on humans.","She came through the operation very well.","a delicate eye operation","an operation for a kidney problem","In 1942, she underwent an operation for a brain tumor.","She had to have an operation on her knee to help her walk again.","The player needed another operation on his injured knee.","Following two major operations for duodenal cancer, he was confined to bed or a wheelchair.","He is fit and well despite a major heart operation two years ago.","He was concerned about the effect of cancelled operations on patients who had waited a long time for surgery."],"opposite":"","synonyms":""},{"def":"an organized activity that involves several people","examples":["Weather conditions were too bad to mount a rescue operation.","The authorities launched a massive security operation in the city.","It was a covert government operation sanctioned by the President himself.","operation against somebody/something The police have launched a major operation against drug suppliers.","the UN peacekeeping operations","A huge rescue operation was launched after two divers were reported missing.","An ambitious clean-up operation followed the oil spill.","The countries have conducted joint anti-terrorist operations.","They were caught as a result of a surveillance operation.","The council said funds will be available for relief operations.","A criminal gang is thought to be behind the operation.","This was a lengthy and complicated operation, which drew on all the specialist skills of our officers.","It was a tricky operation to get all the barrels safely down on to the road.","For anybody to move 380 tons of material, that would be quite an operation."],"opposite":"","synonyms":""},{"def":"a business or company, usually one that involves many parts","examples":["a huge multinational operation","He runs a successful dairy operation.","The venture will be set up as a 70%–30% joint operation.","Network Computing Inc. plans to open a UK operation in Britain next year.","They could not pledge long-term commitment to the Scottish manufacturing operation.","It's difficult for smaller independent operations to compete.","Today the co-op is a highly successful operation with a growing membership.","I have no desire to expand my operation.","By his mid-teens he was overseeing a local drug operation that brought in over $5 000 a day.","The magazine was set up and funded as a joint operation by British Intelligence and the CIA."],"opposite":"","synonyms":""},{"def":"the activity or work done in a company, or in an area of business or industry","examples":["The firm is looking to expand its operations overseas.","The company announced it would cease operations.","The directors are not involved in day-to-day operations of the business.","The airline has appointed a new director of flight operations.","restrictions placed on business operations","One of the aims of the merger was to develop joint investment banking operations.","The company commenced new mining operations in Zambia in 2013.","The company decided to eliminate its unprofitable manufacturing operations.","software tools for planning, distribution, order management, and retail operations","Many companies are transferring manufacturing operations to lower-cost countries.","She was executive vice president of business operations.","The company applied for a federal permit to expand its operations.","David Thicke will oversee operations at the new warehouse.","The business was forced to suspend operations due to water damage.","The Financial Services Authority ordered the bank to suspend some operations for six months.","The plant resumed operations after a two-week closure.","They will continue operations as separate companies.","The company's trading operations relied heavily on complicated transactions.","The publisher will continue its web operations.","It is understood that the new hedge fund has not commenced operations, but it is raising funds for investments.","Retailers look for ways to streamline their operations and improve efficiency.","The hurricane disrupted operations at refineries along the Gulf Coast.","Many small businesses finance their operations by credit card."],"opposite":"","synonyms":""},{"def":"an act performed by a machine, especially a computer","examples":["The whole operation is performed in less than three seconds.","Use the new Smart Feature Manager to extract multiple features in a single operation.","One of our application servers currently requires 3 passwords just for one simple operation.","The application is designed to perform advanced file search operations on your computer.","People can apply for benefits and perform other operations from their home computers.","The staff didn't seem to know how to perform simple operations at the till.","The hire cost for equipment is estimated according to the average number of times a particular operation is performed.","To continue normal operations, both of the two firewalls must agree conditions are safe.","Docking stations allow the laptop to be detached with a single operation.","The phone boasts the very latest chip which delivers exceptional operation times."],"opposite":"","synonyms":""},{"def":"the way that parts of a machine or a system work; the process of making something work","examples":["Regular servicing guarantees the smooth operation of the engine.","Operation of the device is extremely simple.","Competition is central to the operation of markets.","The machine can get very hot during operation.","Serious injuries can result from unsafe operation of this vehicle.","As a student he did intensive research into the design and operation of fusion reactors.","We found this ventilation device best with regards to ease of maintenance and operation.","A touch screen can greatly simplify day-to-day operation of these complex devices.","a long-lasting lamp with an operation time of up to 6 000 hours","The law can and should constrain the operation of the free market.","measures to improve the operation of the linked exchange rate system"],"opposite":"","synonyms":""},{"def":"the action of functioning; the fact of being used or active or having an effect","examples":["The factory will cease operation at the end of the year.","in operation The system has been in operation for six months.","Temporary traffic controls are in operation on New Road.","into operation The new rules come into operation from next week.","It's time to put our plan into operation.","the only reactor in full operation","the smooth day-to-day operation of the department","To reduce the target would disrupt the operation of money market mutual funds.","This is an example of the operation of the economic laws of supply and demand."],"opposite":"","synonyms":""},{"def":"military activity","examples":["joint military/combat operations","US forces conducted ground and air operations.","He was the officer in charge of operations.","UN troops supervised the relief operations."],"opposite":"","synonyms":""},{"def":"a process in which a number or quantity is changed by adding, multiplying, etc.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]