[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/opi/opini/opinion__us_5.mp3","phonsUS":"/əˈpɪnjən/","level":"A1","meanings":[{"def":"your feelings or thoughts about somebody/something, rather than a fact","examples":["He has very strong political opinions.","opinion about something/somebody We were invited to give our opinions about how the work should be done.","opinion of somebody/something I've recently changed my opinion of her.","opinion on something You will have the chance to voice your opinions on the matter.","opinion about somebody/something We all have opinions about what is wrong with the process.","opinion that… The chairman expressed the opinion that job losses were inevitable.","I formed the opinion that he was not to be trusted.","(formal) It is our opinion that he should resign.","in my opinion In my personal opinion, it's a very sound investment.","If you want my opinion, I think you'd be crazy not to accept.","(ironic or humorous) In my humble opinion, you were wrong.","He writes an opinion piece in the ‘New York Times’.","In my opinion, everyone should have some understanding of science.","Everyone should, in my opinion, have some understanding of science.","It seems to me that many people in this country have a poor understanding of science.","This is, in my view, the result of a failure of the scientific community to get its message across.","Another reason why so many people have such a poor understanding of science is, I believe, the lack of adequate funding for science in schools.","Smith argues that science is separate from culture. My own view is that science belongs with literature, art, philosophy and religion as an integral part of our culture.","In this writer’s opinion, the more the public know about science, the less they will fear and distrust it.","Photography is, according to Vidal, the art form of untalented people.","For Vidal, photography is the art form of untalented people.","His view is that photography is not art but merely the mechanical reproduction of images.","Smith takes the view that photography is both an art and a science.","In Brown’s view, photography should be treated as a legitimate art in its own right.","James is of the opinion that a good painter can always be a good photographer if they so decide.","Emerson believed that a photograph should only reflect what the human eye can see.","I would say it’s OK in the city, but not in the country. What do you think?","My feeling is that we could improve our performance. Do you agree with that?","What would you say if we waited another month?","What about you? Do you cycle?","Which place do you think is more dangerous?","The traffic’s going faster there, isn't it?/don't you think?","Would you say that traffic's going faster there?","So this would be a better option, right?","He asked me for my opinion of the course.","I don't share your opinion of his ability.","I don't trust her, if you want my honest opinion.","I've only met her briefly and I haven't really had the chance to form an opinion.","People have differing opinions on the subject.","Most people have very negative opinions towards him.","She is one of the few critics with a dissenting opinion on the film.","Only about 20% of Italians have a favourable opinion of the candidate.","Views expressed in this column do not reflect the opinions of my employer.","a city guide based on the informed opinions of locals","I'm just stating my opinion and you can disagree if you want.","I respect your opinion but I'm going to go with my original choice.","Thank you for your feedback. We value your opinion.","a platform for people to share their opinions","Opinions are mixed regarding genetically-modified food.","Opinions differ as to when this wine should be drunk.","The meeting will give people the chance to voice their opinions on the matter.","I didn't ask for your opinion!","These are all just subjective opinions.","I think you should keep your opinions to yourself.","a regular opinion column"],"opposite":"","synonyms":""},{"def":"the beliefs or views of a group of people","examples":["legal/medical/political opinion (= the beliefs of people working in the legal, etc. profession)","There is a difference of opinion (= people disagree) as to the merits of the plan.","Opinion is divided (= people disagree) on the issue.","to split/polarize opinion","to sway/shape/influence opinion","Popular opinion is shifting in favour of change.","There is a wide body of opinion that supports this proposal.","Which is the better is a matter of opinion (= people have different opinions about it).","opinion among somebody Opinion among fans is mixed, but most approve the new direction.","Contrary to general opinion, not all of Hitchcock's movies were great.","The majority opinion in this country is that gay marriage is acceptable.","They are purposely misleading the public in a desperate attempt to sway opinion.","We have learned how a simple message can shape popular opinion.","He believes there has been a shift in opinion towards legalizing the drug.","His status as a sports idol could influence local opinion about his innocence.","She is aware that her new book will split opinion.","The film has divided opinion: people either love it or hate it.","The decision to cast him as the new James Bond polarized opinion.","UN resolutions are not legally binding, but they do reflect world opinion.","The survey is intended to gauge consumer opinion about pricing.","There is no consensus opinion on the matter.","Opinion among doctors is that the medication is safe.","Prevailing local opinion is against the new road proposals.","The country's government appears disdainful of world opinion.","This view is supported by a growing body of professional opinion.","Medical opinion differs as to whether the condition has any psychological causes."],"opposite":"","synonyms":""},{"def":"advice from a professional person","examples":["The couple sought the opinions of other doctors who confirmed the diagnosis.","Get an expert opinion before you invest.","I'd like a second opinion (= advice from another person) before I make a decision.","They called in a psychologist to give an independent opinion.","I think we need to get a legal opinion on whether we can proceed.","This statement should in no way be construed as a legal opinion.","After seeking opinions from three different specialists, she chose to have surgery.","In a dissenting opinion, Justice Ruth Corder argued that the court was overstepping its bounds.","The department asked the Board of Ethics to issue an advisory opinion.","The International Courts produced an advisory opinion against the wall.","Judge Leonard Sack wrote a concurring opinion, agreeing that the defendant's civil rights were infringed.","She was asked whether, in her expert opinion, the child was at risk."],"opposite":"","synonyms":""},{"def":"to believe or think that…","examples":["We are strongly of the opinion that great caution should be exercised in dealing with this matter."],"opposite":"","synonyms":""},{"def":"your opinion that is the result of careful thought","examples":["It is my considered opinion that you are wrong."],"opposite":"","synonyms":""},{"def":"to think that somebody/something is good, bad, etc.","examples":["The boss has a very high opinion of her."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be of the opinion that…","def":"to believe or think that…","examples":["We are strongly of the opinion that great caution should be exercised in dealing with this matter."]},{"idiom":"your considered opinion","def":"your opinion that is the result of careful thought","examples":["It is my considered opinion that you are wrong."]},{"idiom":"have a good, bad, high, low, etc. opinion of somebody/something","def":"to think that somebody/something is good, bad, etc.","examples":["The boss has a very high opinion of her."]}],"phrasal":[],"related":["opinion poll","public opinion","opinion polls","in my opinion","in my humble opinion","your considered opinion"]}]