[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/opp/oppos/opposition__us_2.mp3","phonsUS":"/ˌɑːpəˈzɪʃn/","level":"B2","meanings":[{"def":"the act of strongly disagreeing with somebody/something, especially with the aim of preventing something from happening","examples":["Opposition came primarily from students.","opposition to somebody/something Delegates expressed strong opposition to the plans.","He spent five years in prison for his opposition to the regime.","They mounted an effective opposition to the bill.","There was widespread opposition to the war.","The army met with fierce opposition in every town.","The proposal faced stiff opposition.","We cannot back down at the first sign of opposition.","opposition forces (= people who are arguing, fighting, etc. with another group)","Greens are prominent among opposition groups in several countries.","Many people have voiced their opposition to these proposals.","The Democrats are unlikely to drop their opposition to his nomination.","The authorities succeeded despite bitter opposition from teachers.","We will brook no opposition to the strategy."],"opposite":"","synonyms":""},{"def":"the act of competing against somebody in a contest","examples":["She won against determined opposition from last year's champion.","He is expected to face stiff opposition from countryman, Scott, who has also emerged as a leading contender."],"opposite":"","synonyms":""},{"def":"the people you are competing against in business, a competition, a game, etc.","examples":["He's gone to work for the opposition.","The opposition is/are mounting a strong challenge to our business.","Liverpool couldn't match the opposition in the final and lost 2–0."],"opposite":"","synonyms":""},{"def":"the main political party that is opposed to the government; the political parties that are in a parliament but are not part of the government","examples":["the leader of the Opposition","Opposition MPs/politicians/parties","the Opposition spokesman on education","They received support from the main opposition leaders.","He has led the political opposition for the past decade."],"opposite":"","synonyms":""},{"def":"the state of being as different as possible; two things that are as different as possible","examples":["the opposition between good and evil","His poetry is full of oppositions and contrasts."],"opposite":"","synonyms":""},{"def":"forming part of a parliament but not part of the government","examples":["They returned to power after six years in opposition.","The Conservative Party is now in opposition."],"opposite":"","synonyms":""},{"def":"disagreeing strongly with somebody/something, especially with the aim of preventing something from happening","examples":["We found ourselves in opposition to several colleagues on this issue.","Protest marches were held in opposition to the proposed law."],"opposite":"","synonyms":""},{"def":"contrasting two people or things that are very different","examples":["Leisure is often defined in opposition to work."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in opposition","def":"forming part of a parliament but not part of the government","examples":["They returned to power after six years in opposition.","The Conservative Party is now in opposition."]},{"idiom":"in opposition to somebody/something","def":"disagreeing strongly with somebody/something, especially with the aim of preventing something from happening","examples":["We found ourselves in opposition to several colleagues on this issue.","Protest marches were held in opposition to the proposed law.","Leisure is often defined in opposition to work."]}],"phrasal":[],"related":["Leader of the Opposition"]}]