[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/opt/optio/option__us_2.mp3","phonsUS":"/ˈɑːpʃn/","level":"A2","meanings":[{"def":"something that you can choose to have or do; the freedom to choose what you do","examples":["As I see it, we have two options…","There are various options open to you.","to explore/consider/look at all your options","We are currently studying all the options available.","Going to college was not an option for me.","Selling the house was our only option.","Waiting a year may be your best option.","We felt this was the most viable option.","I had no option but to (= I had to) ask him to leave.","option of doing something Students have the option of studying abroad in their second year.","option of something He was given one month’s imprisonment without the option of a fine.","option to do something A savings plan that gives you the option to vary your monthly payments.","This particular model comes with a wide range of options (= things you can choose to have when buying something but which you will have to pay extra for).","In most cases, I would go for the cheaper option.","Farming is not an attractive career option for many young people.","The poor villagers are left with no option but to risk their lives.","Your doctor will discuss treatment options with you.","Failure is not an option.","As I see it, we have two options…","Students have the option of studying abroad in their second year.","If I had the choice, I would stop working tomorrow.","There is a wide range of choices open to you.","You can be paid in cash weekly or by cheque monthly: those are the two alternatives.","We need to explore a wide range of possibilities.","The possibilities are endless.","Deciding on your best option is not easy.","Resignation was her only option.","You have the option of taking your holiday early.","You have the option of working full-time or part-time."],"opposite":"","synonyms":"option"},{"def":"a subject that a student can choose to study, but that they do not have to do","examples":["The course offers options in design and computing."],"opposite":"","synonyms":""},{"def":"the right to buy or sell something at some time in the future","examples":["share options (= the right to buy shares in a company)","option on something We have an option on the house.","He has promised me first option on his car (= the opportunity to buy it before anyone else).","option to do something The property is for rent with an option to buy at any time.","They exercised an option on their lease to buy the building.","She took up an option in her contract to buy three million shares."],"opposite":"","synonyms":""},{"def":"one of the choices you can make when using a computer program","examples":["Choose the ‘Cut’ option from the Edit menu.","Look at the on-screen menu and select the ‘File’ option."],"opposite":"","synonyms":""},{"def":"to avoid making a decision now so that you still have a choice in the future","examples":["At the moment I'm keeping my options open and applying for as many different jobs as possible."],"opposite":"","synonyms":""},{"def":"a choice that is thought to be easier because it involves less effort, difficulty, etc.","examples":["They are anxious that the new course should not be seen as a soft option.","He decided to take the easy option and give them what they wanted.","She could have taken the easy option and left."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"keep/leave your options open","def":"to avoid making a decision now so that you still have a choice in the future","examples":["At the moment I'm keeping my options open and applying for as many different jobs as possible."]},{"idiom":"a/an/the soft/easy option","def":"a choice that is thought to be easier because it involves less effort, difficulty, etc.","examples":["They are anxious that the new course should not be seen as a soft option.","He decided to take the easy option and give them what they wanted.","She could have taken the easy option and left."]}],"phrasal":[],"related":["share option","stock option","nuclear option","an/a/the easy/soft option"]},{"pos":"verb","level":"","meanings":[{"def":"to buy or sell the right to own or use something at some time in the future","examples":["The novel has been optioned for the screen by his production company.","We've optioned all her books, including future ones.","This is his first script to be optioned by a film company."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]