[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/ord/order/order__us_2.mp3","phonsUS":"/ˈɔːrdər/","level":"A1","meanings":[{"def":"the way in which people or things are placed or arranged in relation to each other","examples":["in… order The names are listed in alphabetical order.","The winning scores, in reverse order, are as follows.","in the/a… order Put the words in the correct order.","Let's take the problems in a different order.","in order of something arranged in order of preference/importance/priority","out of order Scenes in films are often shot out of order.","Make sure you get the chronological order right.","The information is given in no particular order.","All the procedures must be done in the correct order.","The exhibition is organized in chronological order based on the date of purchase for each item.","Ingredients are listed in order, by weight.","He noted that the three photographs were arranged in the wrong order.","The episodes were shown out of order.","I think you should change the order of these paragraphs.","I would reverse the order of ‘mainly’ and ‘depends’ in that sentence.","Inscriptions usually follow a conventional order, beginning with the subject's name or title.","The winners were announced in reverse order.","The top grossing movies of the year are ranked in descending order.","Here are the top ten performing stocks, in ascending order.","Add the ingredients in this order: butter, flour, egg, milk.","My priorities were work, friends and family—in that order.","The paragraphs are not in a logical order.","We will deal with cases in order of importance.","We got the children to arrange wooden blocks in order of size.","The questions are arranged in order of difficulty.","Please rank the following items in order of preference.","The side-effects are listed below in order of frequency of occurrence.","The cast is credited in order of appearance.","Here are some possible scenarios, in order of probability."],"opposite":"","synonyms":""},{"def":"the state of being carefully and neatly arranged","examples":["in/into order It was time she put her life in order.","The house had been kept in good order.","Get your ideas into some sort of order before beginning to write.","It is one of the functions of art to bring order out of chaos.","He needs help to get his life back in order.","My notes are in order.","She attempted to impose some order on the chaos of her files.","The accounts were in perfect order.","The complete lack of order in the household made him feel uncomfortable.","Maintain all equipment in good order.","He was the first editor to try and bring Shakespeare's manuscripts into order.","It is said that architecture, like music, depends on discipline and order.","Her work explores the tension between light and dark, order and chaos.","the splendid order and harmony of classical buildings","She brought order to his troubled existence.","Marriage is an attempt to confer a semblance of order on our otherwise chaotic lives.","People look for order and meaning in their experiences.","The School seems to have offered him the order, stability and discipline previously missing from his life.","She has imposed some order and professional procedures on the managerial chaos.","It can take many months for victims of these scams to restore their financial lives to order.","She was a fantastic organiser who could bring any chaos to order.","Meditation can be a way to restore order to your thoughts."],"opposite":"disorder","synonyms":""},{"def":"the state that exists when people obey laws, rules or authority","examples":["The army has been sent to maintain order in the capital.","The police struggled to restore order.","in order Some teachers find it difficult to keep their classes in order.","to order He soon brought the rebels to order.","The film was banned as a potential threat to public order.","The job of the guards is to maintain peace and order at all times without using physical violence.","He said that the continued presence of military forces was necessary to maintain order and security.","She was denied entry as ‘a threat to the order and security of the country’.","Some surveys appear to show that people prefer authoritarian order to democracy.","His landscapes are celebrations of abundance, fertility, and social order.","The prison service claimed that it was not in the interests of good order within the prison to permit prisoners to conduct campaigns through the media.","The city was once more restored to lawful order.","He believed that Ireland would only be brought to order after military conquest.","He said his was the only party that could put the country in order.","He expressed firm support for the police efforts to keep the city in order."],"opposite":"","synonyms":""},{"def":"a request for food or drinks in a restaurant, bar, etc.","examples":["The waiter came to take their orders.","You place your order at the front counter.","a food/drink(s) order","order for something an order for steak and fries","May I take your order?","The restaurant stops taking orders at 8:30.","Once the waiter had taken my order for a smoked chicken salad, I sat back to enjoy my drink.","He summoned a waiter and placed an order for the table.","Before we placed our order I asked if the restaurant had sea bass.","The waitress wrote down my order.","They lost our food order and we had to wait over an hour.","Are there any more orders for drinks?","First you give the customers menus and take their drink orders.","The waitress came for our drinks order."],"opposite":"","synonyms":""},{"def":"food or drinks that you ask for in a restaurant, bar, etc.","examples":["The waiter brought my order.","They brought the wrong order.","This isn't my order. I asked for steak.","Shall we have an order of spring rolls on the side?","I decided to ask for an extra order of rice.","Our order took over an hour to arrive.","Collect takeaway food orders from this window.","We delivered 5 000 food orders over the weekend."],"opposite":"","synonyms":""},{"def":"a request to make or supply goods","examples":["order for something I would like to place an order for ten copies of this book.","Complete the online order form.","order fulfilment/processing","on order The machine parts are still on order (= they have been ordered but have not yet been received).","to order These items can be made to order (= produced especially for a particular customer).","The company won a $10 million order for oil-drilling equipment.","We received a purchase order for 125 bicycles.","We have a firm order for ten cases of wine.","We're trying to fill all the back orders.","He already had thousands of advance orders for the book.","We are now accepting orders for the new model.","My copy is already on order.","We're offering 10% off orders over £75.","Free delivery for orders worth £30 or more.","Please fill in the order form and send it to the above address.","To subscribe to the print version, use this order form.","You will receive an order confirmation by email.","The system handles order processing and inventory control.","We use scanning technology to improve product tracking and order fulfillment.","The company has an order backlog of $160 million."],"opposite":"","synonyms":""},{"def":"goods supplied in response to a particular order that somebody has placed","examples":["The stationery order has arrived."],"opposite":"","synonyms":""},{"def":"something that somebody is told to do by somebody in authority","examples":["Dogs can be trained to obey orders.","Their defence was that they were only following orders.","to disobey/defy orders","order from somebody She takes orders only from the president.","order to do something The general gave the order to advance.","order for somebody/something to do something He issued orders for the work to begin.","under orders (to do something) I'm under orders not to let anyone in.","by (the) order of somebody/something Interest rates can be controlled by order of the central bank.","(informal) No sugar for me—doctor's orders.","He was court-martialled for disobeying an order.","The judge asked him why he had chosen to defy the order of the court.","The government has issued an order to round up street criminals.","Officials continued to conduct business as usual, issuing orders on behalf of the dead king.","She faces five years in prison if she breaches the order granted yesterday by Blackpool magistrates.","The sisters were under strict orders from their father not to leave the house.","He is under orders from the court to comply with psychiatric treatment.","Under the Prime Minister's orders, he had not spoken to the press.","He opened his sealed orders.","The captain gave the order to fire.","The colonel had given orders for the spy's execution.","The local civilians don't take orders from the military.","The ship was to set sail at once, on the admiral's orders.","I don't take orders from you!","She just stood there barking orders at everyone.","He barked out orders as he left.","The judge made an order for the costs to be paid.","The wife was granted an order for payment of child support.","The creditors obtained an order from the court giving them right of entry.","The book was the subject of a banning order by the Censorship Board.","By order of the King, I place you under arrest.","By the order of the coroner, an autopsy was carried out."],"opposite":"","synonyms":""},{"def":"a formal written instruction for somebody to be paid money or to do something","examples":["You can cash the order at any post office."],"opposite":"","synonyms":""},{"def":"the way that a society, the world, etc. is arranged, with its system of rules and customs","examples":["a change in the political and social order","the natural order of things","He was seen as a threat to the established order.","A new world order seems to be emerging.","The old order in Europe saw rapid change in the late 1980s."],"opposite":"","synonyms":""},{"def":"a social class","examples":["the lower orders"],"opposite":"","synonyms":""},{"def":"a group into which animals, plants, etc. that have similar characteristics are divided, smaller than a class and larger than a family","examples":["the order of primates"],"opposite":"","synonyms":""},{"def":"a group of people living in a religious community, especially monks or nuns","examples":["religious orders","the Benedictine order"],"opposite":"","synonyms":""},{"def":"a group of people who have been given a special honour by a queen, king, president, etc.","examples":["The Order of the Garter is an ancient order of chivalry."],"opposite":"","synonyms":""},{"def":"a badge or ribbon worn by members of an order who have been given a special honour","examples":[],"opposite":"","synonyms":""},{"def":"a secret society whose members meet for special ceremonies","examples":["the Ancient Order of Druids"],"opposite":"","synonyms":""},{"def":"to be/become a priest","examples":[],"opposite":"","synonyms":""},{"def":"to be very difficult to do","examples":[],"opposite":"","synonyms":""},{"def":"to order somebody to obey the formal rules of a meeting; to start a formal meeting","examples":["The argument continued until the chairman called them both to order.","The president brought the meeting to order at 9.15 a.m.","As the meeting was brought to order, the councillor immediately stood and began to protest."],"opposite":"","synonyms":""},{"def":"to ask people in a meeting to be quiet so that the meeting can start or continue","examples":[],"opposite":"","synonyms":""},{"def":"to be ordered to leave a place, a job, etc.","examples":[],"opposite":"","synonyms":""},{"def":"to order somebody to leave a place, their job, etc.","examples":[],"opposite":"","synonyms":""},{"def":"that can be used because it is all correct and legal","examples":["Is your work permit in order?"],"opposite":"","synonyms":""},{"def":"as it should be","examples":["Is everything in order, sir?"],"opposite":"","synonyms":""},{"def":"if something is in order, it is a suitable thing to do or say on a particular occasion","examples":["I think a drink would be in order.","Would it be in order for us to examine the manuscript?"],"opposite":"","synonyms":""},{"def":"allowed according to the rules of a meeting, etc.","examples":["Is it in order to speak now?"],"opposite":"","synonyms":""},{"def":"so that something can happen","examples":["All those concerned must work together in order that agreement can be reached on this issue."],"opposite":"","synonyms":""},{"def":"with the purpose or intention of doing or achieving something","examples":["She arrived early in order to get a good seat.","In order to get a complete picture, further information is needed.","This diagram illustrates the process of paper-making./This diagram shows how paper is made.","First/First of all, logs are delivered to a paper mill, where the bark is removed and the wood is cut into small chips.","Next/Second, the wood chips are pulped, either using chemicals or in a pulping machine.","Pulping breaks down the internal structure of the wood and enables/allows the natural oils to be removed.","Once/After the wood has been pulped, the pulp is bleached in order to remove impurities. /…is bleached so that impurities can be removed.","The next stage is to feed the pulp into the paper machine, where it is mixed with water and then poured onto a wire conveyor belt.","As the pulp travels along the conveyor belt, the water drains away. This causes the solid material to sink to the bottom, forming a layer of paper.","At this point the new paper is still wet, so it is passed between large heated rollers, which press out the remaining water and simultaneously dry the paper/…dry the paper at the same time.","The final stage is to wind the paper onto large rolls./Finally, the paper is wound onto large rolls."],"opposite":"","synonyms":""},{"def":"working well","examples":["The engine is now in perfect working order."],"opposite":"","synonyms":""},{"def":"quickly and without trouble","examples":[],"opposite":"","synonyms":""},{"def":"a situation in which people obey the law and behave in a peaceful way","examples":["The government struggled to maintain law and order.","After the riots, the military was brought in to restore law and order.","They claim to be the party of law and order.","Martial law was imposed to prevent the breakdown of law and order."],"opposite":"","synonyms":""},{"def":"of a high quality or degree; of the highest quality or greatest degree","examples":["The job requires diplomatic skills of a high order.","She was a snob of the first order."],"opposite":"","synonyms":""},{"def":"about something; approximately something","examples":["She earns something in the order of £80 000 a year."],"opposite":"","synonyms":""},{"def":"common, popular or suitable at a particular time or for a particular occasion","examples":["Pessimism seems to be the order of the day."],"opposite":"","synonyms":""},{"def":"used by the person in charge of a formal meeting or debate to remind people to obey the rules of the meeting","examples":[],"opposite":"","synonyms":""},{"def":"not working correctly","examples":["The phone is out of order."],"opposite":"","synonyms":""},{"def":"not arranged correctly or neatly","examples":["I checked the files and some of the papers were out of order."],"opposite":"","synonyms":""},{"def":"behaving in a way that is not acceptable or right","examples":["You were well out of order taking it without asking.","He accepted that he'd been out of order."],"opposite":"","synonyms":""},{"def":"not allowed by the rules of a formal meeting or debate","examples":["His objection was ruled out of order."],"opposite":"","synonyms":""},{"def":"the order of importance in relation to one another among the members of a group","examples":["New Zealand is at the top of the pecking order of rugby nations.","to be first in the pecking order"],"opposite":"","synonyms":""},{"def":"to organize your own business or improve your own behaviour before you try to criticize somebody else","examples":[],"opposite":"","synonyms":""},{"def":"waiting for a signal to start a race","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be in/take (holy) orders","def":"to be/become a priest","examples":[]},{"idiom":"be a tall order","def":"to be very difficult to do","examples":[]},{"idiom":"call/bring somebody/something to order","def":"to order somebody to obey the formal rules of a meeting; to start a formal meeting","examples":["The argument continued until the chairman called them both to order.","The president brought the meeting to order at 9.15 a.m.","As the meeting was brought to order, the councillor immediately stood and began to protest."]},{"idiom":"call somebody/something to order","def":"to ask people in a meeting to be quiet so that the meeting can start or continue","examples":[]},{"idiom":"get your marching orders","def":"to be ordered to leave a place, a job, etc.","examples":[]},{"idiom":"give somebody their marching orders","def":"to order somebody to leave a place, their job, etc.","examples":[]},{"idiom":"in order","def":"that can be used because it is all correct and legal","examples":["Is your work permit in order?","Is everything in order, sir?","I think a drink would be in order.","Would it be in order for us to examine the manuscript?"]},{"idiom":"in order (to do something)","def":"allowed according to the rules of a meeting, etc.","examples":["Is it in order to speak now?"]},{"idiom":"in order that","def":"so that something can happen","examples":["All those concerned must work together in order that agreement can be reached on this issue."]},{"idiom":"in order to do something","def":"with the purpose or intention of doing or achieving something","examples":["She arrived early in order to get a good seat.","In order to get a complete picture, further information is needed.","This diagram illustrates the process of paper-making./This diagram shows how paper is made.","First/First of all, logs are delivered to a paper mill, where the bark is removed and the wood is cut into small chips.","Next/Second, the wood chips are pulped, either using chemicals or in a pulping machine.","Pulping breaks down the internal structure of the wood and enables/allows the natural oils to be removed.","Once/After the wood has been pulped, the pulp is bleached in order to remove impurities. /…is bleached so that impurities can be removed.","The next stage is to feed the pulp into the paper machine, where it is mixed with water and then poured onto a wire conveyor belt.","As the pulp travels along the conveyor belt, the water drains away. This causes the solid material to sink to the bottom, forming a layer of paper.","At this point the new paper is still wet, so it is passed between large heated rollers, which press out the remaining water and simultaneously dry the paper/…dry the paper at the same time.","The final stage is to wind the paper onto large rolls./Finally, the paper is wound onto large rolls."]},{"idiom":"in running/working order","def":"working well","examples":["The engine is now in perfect working order."]},{"idiom":"in short order","def":"quickly and without trouble","examples":[]},{"idiom":"law and order","def":"a situation in which people obey the law and behave in a peaceful way","examples":["The government struggled to maintain law and order.","After the riots, the military was brought in to restore law and order.","They claim to be the party of law and order.","Martial law was imposed to prevent the breakdown of law and order."]},{"idiom":"of a high order | of the highest/first order","def":"of a high quality or degree; of the highest quality or greatest degree","examples":["The job requires diplomatic skills of a high order.","She was a snob of the first order."]},{"idiom":"of/in the order of something","def":"about something; approximately something","examples":["She earns something in the order of £80 000 a year."]},{"idiom":"the order of the day","def":"common, popular or suitable at a particular time or for a particular occasion","examples":["Pessimism seems to be the order of the day."]},{"idiom":"Order! Order!","def":"used by the person in charge of a formal meeting or debate to remind people to obey the rules of the meeting","examples":[]},{"idiom":"out of order","def":"not working correctly","examples":["The phone is out of order.","I checked the files and some of the papers were out of order.","You were well out of order taking it without asking.","He accepted that he'd been out of order.","His objection was ruled out of order."]},{"idiom":"a/the pecking order","def":"the order of importance in relation to one another among the members of a group","examples":["New Zealand is at the top of the pecking order of rugby nations.","to be first in the pecking order"]},{"idiom":"put/set your (own) house in order","def":"to organize your own business or improve your own behaviour before you try to criticize somebody else","examples":[]},{"idiom":"under starter’s orders","def":"waiting for a signal to start a race","examples":[]}],"phrasal":[],"related":["gag order","pre-order","back order","back-order","court order","mail order","money order","order about","order book","order form","Order Paper","side order","gagging order","order around","postal order","running order","banker’s order","community order"]},{"pos":"verb","level":"A1","meanings":[{"def":"to ask for something to eat or drink in a restaurant, bar, etc.","examples":["order (something) I ordered a coffee and a sandwich.","Have you ordered yet?","The waiter asked if we were ready to order.","order somebody/yourself something He ordered himself a pot of tea.","order for somebody Will you order for me while I make a phone call?","order something for somebody We ordered extra fries for the kids.","He ordered off the children's menu.","Please order at the counter before finding a table.","We ordered almost an hour ago and the food still hasn't come.","You have to be 21 in this state to order a drink at the bar.","They ordered water with their meal.","Can I order something off the lunch menu?","It was the first time I had ordered wine in a restaurant.","She sat down and ordered a drink.","He ordered a bottle of champagne.","Order two main courses and get a dessert for free.","I've ordered you a coffee, I hope that's OK.","Why don't you order yourself an ice cream?","Shall I order some water for the table?","I let her order for me, as she knows more about Chinese food."],"opposite":"","synonyms":""},{"def":"to ask for goods to be made or supplied; to ask for a service to be provided","examples":["order (something) To order a copy of the report, visit our website.","You will be given a reference number when you order.","order something from somebody/something These boots can be ordered direct from the manufacturer.","order from somebody/something She sometimes orders from catalogues.","order somebody/yourself something Shall I order you a taxi?","order something for somebody Shall I order a taxi for you?","To get a good deal, you have to order in bulk.","All our products can be ordered online.","I'd like to order some books, please.","You can order the parts off the internet.","You should be able to order venison from your butcher.","The kilts had to be specially ordered from a wedding hire company.","Shall we just stay at home and order pizza?","We ordered some Indian food to be delivered.","Why don't you order yourself a new phone?","We ordered our son a bike for his birthday.","I ordered prints of the picture for all my family.","It can be ordered through the publisher's website.","Ordering on the internet is quick and easy.","Items should be available the day after you order.","You can order or download a copy of the document here.","When customers order goods they expect to have them delivered in three to five days."],"opposite":"","synonyms":""},{"def":"to use your position of authority to tell somebody to do something or say that something must happen","examples":["order somebody to do something The officer ordered them to fire.","The company was ordered to pay compensation to its former employees.","order somebody + adv./prep. They were ordered out of the class for fighting.","He ordered them off his property.","order something The government has ordered an investigation into the accident.","Your doctor may order an MRI scan.","The judge ordered a retrial.","order that… The court ordered that a psychological report be prepared.","(British English also) The court ordered that a psychological report should be prepared.","order (somebody) + speech ‘Sit down and be quiet,’ she ordered.","The company was ordered to pay compensation to its former employee.","‘Come here at once!’ she ordered.","He was told to sit down and wait.","Don’t tell me what to do!","The letter instructed him to report to headquarters immediately.","The judge directed the jury to return a verdict of not guilty.","He commanded his men to retreat.","Could you wait here for a moment, please?","Would you come through now?/You can come through now.","Can you send it up to my room, please?","Just sign here for me, please.","I need you to finish the report by Friday.","Everyone has to use the side entrance this week.","You have to sign these reports before submitting them.","Magistrates ordered him to serve 160 hours community service.","For years, doctors have been ordering expectant mothers to eat plenty of folic acid.","They were ordered by the court to enter arbitration.","He was ordered to appear before a grand jury.","The commander of the tank company was ordered by the Task Force commander to destroy the tunnels.","The authorities have ordered surveys to be carried out.","The council ordered the construction to stop.","All foreign journalists have been ordered out of the country.","He was ordered off for bringing down the striker.","The Judge ordered them into her private chambers.","Troops were ordered back from the area.","The British government then ordered a major inquiry into the affair.","The court must order his release if the detention is not lawful.","The general had personally ordered the raid.","Two officers were accused of ordering the killing of 120 civilians.","The pilot ordered an evacuation.","The military operation was ordered by the president himself.","The doctor ordered more diagnostic tests.","tests which are routinely ordered on patients","In Japan, authorities have ordered mandatory labeling for some foods containing GM ingredients.","A court may order that a dog be destroyed if it has rushed at persons, animals, or vehicles.","They ordered that for every tree cut down two more be planted.","‘Get into groups of four!’ he ordered us."],"opposite":"","synonyms":"order"},{"def":"to organize or arrange something","examples":["The list is ordered alphabetically.","I need time to order my thoughts.","Different senses of a word are ordered according to frequency.","The books are ordered alphabetically by title.","In the periodic table elements are ordered according to atomic number."],"opposite":"","synonyms":""},{"def":"exactly what somebody wants or needs","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"just what the doctor ordered","def":"exactly what somebody wants or needs","examples":[]}],"phrasal":["order about","order around"],"related":[]}]