[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/org/organ/organize__us_2.mp3","phonsUS":"/ˈɔːrɡənaɪz/","level":"A2","meanings":[{"def":"to make all the arrangements for something to happen or be provided","examples":["He helped to organize various events.","to organize a conference/meeting","to organize a protest/demonstration/rally","to organize a workshop/seminar","I'll invite people if you can organize food and drinks.","She's on the organizing committee for the tournament.","They organized the festival jointly with the French cultural service.","She entered a competition organized by the BNA (Royal Dutch Institute of Architects).","They organized a large-scale publicity campaign to promote the series.","The aim of these clubs was to organize parties where their members could dance.","We also organize guided tours and informal talks by curators and critics.","We're organizing the evening around a Japanese theme.","I've organized a lot of school trips.","The exhibition was jointly organized by the Met in New York and the National Gallery in London.","It was difficult to organize a meeting at a time that suited everyone.","The president's aides quickly organized a press conference.","The series of lectures was organized by a group of city economists.","The students are organizing a protest march.","They were accused of organizing and financing terrorist activities.","The mayor organized and led the relief efforts.","The premises are available for use by groups wishing to organise fundraising activities.","Farmers attended an open day organised by the Institute for Grassland and Environmental Research."],"opposite":"","synonyms":""},{"def":"to arrange something or the parts of something into a particular order or structure","examples":["Modern computers can organize large amounts of data very quickly.","You should try and organize your time better.","We do not fully understand how the brain is organized.","organize something + adv./prep. The complex is organized around a central courtyard.","We need to organize the work according to the availability and skills of each volunteer.","The overall organizing principle of the book is chronological order.","He has lots of good ideas, but he needs help organizing them.","Take a minute to organize your thoughts.","We need to organize our day.","The book is organized into five parts.","We have 24 divisions organized into six regional groups.","Chapters are organized according to a theme.","The exhibition is organized along a timeline.","We create weekly delivery schedules organized by postcode.","A firm needs to organize its activities in such a way that it makes a profit.","The database is organized hierarchically.","The footage has to be organized in a compelling way.","Educators can use technology to organize content in meaningful ways."],"opposite":"","synonyms":""},{"def":"to plan your/somebody’s work and activities in an efficient way","examples":["I'm sure you don't need me to organize you."],"opposite":"","synonyms":""},{"def":"to form a group of people with a shared aim, especially a union or political party","examples":["the right of workers to organize themselves into unions","Campaigns brought women together to organize."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]