[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/ori/origi/original__us_3.mp3","phonsUS":"/əˈrɪdʒənl/","level":"A2","meanings":[{"def":"existing at the beginning of a particular period, process or activity","examples":["The room still has many of its original features.","I think you should go back to your original plan.","At the end of the lease, the land will be returned to the original owner.","the original stage version of ‘A Streetcar Named Desire’","The original intention was to record about 80 speakers, divided equally between males and females.","The clock was restored to its original condition.","The original findings conflict with more recent findings.","There have been many new findings since the original report."],"opposite":"","synonyms":""},{"def":"new and interesting in a way that is different from anything that has existed before; able to produce new and interesting ideas","examples":["an original idea","That's not a very original suggestion.","an original thinker","the product of a highly original mind","It's a taut, fast-moving detective story with strikingly original characters.","I don't think this is a truly original idea.","He believes that he is creating something wholly original.","They are tackling the problem in a completely original way.","The film is challenging and highly original."],"opposite":"","synonyms":""},{"def":"painted, written, etc. by the artist rather than copied","examples":["an original painting by local artist Graham Tovey","The original manuscript has been lost.","Only original documents (= not photocopies) will be accepted as proof of status."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["original sin","in the original"]},{"pos":"noun","level":"B1","meanings":[{"def":"a document, work of art, etc. produced for the first time, from which copies are later made","examples":["This painting is a copy; the original is in Madrid.","Send out the photocopies and keep the original.","At that price, you could have bought an original!","He copied paintings of famous artists and passed them off as originals.","Can you think of a movie remake that was better than the original?","The film stays romantically faithful to the 1963 original.","Most items in the collection are exact copies of the originals."],"opposite":"","synonyms":""},{"def":"a person who thinks, behaves, dresses, etc. in an unusual way","examples":["Mark Twain was a true original who possibly did more for American literature than any other writer."],"opposite":"","synonyms":""},{"def":"in the language in which a book, etc. was first written, before being translated","examples":["I studied Italian so that I would be able to read Dante in the original.","to read Tolstoy in the original"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in the original","def":"in the language in which a book, etc. was first written, before being translated","examples":["I studied Italian so that I would be able to read Dante in the original.","to read Tolstoy in the original"]}],"phrasal":[],"related":[]}]