[{"pos":"adverb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/oth/other/otherwise__us_2.mp3","phonsUS":"/ˈʌðərwaɪz/","level":"B2","meanings":[{"def":"used to state what the result would be if something did not happen or if the situation were different","examples":["My parents lent me the money. Otherwise, I couldn't have afforded the trip.","Shut the window, otherwise it'll get too cold in here.","We're committed to the project. We wouldn't be here otherwise.","The project had given children opportunities they would never otherwise have had."],"opposite":"","synonyms":""},{"def":"apart from that","examples":["There was some music playing upstairs. Otherwise the house was silent.","He was slightly bruised but otherwise unhurt."],"opposite":"","synonyms":""},{"def":"in a different way to the way mentioned; differently","examples":["Bismarck, otherwise known as ‘the Iron Chancellor’","It is not permitted to sell or otherwise distribute copies of past examination papers.","You know what this is about. Why pretend otherwise (= that you do not)?","He maintains that he is innocent, but the police are looking for evidence and witnesses to prove otherwise.","Even when common sense would suggest otherwise, optimism reigns.","I wanted to see him but he was otherwise engaged (= doing something else).","Unless otherwise stated, all translations in the text are my own."],"opposite":"","synonyms":""},{"def":"to have information or evidence that the opposite is true","examples":["You'd think this was a high-budget film if you didn't know otherwise."],"opposite":"","synonyms":""},{"def":"used to refer to something that is different from or the opposite of what has just been mentioned","examples":["It was necessary to discover the truth or otherwise of these statements.","We insure against all damage, accidental or otherwise."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"know different/otherwise","def":"to have information or evidence that the opposite is true","examples":["You'd think this was a high-budget film if you didn't know otherwise."]},{"idiom":"or otherwise","def":"used to refer to something that is different from or the opposite of what has just been mentioned","examples":["It was necessary to discover the truth or otherwise of these statements.","We insure against all damage, accidental or otherwise."]}],"phrasal":[],"related":["know different/otherwise"]}]