[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/out/outco/outcome__us_1.mp3","phonsUS":"/ˈaʊtkʌm/","level":"B2","meanings":[{"def":"the result or effect of an action or event","examples":["The likely outcome is a compromise.","Their strategy produced the desired outcome.","We are confident of a positive outcome.","a favourable/successful outcome","We await the outcome of the election.","It is difficult to predict the final outcome.","to influence/decide/determine the outcome","Four possible outcomes have been identified.","patient/clinical/treatment/health outcomes","regardless of the outcome These costs are payable regardless of the outcome of the case.","pending the outcome (formal) He has been suspended from his post pending the outcome of a police investigation.","She died as a result of her injuries.","This book is the result of 25 years of research.","This decision could have serious consequences for the industry.","We are waiting to hear the final outcome of the negotiations.","We are waiting to hear the final outcome of the negotiations.","We are confident of a favourable outcome.","We may not know the outcome of the meeting until tomorrow.","We use a computer model to predict the outcome of different scenarios.","The figures suggest patient outcomes at the hospital are not as good as they should be.","The bank has to carry a large reserve to protect against an adverse outcome.","The inevitable outcome is confusion.","This was a very satisfactory outcome from my point of view.","Whatever my feelings, it doesn't change the outcome.","There is no proven record of cinema influencing the outcome of an American election.","How an individual reacted to an experience appeared to determine the eventual outcome.","No single factor decided the outcome of the battle.","Try different variables to see how each one affects the outcome.","We measured clinical outcomes of placebos.","Good housing improves health outcomes.","Improved maternal diet leads to improved pregnancy outcomes.","We need to develop public policies to help children with a higher risk of negative outcomes.","It is important to evaluate the learning outcomes of the course.","We have developed tools for measuring research outcomes."],"opposite":"","synonyms":"result"}],"idioms":[],"phrasal":[],"related":[]}]