[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/out/outli/outline__us_2.mp3","phonsUS":"/ˈaʊtlaɪn/","level":"B2","meanings":[{"def":"to give a description of the main facts or points involved in something","examples":["outline something He outlined his plan to leave St. Petersburg.","The briefing document outlined her family history and background.","The cause of the crash is clearly outlined in the report.","outline something to somebody We outlined our proposals to the committee.","outline what, how, etc… Let me outline what I have in mind.","outline something + adv./prep. For the reasons outlined above, unemployment is likely to remain high.","The Government is expected to outline its strategy at talks today.","He roughly outlined the plot of the opera.","She outlined to Mona the details of her mother's relationship.","Let me briefly outline what we are trying to achieve."],"opposite":"","synonyms":""},{"def":"to show or mark the outer edge of something","examples":["outlined against something They saw the huge building outlined against the sky."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"B2","meanings":[{"def":"a description of the main facts or points involved in something","examples":["outline of something This is a brief outline of the events.","The broad outlines of Marley's life are relatively well known.","You should draw up a plan or outline for the essay.","You need a written outline of the story.","in outline The book describes in outline the main findings of the research.","an outline agreement/proposal/plan","Here's the plan in outline.","The government proposed the outlines of a new tax."],"opposite":"","synonyms":""},{"def":"the line that goes around the edge of something, showing its main shape but not the details","examples":["outline of something At last we could see the dim outline of an island.","I traced the outline of his face with my finger.","an outline map/sketch","in outline She drew the figures in outline.","All four islands are more or less oval in outline.","The children made an outline of their hands.","to cut around the outline","The students added the position of the main cities to an outline map of the country."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]