[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/out/outra/outrage__us_1.mp3","phonsUS":"/ˈaʊtreɪdʒ/","level":"C1","meanings":[{"def":"a strong feeling of shock and anger","examples":["The judge's remarks caused public outrage.","She was filled with a strong sense of moral outrage.","Environmentalists have expressed outrage at the ruling.","Media reports sparked international outrage.","Much of the outrage was directed at foreign nationals.","She was trembling with outrage.","Shopkeepers voiced their outrage at the new tax.","The announcement provoked howls of outrage.","The guests all shouted in outrage.","The news was greeted with outrage."],"opposite":"","synonyms":""},{"def":"an act or event that is violent, cruel or very wrong and that shocks people or makes them very angry","examples":["No one has yet claimed responsibility for this latest terrorist outrage.","The new law on pensions is an outrage against the elderly.","the outrages committed by the invading army"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["OutRage!"]},{"pos":"verb","level":"C1","meanings":[{"def":"to make somebody very shocked and angry","examples":["He was outraged at the way he had been treated.","I am morally outraged by their actions.","The killings have outraged the entire community."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/out/outra/outrage__1_us_1.mp3","level":"","meanings":[{"def":"a former British organization that worked for the rights of LGBT people. OutRage! started in 1990 and became well known for its use of direct action which it often combined with humour, as in the ‘Queer St Valentine's Day Carnival’. One of OutRage's best-known campaigners was the author and political activist Peter Tatchell. OutRage! closed down in 2011.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]