[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/o/owe/owe__/owe__us_1.mp3","phonsUS":"/əʊ/","level":"B2","meanings":[{"def":"to have to pay somebody for something that you have already received or return money that you have borrowed","examples":["owe somebody something She still owes her father £3 000.","(figurative) I'm still owed three days' leave.","owe something He owes more money than he can afford to pay.","Exactly how much do we owe?","owe something to somebody She still owes £3 000 to her father","The country owes billions of dollars to foreign creditors.","owe something to somebody for something Most hospitals owe money to pharmaceutical companies for medicines and equipment.","owe somebody something for something How much do I owe you for the groceries?"],"opposite":"","synonyms":""},{"def":"to feel that you ought to do something for somebody or give them something, especially because they have done something for you","examples":["owe something to somebody I owe a debt of gratitude to all my family.","You owe it to your staff to be honest with them.","I owe a duty to my family.","owe somebody something You owe me a favour!","Thanks for sticking up for me—I owe you one (= I owe you a favour).","I think you owe us an explanation.","I think we're owed an apology."],"opposite":"","synonyms":""},{"def":"to exist or be successful because of the help or influence of somebody/something","examples":["owe something to somebody/something He owes his success to hard work.","The play owes much to French tragedy.","I owe everything to him.","The town owes its existence to the minerals that lie below the mountains.","owe somebody something I owe him everything.","I knew that I owed the surgeon my life."],"opposite":"","synonyms":""},{"def":"to have to obey and support somebody who is in a position of authority or power","examples":["All serfs owed allegiance to a lord."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]