[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pag/page_/page__us_1.mp3","phonsUS":"/peɪdʒ/","level":"A1","meanings":[{"def":"one side or both sides of a sheet of paper in a book, magazine, etc.","examples":["Turn to page 64.","Someone has torn a page out of this book.","She slowly turned the pages of the album.","a blank page","the title/index page","the sports/news pages of the newspaper","the letters/opinion page","Some newspapers devoted several pages to the scandal.","on a page The photograph was on the front page of every newspaper.","on the opposite/facing/next page","over the page The address is over the page (= on the next page).","I read almost 100 pages of my book on the plane.","He skipped a few pages and carried on reading.","He wrote fifty pages in five hours.","Her eyes skimmed over the page.","Start a new page for each new chapter.","They crammed three or four images onto each page.","She seems to put her thoughts directly down on the page.","I ran my finger down the page until I found the name I was looking for.","A correction appears further down the page, in very small print.","I turned the dog-eared pages of my old address book.","Open your books at page 14.","I tried to read it, but I couldn't get past page 1.","Which page are you on?","Phyllis graced the pages of ‘Life’ magazine in 1953.","They fill their pages with celebrity gossip.","There was page after page about the royal wedding.","Photocopying is 20 pence per page.","Several pages had come loose.","She sat idly flipping through the pages of a fashion magazine.","The article continues over the page.","The crossword is on the back page.","The front page features a warning about the dangers of drugs.","The murder takes place in the opening pages of the novel.","The news dominated the pages of the local newspaper.","Write each answer on a new page."],"opposite":"","synonyms":""},{"def":"a section of data or information that can be shown on a computer screen at any one time","examples":["to visit/view a page","to load/update a page","Press F5 to refresh the page.","The page was really slow to load.","a Twitter/an Instagram page","on a page The message was posted on the company's official Facebook page.","This photo will no longer appear on your profile page.","The page is automatically updated every five minutes.","He posted the video on his official page.","She began to scroll down the page looking for the address.","Click here to print this page.","She posted the image on her Instagram page.","People left nasty comments on his fan page.","According to his Wikipedia page he was born in 1968.","Click the ‘Back’ button to return to the search results page.","My parents' internet connection takes forever to load simple pages.","The answer was so far down the page I decided to start a new thread.","You'll find links on our page to the park's opening schedules and some special discounted admission deals.","The result page will display product images, prices and direct links.","Copy and paste the URL of the page you wish to translate.","I took a screenshot of the page.","The file-sharing news site offers a slick interface and fast page load times."],"opposite":"","synonyms":""},{"def":"an important event or period of history","examples":["a glorious page of Arab history"],"opposite":"","synonyms":""},{"def":"a small boy who helps or follows a bride during a marriage ceremony","examples":[],"opposite":"","synonyms":""},{"def":"a boy or young man, usually in uniform, employed in a hotel to open doors, deliver messages for people, etc.","examples":[],"opposite":"","synonyms":""},{"def":"a student who works as an assistant to a member of the US Congress","examples":[],"opposite":"","synonyms":""},{"def":"a boy or young man who worked for a knight while training to be a knight himself","examples":[],"opposite":"","synonyms":""},{"def":"if two or more people or groups are on the same page, they agree about what they are trying to achieve","examples":["Are employers and employees on the same page when it comes to retirement benefits?","It was an effort to get us all on the same page."],"opposite":"","synonyms":""},{"def":"what is published in books, newspapers, etc.","examples":["the power of the printed word"],"opposite":"","synonyms":""},{"def":"to begin doing things in a different way and thinking in a more positive way after a period of difficulties","examples":["It’s time to turn the page and make a fresh start.","He turned the page on that chapter in his life a long time ago."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"on the same page","def":"if two or more people or groups are on the same page, they agree about what they are trying to achieve","examples":["Are employers and employees on the same page when it comes to retirement benefits?","It was an effort to get us all on the same page."]},{"idiom":"the printed word/page","def":"what is published in books, newspapers, etc.","examples":["the power of the printed word"]},{"idiom":"turn the page","def":"to begin doing things in a different way and thinking in a more positive way after a period of difficulties","examples":["It’s time to turn the page and make a fresh start.","He turned the page on that chapter in his life a long time ago."]}],"phrasal":[],"related":["web page","full-page","home page","page view","front page","front-page","page proof","page-turner","title page","landing page","page through","page-three girl","page proofs","page views","op-ed page","page-turners","page through something"]},{"pos":"verb","level":"","meanings":[{"def":"to call somebody’s name over a public address system in order to find them and give them a message","examples":["Why don't you have him paged at the airport?"],"opposite":"","synonyms":""},{"def":"to contact somebody by sending a message to their pager","examples":["Page Dr Green immediately."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["page through"],"related":[]}]