[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pai/paint/painting__us_3.mp3","phonsUS":"/ˈpeɪntɪŋ/","level":"A1","meanings":[{"def":"a picture that has been painted","examples":["a watercolour/crylic painting","painting of somebody/something Canaletto's paintings of Venice","painting by somebody an exhibition of paintings by American artists","She has also done abstract paintings and made experimental films.","Kahlo's paintings often depict her suffering.","The children were drawing pictures of their pets.","a collection of paintings by American artists","a pencil/​charcoal drawing","Vermeer’s ‘Portrait of the artist in his studio’","a self-portrait (= a painting that you do of yourself)","a Renoir print","I usually do a few very rough sketches before I start on a painting.","Degas did several paintings of ballet dancers.","He was commissioned to paint four large paintings.","an exhibition of paintings and sculptures by local artists","Her early paintings were light, expressive compositions.","The classroom walls are covered with children's paintings.","His most famous paintings hang in the Louvre.","Paintings by contemporary Aboriginal artists are displayed in the gallery.","Vanderlyn's painting represents Ariadne abandoned on the island of Naxos.","Rauch's paintings evoke memories of a bygone era.","The design is based on an original painting by Matisse.","The woman in the painting is the artist's mistress.","a fine painting in oils","The photograph looks almost like an Impressionist painting.","A Dutch landscape painting hung on the wall.","In 1912 Marc saw an exhibition of Futurist paintings in Berlin.","He commissioned history paintings from the leading painters of the day.","The little chapel is decorated with medieval wall paintings.","He began preparations for a large mural painting of the Battle of Anghiari.","The house is full of paintings and sculpture.","Recently, she sold two paintings."],"opposite":"","synonyms":"picture"},{"def":"the act or art of using paint to produce pictures","examples":["Her hobbies include music and painting.","the great British tradition of landscape painting","abstract/figurative painting","He was appointed to teach painting and drawing at the Glasgow School of Art.","He studied traditional Japanese painting at the Kano school.","He went to Europe to study painting.","When she retired she took up painting.","They dreamed of creating a uniquely Canadian type of landscape painting.","the development of 20th century abstract painting","In the 1970s he returned to figurative painting.","He gave up a career in law for portrait painting.","She discussed the relationship between painting and photography.","Tobey developed a distinctive style of painting that he called 'white writing'.","There is no recognizable Amsterdam school of painting.","18th-century treatises on the art of painting","His work became wholly abstract and he changed his painting technique.","Throughout her life, she maintained a painting style of light figures against a dark background."],"opposite":"","synonyms":""},{"def":"the act of putting paint onto the surface of objects, walls, etc.","examples":["painting and decorating","We can do the painting ourselves.","He's finished the painting, and the house looks amazing.","Find all your building, painting, carpentry, and plumbing needs on our website.","Frequent painting of infested areas will kill the beetles and prevent further damage.","I hate painting so we hired painters.","We can help with weeding, fence painting, and hedge trimming.","She does interior painting and minor household repairs."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["cave painting","face painting","oil painting","wall painting","action painting","finger-painting","genre painting","spray-painting","be no oil painting","like painting the Forth Bridge"]}]