[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pai/pain_/pain__us_1.mp3","phonsUS":"/peɪn/","level":"A2","meanings":[{"def":"the feelings that you have in your body when you have been hurt or when you are ill","examples":["a cry of pain","in pain She was clearly in a lot of pain.","He screamed in pain as he fell to his knees.","pain in something He felt a sharp pain in his knee.","chronic/acute/severe pain","patients suffering from back pain","stomach/chest/abdominal/back pains","You get more aches and pains as you get older.","The booklet contains information on pain relief during labour.","This cream should help to relieve the pain.","These pills should ease the pain.","to feel/experience/suffer pain","It's wrong to inflict pain on any animal.","I was able to learn pain management techniques.","These pills should ease the pain.","It did pain him to see his ex happily married.","The burglars got in by breaking a pane of glass in a door.","Can you feel any pain?","His face was contorted with pain as he crossed the finish line.","I have a very low threshold for pain.","If the pain persists, see your doctor.","She had a burning pain in one eye.","The pains began shortly after she started work as a gardener.","The treatments helped manage his pain.","Your doctor should be able to do something for the pain."],"opposite":"","synonyms":""},{"def":"mental or emotional difficulty","examples":["the pain of something the pain of separation","the pain of doing something It took him several years to get over the pain of losing his job.","I never meant to cause her pain.","the pleasures and pains of growing old","a life full of pain and suffering","Ellen saw the pain etched on his face when he mentioned his ex-wife's name.","For a few moments she forgot the pain he had caused her.","I could sense her pain and put my arm around her.","It was lovely to have someone there to share both the pain and the joy.","Nothing could heal the pain of her son's death.","Through her drug addiction she had inflicted a lot of pain on the family.","We hoped to spare her the pain of having to meet her attacker.","The government has to persuade the people that the economic reforms are worth the pain."],"opposite":"","synonyms":""},{"def":"a person or thing that is very annoying","examples":["She can be a real pain when she's in a bad mood.","It's a pain having to go all that way for just one meeting."],"opposite":"","synonyms":""},{"def":"used to say that you need to suffer if you want to achieve something","examples":[],"opposite":"","synonyms":""},{"def":"with the threat of having something done to you as a punishment if you do not obey","examples":["They were required to cut pollution levels, on pain of a £10 000 fine if they disobeyed."],"opposite":"","synonyms":""},{"def":"a person or thing that is very annoying","examples":["That man's a pain in the neck!"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"no pain, no gain","def":"used to say that you need to suffer if you want to achieve something","examples":[]},{"idiom":"on/under pain of something","def":"with the threat of having something done to you as a punishment if you do not obey","examples":["They were required to cut pollution levels, on pain of a £10 000 fine if they disobeyed."]},{"idiom":"a pain in the neck","def":"a person or thing that is very annoying","examples":["That man's a pain in the neck!"]}],"phrasal":[],"related":["pain point","pain barrier","pain points","pain barriers","a pain in the neck","a pain in the ass/butt","a pain in the arse/backside","no pain, no gain","a pain in the butt/ass","a pain in the backside/arse"]},{"pos":"verb","level":"","meanings":[{"def":"to cause somebody pain or make them unhappy","examples":["pain somebody She was deeply pained by the accusation.","(old use) The wound still pained him occasionally.","it pains somebody to do something It pains me to see you like this.","it pains somebody that… It pained him that she would not acknowledge him.","These pills should ease the pain.","It did pain him to see his ex happily married.","The burglars got in by breaking a pane of glass in a door."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]