[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pan/panel/panel__us_1.mp3","phonsUS":"/ˈpænl/","level":"B2","meanings":[{"def":"a square or rectangular piece of wood, glass or metal that forms part of a larger surface such as a door or wall","examples":["One of the glass panels in the front door was cracked.","wooden fence panels","The central panel depicts St George.","You need to remove the roof panel to remove the side panels."],"opposite":"","synonyms":""},{"def":"a flat board in a vehicle or on a machine where the controls and instruments are fixed","examples":["an instrument/a display panel","A red light flashed on the control panel."],"opposite":"","synonyms":""},{"def":"a piece of metal that forms part of the outer frame of a vehicle","examples":["A rear body panel needed replacing after the accident."],"opposite":"","synonyms":""},{"def":"a piece of cloth that forms part of a piece of clothing","examples":["The trousers have double thickness knee panels for extra protection."],"opposite":"","synonyms":""},{"def":"a group of specialists who give their advice or opinion about something; a group of people who discuss topics of interest on television or radio","examples":["an advisory panel","a judging panel","a panel of experts/judges","on a panel We have two politicians on tonight's panel.","a panel discussion","The budget increase was recommended by an independent panel.","She is a member of the medical advisory panel.","Raphael will head a panel to discuss the topic.","The panel concluded that there was no scientific basis for the claim.","The panel ruled that the men must remain in prison.","The panel consists of ten attorneys.","The panel voted unanimously for its approval.","The interview panel wants to find out as much as possible about each candidate's abilities.","He joins our panel of journalists.","The winners were chosen by a panel of judges.","We asked a panel of experts to review the products.","A distinguished panel of speakers considered the role of global corporations."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["panel van","flat-panel","panel game","panel show","solar panel","panel beater","jury panel","panel games","panel vans","panel truck","panel beaters"]},{"pos":"verb","level":"","meanings":[{"def":"to cover or decorate a surface with flat pieces of wood, glass, etc.","examples":["be panelled (in something) The walls were panelled in oak.","a glass-/wood-panelled door"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]