[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pan/panic/panic__us_1.mp3","phonsUS":"/ˈpænɪk/","level":"B2","meanings":[{"def":"a sudden feeling of great fear that cannot be controlled and prevents you from thinking clearly","examples":["a moment of panic","They were in a state of panic.","in panic Office workers fled in panic as the fire took hold.","There's no point getting into a panic about the exams.","a panic attack (= a condition in which you suddenly feel very anxious, causing your heart to beat faster, etc.)","a panic decision (= one that is made when you are in a state of panic)","A look of panic crossed his face.","The mere thought of flying fills me with panic.","(a) fear of flying","She showed no fear.","Her eyes were wild with terror.","I had a sudden moment of panic.","The doctor said there was no cause for alarm.","She cried out in fright.","He felt panic rising within him.","He jumped out of the car in a panic.","Her mind went blank with panic.","I felt a surge of panic when I realized my mistake.","She went into a blind panic when she couldn't find the exit.","The thought of being in charge threw him into a mild panic.","Eli was clearly in panic mode.","She still has panic attacks two years after the accident.","people suffering from depression and panic disorders"],"opposite":"","synonyms":"fear"},{"def":"a situation in which people are made to feel very anxious or frightened, causing them to act quickly and without thinking carefully","examples":["News of the losses caused (a) panic among investors.","Careful planning at this stage will help to avoid a last-minute panic.","There's no panic (= we do not need to rush), we've got plenty of time.","panic buying/selling (= the act of buying/selling things quickly and without thinking carefully because you are afraid that a particular situation will become worse)","In the ensuing panic, they lost each other.","The keys were lost during the panic over the fire alarm.","Panic buying turned the petrol shortage into a crisis.","Panic swept through the crowd."],"opposite":"","synonyms":""},{"def":"a situation in which people feel very anxious and there is a lot of confused activity, especially because there is a lot to do in a short period of time","examples":["It was panic stations when the deadline was brought forward by a week."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"panic stations","def":"a situation in which people feel very anxious and there is a lot of confused activity, especially because there is a lot to do in a short period of time","examples":["It was panic stations when the deadline was brought forward by a week."]}],"phrasal":[],"related":["panic room","panic button","panic buying","panic-stricken","panic into doing","panic rooms","panic buttons","panic somebody into doing something","press/push the panic button","push/press the panic button"]},{"pos":"verb","level":"","meanings":[{"def":"to suddenly feel frightened so that you cannot think clearly and you say or do something stupid, dangerous, etc.; to make somebody do this","examples":["I panicked when I saw smoke coming out of the engine.","panic somebody/something The gunfire panicked the horses.","He panics at the first sign of trouble.","We are beginning to panic about the wedding arrangements.","Don't panic! We need to try and stay calm."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["panic into doing"],"related":[]}]