[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pap/paper/paper__us_3.mp3","phonsUS":"/ˈpeɪpər/","level":"A1","meanings":[{"def":"the thin material that you write and draw on and that is also used for wrapping and packing things","examples":["a piece/sheet of paper","She wrote her name and address on a slip (= a small piece) of paper.","He scribbled the number on a scrap of paper.","a package wrapped in brown paper","recycled paper","Make sure you have pen and paper handy.","on/onto paper The image is copied onto paper.","He brought his lunch in a brown paper bag.","a paper cup/plate/napkin","This journal is available in paper and electronic form.","Experience is more important for this job than paper qualifications (= that exist as official documents but may not have any real value).","paper losses/profits (= that are shown in accounts but which may not exist in reality)","Fold the paper in half.","He crumpled the paper into a ball.","I screwed up the paper and threw it away.","I scribbled down his number on a scrap of paper.","He jotted ideas on bits of paper.","She did a series of sketches using soft pencil on paper.","The report is available both online and on paper.","She uses recycled materials such as old paper and cardboard.","Insulation can be made from recycled paper.","I stared at the blank paper, not knowing how to start the letter.","I've thought about what I'm going to write, but I haven't yet put pen to paper.","The essay filled seven sides of A4 paper.","There was paper strewn all over the floor.","This report is a waste of paper.","He kept a paper copy of his account information.","the advantages of paper maps over online maps","He gave me some water in a paper cup.","the introduction of paper currency in the 1690s","The bed was covered in mountains of paper money.","There were paper lanterns and party streamers hanging from the trees."],"opposite":"","synonyms":""},{"def":"a newspaper","examples":["the daily/morning paper","the local paper","Have you seen today's paper?","He sat down to read the paper.","in the paper I read about it in the paper.","She put an ad in the paper pleading for the dog's return.","The papers (= newspapers in general) soon got hold of the story.","Do you have a copy of yesterday's paper?","I just went out to buy a paper.","It was on the front page of the daily paper.","I expected to read all about it in the next day's papers.","I saw his picture in the paper.","There was an article about it in the Sunday paper.","Just because you read it in the paper doesn't mean it's true.","Inside the paper was a double-page spread on the story.","Do you take a daily paper?","She got a job on the local paper.","She was the first woman editor of a national paper.","The paper comes out every Saturday.","The paper reported that several people had seen UFOs.","The story got into the papers.","What paper do you usually read?","“This is nothing to do with us,” the paper quoted him as saying.","A New York paper published his obituary.","The paper printed the story the next day.","Her resignation made the headlines of all the morning papers.","He was desperate to keep the scandal out of the papers.","She wrote a letter to the papers."],"opposite":"","synonyms":""},{"def":"pieces of paper with writing on them, such as letters, pieces of work or private documents","examples":["His desk was covered with books and papers.","a stack/pile of papers","I found these documents among my father's papers after his death.","He increasingly confined himself to his study, surrounded by books and papers.","It's hard to work if there's a stack of papers on your desk.","She was sorting through a big pile of papers.","She was clutching her file full of papers.","He didn't leave behind much in the way of memoirs, letters, or other personal papers.","He destroyed all his personal papers relating to the period.","She had access to all of Karen Blixen's private papers.","In his private papers he recorded the news of Napoleon's death.","Papers found in the palace only confirmed suspicions about his treachery.","The poems were printed from papers found in his rooms by his housekeeper.","The archive includes papers and correspondence belonging to the late musician.","I found some papers relating to the case in his desk."],"opposite":"","synonyms":""},{"def":"official documents that prove your identity, give you permission to do something, etc.","examples":["identity papers","The couple filed divorce papers at Los Angeles court on Monday.","Teresa signed the adoption papers.","Immigration officials will ask to see your papers.","Her husband has refused to sign divorce papers.","His parents signed papers to make his aunt his legal guardian.","She changed her will but died before all the papers were signed.","Be prepared to show your identity papers at the border.","Customs agents are searching all vehicles and checking identification papers.","They are illegal immigrants and terrifed of being caught without papers.","legal papers filed in London","According to court papers, the Jones family owns the rights to the late Mr. Jones's recorded performances.","She had travel papers for herself, Kurt, and Oskar.","I just filed my nomination papers to seek a second term as mayor."],"opposite":"","synonyms":""},{"def":"a set of exam questions on a particular subject; the answers that people write to the questions","examples":["The geography paper was hard.","She spent the evening marking exam papers.","I did well on the oral but not on the written paper.","The exam papers are set by experienced teachers.","You may now turn over your papers.","You must not write on the question paper.","He sat papers in computer science and economics.","Some students took their GSCE Science paper early.","You have to pass a compulsory Irish language paper.","The multiple-choice papers are marked by computer."],"opposite":"","synonyms":""},{"def":"an academic article about a particular subject that is written by and for specialists","examples":["a recent paper in the Journal of Medicine","paper on something He has published a research paper on the topic.","a consultation/discussion paper","She was invited to give a paper (= a talk) at an international scientific congress.","Freud first mentioned this concept in his paper ‘On Narcissism’.","The paper looks at the future of primary school education.","This paper reports the results of a two-year field experiment.","This paper examines how urban sprawl is linked to increased flooding risk.","His paper explores the cultural divide that continues to exist between Quebec and the rest of Canada.","The consultation paper focused on whether payments should be linked to production.","The Council released a discussion paper entitled 'The Ethics of Patenting DNA'.","He had prepared a briefing paper for the board meeting.","According to a paper published in the Journal of Experimental Psychology, thinking and driving is a potentially lethal combination.","She has presented papers at international conferences.","She has to defend her work nearly every time she submits a paper for publication.","Some of the materials cited in this paper are no longer available online."],"opposite":"","synonyms":""},{"def":"a piece of written work done by a student","examples":["Your grade will be based on four papers and a final exam.","paper on something I'm writing a paper on ‘Macbeth’."],"opposite":"","synonyms":""},{"def":"paper that you use to cover and decorate the walls of a room","examples":["The room was damp and the paper was peeling off."],"opposite":"","synonyms":""},{"def":"having no value, especially legally, or because one of the people involved has no intention of doing what they said they would","examples":[],"opposite":"","synonyms":""},{"def":"when you put something on paper, you write it down","examples":[],"opposite":"","synonyms":""},{"def":"judged from written information only, but not proved in practice","examples":["The idea looks good on paper."],"opposite":"","synonyms":""},{"def":"to write or start to write something","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"not worth the paper it’s written/printed on","def":"having no value, especially legally, or because one of the people involved has no intention of doing what they said they would","examples":[]},{"idiom":"on paper","def":"when you put something on paper, you write it down","examples":["The idea looks good on paper."]},{"idiom":"put pen to paper","def":"to write or start to write something","examples":[]}],"phrasal":[],"related":["paper boy","wax paper","bond paper","crêpe paper","free paper","graph paper","Green Paper","Order Paper","paper clip","paper doll","paper girl","paper money","paper over","paper plate","paper round","paper shop","paper-thin","paper tiger"]},{"pos":"verb","level":"","meanings":[{"def":"to decorate the walls of a room by covering them with wallpaper","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["paper over"],"related":[]}]