[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/par/parad/parade__us_1.mp3","phonsUS":"/pəˈreɪd/","level":"B2","meanings":[{"def":"a public celebration of a special day or event, usually with bands in the streets and decorated vehicles","examples":["the Lord Mayor’s parade","St Patrick’s Day parade in New York","The parade is held every year.","Thousands of people were at the parade."],"opposite":"","synonyms":""},{"def":"a formal occasion when soldiers march or stand in lines so that they can be inspected (= looked at and approved) by their officers or other important people","examples":["a military parade","They held a parade to mark the soldiers' return.","on parade They stood as straight as soldiers on parade.","(figurative) The latest software will be on parade at the exhibition."],"opposite":"","synonyms":""},{"def":"a series of things or people","examples":["Each generation passes through a similar parade of events."],"opposite":"","synonyms":""},{"def":"a street with a row of small shops","examples":["a shopping parade"],"opposite":"","synonyms":""},{"def":"an obvious display of something, particularly in order to impress other people","examples":["Social media is a constant parade of wealth, happiness, success and vanity."],"opposite":"","synonyms":""},{"def":"to prevent somebody from enjoying an event; to cause somebody's plans to fail","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"rain on somebody’s parade","def":"to prevent somebody from enjoying an event; to cause somebody's plans to fail","examples":[]}],"phrasal":[],"related":["parade ground","identity parade","hit parade","identification parade","ticker-tape parade","Horse Guards Parade","Apprentice Boys' Parade","beauty parade","parade grounds"]},{"pos":"verb","level":"","meanings":[{"def":"to walk somewhere in a formal group of people, in order to celebrate or protest about something","examples":["The victorious team will parade through the city tomorrow morning."],"opposite":"","synonyms":""},{"def":"to walk around in a way that makes other people notice you","examples":["People were parading up and down showing off their finest clothes."],"opposite":"","synonyms":""},{"def":"to show somebody/something in public so that people can see them/it","examples":["The trophy was paraded around the stadium.","The prisoners were paraded in front of the crowd.","(figurative) He is not one to parade his achievements."],"opposite":"","synonyms":""},{"def":"to come together, or to bring soldiers together, in order to march (= walk formally) in front of other people","examples":["+ adv./prep. The crowds applauded as the guards paraded past.","parade somebody + adv./prep. The colonel paraded his men before the Queen."],"opposite":"","synonyms":""},{"def":"to pretend to be, or to make somebody/something seem to be, good or important when they are not","examples":["parade as something myth parading as fact","parade somebody/something/yourself as something He paraded himself as a loyal supporter of the party."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]