[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/par/paral/parallel__us_1.mp3","phonsUS":"/ˈpærəlel/","level":"B2","meanings":[{"def":"two or more lines that are parallel to each other are the same distance apart at every point","examples":["parallel lines","parallel to/with something The road and the canal are parallel to each other.","The lane is roughly parallel to the main road.","The road runs parallel with the coast."],"opposite":"","synonyms":""},{"def":"very similar or taking place at the same time","examples":["parallel trends","Though still a committed painter, in 1978 she launched a parallel career as a photographer.","Two poisonings have been reported recently in London and now there has been a parallel case in the Netherlands."],"opposite":"","synonyms":""},{"def":"involving several computer operations at the same time","examples":["parallel processing"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["parallel bars","parallel park","parallel port","parallel turn","parallel circuit","parallel imports","parallel ruler","parallel processing","38th parallel","forty-ninth parallel","parallel parks","parallel parked","parallel ports","parallel rulers","parallel turns","parallel circuits"]},{"pos":"adverb","level":"","meanings":[{"def":"two or more lines that run parallel to each other are the same distance apart at every point","examples":["The road and the canal run parallel to each other.","The plane flew parallel to the coast."],"opposite":"","synonyms":""},{"def":"in a way that is very similar or takes place at the same time","examples":["The team's findings run parallel to those of other researchers."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"B2","meanings":[{"def":"a person, a situation, an event, etc. that is very similar to another, especially one in a different place or time","examples":["These ideas have parallels in Freud's thought too.","This tradition has no parallel in our culture.","without parallel This is an achievement without parallel in modern times.","The move west suggests a parallel with the earlier American pioneer experience.","This weather pattern of the southern hemisphere has no parallel in the north.","We found a direct parallel in the attitudes of children in other countries."],"opposite":"","synonyms":""},{"def":"similar features","examples":["There are interesting parallels between the 1960s and the late 1990s.","It is possible to draw a parallel between (= find similar features in) their experience and ours.","Parallels do exist between the author's family and that of Francie Coffin.","She saw an obvious parallel with her sister's predicament.","A close parallel to this behaviour is found in dolphins."],"opposite":"","synonyms":""},{"def":"an imaginary line around the earth that is always the same distance from the equator; this line on a map","examples":["the 49th parallel"],"opposite":"","synonyms":""},{"def":"with and at the same time as something/somebody else","examples":["The new degree and the existing certificate courses would run in parallel.","Ann wanted to pursue her own career in parallel with her husband’s."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in parallel (with something/somebody)","def":"with and at the same time as something/somebody else","examples":["The new degree and the existing certificate courses would run in parallel.","Ann wanted to pursue her own career in parallel with her husband’s."]}],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to be similar to something; to happen at the same time as something","examples":["Their legal system parallels our own.","The rise in unemployment is paralleled by an increase in petty crime."],"opposite":"","synonyms":""},{"def":"to be as good as something","examples":["a level of achievement that has never been paralleled"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]