[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/par/paren/parent__us_1.mp3","phonsUS":"/ˈperənt/","level":"A1","meanings":[{"def":"a person’s father or mother","examples":["He's still living with his parents.","Sue and Ben have recently become parents.","It can be difficult to be a good parent.","her adoptive parents (= who have legally adopted her as their child)","It's not easy being a foster parent (= who looks after a child for a period of time without legally adopting him/her) to these children.","his biological/birth parents (= natural parents, not ones who adopt or foster)","Emma is a lone parent with two children.","More childcare options and more paid leave will improve the lives of working parents.","The study showed that children with involved parents do better at school.","They have just become the proud parents of a baby girl.","They may not be my biological parents but I consider them my real mum and dad.","Concerned parents want more information about the safety of these products.","More and more women are caring for both young children and elderly parents.","He was born in Montana to Greek immigrant parents.","They are all the children of divorced parents.","My parents' generation didn't worry about sitting their kids in front of the TV.","She spends every Christmas at her parents' house.","It's important for parents and teachers to work together."],"opposite":"","synonyms":""},{"def":"an animal or a plant which produces other animals or plants","examples":["the parent bird/tree"],"opposite":"","synonyms":""},{"def":"an organization that produces and owns or controls smaller organizations of the same type","examples":["a parent bank and its subsidiaries","The subsidiary eventually outgrew its parent company and took it over."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["co-parent","lone parent","step-parent","single parent","helicopter parent","lone-parent family","one-parent family","single-parent family","parent-teacher association"]},{"pos":"verb","level":"","meanings":[{"def":"to care for your child or children","examples":["They'd never parented a toddler and a newborn at the same time before.","We have an intuitive ability to parent."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]