[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/par/parli/parliament__us_1.mp3","phonsUS":"/ˈpɑːrləmənt/","level":"B2","meanings":[{"def":"the group of people who are elected to make and change the laws of a country","examples":["The German parliament is called the ‘Bundestag’.","The Scottish parliament is expected to vote in favour of a ban.","(British English) The exit polls predicted a hung parliament (= in which no political party has more elected members than all the other parties added together).","Angry protesters stormed the parliament.","It will take at least the lifetime of a parliament to put the health service in order.","The National Assembly is the lower house of the French parliament.","The President will address the Canadian parliament during his trip.","The election resulted in a hung parliament, followed by the resignation of the prime minister.","The floor of the Scottish parliament chamber contains seating for 128 members.","The ruling National Democratic Party dominates parliament.","Riot police yesterday surrounded the Georgian parliament building.","a popularly elected parliament","a senior parliament official","She was elected as a member of the Dutch parliament in 2016."],"opposite":"","synonyms":""},{"def":"the parliament of some countries, including the United Kingdom. In the UK, Parliament consists of the House of Commons and the House of Lords","examples":["a Member of Parliament","an Act of Parliament","in Parliament The issue was debated in Parliament.","to win a seat in Parliament","The party is set to win a majority in Parliament (= the most votes) in October's election.","to be elected to Parliament","He practised law briefly before standing for Parliament (= becoming a candidate in an election).","before Parliament The plans are included in a bill currently before Parliament (= that is being discussed in Parliament).","He first stood for Parliament in 2001.","He sat in Parliament for over forty years.","He was returned to Parliament in 2014 as MP for Appleby.","Parliament may legislate on any matter of penal law.","Parliament will be in session until 15th December.","The bill will come before Parliament next month.","The party failed to win any seats in Parliament.","The party has a two-thirds majority in Parliament.","The government was accused of forcing the bill through Parliament."],"opposite":"","synonyms":""},{"def":"a particular period during which a parliament is working; Parliament as it exists between one general election and the next","examples":["We are now into the second half of the parliament.","to dissolve Parliament (= formally end its activities) and call an election","The legislation is expected to be introduced early in the next session of parliament."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Act of Parliament","Long Parliament","Member of Parliament","Model Parliament","Rump Parliament","Short Parliament","European Parliament","Scottish Parliament","Houses of Parliament","Member of the European Parliament","State Opening of Parliament","Acts of Parliament","Members of Parliament","Members of the European Parliament","Member of the Provincial Parliament"]}]