[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/par/party/party__us_1.mp3","phonsUS":"/ˈpɑːrti/","level":"A1","meanings":[{"def":"a social occasion, often in a person’s home, at which people eat, drink, talk, dance and enjoy themselves","examples":["a dinner/tea/cocktail party","at a party I was at a birthday party for my friend's five-year-old daughter.","to have/throw/give a party","to hold/host a party","Did you go to the party?","party games","By now the party was in full swing.","The main task faced by the host at a party is making people comfortable.","I was at a party in London that night.","It's a good snack for serving at parties.","They were invited to an elegant garden party.","We had a small party to celebrate.","She attended a wedding anniversary party for her mother- and father-in-law.","They host a Christmas party every year for all the neighbours.","They went to a New Year's Eve party held at Planet Hollywood in New York City.","We occasionally hold informal parties.","She's planning a surprise party for her boyfriend.","He loves throwing lavish parties.","I'm organizing an engagement party for my sister.","He gave a dinner party for some old friends.","On moving in they threw a huge house-warming party.","She turned up at her fiancé's bachelor party.","The girls were having a slumber party.","They attended the launch party for the new film.","We had a farewell party for Michelle when she left the company.","Are you going to Tom's leaving party?","They met at a friend's wedding party.","She danced on the table at her own retirement party.","She is a hard-drinking, non-stop party girl.","There was a real party atmosphere on the last day of term."],"opposite":"","synonyms":""},{"def":"a political organization that you can vote for in elections and whose members have the same aims and ideas","examples":["Do you belong to a political party?","the ruling/opposition party","the Democratic/Republican/Conservative/Labour Party","the party leader/conference","a party member/activist/official","From 1991 new political parties emerged to challenge the governing party.","Three of Australia's four main political parties supported the change.","It is unlikely that either of the two main parties will get enough votes to govern alone.","He's a successful politician unaffiliated with either major party.","He has been criticized from within his own party.","How is that going to go down with the right wing of the party?","a coalition of centrist and left-wing parties","The incumbent party has won seven out of the last nine elections.","The party fears losing its majority.","The Democratic party now controls the Senate.","She was selected as her party's candidate for mayor.","She became leader of the party in 2016.","This bitter dispute finally split the party.","He called the vote in a disastrous attempt to unite the party.","He founded his own party, the LPF.","They formed a radical opposition party, the National Movement.","members of the parliamentary party","They are now the majority party in Parliament.","They present themselves as the party of the working classes.","They want to be taken seriously as a prospective party of government.","He had strong links with the Communist Party.","The Prime Minister was cheered by the party faithful.","She continued to be loyal to the party leadership.","He denied that he had ever been a Nazi party member.","The cost of party membership is relatively high.","The most important thing is to maintain party unity."],"opposite":"","synonyms":""},{"def":"a group of people who are doing something together such as travelling or visiting somewhere","examples":["The school is taking a party of 40 children to France.","The theatre gives a 10 per cent discount to parties of more than ten.","a rescue/wedding/hunting party","The table was taken by a party of six.","The total bill for our party of five was almost £300.","A small party of four soldiers came into view.","She arrived with a party of helpers.","The ship hosted a number of visits, including parties of local schoolchildren.","In 1863 Mr. Thomas Cook led his first party of tourists to Switzerland.","A small party set out from the fort.","Some of the party wanted to turn back.","One of the men in our party volunteered to go for help.","A guide travelled with our party.","It was time for us to join rest of the coach party.","The visiting party included city dignitaries.","A landing party was sent ashore.","The hunting party came across a bear in the forest.","He landed a small scouting party on the island and named it Sri Lanka.","The captain told the crew to prepare to receive a boarding party.","They formed a raiding party to venture into enemy territory.","The wedding party climbed into the carriages.","A rescue party immediately set off by boat.","Several members of the England cricket touring party were robbed outside the team hotel."],"opposite":"","synonyms":""},{"def":"one of the people or groups of people involved in a legal agreement or argument","examples":["the guilty/innocent party","The contract can be terminated by either party with three months' notice.","The judge’s decision satisfied most of the parties concerned.","First we must notify all the interested parties.","This agreement shall be binding upon both parties."],"opposite":"","synonyms":""},{"def":"to be involved in an agreement or action","examples":["to be party to a decision","He refused to be a party to any violence."],"opposite":"","synonyms":""},{"def":"to contribute something useful to a discussion, project, etc.","examples":["What Hislop brought to the party was real commitment and energy."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be (a) party to something","def":"to be involved in an agreement or action","examples":["to be party to a decision","He refused to be a party to any violence."]},{"idiom":"bring something to the party/table","def":"to contribute something useful to a discussion, project, etc.","examples":["What Hislop brought to the party was real commitment and energy."]}],"phrasal":[],"related":["all-party","hen party","tea party","after-party","block party","house party","kitty party","micro party","party favor","party-goer","party line","party piece","party wall","third party","bottle party","colour party","concert party","costume party","dinner party"]},{"pos":"verb","level":"","meanings":[{"def":"to enjoy yourself, especially by eating, drinking alcohol and dancing","examples":["They were out partying every night.","That guy Jake—he really knows how to party!"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]