[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/par/partn/partner__us_1.mp3","phonsUS":"/ˈpɑːrtnər/","level":"A1","meanings":[{"def":"a person that you are doing an activity with, such as dancing or playing a game","examples":["a dance/tennis partner","The teacher asked the students to choose a partner for the next activity.","All change partners for the next dance!","She penned the script with her long-time writing partner.","I need a doubles partner for the table tennis tournament.","The old political sparring partners are now firm friends."],"opposite":"","synonyms":""},{"def":"the person that you are married to or having a sexual relationship with","examples":["Come to the New Year disco and bring your partner!","This is my partner, Mark.","a sexual/romantic partner","a male/female/same-sex partner","She still hasn't found her perfect partner.","a former/​potential partner","Local government workers have been refused pensions for their unmarried partners.","Most of those questioned said they wanted a steady partner for emotional support.","People who have had multiple partners are more at risk from sexually transmitted diseases.","She was the dominant partner in the relationship.","reasons for divorce such as having an abusive partner"],"opposite":"","synonyms":""},{"def":"one of the people who owns a business and shares the profits, etc.","examples":["partner in something a partner in a law firm","a junior/senior partner","Maintain good relationships with your customers, employees and business partners.","He is the founder and managing partner of the gallery.","Teresa became a full partner in 2020.","He has recently been made a junior partner in the family business.","She is a general partner in a consulting firm.","He was made a full partner in his father's firm.","She and her husband became limited partners in the team's ownership."],"opposite":"","synonyms":""},{"def":"a country or an organization that has an agreement with another country or organization","examples":["a trading partner","The party was unable to find a coalition partner.","India remains an important strategic partner for the United States.","AOL remains the company's only online retail partner.","Britain's partner in the aeronautic project","France's principal trading partners","We are working with partner companies on wireless technologies."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["birth partner","civil partner","domestic partner","silent partner","sleeping partner","sparring partner"]},{"pos":"verb","level":"","meanings":[{"def":"to be somebody’s partner in a dance, game, etc.","examples":["Gerry offered to partner me at tennis."],"opposite":"","synonyms":""},{"def":"to be involved in a business project with another company","examples":["partner with somebody/something Freshfoods usually partners with other companies to share risk.","We are very excited to be partnering with such a vibrant and dynamic company."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]