[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/par/part_/part__us_1.mp3","phonsUS":"/pɑːrt/","level":"A1","meanings":[{"def":"some but not all of a thing","examples":["We spent part of the time in the museum.","Part of the building was destroyed in the fire.","Part of the problem is that more and more people live alone.","Voters are given only part of the story (= only some of the information).","Part of me feels sorry for him (= I feel a little sorry for him, but not very sorry).","We spent a good part of the day rehearsing.","He spends part of the year in Ireland.","She lived for part of her life in Ethiopia.","Part of the morning was spent brainstorming ideas.","Educational disadvantage is just part of a bigger social problem.","His performance in the movie seems weak, although the weakness of the script could be part of the reason.","Part of the reason I'm interested in this is that my father was a vet.","Improvements to the physical structure of the building are only part of the solution.","Production is only part of it; you also have to sell your products.","Part of it was about money, but most of our arguments were about housework.","Part of why we read is to escape our immediate surroundings."],"opposite":"","synonyms":""},{"def":"a section, piece or feature of something","examples":["part of something The mountains are covered with snow for a large part of the year.","The early part of her life was spent in Paris.","the latter part of the 19th century","Making mistakes is an integral part of the learning process.","We've done the difficult part of the job.","an important/essential part of the project","Wool production was a key part of the economy.","in parts The novel is good in parts.","The procedure can be divided into two parts.","The worst part was having to wait three hours in the rain.","These insects are an essential part of our agricultural system.","Fresh fruit is an important part of a healthy diet.","Music has always been an important part of my life.","Death is a part of life.","A key part of our strategy is community involvement.","A big part of our economy is based on agriculture.","Recognition for New York wines is growing, and Long Island wines are a big part of this.","His article tells just a small part of the story.","The analysis of imagery remains a significant part of Shakespearian study.","Break it down into its constituent parts.","Cut it into four equal parts.","I gave up once I got to the hard part.","Now comes the fun part.","The sad part was that he didn't really care.","There's a certain randomness which is the most exciting part about these discoveries.","I didn't understand the beginning part of the film.","I liked the part about his childhood.","This is the part where the plot really comes together.","In the early part of his career he worked in India.","the latter part of the century","the upper part of the building","Opera is a dramatic performance in which music forms an essential part.","The administration of an election is comprised of three essential parts: technology, processes, and people."],"opposite":"","synonyms":""},{"def":"an element or member of something; a person or thing that helps to make up a whole or belongs in it","examples":["Snacks can be part of a healthy eating plan.","You need to be able to work as part of a team.","Under the Saxons, Westmorland formed part of the Kingdom of Northumberland.","Antibiotics have become part of our daily existence.","They still wanted to remain part of Europe.","This was once a very rural area, but has now become part of the London commuter belt.","Our dog is very much part of our lives.","Fishing has always been part of life here.","Living here you really feel like you're part of a community.","They made me feel part of the family.","Architecture forms part of a nation's culture.","Things may seem strange at times, but it's all part of the experience.","It became apparent that he was not part of the solution, but part of the problem.","Marketing has to be part of your plan.","The farm buildings were included as part of the sale.","I learned valuable lessons as part of this experience.","Dealing with difficult people is all part of the job."],"opposite":"","synonyms":""},{"def":"a separate piece or area of a human or animal body or of a plant","examples":["The cancer could spread to other parts of the body.","It may one day be possible to grow new body parts in the laboratory.","Different insects feed on different parts of the plant.","He has tattoos on various parts of his body.","The sole of the foot is one of the most sensitive parts of the body.","It's important to know which plant parts are most vulnerable to frost.","Other parts of the egg are the albumen (white) and the yolk.","a diagram of a cell with the key parts labelled"],"opposite":"","synonyms":""},{"def":"a piece of a machine or structure","examples":["The factory manufactures aircraft parts.","car/machine/engine parts","the working parts of the machinery","Where can I get spare parts for my bike?","He quickly explained about the engine and the broken part.","The washing machine needed a new part.","I ordered a part online.","an auto parts maker","a wholesale supplier of lawn and garden equipment parts","He started selling cars and car parts.","Industrial goods include raw materials and component parts.","imports of foreign-made parts and equipment","The yard is full of old bits of machinery and tractor parts.","the country's leading supplier of plumbing parts","Although it is no longer a working watermill, several of the working parts remain.","Clean the plastic parts of the machine with a soapy cloth.","The adaptors being recalled contain the part number 02K65 on their labels."],"opposite":"","synonyms":""},{"def":"an area or a region of the world, a country, a town, etc.","examples":["The island is mostly flat, but there are some hilly parts.","part of something the northern part of town","different parts of the world/country","Which part of Japan do you come from?","Come and visit us if you're ever in our part of the world.","They ship their products to many parts of the UK.","He has travelled extensively in Thailand and other parts of Asia.","Several parts of the country have experienced flooding.","Which part of the world is Guyana in?","I've been all over the UK, but the Lake District is my favourite part.","They live in the southern, more mountainous part.","I'd never been to that part of Wales before.","They collected soil samples from different parts of Russia.","The bridge links the old and new parts of the city.","Many buildings in this part of the city are dilapidated.","Tourists tend to visit the southern part of town.","Office space is expensive in the central part of Berlin.","The Shenandoah Valley area of Virginia lies in the west central part of the state.","There could be food shortages in one part of the country and food stores rotting in other parts.","The northern part (New Guinea) was administered by Australia."],"opposite":"","synonyms":""},{"def":"a region or an area","examples":["She's not from these parts.","He's just arrived back from foreign parts."],"opposite":"","synonyms":""},{"def":"a section of a book, television series, etc., especially one that is published or broadcast separately","examples":["The documentary was screened in four parts.","Henry IV, Part II","The final part will be shown next Sunday evening.","The book falls into three distinct parts.","an encyclopedia published in 25 weekly parts","a serial in four parts","Tonight, the first part of a new drama.","To find out what happens next, you'll have to wait for part two!","In part four, Tommy returns home to find his family in difficult circumstances.","In the next part, the authors focus on the consequences of baby boomer retirement.","Her character is not introduced until the third part.","There's a part on sourcing ingredients at the back of the book.","The last part is about the years following the war and its lasting effects."],"opposite":"","synonyms":""},{"def":"a role played by an actor in a play, film, etc.; the words spoken by an actor in a particular role","examples":["She played the part of Juliet.","(figurative) He's always playing a part (= pretending to be something that he is not).","Have you learned your part yet?","part in something He got a small part in a West End play.","in a part She was very good in the part.","Judy Garland landed the part of Dorothy in the Wizard of Oz.","Walken stars as Shannon and he fits the part well.","She had a part on ‘Law and Order’.","Did you get the part?","It's a really big part.","In the end they gave the part to someone else.","Several leading actors were rumoured to want the part.","He would be perfect for the part.","He auditioned unsuccessfully for a part on the show.","My dream is to one day get a part on Broadway.","I was offered a part in a Robert De Niro movie."],"opposite":"","synonyms":""},{"def":"the way in which somebody/something is involved in an action or situation","examples":["Luck played a big part in their success.","She plays an active part in local politics.","We all have a part to play in the fight against crime.","He had no part in the decision.","I want no part of this sordid business.","He had no part in the scam.","She did her part in bringing them back together.","Alcohol plays a part in 70 per cent of divorces."],"opposite":"","synonyms":""},{"def":"music for a particular voice or instrument in a group singing or playing together","examples":["the clarinet part","The first two verses of the song are set in four-part harmony.","I can play the guitar part to that song."],"opposite":"","synonyms":""},{"def":"a unit of measurement that allows you to compare the different amounts of substances in something","examples":["Add three parts wine to one part water.","fluoride levels of 0.2 parts per million"],"opposite":"","synonyms":""},{"def":"a line on a person’s head where the hair is divided with a comb","examples":[],"opposite":"","synonyms":""},{"def":"to be better or more effective as a group than you would think just by looking at the individual members of the group","examples":["The team is greater than the sum of its parts."],"opposite":"","synonyms":""},{"def":"most of something, especially a period of time; more than half of something","examples":["He drank the best part of a bottle of Scotch waiting for her to get home.","The journey took her the better part of an hour."],"opposite":"","synonyms":""},{"def":"you should avoid danger and not take unnecessary risks","examples":[],"opposite":"","synonyms":""},{"def":"mostly; usually","examples":["The contributors are, for the most part, professional scientists.","Women generally earn less than men.","Generally speaking, jobs traditionally done by women are paid at a lower rate than those traditionally done by men.","In general/By and large, women do not earn as much as men.","Certain jobs, like nursing and cleaning, are still mainly carried out by women.","Senior management posts are predominantly held by men.","Most senior management posts tend to be held by men.","Women are, for the most part, still paid less than men.","Economic and social factors are, to a large extent, responsible for women being concentrated in low-paid jobs."],"opposite":"","synonyms":""},{"def":"used to express your own, his, their, etc. opinion or feelings about something","examples":["For my part, I would reject all these arguments."],"opposite":"","synonyms":""},{"def":"to a great extent","examples":["Their success is due in large part to their determination."],"opposite":"","synonyms":""},{"def":"partly; to some extent","examples":["Her success was due in part to luck.","Your salary depends in part on your qualifications."],"opposite":"","synonyms":""},{"def":"to have an appearance or wear clothes suitable for a particular job, role or position","examples":["He acts and dresses the part of a gentleman.","He was a pirate in the school play and certainly looked the part."],"opposite":"","synonyms":""},{"def":"a person with many skills","examples":[],"opposite":"","synonyms":""},{"def":"made or done by somebody","examples":["It was an error on my part."],"opposite":"","synonyms":""},{"def":"a normal part of something","examples":["Keeping the accounts is part and parcel of my job."],"opposite":"","synonyms":""},{"def":"a person or thing that you are so used to seeing that you no longer notice them","examples":["I worked there so long that I became part of the furniture."],"opposite":"","synonyms":""},{"def":"to accept something slightly unpleasant without complaining or being offended","examples":["He took the teasing in good part."],"opposite":"","synonyms":""},{"def":"to be involved in something","examples":["to take part in a discussion/demonstration/fight/celebration","How many countries took part in the last Olympic Games?","They took little part in the discussion."],"opposite":"","synonyms":""},{"def":"to support somebody, for example in an argument","examples":["His mother always takes his part."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be greater/more than the sum of its parts","def":"to be better or more effective as a group than you would think just by looking at the individual members of the group","examples":["The team is greater than the sum of its parts."]},{"idiom":"the best/better part of something","def":"most of something, especially a period of time; more than half of something","examples":["He drank the best part of a bottle of Scotch waiting for her to get home.","The journey took her the better part of an hour."]},{"idiom":"discretion is the better part of valour","def":"you should avoid danger and not take unnecessary risks","examples":[]},{"idiom":"for the most part","def":"mostly; usually","examples":["The contributors are, for the most part, professional scientists.","Women generally earn less than men.","Generally speaking, jobs traditionally done by women are paid at a lower rate than those traditionally done by men.","In general/By and large, women do not earn as much as men.","Certain jobs, like nursing and cleaning, are still mainly carried out by women.","Senior management posts are predominantly held by men.","Most senior management posts tend to be held by men.","Women are, for the most part, still paid less than men.","Economic and social factors are, to a large extent, responsible for women being concentrated in low-paid jobs."]},{"idiom":"for my, his, their, etc. part","def":"used to express your own, his, their, etc. opinion or feelings about something","examples":["For my part, I would reject all these arguments."]},{"idiom":"in large part | in large measure","def":"to a great extent","examples":["Their success is due in large part to their determination."]},{"idiom":"in part","def":"partly; to some extent","examples":["Her success was due in part to luck.","Your salary depends in part on your qualifications."]},{"idiom":"look/dress the part","def":"to have an appearance or wear clothes suitable for a particular job, role or position","examples":["He acts and dresses the part of a gentleman.","He was a pirate in the school play and certainly looked the part."]},{"idiom":"a man/woman of (many) parts","def":"a person with many skills","examples":[]},{"idiom":"on the part of somebody/on somebody’s part","def":"made or done by somebody","examples":["It was an error on my part."]},{"idiom":"part and parcel of something","def":"a normal part of something","examples":["Keeping the accounts is part and parcel of my job."]},{"idiom":"part of the furniture","def":"a person or thing that you are so used to seeing that you no longer notice them","examples":["I worked there so long that I became part of the furniture."]},{"idiom":"take something in good part","def":"to accept something slightly unpleasant without complaining or being offended","examples":["He took the teasing in good part."]},{"idiom":"take part (in something)","def":"to be involved in something","examples":["to take part in a discussion/demonstration/fight/celebration","How many countries took part in the last Olympic Games?","They took little part in the discussion."]},{"idiom":"take somebody’s part","def":"to support somebody, for example in an argument","examples":["His mother always takes his part."]}],"phrasal":[],"related":["bit part","part-way","part-time","part with","part-work","part-timer","spare part","part exchange","part-exchange","part of speech","Till Death Us Do Part","part-timers","part-works","part exchanges","part-exchanges","part-exchanged","part-exchanging"]},{"pos":"verb","level":"","meanings":[{"def":"if a person parts from another person, or two people part, they leave each other","examples":["We parted at the airport.","I hate to part on such bad terms.","part from somebody He has recently parted from his wife (= they have started to live apart)."],"opposite":"","synonyms":""},{"def":"to prevent somebody from being with somebody else","examples":["I hate being parted from the children.","The puppies were parted from their mother at birth.","I refused to be parted from my sisters."],"opposite":"","synonyms":""},{"def":"if two things or parts of things part or you part them, they move away from each other","examples":["The crowd parted in front of them.","The elevator doors parted and out stepped the President.","part something Her lips were slightly parted.","She parted the curtains a little and looked out."],"opposite":"","synonyms":""},{"def":"to divide your hair into two sections with a comb, creating a line that goes from the back of your head to the front","examples":["He parts his hair in the middle."],"opposite":"","synonyms":""},{"def":"a person who is not sensible usually spends money too quickly or carelessly, or is cheated by others","examples":[],"opposite":"","synonyms":""},{"def":"to leave somebody; to end a relationship with somebody","examples":["This is where we part company (= go in different directions).","The band have parted company with their manager.","The band and their manager have parted company.","He parted ways with the team at the end of the season."],"opposite":"","synonyms":""},{"def":"to disagree with somebody about something","examples":["Weber parted company with Marx on a number of important issues.","The two leaders parted ways on this question."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a fool and his money are soon parted","def":"a person who is not sensible usually spends money too quickly or carelessly, or is cheated by others","examples":[]},{"idiom":"part company (with/from somebody)","def":"to leave somebody; to end a relationship with somebody","examples":["This is where we part company (= go in different directions).","The band have parted company with their manager.","The band and their manager have parted company.","He parted ways with the team at the end of the season.","Weber parted company with Marx on a number of important issues.","The two leaders parted ways on this question."]}],"phrasal":["part with"],"related":[]},{"pos":"adverb","level":"","meanings":[{"def":"consisting of two things; to some extent but not completely","examples":["She's part French, part English.","His feelings were part anger, part relief.","The course is part funded by the European Commission.","He is part owner of a farm in France."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]