[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pas/pass_/pass__us_1.mp3","phonsUS":"/pæs/","level":"A2","meanings":[{"def":"to achieve the required standard in an exam, a test, etc.","examples":["I'm not really expecting to pass first time.","She passed with flying colours (= very easily).","pass something She hasn't passed her driving test yet.","pass an exam/examination","You've passed all your exams—well done!","It's arguably the best novel of the past 20 years.","Let's put the past behind us and move on.","You shouldn't be up, it's past your bedtime!","Three students in the class passed with distinction.","Students are required to pass a weekly multiple-choice test.","He passed his medical exams and began to practise as a doctor.","We require all employees to pass a written exam.","She was the first woman to pass the entrance examination at the famous Ecole des Beaux-Arts in Paris.","You need 90 per cent attendance in order to pass the course.","Candidates must have passed at least five subjects, including English language.","Chinese students had to pass papers in Chinese, English and maths.","Your grades in the first year don't count towards your final grade; you just have to pass.","I had no idea whether I'd passed or failed.","She passed in the following subjects: Advanced Irish, English, arithmetic, history, geography, music."],"opposite":"fail","synonyms":""},{"def":"to test somebody and decide that they are good enough, according to an agreed standard","examples":["The examiners passed all the candidates."],"opposite":"fail","synonyms":""},{"def":"to move past or to the other side of somebody/something","examples":["Several people were passing but nobody offered to help.","I hailed a passing taxi.","The security guard refused to let us pass.","pass somebody/something to pass a barrier/sentry/checkpoint","You'll pass a bank on the way to the train station.","She passed me in the street without even saying hello.","Nobody has passed this way for hours.","(especially North American English) There was a truck behind that was trying to pass me.","The road was so narrow that cars were unable to pass.","Several buses passed, but did not stop.","He pulled out to pass a truck.","She passed him with a fractional quickening of her pace.","On my way to the cinema, I passed a flower shop.","Will you be passing a post box on your way home?","I just happened to pass a bookshop and saw it in the window.","Police stopped the car after it passed a red light without stopping.","We somehow passed the hotel without noticing it.","You'll pass a supermarket on your right.","The train passes picturesque lakes and villages.","I heard someone passing my bedroom door.","We passed several people going up the mountain as we were coming down.","I was just passing your house, so I thought I'd call.","I was just passing, so I thought I'd call.","We tried to take note of landmarks we passed along the way.","Not many strangers pass this way.","He passed a 30 miles per hour sign doing 120.","We passed the border about half an hour ago.","A passing freight train shook the walls.","A man threw something from the window of a passing car.","I saw no-one except a passing jogger."],"opposite":"","synonyms":""},{"def":"to go or move in the direction mentioned","examples":["The procession passed slowly along the street.","We passed through a security checkpoint.","A plane passed low overhead.","The air cools as it passes along the pipe.","After passing through tall gates, you follow a long curving drive.","We passed through the Spanish Quarter on our way here.","Almost 7 million people pass through the museum's doors each year.","The number of people passing through British airports rose 3%.","The train passes through a desolate industrial landscape.","As the water passes through, the membrane filters out most of the impurities.","As they passed under the bridge they heard a noise above them.","As water passes over rocks, it dissolves many minerals.","They passed down winding streets.","A train was passing noisily over the bridge.","They became used to hearing warplanes pass overhead."],"opposite":"","synonyms":""},{"def":"to make something move in the direction or into the position mentioned","examples":["He passed the rope around the post three times to secure it.","She passed her hand across her forehead."],"opposite":"","synonyms":""},{"def":"to give something to somebody by putting it into their hands or in a place where they can easily reach it","examples":["pass something Pass the salt, please.","Pass that book over.","pass something to somebody He passed a note to his friend.","pass somebody something Pass me the salt.","Pass me over that book.","Pass my coat, would you?","She passed me a plate.","Can you pass me that bag?","Could you pass the potatoes up to this end of the table, please?","He stood at the counter, passing drinks to everyone.","We passed the pens along the row until everyone had one."],"opposite":"","synonyms":""},{"def":"to give somebody information or a message","examples":["pass something to somebody His wife had been passing information to the police.","pass something They devised a method of passing secret messages."],"opposite":"","synonyms":""},{"def":"to kick, hit or throw the ball to a player of your own side","examples":["pass something (to somebody) He passed the ball to Sterling.","pass (to somebody) Why do they keep passing back to the goalie?","They should pass more.","We watched them skillfully pass, run and shoot.","The team caught and passed very well.","The ball went to Hummell, who passed to Young.","In basketball, the rule is that the player can't move without passing the ball (or dribbling, which is like passing to himself).","In rugby you can only pass the ball backwards.","He should have passed the ball to a teammate."],"opposite":"","synonyms":""},{"def":"when time passes, it goes by","examples":["Almost fifty years have passed since that day.","Six months passed and we still had no news of them.","The time passed quickly.","We grew more anxious with every passing day.","The days passed uneventfully.","The years passed, and many people forgot what had happened that day.","Several months could pass without them having any contact.","It might be best to think about this again when a little time has passed.","As time passes, our views can change.","I realized that three hours had passed.","Half an hour passes, and there is still no sign of him.","Barely a week passes without another story breaking about sexual harassment.","Only a few minutes have passed and you're bored already.","The afternoon passed pleasantly enough.","The evening passed so slowly.","With every passing minute she became more convinced something had happened to them.","I love her more with each passing year."],"opposite":"","synonyms":""},{"def":"to spend time, especially when you are bored or waiting for something","examples":["We sang songs to pass the time.","How do you pass the long winter nights?","She went for a walk to pass the time until dinner.","It's not a very exciting game, but it passes the time.","We passed the time chatting.","He found a dry barn where he passed the night.","She passed a sleepless night.","We passed an uneasy few days waiting for the results.","Conversation helps them pass the hours of guard duty.","They passed a pleasant evening telling tales and singing songs.","Reading is a way for prisoners to pass the long evenings when they are locked in their cells."],"opposite":"","synonyms":""},{"def":"to come to an end; to be over","examples":["They waited for the storm to pass.","It's just a phase which will eventually pass.","This is a record of an era long since passed (= that ended a long time ago).","I felt a little dizzy at first, but that quickly passed.","The immediate danger seemed to have passed.","After the deadline passes, interest will be charged on the amount due.","The shock will soon pass.","The indignation I felt on reading this soon passed.","I wanted to ask a question, but the moment passed.","The film gives a wonderful insight into a way of life that has now passed.","His youthful idealism has long since passed."],"opposite":"","synonyms":""},{"def":"to change from one state or condition to another","examples":["She had passed from childhood to early womanhood."],"opposite":"","synonyms":""},{"def":"to be given to another person after first belonging to somebody else, especially after the first person has died","examples":["On his death, the title passed to his eldest son."],"opposite":"","synonyms":""},{"def":"to become greater than a particular total","examples":["Unemployment has now passed the three million mark."],"opposite":"","synonyms":""},{"def":"to accept a proposal, law, etc. by voting; to be accepted in this way","examples":["pass something to pass a bill/law/resolution","The Kansas State House narrowly passed the legislation last year.","In 1996, Congress unanimously passed the Food Quality Protection Act.","(especially North American English) The bill is expected to pass the Senate.","pass (by something) The bill passed by 360 votes to 280.","New Zealand recently passed the Civil Union Act.","University staff passed a motion of no confidence in the Vice Chancellor.","Delegates unanimously passed a motion calling for a boycott.","The amendment passed by a vote of 57 - 40.","The income tax amendment was passed in 1913.","Parliament passed tough new security measures.","The country is better off because we have passed these economic reforms.","(especially North American English) Any budget deal has to pass the House of Representatives.","The state legislature passed a law requiring public schools to offer breakfast programs.","They needed six more votes to pass the resolution.","The resolution passed unanimously.","Congress has failed to pass legislation that would raise the minimum wage.","The House of Lords is expected to pass the amendment.","The amendment is expected to pass."],"opposite":"","synonyms":""},{"def":"to be allowed","examples":["I don't like it, but I'll let it pass (= will not object).","Her remarks passed without comment (= people ignored them)."],"opposite":"","synonyms":""},{"def":"to happen; to be said or done","examples":["pass (between A and B) They'll never be friends again after all that has passed between them.","+ adj. His departure passed unnoticed."],"opposite":"","synonyms":""},{"def":"to say that you do not know the answer to a question, especially during a quiz","examples":["‘What's the capital of Peru?’ ‘I'll have to pass on that one.’","‘Who wrote ‘Catch-22’?’ ‘Pass (= I don't know).’"],"opposite":"","synonyms":""},{"def":"to say that you do not want something that is offered to you","examples":["Thanks. I'm going to pass on dessert, if you don't mind."],"opposite":"","synonyms":""},{"def":"to say or state something, especially officially","examples":["The court waited in silence for the judge to pass sentence.","It's not for me to pass judgement on your behaviour.","The man smiled at the girl and passed a friendly remark."],"opposite":"","synonyms":""},{"def":"to go beyond the limits of what you can believe, understand, etc.","examples":["It passes belief (= is impossible to believe) that she could do such a thing."],"opposite":"","synonyms":""},{"def":"to refuse to play a card or make a bid when it is your turn","examples":[],"opposite":"","synonyms":""},{"def":"to send something out from the body as or with waste matter","examples":["If you're passing blood you ought to see a doctor."],"opposite":"","synonyms":""},{"def":"to happen","examples":["How did such a disaster come to pass?","I wondered how it came to pass that a thinking man bore the prejudices of his unthinking parents."],"opposite":"","synonyms":""},{"def":"if words do not pass your lips, you say nothing","examples":[],"opposite":"","synonyms":""},{"def":"if food or drink does not pass your lips, you eat or drink nothing","examples":[],"opposite":"","synonyms":""},{"def":"to collect money from a number of people, for example to buy a present for somebody","examples":[],"opposite":"","synonyms":""},{"def":"to be accepted as of a good enough standard","examples":[],"opposite":"","synonyms":""},{"def":"to say hello to somebody and have a short conversation with them","examples":[],"opposite":"","synonyms":""},{"def":"to urinate","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"come to pass","def":"to happen","examples":["How did such a disaster come to pass?","I wondered how it came to pass that a thinking man bore the prejudices of his unthinking parents."]},{"idiom":"not pass your lips","def":"if words do not pass your lips, you say nothing","examples":[]},{"idiom":"pass the hat round/around","def":"to collect money from a number of people, for example to buy a present for somebody","examples":[]},{"idiom":"pass muster","def":"to be accepted as of a good enough standard","examples":[]},{"idiom":"pass the time of day (with somebody)","def":"to say hello to somebody and have a short conversation with them","examples":[]},{"idiom":"pass water","def":"to urinate","examples":[]}],"phrasal":["pass around","pass as","pass away","pass by","pass down","pass for","pass into","pass off","pass off as","pass on","pass out","pass round","pass over","pass through","pass up"],"related":["bus pass","pass as","pass by","pass for","pass key","pass off","pass on","pass out","pass up","pass away","pass down","pass-fail","pass into","pass over","pass play","pass around","pass round","screen pass"]},{"pos":"noun","level":"B1","meanings":[{"def":"an official document or ticket that shows that you have the right to enter or leave a place, to travel on a bus or train, etc.","examples":["a boarding pass (= for a plane)","There is no admittance without a security pass.","We had backstage passes to the show.","The official asked to see our passes.","The complete ski package includes equipment hire, tuition and lift pass.","Attendees will receive a free pass to the VIP lounge.","I won two free passes to the red-carpet screening of a new movie.","You have to show your passport and boarding pass before you can get on the plane.","It's impossible to get backstage without a press pass.","The travel pass is accepted on all local bus and train services.","Individual tickets and festival passes can be bought at the box office.","Please display your parking pass.","The teacher wrote out a hall pass and handed it to her.","I was caught in the hall during lesson time without a pass.","The visitors were issued with day passes.","You can save money by buying a monthly pass.","You can buy a three-day pass that gives you entry to all the major sights.","a monthly rail pass","soldiers on a weekend pass"],"opposite":"","synonyms":""},{"def":"a successful result in an exam or test","examples":["She got a pass in French.","12 passes and 3 fails","Two A-level passes are needed for this course.","The pass mark is 50 per cent.","The school has a 90 per cent pass rate (= 90 per cent of students pass their exams).","Applicants need a good degree pass.","Use of quotations can mean the difference between a pass and a fail.","He should get a good pass in mathematics.","It's difficult to obtain a pass at A Level.","The school is one of the top ten most-improved in the country, based on passes at GCSE.","Pupils need at least five passes at A* to C grade.","She barely scraped a pass in chemistry.","The beach failed a hygiene inspection last year, but this year got a borderline pass.","Exam pass rates get higher every year.","A simple regurgitation of lecture notes would be unlikely to gain more than a pass mark.","The points system is stringent, but those failing to meet the pass mark may still be able to obtain a resident visa."],"opposite":"","synonyms":""},{"def":"(in some sports) an act of hitting or throwing the ball to another player in your team","examples":["a long pass to Turner","a back pass to the goalkeeper","The referee disallowed the try for a forward pass.","His long reach enables him to block passes.","Lafferty played a pass down the right to Gallagher.","Robson had pounced on a dropped pass.","Ziege played a pass behind the defence to Weiss.","Palmer caught a 24-yard touchdown pass from Beach early in the fourth quarter."],"opposite":"","synonyms":""},{"def":"a road or way over or through mountains","examples":["a mountain pass","They came over the top of the pass and started down towards the coast.","They had to struggle over the pass with their donkeys.","We took the high pass over the ridge.","building a road through the pass"],"opposite":"","synonyms":""},{"def":"an act of going or moving past or over something","examples":["The helicopter made several passes over the village before landing."],"opposite":"","synonyms":""},{"def":"a stage in a process, especially one that involves separating things from a larger group","examples":["In the first pass all the addresses are loaded into the database."],"opposite":"","synonyms":""},{"def":"to reach a sad or difficult state","examples":["I never thought things would come to such a pass as this.","Things have come to a such a pass when we can’t afford to pay the heating bills!"],"opposite":"","synonyms":""},{"def":"if you give somebody a free pass or somebody gets a free pass, they are not punished for something bad they have done, or they are given permission to do something bad","examples":["This time he gets a free pass but if he does it again, he’ll be sent to jail.","Just because someone has expensive designer gear, it doesn't mean they have a free pass to be mean to my staff."],"opposite":"","synonyms":""},{"def":"to try to start a sexual relationship with somebody","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"come to such a pass","def":"to reach a sad or difficult state","examples":["I never thought things would come to such a pass as this.","Things have come to a such a pass when we can’t afford to pay the heating bills!"]},{"idiom":"(give somebody/get) a free pass","def":"if you give somebody a free pass or somebody gets a free pass, they are not punished for something bad they have done, or they are given permission to do something bad","examples":["This time he gets a free pass but if he does it again, he’ll be sent to jail.","Just because someone has expensive designer gear, it doesn't mean they have a free pass to be mean to my staff."]},{"idiom":"make a pass at somebody","def":"to try to start a sexual relationship with somebody","examples":[]}],"phrasal":[],"related":[]}]