[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pas/passa/passage__us_5.mp3","phonsUS":"/ˈpæsɪdʒ/","level":"B2","meanings":[{"def":"a long narrow area with walls on either side that connects one room or place with another","examples":["A dark narrow passage led to the main hall.","a secret underground passage","Someone was waiting outside in the passage.","There was a bedroom with a small passage leading off to a bathroom.","There was a door at the end of the passage.","Liz walked out of her room and down the passage.","the maze of secret passages which wound their way under the building","the passage between the two houses"],"opposite":"","synonyms":""},{"def":"a tube in the body through which air, liquid, etc. passes","examples":["blocked nasal passages"],"opposite":"","synonyms":""},{"def":"a short section from a book, piece of music, etc.","examples":["Read the following passage and answer the questions below.","I have quoted this passage at length.","passage from/in something a passage from the Bible","His writings are filled with poignant passages describing winter winds.","I'll dig out the relevant passages in St Augustine.","In the 15th symphony he quotes a passage from Rossini's ‘William Tell’ overture.","There's a lot of slang in this passage.","The children were asked to choose their favourite passage from the books they had read.","There are passages in this book that are very hard to understand."],"opposite":"","synonyms":""},{"def":"the process of time passing","examples":["Her confidence grew with the passage of time.","rituals which mark the passage of the seasons"],"opposite":"","synonyms":""},{"def":"the process of discussing a bill in a parliament so that it can become law","examples":["The bill is now guaranteed an easy passage through the House of Representatives.","He deserves credit for ensuring the passage of the Civil Rights Act.","Starr voted for the final passage of the bill.","The bill is expected to face a stormy passage in both houses.","The bill will complete its passage in November.","The bills did not gain passage in the Senate.","They have launched a campaign to block passage of the bill."],"opposite":"","synonyms":""},{"def":"a journey from one place to another by ship","examples":["Her grandfather had worked his passage (= worked on a ship to pay for the journey) to America.","The canal route was shorter than the sea passage around the northern coast.","It was a long, rough passage, battling into the wind for seven hours.","We met him on our outward passage.","We had a stormy passage to India.","She had secured passage on a ship heading for England."],"opposite":"","synonyms":""},{"def":"a way through something","examples":["The officers forced a passage through the crowd.","a narrow passage through the bushes","to clear a passage for ships through the ice"],"opposite":"","synonyms":""},{"def":"the action of going across, through or past something","examples":["Large trees may obstruct the passage of light.","State-of-the-art suspension guarantees a smooth passage over the bumpiest road.","Steps cut in the hillside give walkers an easy passage down the mountain.","the slow passage of a snail across the veranda","The operation will allow free passage of fluid in and out of the organ.","Portugal's passage into the next round of the tournament","We are not aware of our passage from consciousness to sleep."],"opposite":"","synonyms":""},{"def":"the permission to travel across a particular area of land","examples":["We were promised (a) speedy passage through the border.","If the law were passed, EU nationals would no longer enjoy free passage through member states.","The Security Council has demanded free passage for families fleeing from the fighting.","They denied him passage through the territory.","a safe passage out of the war zone"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["back passage","safe passage","bird of passage","rite of passage","middle passage","Passage to India","North-West Passage","birds of passage","North-west Passage","rites of passage"]}]