[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pat/patch/patch__us_1.mp3","phonsUS":"/pætʃ/","level":"C1","meanings":[{"def":"a small area of something, especially one which is different from the area around it","examples":["a black dog with a white patch on its back","a bald patch on the top of his head","damp patches on the wall","patches of dense fog","We sat in a patch of shade under a tree.","a white dog with a black patch on its head","patches of dense fog","The letters ‘i’ and ‘j’ have dots over them.","The island is a small green dot on the map.","The horse had a white mark on its head.","Which has spots, a leopard or a tiger?","The velvet curtains were faded in patches.","There were some patches of clear blue sky.","Flowers provide little bright patches of colour around the garden.","an isolated patch of forest","icy patches on the roads","located on a small patch of flat ground","This led Nixon into a political briar patch (= a painful situation that is difficult to escape)."],"opposite":"","synonyms":"patch"},{"def":"a small piece of material that is used to cover a hole in something or to make a weak area stronger, or as decoration","examples":["I sewed patches on the knees of my jeans.","She wore a jacket with bright patches sewn onto it.","dancers with patches on their costumes","Students were wearing American flag patches on their sleeves."],"opposite":"","synonyms":""},{"def":"a piece of material that you wear over an eye, usually because the eye is damaged","examples":["He had a black patch over one eye."],"opposite":"","synonyms":""},{"def":"a piece of material that you sew onto clothes as part of a uniform","examples":["He wears a patch from his employer, Verizon.","It has a UPS patch sewn on the right shoulder."],"opposite":"","synonyms":""},{"def":"a piece of material that people can wear on their skin to help them to stop smoking","examples":["nicotine patches"],"opposite":"","synonyms":""},{"def":"a small piece of land, especially one used for growing vegetables or fruit","examples":["a vegetable patch","We had a strawberry patch beside the greenhouse."],"opposite":"","synonyms":""},{"def":"an area that somebody works in, knows well or comes from","examples":["He knows every house in his patch.","She has had a lot of success in her home patch."],"opposite":"","synonyms":""},{"def":"a period of time of the type mentioned, usually a difficult or unhappy one","examples":["to go through a bad/difficult/sticky patch","I was going through a patch of poor health.","Their business hit a sticky patch last year.","The team has been through a rough patch recently.","We did have a patch of bad luck, but we're through it now."],"opposite":"","synonyms":""},{"def":"a small piece of code (= instructions that a computer can understand) which can be added to a computer program to improve it or to correct a fault","examples":["Follow the instructions below to download and install the patch.","Update and apply all security patches to your browser, as soon as possible."],"opposite":"","synonyms":""},{"def":"to be much less good, attractive, etc. than somebody/something else","examples":["This book isn’t a patch on her others.","She was no great beauty. Not a patch on Martha."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be not a patch on somebody/something","def":"to be much less good, attractive, etc. than somebody/something else","examples":["This book isn’t a patch on her others.","She was no great beauty. Not a patch on Martha."]}],"phrasal":[],"related":["patch up","patch through","purple patch","patch together","patch something","patch something/somebody","patch somebody/something through (to somebody/something)"]},{"pos":"verb","level":"","meanings":[{"def":"to cover a hole or a worn place, especially in clothes, with a piece of cloth or other material","examples":["patched jeans","to patch a hole in the roof"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["patch through","patch together","patch up"],"related":[]}]