[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pat/patie/patience__us_1.mp3","phonsUS":"/ˈpeɪʃns/","level":"B2","meanings":[{"def":"the ability to stay calm and accept a delay or something annoying without complaining","examples":["She has little patience with (= will not accept or consider) such views.","People have lost patience with (= have become annoyed about) the slow pace of reform.","I have run out of patience with her.","My patience is wearing thin (= I do not have much patience left).","Teaching children with special needs requires patience and understanding.","Her patience snapped and she walked out.","I find it hard to keep my patience with them.","It is clear that they are out of patience with me.","Meg could see Kirk's patience was running out, so she shut up.","She listened with infinite patience to his excuses.","The children were beginning to try my patience.","They thanked him for showing so much patience."],"opposite":"","synonyms":""},{"def":"the ability to spend a lot of time doing something difficult that needs a lot of attention and effort","examples":["It takes time and patience to photograph wildlife.","I don't have the patience to do jigsaw puzzles.","Our patience was finally rewarded and we got the band's autographs."],"opposite":"","synonyms":""},{"def":"a card game for only one player","examples":[],"opposite":"","synonyms":""},{"def":"the quality of being extremely patient and not complaining","examples":["You need the patience of Job to deal with some of our customers."],"opposite":"","synonyms":""},{"def":"to make somebody feel impatient","examples":["His stubbornness would try the patience of a saint."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the patience of Job","def":"the quality of being extremely patient and not complaining","examples":["You need the patience of Job to deal with some of our customers."]},{"idiom":"try somebody’s patience","def":"to make somebody feel impatient","examples":["His stubbornness would try the patience of a saint."]}],"phrasal":[],"related":["the patience of Job","be patience, honesty, simplicity, etc. itself"]}]