[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pat/patte/pattern__us_3.mp3","phonsUS":"/ˈpætərn/","level":"A2","meanings":[{"def":"the regular way in which something happens or is done","examples":["changing patterns of urban life","We have no way of predicting next year's weather patterns.","behaviour/sleep/growth patterns","stress/intonation/speech patterns","Wages in both sectors have followed a similar pattern.","The studies show different patterns of distribution.","The music contains repeated rhythmic patterns.","Her speech patterns are very distinctive.","People have changed their spending patterns in response to changing conditions.","Portuguese colonial rule followed a similar pattern to that of other powers.","The overall pattern of our life changes little.","The pattern is clear: obesity is associated with lower incomes.","Their actions follow a very predictable pattern.","There is no set pattern for these meetings.","They analyzed employees' email usage patterns.","We can trace a familiar pattern to these events.","ideas that do not fit neatly into his patterns of thought","The murders all seem to follow a similar pattern.","an irregular sleeping pattern"],"opposite":"","synonyms":""},{"def":"an excellent example to copy","examples":["This system sets the pattern for others to follow.","Italy created the pattern for northern and central European art galleries.","Providing the most value for the lowest cost is the traditional pattern for corporate success."],"opposite":"","synonyms":""},{"def":"a regular arrangement of lines, shapes, colours, etc. for example as a design on material, carpets, etc.","examples":["a pattern of diamonds and squares","a shirt with a floral pattern","complex geometric patterns","He had arranged the glasses in a pattern on the table.","She drew patterns in the sand.","The jumper has a geometric pattern on it.","The roof beams form a star-like pattern.","The ice formed patterns on the windows.","the pattern on the carpet","wallpaper with a repeating pattern of interlocking shapes"],"opposite":"","synonyms":""},{"def":"a design, set of instructions or shape to cut around that you use in order to make something","examples":["a knitting pattern","She bought a dress pattern and some material."],"opposite":"","synonyms":""},{"def":"a small piece of material, paper, etc. that helps you choose the design of something","examples":["wallpaper patterns"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["pattern on","holding pattern","willow pattern","pattern something after something","pattern something on something"]},{"pos":"verb","level":"","meanings":[{"def":"to form a regular arrangement of lines or shapes on something","examples":["Frost patterned the window.","a landscape patterned by vineyards"],"opposite":"","synonyms":""},{"def":"to cause a particular type of behaviour to develop","examples":["Adult behaviour is often patterned by childhood experiences."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["pattern on"],"related":[]}]