[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pau/pause/pause__us_1.mp3","phonsUS":"/pɔːz/","level":"B2","meanings":[{"def":"to stop talking or doing something for a short time before continuing","examples":["Anita paused for a moment, then said: ‘All right’.","The woman spoke almost without pausing for breath (= very quickly).","I paused at the door and looked back.","Pausing only to pull on a sweater, he ran out of the house.","Just pause to think before giving me your answer.","She paused a moment and then walked away.","She paused occasionally to smell the flowers.","Without pausing to knock, she opened the door."],"opposite":"","synonyms":""},{"def":"to stop a video, etc. for a short time using the pause button","examples":["She paused the movie to go and answer the door."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["pause button","give (somebody) pause","give (somebody) pause for thought","a pregnant pause/silence"]},{"pos":"noun","level":"B2","meanings":[{"def":"a period of time during which somebody stops talking or stops what they are doing","examples":["There was a long pause before she answered.","After a brief pause, they continued climbing.","pause in something David waited for a pause in the conversation so he could ask his question.","without pause The rain fell without pause.","He made frequent pauses to catch his breath.","He read very slowly and with frequent pauses.","In the pause that followed, I noticed that he was shaking.","Shall we take a pause here?","She read the whole text without a pause."],"opposite":"","synonyms":""},{"def":"a sign (͒) over a note or a rest to show that it should be longer than usual","examples":[],"opposite":"","synonyms":""},{"def":"a control that allows you to stop a video, etc. for a short time","examples":["Press pause to stop the film."],"opposite":"","synonyms":""},{"def":"to make somebody think seriously about something or hesitate before doing something","examples":["Popular resistance to the measures should give the government pause."],"opposite":"","synonyms":""},{"def":"an occasion when nobody speaks, although people are aware that there are feelings or thoughts to express","examples":["There was a pregnant pause before she replied."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"give (somebody) pause","def":"to make somebody think seriously about something or hesitate before doing something","examples":["Popular resistance to the measures should give the government pause."]},{"idiom":"a pregnant pause/silence","def":"an occasion when nobody speaks, although people are aware that there are feelings or thoughts to express","examples":["There was a pregnant pause before she replied."]}],"phrasal":[],"related":[]}]