[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pea/peace/peace__us_1.mp3","phonsUS":"/piːs/","level":"A2","meanings":[{"def":"a situation or a period of time in which there is no war or violence in a country or an area","examples":["world peace","in peace The two communities live together in peace.","at peace The countries have been at peace for more than a century.","peace talks/negotiations","the peace process","a peace treaty/accord/agreement/deal","peace between A and B The negotiators are trying to make peace between the warring factions.","The fragile peace between North and South is threatened.","He is critical of US efforts to restore peace to the country.","to bring/promote/achieve/ensure peace","A UN force has been sent to keep the peace (= to prevent people from fighting).","After years of war, the people long for a lasting peace.","the peace movement (= that tries to prevent war by protesting, persuading politicians, etc.)","the Peace of Utrecht, 1713 (= the agreement ending the war)","Hopes for peace between the two nations are fading.","Here's an interesting piece of information.","An uneasy peace prevailed in the first days of the ceasefire.","The country is in a state of relative peace after ten years of fighting.","His country's actions threaten peace in the region.","The UN has resumed its efforts to broker peace.","An uneasy peace settled over the region.","The regime fell and peace reigned once more.","Any hopes of peace between the two nations seem to have faded.","The president is visiting the country on a peace mission.","Over 20 heads of state attended the peace talks.","Peace protesters came out in force for the biggest demonstration ever.","The peace movement grew in strength during the Cold War years.","Ironically the peace settlement was the cause of much future conflict.","Their efforts to bring about a peace accord soon failed.","He was awarded the Nobel Peace Prize.","Obviously world peace is our ultimate goal.","They prayed for peace on earth."],"opposite":"","synonyms":""},{"def":"the state of being calm or quiet","examples":["She lay back and enjoyed the peace of the summer evening.","I would work better if I had some peace and quiet.","I need to check that she is all right, just for my own peace of mind (= so that I do not have to worry).","at peace with yourself He never really felt at peace with himself.","at peace I felt calm and at peace.","Her father is at peace (= dead) now.","(law) They were charged with disturbing the peace (= behaving in a noisy and violent way).","in peace He just wants to be left in peace (= not to be disturbed).","Go away and leave me in peace!","He was enjoying the peace of his study.","Peace descended once more on the little town.","She finally found inner peace and happiness.","The island is a haven of peace and tranquillity.","The peace of the afternoon was suddenly shattered by a police siren.","She stopped shouting and peace reigned supreme once again."],"opposite":"","synonyms":""},{"def":"the state of living in friendship with somebody without arguing","examples":["in peace with somebody They simply can't seem to live in peace with each other.","in peace They live together in peace despite their differences.","at peace with somebody/something She felt at peace with the world.","world peace","I just need some peace and quiet."],"opposite":"","synonyms":""},{"def":"to say nothing although you would like to give your opinion","examples":[],"opposite":"","synonyms":""},{"def":"to end an argument with somebody, usually by saying you are sorry","examples":["He made peace with his brother when their father was dying."],"opposite":"","synonyms":""},{"def":"used when somebody is complaining that they have a lot of work to do","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"hold your peace/tongue","def":"to say nothing although you would like to give your opinion","examples":[]},{"idiom":"make (your) peace with somebody","def":"to end an argument with somebody, usually by saying you are sorry","examples":["He made peace with his brother when their father was dying."]},{"idiom":"(there’s) no peace/rest for the wicked","def":"used when somebody is complaining that they have a lot of work to do","examples":[]}],"phrasal":[],"related":["peace pipe","peace-loving","peace officer","peace process","peace dividend","peace offering","Peace Corps","peace in our time","Justice of the Peace","Prince of Peace","peace pipes","peace dividends","peace offerings","peace officers","rest in peace","Justices of the Peace","hold your tongue/peace"]}]