[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pea/peak_/peak__us_1.mp3","phonsUS":"/piːk/","level":"C1","meanings":[{"def":"the point when somebody/something is best, most successful, strongest, etc.","examples":["Traffic reaches its peak between 8 and 9 in the morning.","the peaks and troughs of married life","at the peak of something She's at the peak of her career.","Membership of the club has fallen from a peak of 600 people in 2006.","Her performance is just past its peak.","Production is rising back towards its 2008 peak.","The crisis was now at its peak.","The graph shows two very sharp price peaks.","The influx of tourists has reached its summer peak."],"opposite":"","synonyms":""},{"def":"the pointed top of a mountain; a mountain with a pointed top","examples":["a mountain peak","snow-capped/jagged peaks","The climbers made camp halfway up the peak.","We looked up at the rocky peaks towering above us.","Mount McKinley is the highest peak in North America.","Birdsong tends to peak in the spring mating season.","I have to peek out from behind a cushion when watching horror films.","She sneaked a peek at her watch.","He smashed his racket in a fit of pique.","He knew the cutting remark would pique his friend's vanity."],"opposite":"","synonyms":""},{"def":"any narrow and pointed shape, edge, etc.","examples":["Whisk the egg whites into stiff peaks.","He combed his hair into a peak."],"opposite":"","synonyms":""},{"def":"the stiff front part of a cap that sticks out above your eyes","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["off-peak","peak oil","peak rate","peak time","Pike's Peak","widow’s peak","Peak District","peak oils","peak viewing time"]},{"pos":"verb","level":"","meanings":[{"def":"to reach the highest point or value","examples":["Oil production peaked in the early 1980s.","Unemployment peaked at 17 per cent.","an athlete who peaks (= produces his or her best performance) at just the right time","Mount McKinley is the highest peak in North America.","Birdsong tends to peak in the spring mating season.","I have to peek out from behind a cushion when watching horror films.","She sneaked a peek at her watch.","He smashed his racket in a fit of pique.","He knew the cutting remark would pique his friend's vanity."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adjective","level":"","meanings":[{"def":"used to describe the highest level of something, or a time when the greatest number of people are doing something or using something","examples":["It was a time of peak demand for the product.","March is one of the peak periods for our business.","The athletes are all in peak condition.","We need extra help during the peak season."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]