[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pee/peer_/peer__us_1.mp3","phonsUS":"/pɪr/","level":"B2","meanings":[{"def":"a person who is the same age or who has the same social status as you","examples":["She enjoys the respect of her peers.","A peer review system is being introduced to help teachers who are experiencing difficulty.","Children are worried about failing in front of their peers.","Peer pressure is strong among young people (= they want to be like other people of the same age).","Children often take up smoking because of peer pressure.","Peer acceptance is particularly important for teenagers.","She is highly respected by her professional peers.","Some children fail to develop normal peer relations.","They adopt attitudes that are more socially acceptable among their peers.","We have seen several women who can outperform their male peers physically.","an extended family and peer network","teenagers trying to impress their peers"],"opposite":"","synonyms":""},{"def":"(in the UK) a member of the nobility or the House of Lords","examples":["MPs and peers from all parties met to discuss the issue.","She is the American-born wife of a Scottish peer.","Conservative peers are expected to criticize the scheme.","She described the incident as ‘unbecoming behaviour for a peer of the realm’."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["life peer","peer group","peer review","peer-to-peer","peer pressure","peer-reviewed","hereditary peer","peer groups","peer reviews"]},{"pos":"verb","level":"","meanings":[{"def":"to look closely or carefully at something, especially when you cannot see it clearly","examples":["We peered into the shadows.","He went to the window and peered out.","She kept peering over her shoulder.","He peered closely at the photograph.","I screamed and everyone stared.","We all gazed at Marco in amazement.","I looked at her and she glared stonily back.","A face was peering down at him.","He peered into the darkness.","His pale blue eyes peered anxiously at Vic.","I peered through the letter box.","She peered around the corner.","She peered out of the window.","She peered round into the farmyard.","She tried to peer over her shoulder.","peering short-sightedly at the book"],"opposite":"","synonyms":"stare"}],"idioms":[],"phrasal":[],"related":[]}]