[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pen/penal/penalty__us_1.mp3","phonsUS":"/ˈpenəlti/","level":"B2","meanings":[{"def":"a punishment for breaking a law, rule or contract","examples":["to impose a penalty","Assault carries a maximum penalty of seven years' imprisonment.","penalty for (doing) something The penalty for travelling without a ticket is £200.","Contractors who fall behind schedule incur heavy financial penalties.","Harsher penalties are being imposed for crimes involving firearms.","a penalty clause in a contract","without penalty You can withdraw money from the account at any time without penalty.","on penalty of something The Romans prohibited the teaching of the Torah on penalty of death.","He threatened stiffer penalties on young offenders.","He was seeking financial penalties against the company.","Some lenders charge heavy penalties for early settlement.","The legislation sanctions harsh mandatory penalties for weapons possession.","The penalty handed down was disproportionate to the crime committed.","There are redemption penalties if you pay off the mortgage early.","There is a fixed penalty fine of £50 for allowing your dog to foul public places.","These crimes carried with them the ultimate penalty of execution.","They made him promise, under penalty of death.","You must accept the penalty for your rash actions.","You will be given a fixed penalty notice if you fail to renew insurance on time.","a new system of fixed penalties for most traffic offences","crimes which carry severe penalties","the heavy financial penalties of leaving the scheme early","the heavy financial penalties of paying off the loan early","the penalty for murder","They deserve to face severe penalties.","The application should be signed under penalty of perjury."],"opposite":"","synonyms":""},{"def":"a disadvantage suffered as a result of something","examples":["One of the penalties of fame is loss of privacy.","It's just one of the penalties of fame.","People who lose their jobs are suffering the penalties for longer periods."],"opposite":"","synonyms":""},{"def":"a disadvantage given to a player or a team when they break a rule","examples":["He incurred a ten-second penalty in the first round."],"opposite":"","synonyms":""},{"def":"a chance to score a goal or point without any defending players, except the goalkeeper, trying to stop it; the goal or point that is given if it is successful. This chance is given because the other team has broken the rules.","examples":["Two minutes later Ford equalized with a penalty.","We were awarded a penalty after a late tackle.","I volunteered to take the penalty (= be the person who tries to score the goal/point)","He missed a penalty in the last minute of the game.","They won, thanks to a late penalty from Fry.","We were unlucky not to get a penalty.","They were leading until Rice gave away a penalty.","Ricketts netted his third penalty of the season to put his team ahead.","Kane scored from a first-half penalty."],"opposite":"","synonyms":""},{"def":"to suffer because of bad luck, a mistake or something you have done","examples":["He looked terrible this morning. I think he's paying the penalty for all those late nights.","They're now paying the price for past mistakes.","She thinks that any inconvenience is a price worth paying for living in such a beautiful place.","He's now paying the penalty for his misspent youth.","If Mac had killed Caroline, then he was going to make him pay the price."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"pay the/a penalty/price (for something/for doing something)","def":"to suffer because of bad luck, a mistake or something you have done","examples":["He looked terrible this morning. I think he's paying the penalty for all those late nights.","They're now paying the price for past mistakes.","She thinks that any inconvenience is a price worth paying for living in such a beautiful place.","He's now paying the penalty for his misspent youth.","If Mac had killed Caroline, then he was going to make him pay the price."]}],"phrasal":[],"related":["penalty box","tap penalty","penalty area","penalty kick","penalty point","penalty spot","death penalty","penalty shoot-out","penalty areas","penalty boxes","penalty kicks","penalty spots","penalty points","penalty shoot-outs","pay the/a penalty/price (for something/for doing something)"]}]