[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/peo/peopl/people__us_4.mp3","phonsUS":"/ˈpiːpl/","level":"A1","meanings":[{"def":"human beings; men, women and children","examples":["At least ten people were killed in the crash.","There were a lot of people at the party.","Many young people are out of work.","older people","They are just ordinary people.","Millions of working people are struggling.","It is important to involve local people in the project.","poor/rich people","people of faith (= people who are religious)","Many innocent people were killed.","The local tourist board is trying to attract more people to the town.","a line of limousines carrying very important people","access for disabled people","Working-class people in general get a bad deal from the legal system."],"opposite":"","synonyms":""},{"def":"humans in general; everyone","examples":["We want to change the way people think.","People want fresh, local food.","He wanted to help people fulfil their potential.","She tends to annoy people.","We encourage people to contact us.","He doesn't care what people think of him.","In the past, people were told to change their eating habits and they went on a diet."],"opposite":"","synonyms":""},{"def":"all the people who live in a particular place or belong to a particular country, race, etc.","examples":["the American/French people","black/white people","people of colour (= people who are not white)","the indigenous peoples of Mexico","We should strive for peace among the peoples of the world.","The rest of China's Muslim minorities are mostly Turkic peoples.","The organization campaigns for the rights of tribal peoples.","The caribou have traditionally been hunted by indigenous peoples in the area.","The book contains translations of folk poetry of the Slav peoples.","He researched the customs of the primitive peoples of the Amazon Basin.","the culture of the Basque people","These artists derived much of their imagery from the art of so-called primitive peoples.","The EU was intended to unite the peoples of Europe.","I was elected to represent the people of Bristol.","the native peoples of Siberia"],"opposite":"","synonyms":""},{"def":"men and women who work in a particular type of job or are involved in a particular area of activity","examples":["a meeting with business people and bankers","These garments are intended for professional sports people."],"opposite":"","synonyms":""},{"def":"the ordinary citizens of a country rather than those who govern or have a special position in society","examples":["the life of the common people","It was felt that the government was no longer in touch with the people."],"opposite":"","synonyms":""},{"def":"the men, women and children that a person leads","examples":["The king urged his people to prepare for war.","the story of the Zulu leader who died while attempting to free his people"],"opposite":"","synonyms":""},{"def":"the men and women who work for you or support you","examples":["I've had my people watching the house for a few days.","Our people are all highly trained and motivated."],"opposite":"","synonyms":""},{"def":"guests or friends","examples":["I'm having people to dinner this evening."],"opposite":"","synonyms":""},{"def":"the men, women and children that you are closely related to, especially your parents, grandparents, etc.","examples":["She's spending the holidays with her people."],"opposite":"","synonyms":""},{"def":"to please everyone by changing your attitudes or opinions to suit different people","examples":[],"opposite":"","synonyms":""},{"def":"to be understood or used in different ways by different people","examples":[],"opposite":"","synonyms":""},{"def":"a man/woman who understands and supports ordinary people","examples":["He is not only a statesman, but also a man of the people."],"opposite":"","synonyms":""},{"def":"when you say of all people, you are emphasizing that somebody is the person you would most or least expect to do something","examples":["She of all people should know the answer to that."],"opposite":"","synonyms":""},{"def":"you should not criticize other people, because they will easily find ways of criticizing you","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be all things to all men/people","def":"to please everyone by changing your attitudes or opinions to suit different people","examples":[]},{"idiom":"a man/woman of the people","def":"a man/woman who understands and supports ordinary people","examples":["He is not only a statesman, but also a man of the people."]},{"idiom":"of all people","def":"when you say of all people, you are emphasizing that somebody is the person you would most or least expect to do something","examples":["She of all people should know the answer to that."]},{"idiom":"people (who live) in glass houses shouldn’t throw stones","def":"you should not criticize other people, because they will easily find ways of criticizing you","examples":[]}],"phrasal":[],"related":["People","boat people","Beaker People","little people","people person","people power","people skills","street people","people carrier","people smuggler","people smuggling","people trafficker","people-watching","people trafficking","Sunday People","People's Dispensary for Sick Animals","National Association of Clubs for Young People","Royal National Institute for Deaf People"]},{"pos":"verb","level":"","meanings":[{"def":"to live in a place or fill it with people","examples":["be peopled by somebody The town was peopled largely by workers from the car factory and their families.","be peopled with something The ballroom was peopled with guests.","Her novels are peopled with interesting, complex characters."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"","level":"","meanings":[{"def":"a popular US magazine published each week. It contains photographs of and articles about film and television stars, as well as news stories. It was begun in 1974.","examples":[],"opposite":"","synonyms":""},{"def":"The Sunday People","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]