[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/per/perce/perception__us_1.mp3","phonsUS":"/pərˈsepʃn/","level":"B2","meanings":[{"def":"an idea, a belief or an image you have as a result of how you see or understand something","examples":["a campaign to change public perception of the police","perception that… There is a general public perception that standards in schools are falling.","There's a general perception that standards of healthcare are falling.","The growing perception that their needs were being ignored spurred the group to further action.","a marketing strategy to overcome negative public perception of the company","Your brand name should create a distinctive perception in the customer's mind.","This film challenges traditional perceptions of older people.","This study dispels the perception that men are better drivers.","Further research should lead to an enhanced perception of the issues facing developing nations.","We need to gain a clearer perception of how young people feel about the problem.","Movies have shaped our perception of many historical events.","The book explores the changing perceptions about gender.","The company wanted to boost the overall perception of the brand.","The survey reflects the perceptions of business people around the world.","These developments hardly affected the public perception of the crisis."],"opposite":"","synonyms":""},{"def":"the way you notice things, especially with the senses","examples":["Everyone's perception of reality is slightly different.","visual perception","If we improve drivers' hazard perception, road deaths will fall.","The computer changes our perceptions of place and time.","cultural differences in risk perception between European students and their American counterparts","heightened perception caused by drugs"],"opposite":"","synonyms":""},{"def":"the ability to understand the true nature of something","examples":["She showed great perception in her assessment of the family situation.","They have little perception of how ordinary people live their lives."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["extrasensory perception"]}]