[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/per/perfo/performance__us_2.mp3","phonsUS":"/pərˈfɔːrməns/","level":"B1","meanings":[{"def":"the act of performing a play, concert or some other form of entertainment","examples":["The performance starts at seven.","an evening performance","They put on performances for the tourists.","This was one of the band's rare live performances.","performance of something They gave a performance of Ravel’s String Quartet","performance by somebody/something a series of performances by the Kirov Ballet","The company is putting on a performance of the popular musical ‘Cats’.","The course aims to develop the children's appreciation of music in performance.","The musical closes this week after a record number of performances.","The singer is renowned for his live concert performances.","Please refrain from talking during the performance."],"opposite":"","synonyms":""},{"def":"the way a person performs in a play, concert, etc.","examples":["She gave the greatest performance of her career.","Both actors deliver outstanding performances.","an excellent/a fine/an impressive performance","Finney gives a virtuoso performance as a psychopath.","Mel Gibson's central performance in the film as Hamlet","The band gave a great performance at the festival.","The film has a great performance from Jack Lemmon.","The quality of his performance was unmatched.","The recording gives the most convincing performance of Stravinsky's ‘Rite of Spring’ to date.","his flawless performance on the piano","her fine performance as Ophelia","They gave a magnificent performance of Ravel's String Quartet.","an Oscar-winning performance from Kate Winslet"],"opposite":"","synonyms":""},{"def":"how well or badly you do something; how well or badly something works","examples":["the country's strong economic performance over the last two years","It was an impressive performance by the French team.","He criticized the recent poor performance of the company.","Her academic performance has been inconsistent.","Profits continue to grow, with strong performances in South America and the Far East.","The team has continued to improve performance.","This machine delivers excellent performance at a very competitive price.","to measure/evaluate the performance of somebody/something","high-performance (= very powerful) cars","performance indicators (= things that show how well or badly something is working)","He got top marks for overall academic performance.","Sales forecasts were based on past performance.","The agency has developed a set of core performance indicators to compare schools.","The team put in an excellent performance at the World Cup.","to maintain a high level of performance","The new management techniques aim to improve performance.","The goal is to enhance the performance of biofuels."],"opposite":"","synonyms":""},{"def":"the act or process of performing a task, an action, etc.","examples":["She has shown enthusiasm in the performance of her duties.","He did not want a repeat performance of the humiliating defeat he had suffered.","The party are dreading a repeat performance of their defeat in the last election."],"opposite":"","synonyms":""},{"def":"an act that involves a lot of effort or trouble, sometimes when it is not necessary","examples":["It's such a performance getting the children off to school in the morning.","He always goes through the whole performance of checking the oil and water even if we’re in a hurry."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["high-performance","performance art","command performance","performance-related","performance review","performance-enhancing","pay-for-performance","Royal Film Performance","Royal Variety Performance"]}]