[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/per/perfo/perform__us_2.mp3","phonsUS":"/pərˈfɔːrm/","level":"A2","meanings":[{"def":"to entertain an audience by playing a piece of music, acting in a play, etc.","examples":["to perform a song/dance/play","The play was first performed in 2007.","Visiting artists will perform their music and poetry.","I'm looking forward to seeing you perform.","I'd love to see them perform live (= in a live show, not a recording).","What do you like about performing on stage?","I've never seen this play performed before.","The group will be performing live on tonight's show.","The play was first publicly performed in 1872.","The two artists have never performed together before.","He performed a few magic tricks at the party.","to perform somersaults/​magic tricks","I'd like to hear it performed live."],"opposite":"","synonyms":""},{"def":"to do something, such as a piece of work, task or duty","examples":["She performs an important role in our organization.","A computer can perform many tasks at once.","to perform a function/duty","to perform an analysis/a test/an experiment","to perform a ceremony/ritual","(medical) to perform an operation/a procedure/surgery","The procedure was performed safely on ten patients.","The prince is no longer able to perform his duties.","Who ensures that tasks are properly performed?","those who faithfully perform their duties","This operation has never been performed in this country.","All subjects performed the experiment twice.","All analyses were performed on the entire sample."],"opposite":"","synonyms":""},{"def":"to work or function well or badly","examples":["The engine seems to be performing well.","The company has been performing poorly over the past year.","England's players perform better for their clubs than for their country.","to perform admirably/brilliantly/strongly","She performed less well in the second test.","They gather information on how businesses are performing.","If Bale performs (= performs well) then I believe Wales can win.","One or two of the players performed brilliantly.","The car performed poorly at high speeds.","The company has been performing strongly over the past year.","students who are expected to perform well","Once your body demonstrates its ability to perform, you will feel more confident."],"opposite":"","synonyms":""},{"def":"to achieve very good results","examples":["Her exercise programme has worked miracles for her.","You can work miracles with very little money if you follow our home decoration tips.","He performed miracles to get everything ready in time.","Don't expect this medicine to work miracles.","You shouldn't expect the treatment to work miracles."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"work/perform miracles","def":"to achieve very good results","examples":["Her exercise programme has worked miracles for her.","You can work miracles with very little money if you follow our home decoration tips.","He performed miracles to get everything ready in time.","Don't expect this medicine to work miracles.","You shouldn't expect the treatment to work miracles."]}],"phrasal":[],"related":["work/perform miracles","do, perform, stage a disappearing act","do, perform, stage a vanishing act"]}]