[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/per/perio/period__us_2.mp3","phonsUS":"/ˈpɪriəd/","level":"A1","meanings":[{"def":"a particular length of time","examples":["a long/an extended period","a short/brief period","period of something a period of transition/uncertainty/expansion","a period of two years/six months/four weeks","a two-year/six-month/four-week period","All these changes happened over a period of time.","A year-to-year lease has no fixed time period.","for a period The offer is available for a limited period only.","This compares with a 4% increase for the same period last year.","The project will run for a six-month trial period.","over a period The hall will be closed over a 2-year period.","during a period We know little of her life during that period.","The aim is to reduce traffic at peak periods.","Tomorrow will be cold with sunny periods.","Committee members will not be eligible for re-election within a period of two years.","Eastern Europe entered a period of transition in the 1990s.","Public spending was cut during his period of office.","Sales have gone up in the last-five-year period.","The balance must be paid within an agreed period of time.","The film spans a period of 40 years of Castro's rule.","The medication is prescribed for a fixed period of time.","The most formative period of life is childhood.","The period was marked by a succession of financial crises.","The view is that the government's honeymoon period is over.","There will be a reduced bus service over the Christmas period.","Try breaking your period of study into 20-minute blocks.","We lived in Caracas for a brief period.","We visited five different cities within a two-day period.","You can use the software free for a 30-day trial period.","You have been paid for the full period of your employment with us.","a critical period in the development of the project","a happy period in her life","a period of transition between communist rule and democratic government","a period of transition from a totalitarian regime to democratic government","after a long period of waiting","during the intervening period","the period between his resigning and finding a new job","the period from 1 July to 31 December","There are extra buses at peak periods.","There was a long period of uncertainty before we knew the final decision."],"opposite":"","synonyms":""},{"def":"a length of time in the life of a particular person or in the history of a particular country","examples":["Which period of history would you most like to have lived in?","This textbook covers the post-war period.","The church dates from the Norman period.","We are currently studying the early medieval period.","Like Picasso, she too had a blue period.","Most teenagers go through a period of rebelling.","The picture was painted by Picasso during his blue period.","the late Victorian period","the period covered by the book","a dark period in the country's history"],"opposite":"","synonyms":""},{"def":"a length of time which is a division of an era. A period is divided into epochs.","examples":["the Jurassic period","Dinosaurs died out during the Cretaceous period."],"opposite":"","synonyms":""},{"def":"any of the parts that a day is divided into at a school, college, etc. for study","examples":["‘What do you have next period?’ ‘French.’","a free/study period (= for private study)","We've got French next period.","I have two free periods on Tuesday afternoons."],"opposite":"","synonyms":""},{"def":"the flow of blood each month from the body of a woman who is not pregnant","examples":["period pains","monthly periods","When did you last have a period?","I was thirteen when I started my period.","I have my period and don't feel too great.","Missing a period is often one of the first signs that a woman is pregnant."],"opposite":"","synonyms":""},{"def":"the mark ( . ) used at the end of a sentence and in some abbreviations, for example e.g.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["free period","period piece","safe period","cooling-off period","period pieces","incubation period"]},{"pos":"adverb","level":"","meanings":[{"def":"used at the end of a sentence to emphasize that there is nothing more to say about a subject","examples":["The answer is no, period!"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adjective","level":"","meanings":[{"def":"having a style typical of a particular time in history","examples":["period costumes/furniture"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]