[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/per/permi/permission__us_2.mp3","phonsUS":"/pərˈmɪʃn/","level":"A2","meanings":[{"def":"the act of allowing somebody to do something, especially when this is done by somebody in a position of authority","examples":["permission for something You must ask permission for all major expenditure.","permission to do something After much persuasion, permission was granted to speak to the refugees at the camp.","The school has been refused permission to expand.","All minors must seek parental permission to marry.","permission for somebody/something to do something No official permission has been given for the event to take place.","permission from somebody/something You shouldn't rent out your property without seeking permission from your mortgage lender.","permission from somebody/something to do something He had to get permission from his parents to audition for the show.","without permission She took the car without permission.","with somebody's permission (formal) With your permission, I'd like to say a few words.","by permission of somebody poems reprinted by kind permission of the author","Would you mind if I opened the window?","Could I possibly borrow your phone?","I hate to ask, but could I please borrow your phone?","Do you happen to have a pair of gloves I could borrow for the evening?","Would it be all right if I left five minutes early?","Is there any chance that we could stay at your house the night before our flight?","Would it be OK to leave my bag here?","Yes, of course.","Go ahead.","That's fine.","I'd rather you didn't, if you don't mind.","I'd prefer it if you asked somebody else.","If there's someone else you can ask, I'd be grateful.","We couldn't get permission to film in Primrose Hill.","I did not give permission for anyone to print it or copy it.","She was given permission for a three-month visit to Asia.","Staff may not leave early without the express permission of the director.","The council granted outline permission for the construction of a house on the land.","The illustrations are reproduced by kind permission of the British Library.","The information was published with the full permission of Amnesty International.","They chopped the trees down without having been granted the necessary permission.","permission to park","He had taken the car without his father's permission.","I asked permission to photograph the house.","Of course you can. You don't need to ask my permission.","The portrait is reproduced by kind permission of the artist.","They applied for permission to put up a temporary structure.","They were given permission to enter the building.","Who gave permission for this?"],"opposite":"","synonyms":""},{"def":"an official written statement allowing somebody to do something","examples":["The publisher is responsible for obtaining the necessary permissions to reproduce illustrations.","The report recommends that all planning permissions for quarrying in national parks should expire in ten years."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["planning permission"]}]