[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/per/permi/permit__us_1.mp3","phonsUS":"/pərˈmɪt/","level":"B2","meanings":[{"def":"to allow somebody to do something or to allow something to happen","examples":["be permitted Mobile phones are not permitted in the examination room.","be permitted something We were not permitted any contact with each other.","be permitted to do something Visitors are not permitted to take photographs.","permit something The owners have been unwilling to permit the use of their land.","There are fines for exceeding permitted levels of noise pollution.","permit somebody/yourself something Jim permitted himself a wry smile.","permit somebody/yourself to do something The bill was designed to permit new fathers to take time off work.","She would not permit herself to look at them.","(formal) Permit me to offer you some advice.","I'm sorry, smoking isn't allowed./You're not allowed to smoke here.","Would you mind not talking during the music?","Could I ask you not to use your phone here, please?","I'm afraid I have to ask you not to take pictures here.","Development is not normally permitted in conservation areas.","A new constitution permitted the formation of political parties.","People are breathing in more than five times the permitted level of pollutants.","Permit me to make a suggestion.","The banks were not permitted to invest overseas.","The rules of the club do not permit it.","They were permitted to stay in the country on humanitarian grounds."],"opposite":"","synonyms":""},{"def":"to make something possible","examples":["We hope to visit the cathedral, if time permits.","I'll come tomorrow, weather permitting (= if the weather is fine).","permit something The password permits access to all files on the hard disk.","The length of the report does not permit a detailed discussion of the problems.","permit somebody/something to do something Cash machines permit you to withdraw money at any time."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["work permit","learner’s permit"]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/per/permi/permit__us_2.mp3","phonsUS":"/ˈpɜːrmɪt/","level":"B2","meanings":[{"def":"an official document that gives somebody the right to do something, especially for a limited period of time","examples":["a parking/building permit","to apply for a permit","permit for something The agency issued permits for exploratory drilling.","The company failed to obtain the necessary permits for the landfill project.","You cannot enter the military base without a permit.","They applied for a permit for a street demonstration against university fees.","You can't film here without a permit.","His 30-day permit expires on Tuesday.","I asked to see his permit.","My parking permit was due to be renewed.","We asked for a permit to enter the compound.","You will need to apply for a fishing permit."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]