[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/per/perso/personal__us_4.mp3","phonsUS":"/ˈpɜːrsənl/","level":"A1","meanings":[{"def":"your own; not belonging to or connected with anyone else","examples":["The novel is written from personal experience.","a personal account of her experiences","personal effects/belongings/possessions","I take personal responsibility for the incident.","Of course, this is just a personal opinion.","a personal preference/view","Her art is deeply personal.","intensely/highly personal","I need my own personal space.","The software is for personal use only (= no one else can use it).","The movie is a uniquely personal exploration of the effects of war.","The receptionist asked for my personal details.","They packed up their personal belongings and left.","Use stencils to add a few personal touches to walls and furniture.","He was popular as much for his personal qualities as for his management skills.","Drawing is an intensely personal art form.","This song is a personal favourite of mine."],"opposite":"","synonyms":""},{"def":"between individual people who know each other","examples":["Having good personal relationships is the most important thing for me.","She is a personal friend of mine."],"opposite":"","synonyms":""},{"def":"connected with a person’s private life, rather than their job or official position","examples":["I try not to let work interfere with my personal life.","personal information/data/details (= information about you that not everyone can know)","The letter was marked ‘Personal’.","I'd like to talk to you about a personal matter.","Please keep personal phone calls to a minimum.","I'd rather not talk about it, it's personal.","He moved to San Francisco for personal reasons.","This is a strictly personal decision.","The views expressed here are purely personal.","It felt too personal to tell you.","highly personal information"],"opposite":"","synonyms":""},{"def":"done by a particular person rather than by somebody who is acting for them","examples":["The President made a personal appearance at the event.","I shall give the matter my personal attention.","She takes a personal interest in the work of the charity.","The Principal has little personal contact with the students."],"opposite":"","synonyms":""},{"def":"made or done for a particular person rather than for a large group of people or people in general","examples":["We offer a personal service to all our customers.","a personal pension plan (= a pension organized by a private company for one particular person)","Will you do it for me as a personal favour?"],"opposite":"","synonyms":""},{"def":"referring to a particular person’s character, appearance, opinions, etc. in a way that is offensive","examples":["Try to avoid making personal remarks.","I felt the criticism crossed the line and became a personal attack.","Then he got personal and brought my family into it.","It's nothing personal (= I do not wish to offend you) but I have to correct you on that point."],"opposite":"","synonyms":""},{"def":"connected with a person’s body","examples":["personal cleanliness/hygiene","She's always worrying about her personal appearance.","This insurance policy covers you against personal injury or death."],"opposite":"","synonyms":""},{"def":"physically very close to somebody; getting to know them well","examples":["Get up close and personal with the koalas at the San Diego Zoo.","For the last 30 years, I’ve been up close and personal with people whose lives were in crisis."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"up close and personal","def":"physically very close to somebody; getting to know them well","examples":["Get up close and personal with the koalas at the San Diego Zoo.","For the last 30 years, I’ve been up close and personal with people whose lives were in crisis."]}],"phrasal":[],"related":["personal ad","personal best","personal day","personal action","personal check","personal column","personal computer","personal injury","personal pronoun","personal shopper","personal space","personal stereo","personal trainer","personal allowance","personal assistant","personal exemption","personal organizer","personal statement","Personal Equity Plan","personal protective equipment"]}]