[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/per/persu/persuade__us_2.mp3","phonsUS":"/pərˈsweɪd/","level":"B1","meanings":[{"def":"to make somebody do something by giving them good reasons for doing it","examples":["persuade somebody to do something Try to persuade him to come.","persuade somebody Please try and persuade her.","She's always easily persuaded.","I'm sure he'll come with a bit of persuading.","persuade somebody into something I didn't want to go, but my friends persuaded me into it.","persuade somebody into doing something I allowed myself to be persuaded into entering the competition.","persuade somebody out of something There was no way to persuade him out of it (= persuade him not to do it).","persuade somebody out of doing something My sister persuaded me out of dying my hair.","Dictators can sometimes be gently persuaded to leave power with special deals that guarantee their safety.","He eventually managed to persuade one of the staff to let him in.","He somehow persuaded the studio to let him make the film.","I was reluctantly persuaded to join the committee.","She was easily persuaded to accompany us.","The education minister personally persuaded the prime minister to rethink.","They had difficulty in persuading the two sides to sit down together.","Can you persuade him to come?","an unsuccessful attempt to persuade her colleagues","She was persuaded into marriage against her will.","She was persuaded into buying an expensive dress.","Why not invite Larry, if he can be persuaded out of hibernation?"],"opposite":"","synonyms":""},{"def":"to make somebody believe that something is true","examples":["persuade somebody/yourself that… It will be difficult to persuade them that there's no other choice.","She had persuaded herself that life was not worth living.","persuade somebody No one was persuaded by his arguments.","persuade somebody of something (formal) I am still not fully persuaded of the plan's merits.","I tried to persuade her to see a doctor.","He convinced me he was right.","I persuaded/​convinced her to see a doctor.","It has been difficult to persuade people that we have no political objectives.","I am not fully persuaded by these arguments.","We must persuade the government of the need for change."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]