[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/per/perso/personality__us_4.mp3","phonsUS":"/ˌpɜːrsəˈnæləti/","level":"A2","meanings":[{"def":"the various aspects of a person’s character that combine to make them different from other people","examples":["His wife has a strong personality.","My outgoing personality has definitely helped me succeed.","He maintained order by sheer force of personality.","normal human personality traits (= qualities), such as shyness","Participants identified their own personality type and explored the implications.","The characters' names reflect their personalities.","There are likely to be tensions and personality clashes in any social group.","People’s clothes are often an expression of their personality.","Barbara has a very forceful personality.","For the first time she was seeing the more unpleasant aspects of her husband's personality.","From your personality profile, it seems you're interested in politics.","He has achieved success by the sheer strength of his personality.","His choice of clothes reflects his personality.","She manages to project a very distinct personality.","She stamped her personality on the company.","The events of her early life shaped her personality.","The job didn't really suit my personality.","There was a personality clash between two members of the committee.","a troubled man who had a vulnerable personality","her amiable nature and easy-going personality","personality conflicts between a faculty member and a student","Her clothes reflect her lively personality.","All candidates have to undergo a personality test.","He developed a split personality after the crash (= began to suffer from split-personality disorder).","The children all have very different personalities."],"opposite":"","synonyms":""},{"def":"the qualities of a person’s character that make them interesting and attractive","examples":["We need someone with lots of personality to head the project.","She was very beautiful but seemed to lack personality.","He had no screen presence and lacked any real personality.","He has the presence and personality to hold audiences spellbound.","She has brought out her husband's personality since their relationship began."],"opposite":"","synonyms":""},{"def":"a famous person, especially one who works in entertainment or sport","examples":["a well-known TV/radio/sports personality","Various personalities from the world of music were invited.","In a viewers' poll he was voted TV Personality of the Year.","a broadcast network with well-known on-air personalities"],"opposite":"","synonyms":""},{"def":"a person whose strong character attracts attention","examples":["Their son is a real personality."],"opposite":"","synonyms":""},{"def":"the qualities of a place or thing that make it interesting and different","examples":["The problem with many modern buildings is that they lack personality.","Interesting displays can add personality to your store window."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["personality cult","personality disorder","cult of personality","split personality disorder","borderline personality disorder","multiple personality disorder","personality cults","personality disorders","multiple-personality disorder","split-personality disorder","borderline personality disorders"]}]