[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pet/petit/petition__us_1.mp3","phonsUS":"/pəˈtɪʃn/","level":"C1","meanings":[{"def":"a written document signed by a large number of people that asks somebody in a position of authority to do or change something","examples":["petition against something Would you like to sign our petition against experiments on animals?","petition for something The workers are getting up (= starting) a petition for tighter safety standards.","to present/deliver a petition","to start/launch a petition","Councillors were presented with a petition calling for more money to be spent on policing the area.","Local government supports the petition for a new hospital.","The company had actively circulated petitions to get rid of the union.","The petition opposes the closures.","The petition supports the plan to rebuild the road.","The players drew up a petition and presented it to the coach.","They delivered petitions with nearly 20 000 signatures to the Senate.","They've threatened to get up a petition against the plan.","Two million people signed the recall petition.","We're getting up a petition against the proposed building plans.","We've started an online petition.","a petition asking him to reconsider","a petition by local residents","a petition in favour of reform"],"opposite":"","synonyms":""},{"def":"an official document asking a court to take a particular course of action","examples":["a bankruptcy petition","petition for something Her husband has already filed a petition for divorce.","a divorce petition on behalf of Terri Jones","The petition will be heard tomorrow.","The district court has opposed the petition by the local electricity company.","The deadline for filing nominating petitions for the primary election was Tuesday.","She filed a habeas corpus petition on Padilla's behalf.","Her petition for divorce was granted.","He can file a petition for writ of habeas corpus."],"opposite":"","synonyms":""},{"def":"a formal prayer to God or request to somebody in authority","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to make a formal request to somebody in authority, especially by sending them a petition","examples":["petition for/against something Local residents have successfully petitioned against the siting of a prison in their area.","petition somebody/something (for something) The group intends to petition Parliament for reform of the law.","petition somebody/something to do something Parents petitioned the school to review its admission policy."],"opposite":"","synonyms":""},{"def":"to formally ask for something in court","examples":["petition for something His wife petitioned for divorce in 1997.","petition somebody/something (for something) He petitioned the court for a new trial.","petition somebody/something to do something She petitioned the judge to restore her licence."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]