[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pho/phone/phone__us_1.mp3","phonsUS":"/fəʊn/","level":"A1","meanings":[{"def":"a piece of equipment for talking to people who are not in the same place as you","examples":["I have to make a phone call.","The phone rang and Pat answered it.","Can someone answer the phone?","I hadn't got my phone with me.","Please switch off your phones before the show begins.","a phone conversation/interview","Here is our list of top new phone apps.","Were there any phone calls for me?","How do I make a local call?","I’ll give you a call tonight.","I’ll give you a ring tonight.","Can you get the phone?","He was called to the phone just as he was leaving.","His phone is almost permanently engaged.","I turned on my phone.","I've lost my phone charger.","If the phone rings, don't answer it.","The phone suddenly went dead in the middle of our conversation.","The phone was busy when I called.","The phone was ringing off the hook.","a £30 fine if caught holding a phone while driving","the modern business of selling phone handsets","His phone must be switched off.","He unplugged the phone as he didn't want to be disturbed."],"opposite":"","synonyms":""},{"def":"the system for talking to somebody else using a phone","examples":["by phone They like to do business by phone.","on the phone I talk to my family on the phone.","over the phone I can't talk about this over the phone.","a phone bill","They want to put up a new phone mast next to the school.","Most people only need one phone line.","Could I speak to Jay Black, please?","Could you give him a message?","Is there a time that might be good for me to try him again?","Can you let him know I’ll call back?","Could you ask him to call me back? My number is…","I haven't seen her but we spoke over the phone.","I think our phone is being tapped.","The modem links the computer to a phone line.","The search of the phone records yielded nothing.","We keep in contact by phone but we rarely see each other.","We spoke on the phone the other day.","Phone lines in the city had been cut.","The toll-free phone line is open from 8 : 30 a.m. to 6 : 30 p.m."],"opposite":"","synonyms":""},{"def":"the part of a landline phone that you hold in your hand and speak into","examples":["to pick up the phone","to put the phone down","to take the phone off the hook (= so that no one can call)","I couldn't get through because you'd left the phone off the hook.","I grabbed the phone and called Josie's number.","I hung up the phone when he started shouting at me.","I picked up the phone receiver and pressed it to my ear.","She cradled the phone between her ear and shoulder.","She slammed the phone down in a rage."],"opposite":"","synonyms":""},{"def":"an instrument that uses or makes sound","examples":["dictaphone","xylophone"],"opposite":"","synonyms":""},{"def":"speaking a particular language; a person who does this","examples":["anglophone","francophone"],"opposite":"","synonyms":""},{"def":"a sound made in speech, especially when not considered as part of the sound system of a particular language","examples":[],"opposite":"","synonyms":""},{"def":"to be using the phone","examples":["He's been on the phone to Kate for more than an hour.","She's on the phone at the moment."],"opposite":"","synonyms":""},{"def":"to have a phone in your home or place of work","examples":["They're not on the phone at the holiday cottage."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be on the phone","def":"to be using the phone","examples":["He's been on the phone to Kate for more than an hour.","She's on the phone at the moment.","They're not on the phone at the holiday cottage."]}],"phrasal":[],"related":["phone in","phone-in","car phone","phone box","phone tag","cell phone","flip phone","phone book","phone booth","phone call","phone tree","feature phone","mobile phone","phone hacker","phone hacking","phone number","phone tapping"]},{"pos":"verb","level":"A1","meanings":[{"def":"to make a phone call to somebody","examples":["I was just phoning up for a chat.","He phoned to invite me out for dinner.","phone for something Someone phone for an ambulance!","phone about something I’m phoning about your ad in the paper.","phone back Could you phone back later?","phone home He phoned home, but there was no reply.","phone somebody/something Don't forget to phone New York.","For reservations, phone 020 281 3964.","Someone phoned the police.","Phone them up and find out when they are coming.","Were there any phone calls for me?","How do I make a local call?","I’ll give you a call tonight.","I’ll give you a ring tonight.","Could you phone me back later?","Dan phoned for a taxi.","Jane phoned up about the meal tonight.","She phoned home to say she'd be late.","You can phone me on this number."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["phone in"],"related":[]}]