[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pho/photo/photograph__us_2.mp3","phonsUS":"/ˈfəʊtəɡræf/","level":"A1","meanings":[{"def":"a picture that is made by using a camera that stores images in digital form or that has a film sensitive to light inside it","examples":["aerial photographs of the crash site","colour/black-and-white photographs","an exhibition of photographs by Annie Liebowitz","a framed photograph of her grandchildren","His photograph appeared in the local paper.","Please enclose a recent passport-sized photograph of yourself.","I spent the day taking photographs of the city.","to post/upload a photograph","to publish/release a photograph","a photograph of the house","Can I take a photograph?","We had our picture taken in front of the hotel.","a passport photo","I tried to get a shot of him in the water.","holiday snaps","a set of prints","An aerial photograph of the field shows clearly where the buildings were.","Can I have my photograph taken with you?","Did you manage to get a photograph of the goal?","Frame the subject in the video viewfinder as you would for a still photograph.","He admitted offences of possessing indecent photographs of children.","Her photograph appeared in all the papers.","I cropped the photograph and mounted it on some card.","I got some great photographs of the party.","I prefer to print my digital photographs.","I scanned in some photographs of the family to send to friends by email.","I'm learning how to post photographs on my blog.","Send a recent facial photograph of yourself with your application.","She scans each photograph into her computer.","Tell me who everyone is in the photograph.","The book is illustrated with 96 action photographs.","The cover photograph of one magazine showed a dying soldier.","The first issue featured a photograph of Martha Graham on the cover.","The newspaper published a grainy photograph of her.","The next day they published photographs of the kidnappers.","The photograph has been touched up to conceal her double chin.","The photograph manages to capture the excitement of the occasion.","The photographs were clear and sharp.","The sun rising over the horizon would have made a good photograph.","The wing is assembled as shown in the photograph below.","This photograph is out of focus.","Tinted photographs were an early substitute for colour.","Upload your photographs to one of these sites.","We looked through her old black-and-white photographs.","We posed for a group photograph.","a couple of photographs released by news agencies","a fuzzy black-and-white photograph","a photograph of my son Edmund","editing software that enables you to enlarge and crop photographs","photograph courtesy Liverpool Evening News","satellite photographs of Beijing","the famous photograph of Che Guevara","the photographs stored on the memory card"],"opposite":"","synonyms":"photograph"}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"A2","meanings":[{"def":"to take a photograph of somebody/something","examples":["photograph somebody/something a workshop on photographing wildlife","a beautifully photographed book (= with very good photographs in it)","photograph somebody/something + adj. She refused to be photographed nude.","photograph somebody/something doing something They were photographed playing with their children.","He has photographed many other celebrities too.","She was photographed entering Downing Street.","They are constantly photographed by the paparazzi."],"opposite":"","synonyms":""},{"def":"to look or not look attractive in photographs","examples":["Some people just don't photograph well."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]