[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pic/pictu/picture__us_2.mp3","phonsUS":"/ˈpɪktʃər/","level":"A1","meanings":[{"def":"a painting or drawing, etc. that shows a scene, a person or thing","examples":["He likes books with lots of pictures in them.","picture of somebody/something A picture of flowers hung on the wall.","The children were drawing pictures of their pets.","She wanted a famous artist to paint her picture (= a picture of herself).","The children were drawing pictures of their pets.","a collection of paintings by American artists","a pencil/​charcoal drawing","Vermeer’s ‘Portrait of the artist in his studio’","a self-portrait (= a painting that you do of yourself)","a Renoir print","I usually do a few very rough sketches before I start on a painting.","It's a picture of a country village.","It's a picture of the Grand Canyon.","The book has simple stories and pictures to colour in.","The story is told in pictures."],"opposite":"","synonyms":"picture"},{"def":"a photograph","examples":["to take a picture","We had our picture taken in front of the hotel.","The picture shows the couple together on their yacht.","picture of somebody/something She posted a picture of the two of them on her Facebook page.","Have you got any pictures of your trip?","The star shared the picture on Twitter.","to upload/send/tweet a picture","a photograph of the house","Can I take a photograph?","We had our picture taken in front of the hotel.","a passport photo","I tried to get a shot of him in the water.","holiday snaps","a set of prints","The picture shows a family gathered around a kitchen table.","This is a picture/​photo of a busy city street.","In the foreground/​background, we can see a group of protesters.","In the bottom right-hand corner/​top left-hand corner, there's a child sitting alone.","On the left/​On the right/​In the middle, someone is standing with a bottle in his hand.","In the cartoon, we can see two people looking at a newspaper headline.","The cartoonist has drawn the man to represent a typical businessman.","I can't see you in the picture.","I got some good pictures of the procession.","This picture shows the man with his family.","His picture appeared in the local paper."],"opposite":"","synonyms":"photograph"},{"def":"an image on a television screen","examples":["harrowing television pictures of the famine","You are looking at live pictures of midtown Manhattan.","poor picture quality"],"opposite":"","synonyms":""},{"def":"a description that gives you an idea in your mind of what something is like","examples":["We've only got scraps of information, not the full picture.","picture of something The writer paints a gloomy picture of the economy.","a bleak/grim picture of the future","a clear/an accurate/a complete picture of these events","The police are trying to build up a picture of what happened.","From news reports a picture emerges of a country in crisis.","The TV report painted a much rosier picture of the employment situation than research shows to be the case.","The book gives a vivid picture of life in Victorian England.","Through interviews and old photos we put together a composite picture of life in the village a hundred years ago.","They're trying to build up a detailed picture of the incident.","What emerges is a complex picture of family rivalry.","From newspaper reports a picture emerges of a country barely under control.","a composite picture of life a hundred years ago","My visits enabled me to build up a broad picture of the culture.","The figures reveal a disturbing picture of the state of our schools."],"opposite":"","synonyms":""},{"def":"a mental image or memory of something","examples":["I have a vivid picture of my grandfather smiling down at me when I was very small.","He uses imagery to form mental pictures within the mind of the reader.","She had formed a picture of what the place would look like and was very disappointed.","I had a sudden and chilling mental picture of him being interrogated in one of their prisons.","The smell of the sea conjures up pictures of my youth.","I tried to form a mental picture of the building being described."],"opposite":"","synonyms":""},{"def":"the general situation relating to somebody/something","examples":["Just a few years ago the picture was very different.","The overall picture for farming is encouraging.","The documentary was interesting but it didn't give the full picture."],"opposite":"","synonyms":""},{"def":"a film","examples":["The movie won nine Academy Awards, including Best Picture.","in pictures (especially North American English) I believe her husband's in pictures (= he acts in movies or works in the movie industry)."],"opposite":"","synonyms":""},{"def":"the cinema","examples":["Shall we go to the pictures tonight?"],"opposite":"","synonyms":""},{"def":"very pretty","examples":["She’s as pretty as a picture."],"opposite":"","synonyms":""},{"def":"to look very beautiful or special","examples":["The garden looks a picture in the summer."],"opposite":"","synonyms":""},{"def":"to look extremely healthy, guilty, unhappy, etc.","examples":[],"opposite":"","synonyms":""},{"def":"the situation as a whole","examples":["Right now forget the details and take a look at the big picture."],"opposite":"","synonyms":""},{"def":"to understand a situation, especially one that somebody is describing to you","examples":["‘I pretended that I hadn't heard.’ ‘I get the picture.’"],"opposite":"","synonyms":""},{"def":"involved/not involved in a situation","examples":["Morris is likely to win, with Jones out of the picture now."],"opposite":"","synonyms":""},{"def":"to describe somebody/something in a particular way; to give a particular impression of somebody/something","examples":["The report paints a vivid picture of life in the city.","Journalists paint a grim picture of conditions in the camps.","He didn't paint a very pretty picture of city life.","The report paints a dismal picture of the government's economic record."],"opposite":"","synonyms":""},{"def":"to give somebody the information they need in order to understand a situation","examples":["Just to put you in the picture—there have been a number of changes here recently."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"as pretty as a picture","def":"very pretty","examples":["She’s as pretty as a picture."]},{"idiom":"be/look a picture","def":"to look very beautiful or special","examples":["The garden looks a picture in the summer."]},{"idiom":"be the picture of health, guilt, misery, etc.","def":"to look extremely healthy, guilty, unhappy, etc.","examples":[]},{"idiom":"the big picture","def":"the situation as a whole","examples":["Right now forget the details and take a look at the big picture."]},{"idiom":"get the picture","def":"to understand a situation, especially one that somebody is describing to you","examples":["‘I pretended that I hadn't heard.’ ‘I get the picture.’"]},{"idiom":"in/out of the picture","def":"involved/not involved in a situation","examples":["Morris is likely to win, with Jones out of the picture now."]},{"idiom":"paint a (grim, gloomy, rosy, etc.) picture of somebody/something","def":"to describe somebody/something in a particular way; to give a particular impression of somebody/something","examples":["The report paints a vivid picture of life in the city.","Journalists paint a grim picture of conditions in the camps.","He didn't paint a very pretty picture of city life.","The report paints a dismal picture of the government's economic record."]},{"idiom":"put/keep somebody in the picture","def":"to give somebody the information they need in order to understand a situation","examples":["Just to put you in the picture—there have been a number of changes here recently."]}],"phrasal":[],"related":["B-picture","picture book","picture rail","motion picture","picture messaging","picture-perfect","picture postcard","picture-postcard","picture window","Rocky Horror Picture Show","Academy of Motion Picture Arts and Sciences","picture books","picture rails","picture windows","picture postcards","the big picture","paint a (grim, gloomy, rosy, etc.) picture of somebody/something"]},{"pos":"verb","level":"B2","meanings":[{"def":"to imagine somebody/something; to create an image of somebody/something in your mind","examples":["picture somebody/something I could picture the scene clearly.","I can still picture the house I grew up in.","picture somebody/something as something We found it hard to picture him as the father of teenage sons.","picture somebody/something doing something When he did not come home she pictured him lying dead on the roadside somewhere.","picture what, how, etc… I tried to picture what it would be like to live alone.","You can almost picture the scene.","I had pictured him as a tall, heavily built man.","I tried to picture what she must have been like at that age.","It was easy to picture the two of them together.","I can picture him sleeping rough on the streets somewhere.","She tried to picture what it must be like back in India."],"opposite":"","synonyms":""},{"def":"to describe or present somebody/something in a particular way","examples":["be pictured as something Before the trial Liz had been pictured as a frail woman dominated by her husband."],"opposite":"","synonyms":""},{"def":"to show somebody/something in a photograph or picture","examples":["be pictured (+ adv./prep./adj.) She is pictured here with her parents.","be pictured doing something The team is pictured setting off on their European tour.","He is pictured here with his students.","Mrs Benson (pictured above) is the new Human Resources Manager."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]