[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pil/pile_/pile__us_1.mp3","phonsUS":"/paɪl/","level":"B2","meanings":[{"def":"a number of things that have been placed on top of each other","examples":["pile of something a pile of clothes/paper","I found it in a pile of documents on his desk.","in/into a pile The hats were stacked in neat piles.","I've sorted the books into three separate piles.","He arranged the documents in neat piles.","He was busy behind a pile of papers on his desk.","I grabbed a shirt from the top of the pile.","I leafed through the pile of documents until I found the one I wanted.","I pulled my diary from beneath a pile of files.","I put the letter in the envelope and placed it on the pile.","I sorted the clothes into two piles.","Just add that application to the pile.","She closed the magazine and threw it back on the pile.","The clothes were in a pile on the floor.","The money lay amid a pile of unopened letters.","She was sorting the books into piles."],"opposite":"","synonyms":""},{"def":"a mass of something that is high in the middle and wider at the bottom than at the top","examples":["pile of something piles of dirty washing","The house was reduced to a pile of rubble.","He threw the remaining stones onto the pile.","He was spreading a small pile of manure around the strawberry plants.","The body was hidden under a pile of leaves.","There was a pile of dirty on the floor.","He dumped a pile of dirty clothes onto the floor."],"opposite":"","synonyms":""},{"def":"a lot of something","examples":["He made a pile of cash on the sale of his house.","He walked out leaving a pile of debt behind him.","I have got piles of work to do."],"opposite":"","synonyms":""},{"def":"the short threads, pieces of wool, etc. that form the soft surface of carpets and some types of cloth such as velvet","examples":["a deep-pile carpet","Corduroy is the poor man’s velvet; its pile is made of cotton rather than silk or satin."],"opposite":"","synonyms":""},{"def":"a large wooden, metal or stone post that is fixed into the ground and used to support a building, bridge, etc.","examples":[],"opposite":"","synonyms":""},{"def":"a large impressive building","examples":["a Victorian pile built as a private hospital","her family's ancestral pile"],"opposite":"","synonyms":""},{"def":"in the least/most important position in a group of people or things","examples":["It’s been 20 years since a British player was top of the pile.","The government is doing little to help those at the bottom of the social pile."],"opposite":"","synonyms":""},{"def":"to make a lot of money","examples":["The family made its pile from oil.","I bet they made an absolute pile out of the deal."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"(at the) bottom/top of the pile","def":"in the least/most important position in a group of people or things","examples":["It’s been 20 years since a British player was top of the pile.","The government is doing little to help those at the bottom of the social pile."]},{"idiom":"make a/your pile","def":"to make a lot of money","examples":["The family made its pile from oil.","I bet they made an absolute pile out of the deal."]}],"phrasal":[],"related":["pile on","pile up","pile-up","pile-ups","compost pile","pile something","pile something on(to) somebody","pile on the agony/gloom","(at the) bottom/top of the pile"]},{"pos":"verb","level":"B2","meanings":[{"def":"to put things one on top of another; to form a pile","examples":["pile something She piled the boxes one on top of the other.","The clothes were piled high on the chair.","pile something up Snow was piled up against the door.","We piled the boxes up neatly.","pile something + adv./prep. We piled sandbags against the doors.","She was sitting at her desk with books piled around her."],"opposite":"","synonyms":""},{"def":"to put something on/into something; to load something with something","examples":["pile A with B The sofa was piled high with cushions.","He piled his plate with as much food as he could.","pile B on(to) A He piled as much food as he could onto his plate.","pile B in(to) A She piled everything into her suitcase.","She piled food onto our plates.","a table piled high with magazines","They piled stones on top of the mound."],"opposite":"","synonyms":""},{"def":"to go somewhere quickly without order or control","examples":["The coach finally arrived and we all piled on.","Children were piling out of the school bus.","The bell rang and kids started piling into the classroom."],"opposite":"","synonyms":""},{"def":"to make an unpleasant situation worse","examples":["Bosses piled on the agony with threats of more job losses."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"pile on the agony/gloom","def":"to make an unpleasant situation worse","examples":["Bosses piled on the agony with threats of more job losses."]}],"phrasal":["pile on","pile up"],"related":[]}]