[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pil/pilot/pilot__us_1.mp3","phonsUS":"/ˈpaɪlət/","level":"A2","meanings":[{"def":"a person who operates the controls of an aircraft, especially as a job","examples":["an airline pilot","a fighter/helicopter pilot","The accident was caused by pilot error.","The pilot bailed out as the aircraft crashed into the ocean.","He has his own plane and a pilot's licence."],"opposite":"","synonyms":""},{"def":"a person with special knowledge of a difficult area of water, for example, the entrance to a harbour, whose job is to guide ships through it","examples":[],"opposite":"","synonyms":""},{"def":"a single television programme that is made in order to find out whether people will like it and want to watch further programmes","examples":[],"opposite":"","synonyms":""},{"def":"a small flame that burns all the time, for example on a gas boiler, and lights a larger flame when the gas is turned on","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["co-pilot","pilot light","pilot whale","test pilot","pilot officer","automatic pilot","acting pilot officer","pilot lights","pilot whales","pilot officers","acting pilot officers","be on automatic pilot"]},{"pos":"verb","level":"","meanings":[{"def":"to fly an aircraft or guide a ship; to act as a pilot","examples":["The plane was piloted by the instructor.","The captain piloted the boat into a mooring."],"opposite":"","synonyms":""},{"def":"to guide somebody/something somewhere, especially through a complicated place or system","examples":["She piloted a bill on the rights of part-time workers through parliament."],"opposite":"","synonyms":""},{"def":"to test a new product, idea, etc. with a few people or in a small area before it is introduced everywhere","examples":["Several centres have been asked to pilot the new qualification.","The recycling boxes have been successfully piloted in a number of areas.","The scheme is already being piloted in Germany."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adjective","level":"","meanings":[{"def":"done on a small scale in order to see if something is successful enough to do on a large scale","examples":["a pilot project/study/survey","a pilot episode (= of a radio or television series)"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]