[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pip/pipe_/pipe__us_1.mp3","phonsUS":"/paɪp/","level":"B1","meanings":[{"def":"a tube through which liquids and gases can flow","examples":["Both hot and cold water pipes should be properly insulated.","steel/copper pipes","a burst pipe","The house was blown apart by an explosion, caused by a leaking gas pipe.","PVC pipe is commonly used in building and construction.","a drainage/sewage pipe","Insulation may reduce the danger of pipes bursting in winter.","He laid the pipes under the floorboards.","Insulating your pipes will save on your heating bills.","The pipe from the boiler to the bath.","The pipes lead into the river.","The pipes will have to pass through the wall.","the pipe for the hot water","to join two lengths of pipe together","All the old lead pipes were replaced with plastic and copper."],"opposite":"","synonyms":""},{"def":"a narrow tube with a bowl at one end, used for smoking tobacco","examples":["to smoke a pipe","He puffed on his pipe.","pipe tobacco","He knocked out his pipe in the big glass ashtray."],"opposite":"","synonyms":""},{"def":"a musical instrument in the shape of a tube, played by blowing","examples":[],"opposite":"","synonyms":""},{"def":"any of the tubes from which sound is produced in an organ","examples":[],"opposite":"","synonyms":""},{"def":"a musical instrument played especially in Scotland. The player blows air into a bag held under the arm and then slowly forces the air out through pipes to produce a noise.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["pipe up","pipe band","pipe bomb","pipe down","soil pipe","peace pipe","pipe dream","pipe organ","pitch pipe","waste pipe","water pipe","exhaust pipe","pipe cleaner","pipe bands","pipe bombs","pipe dreams","pipe organs","overflow pipe"]},{"pos":"verb","level":"","meanings":[{"def":"to send water, gas, oil, etc. through a pipe from one place to another","examples":["to pipe oil across the desert","Water is piped from the reservoir to the city."],"opposite":"","synonyms":""},{"def":"to send sounds or signals through a wire or cable from one place to another","examples":["The speech was piped over a public address system."],"opposite":"","synonyms":""},{"def":"to play music on a pipe or the bagpipes, especially to welcome somebody who has arrived","examples":["Passengers were piped aboard ship at the start of the cruise.","a prize for piping and drumming"],"opposite":"","synonyms":""},{"def":"to speak or sing in a high voice or with a high sound","examples":["Outside a robin piped."],"opposite":"","synonyms":""},{"def":"to decorate food, especially a cake, with thin lines of icing, etc. by forcing it out of a special bag or tube","examples":["The cake had ‘Happy Birthday’ piped on it."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["pipe down","pipe up"],"related":[]}]