[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pit/pitch/pitch__us_1.mp3","phonsUS":"/pɪtʃ/","level":"B2","meanings":[{"def":"an area of ground specially prepared and marked for playing a sports game","examples":["a football pitch","a cricket/rugby/hockey pitch","an artificial pitch","After the game fans invaded the pitch.","The rugby tour was a disaster both on and off the pitch (= they lost their matches and the players behaved badly while on tour, getting bad news reports).","He was the best player on the pitch today.","Negotiations about his transfer are continuing off the pitch.","The pitch was invaded by angry fans.","The players have just come off the pitch.","The game ended in chaos with fans invading the pitch."],"opposite":"","synonyms":""},{"def":"how high or low a sound is, especially a musical note","examples":["A basic sense of rhythm and pitch is essential in a music teacher.","The pitch of the drum can be raised by tightening the skin.","Her voice fell in pitch as she grew older.","The instrument is not tuned to the correct pitch."],"opposite":"","synonyms":""},{"def":"the degree or strength of a feeling or activity; the highest point of something","examples":["a frenetic pitch of activity","Speculation has reached such a pitch that a decision will have to be made immediately.","to reach a high pitch of excitement"],"opposite":"","synonyms":""},{"def":"talk or arguments used by a person trying to sell things or persuade people to do something","examples":["an aggressive sales pitch","the candidate’s campaign pitch","Each company was given ten minutes to make its pitch.","Farley was about to make a pitch to a big client.","His pitch to the business community was based on common sense.","Marcelo will be making his pitch to a small number of potential clients.","The executives listened open-mouthed as she seamlessly delivered a pitch for their business.","a strong pitch delivered by advertising executives"],"opposite":"","synonyms":""},{"def":"an act of throwing the ball; the way in which it is thrown","examples":["Some kids were throwing stones at the window.","She threw the ball and he caught it.","She tossed her jacket onto the bed.","Rioters hurled a brick through the car’s windscreen.","She flung the letter down onto the table.","I chucked him the keys.","They were lobbing stones over the wall."],"opposite":"","synonyms":"throw"},{"def":"a black sticky substance made from oil or coal, used on roofs or the wooden boards of a ship to stop water from coming through","examples":[],"opposite":"","synonyms":""},{"def":"a place in a street or market where somebody sells things, or where somebody performs in order to entertain people outdoors","examples":[],"opposite":"","synonyms":""},{"def":"a place in a campsite where you can put up one tent or park one caravan, etc.","examples":["Pitches to rent from only £15 per night."],"opposite":"","synonyms":""},{"def":"the movement of a ship up and down in the water or of an aircraft in the air","examples":[],"opposite":"","synonyms":""},{"def":"the degree to which a roof slopes","examples":["The pitch of the roof is 45 degrees."],"opposite":"","synonyms":""},{"def":"to make a determined effort to get something or to persuade somebody of something","examples":["He made a pitch to black voters in Alabama."],"opposite":"","synonyms":""},{"def":"to cause somebody’s plans to fail or to destroy their chances of getting something","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"make a pitch for somebody/something | make a pitch to somebody","def":"to make a determined effort to get something or to persuade somebody of something","examples":["He made a pitch to black voters in Alabama."]},{"idiom":"queer somebody’s pitch | queer the pitch (for somebody)","def":"to cause somebody’s plans to fail or to destroy their chances of getting something","examples":[]}],"phrasal":[],"related":["pitch in","pitch up","fever pitch","pitch-black","pitch-dark","pitch into","pitch pipe","perfect pitch","pitch and putt","pitch-and-toss","pitch invasion","pitch pipes","pitch into somebody","pitch something","pitch into something","pitch in (with somebody/something)","pitch a story/line/yarn (to somebody)"]},{"pos":"verb","level":"","meanings":[{"def":"to throw somebody/something with force","examples":["The explosion pitched her violently into the air.","(figurative) The new government has already been pitched into a crisis.","If they hit any unseen obstacle they would be pitched headlong into the snow.","There was a loud bang and he was pitched from his seat."],"opposite":"","synonyms":""},{"def":"to throw the ball to the person who is batting","examples":["He pitched against UCLA last week.","My dream was to pitch for the Yankees.","The pitcher pitched the ball right down the middle of the plate.","Perez has pitched effectively this spring."],"opposite":"","synonyms":""},{"def":"to hit the ground; to make the ball hit the ground","examples":["The ball pitched a yard short of the hole."],"opposite":"","synonyms":""},{"def":"to hit the ball in a high curve","examples":[],"opposite":"","synonyms":""},{"def":"to fall heavily in a particular direction","examples":["With a cry she pitched forward."],"opposite":"","synonyms":""},{"def":"to move up and down on the water or in the air","examples":["The sea was rough and the ship pitched and rolled all night.","The boat pitched violently in a heavy swell."],"opposite":"","synonyms":""},{"def":"to set something at a particular level","examples":["pitch something (+ adv./prep./adj.) They have pitched their prices too high.","pitch something (at something) The test was pitched at too low a level for the students.","The test is pitched at a high GCSE standard.","The price has been pitched quite high.","Estimates have been deliberately pitched on the conservative side."],"opposite":"","synonyms":""},{"def":"to aim or direct a product or service at a particular group of people","examples":["pitch something (at somebody) The new software is being pitched at banks.","The product is pitched primarily at telecommunications companies.","pitch something (as something) Orange juice is to be pitched as an athlete's drink."],"opposite":"","synonyms":""},{"def":"to try to persuade somebody to buy something, to give you something or to make a business deal with you","examples":["pitch something Representatives went to Japan to pitch the company's newest products.","pitch (for something) We were pitching against a much larger company for the contract."],"opposite":"","synonyms":""},{"def":"to produce a sound or piece of music at a particular level","examples":["You pitched that note a little flat.","The song was pitched too low for my voice.","Her voice was pitched low."],"opposite":"","synonyms":""},{"def":"to set up a tent or a camp for a short time","examples":["We could pitch our tent in that field.","They pitched camp for the night near the river."],"opposite":"","synonyms":""},{"def":"to tell somebody a story or make an excuse that is not true","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"pitch a story/line/yarn (to somebody)","def":"to tell somebody a story or make an excuse that is not true","examples":[]}],"phrasal":["pitch in","pitch into","pitch up"],"related":[]}]