[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pit/pity_/pity__us_1.mp3","phonsUS":"/ˈpɪti/","level":"B2","meanings":[{"def":"used to show that you are disappointed about something","examples":["a pity (that…) It's a pity that you can't stay longer.","‘I've lost it!’ ‘Oh, what a pity.’","What a pity that she didn't tell me earlier.","This dress is really nice. Pity it's so expensive.","Oh, that's a pity.","It would be a great pity if you gave up now.","a pity to do something It seems a pity to waste this food.","That would be rather a pity, wouldn't it?","The place was great, but it was a pity about the weather."],"opposite":"","synonyms":""},{"def":"a sad feeling caused by the pain and troubles of others","examples":["I took pity on her and lent her the money.","(formal) I beg you to have pity on him.","I don't want your pity.","a look/feeling/surge of pity","pity for somebody/something I could only feel pity for what they were enduring.","He had no pity for her.","I threw the child some money out of pity.","I took pity on him and allowed him to stay.","She was full of pity for him.","We begged him to have pity on us.","a cruel leader without pity","an unfortunate man who inspires pity","She experienced a sudden feeling of pity for the young man."],"opposite":"","synonyms":""},{"def":"unfortunately","examples":["‘Was the bicycle insured?’ ‘No, more's the pity!’"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"more’s the pity","def":"unfortunately","examples":["‘Was the bicycle insured?’ ‘No, more's the pity!’"]}],"phrasal":[],"related":["self-pity"]},{"pos":"verb","level":"","meanings":[{"def":"to feel sorry for somebody because of their situation; to feel pity for somebody","examples":["pity somebody He pitied people who were stuck in dead-end jobs.","Compulsive gamblers are more to be pitied than condemned.","pity somebody doing something I pity her having to work such long hours."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]