[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pla/place/place__us_1.mp3","phonsUS":"/pleɪs/","level":"A1","meanings":[{"def":"a particular position, point or area","examples":["in a place Keep your purse in a safe place.","I can't be in two places at once.","They organized several demonstrations in public places.","I happened to be in the right place at the right time.","place where… Is this the place where it happened?","place for something This would be a good place for a picnic.","There is a time and place for these questions, but not right here and now.","place to do something If you're looking for a new service provider, this list is a good place to start.","We can easily discover the time and place of the transaction.","There will be rain in places.","Schools should be a safe place for children to work in.","It wasn't his fault. He was just in the wrong place at the wrong time.","This is not the place for an argument."],"opposite":"","synonyms":""},{"def":"a particular city, town, building, etc.","examples":["I can't remember all the places we visited in Thailand.","I used to live in York and I'm still fond of the place.","The police searched the place.","Let's get out of this place!","place to do something We were looking for a place to eat.","a place to live/stay","Please write your full name and date and place of birth.","What places did you visit in Thailand?","They met at a place in the centre of town.","We had dinner at a crowded place in Chelsea.","trips to faraway places","holidays in faraway places","This is a very rewarding place to work.","We should put the welfare of people and places above markets.","The book lists each artist's date and place of birth.","Soybeans are a major protein source in places like China and Japan.","It seemed a strange place to go for a Sunday walk.","They are spending a lot of money on making this area a better place to live and work.","This is one of the best places in the world to study science and engineering.","They'll need a place to stay when they come to Oxford.","It is her job to discover the date and place of origin of all the artworks.","The landscape helps create a strong sense of place.","It's the kind of place we'll return to for holidays for many years.","We are working to make our countryside a great place to visit.","The woods gave them a place to hide.","The ceremony varies from place to place.","There are lots of places to eat in the city centre."],"opposite":"","synonyms":""},{"def":"a building or an area of land used for a particular purpose","examples":["The town has many excellent eating places.","I couldn't find a parking place anywhere.","place of something (formal) churches and other places of worship","(formal) He can usually be contacted at his place of work.","(formal) They seem to have no fixed employment or place of residence.","This would be a good place for a picnic.","They’ve chosen a site for the new school.","the hotel reception area","Move the cursor to a blank area on the screen.","From his position at the top of the hill, he could see the harbour.","the point at which the river divides","The company is moving to a new location.","the scene of the accident","The lake is one of the local beauty spots.","the city's ban on smoking in business places","Here is a list of churches and other places of worship.","The spa is a place for relaxing.","Areas as rural as this have no polling places."],"opposite":"","synonyms":"place"},{"def":"a particular area on a surface, especially on a person’s body","examples":["in… places He broke his arm in three places.","in places The paint was peeling off the wall in places.","The footbath is bumpy in places.","Her blonde hair was sticking up in some places.","Her spine was fractured in two places.","There will be widespread rain which will be heavy in places."],"opposite":"","synonyms":""},{"def":"a point in a book, speech, piece of music, etc., especially one that somebody has reached at a particular time","examples":["She had marked her place with a bookmark.","Excuse me, I seem to have lost my place.","in… places The audience laughed in all the right places.","in places The film is scary in places.","place in something This is one of the few places in his work where he mentions his childhood.","I forgot to mark my place.","The teacher asked us to identify places in the music where there was tension.","He knocked the book out of my hand and made me lose my place."],"opposite":"","synonyms":""},{"def":"the natural or correct position for something","examples":["place (in/on something) (to do something) Is there a place on the form to put your address?","There is a place to sign and date at the bottom of the form.","in something's place Put it back in its place when you've finished with it.","place for something He remembered the saying ‘A place for everything and everything in its place.’"],"opposite":"","synonyms":""},{"def":"a position, seat, etc., especially one that is available for or being used by a person or vehicle","examples":["Come and sit here—I've saved you a place.","I don't want to lose my place in the line.","Would you like to change places with me so you can see better?","I've set a place for you at the table.","We took our places around the table.","The boy returned to his place.","She showed them to their places.","I've laid four places for dinner.","I lost my place in line.","He took the place of honour on his hostess's right.","He changed places with me."],"opposite":"","synonyms":""},{"def":"an opportunity to take part in something, especially to study at a school or university or on a course","examples":["She's been offered a place at Bath to study Business.","There are very few places left on the course.","He was awarded a place at Leeds University.","She got a place on the French course.","To book your place, contact the workshop leader.","He won a place at Trinity College, Cambridge."],"opposite":"","synonyms":""},{"def":"the position of being a member of a sports team","examples":["She has won a place in the Olympic team.","He lost his place in the first team.","He lost his place in the team.","He was injured and lost his place in the side.","They have offered her a place in the squad."],"opposite":"","synonyms":""},{"def":"a position among the winners of a race or competition; a position in the next stage of a competition","examples":["She took third place.","in… place He finished in third place.","place in something Victory earned them a place in the final.","Second place went to the Moroccan athlete.","They tied for second place.","The final whistle confirmed their place in the final.","Jack received a second place finish.","She got first place in the entrance exam."],"opposite":"","synonyms":""},{"def":"the role or importance of somebody/something in a particular situation, usually in relation to others","examples":["place in something He is assured of his place in history.","They felt that they had no place in society and nowhere to go.","It took her a while to find her place in the world.","Anecdotes have no place in (= are not acceptable in) an academic essay.","Accurate reporting takes second place to lurid detail.","My father believed that people should know their place (= behave according to their social position).","It's not your place (= your role) to give advice.","a statesman who is assured a place in history","She knows her place.","It's not your place to correct her.","I'm sorry—I was forgetting my place.","Her victory secured her a place in history.","He has been restored to his rightful place in the community.","Dance has a central place in their culture.","He holds a special place in her affections.","Housing occupied a prominent place in the discussions.","I'm fed up with always taking second place to her sports training.","This album secures his place in the ranks of the great British songwriters.","Sugary foods have no place in our schools.","She struggled to find her place in society."],"opposite":"","synonyms":""},{"def":"a house or flat; a person’s home","examples":["What about dinner at my place?","I'm fed up with living with my parents, so I'm looking for a place of my own.","I thought I’d better clean the place up.","She's looking for a place to rent in the village.","It's a nice place you've got here.","It was a terrible place to live.","They're trying to find a place to live."],"opposite":"","synonyms":""},{"def":"a suitable or safe area for somebody to be","examples":["These streets are no place for a child to be out alone at night."],"opposite":"","synonyms":""},{"def":"the position of a figure after a decimal point","examples":["Convert the decimal to a percentage by moving the decimal point two places to the right."],"opposite":"","synonyms":""},{"def":"used as part of a name for a short street or square","examples":["66 Portland Place"],"opposite":"","synonyms":""},{"def":"everywhere","examples":["New restaurants are appearing all over the place."],"opposite":"","synonyms":""},{"def":"not neat or tidy; not well organized","examples":["Your calculations are all over the place (= completely wrong)."],"opposite":"","synonyms":""},{"def":"to be getting more and more successful in your life or career","examples":["a young architect who’s really going places"],"opposite":"","synonyms":""},{"def":"to behave in a very confident way that annoys other people, for example by telling them what to do","examples":["She was acting as if she owned the place."],"opposite":"","synonyms":""},{"def":"to be feeling happy, sad, worried, etc. about something; to be in a good, bad, unhappy, etc. state","examples":["I'm happy now. I'm in a good place.","Me and Ed are in a good space right now.","The economy is in a better place than it was a year ago.","He was in a bad place, mentally and emotionally.","She was in a dark place after her mother's death."],"opposite":"","synonyms":""},{"def":"to be able to take advantage of opportunities when they come","examples":["His success was down to being in the right place at the right time."],"opposite":"","synonyms":""},{"def":"in a situation where you have to choose between two things, both of which are unpleasant","examples":[],"opposite":"","synonyms":""},{"def":"to be in somebody else’s situation","examples":["I'm perfectly happy—I wouldn't change places with anyone."],"opposite":"","synonyms":""},{"def":"if something complicated or difficult to understand falls or slots into place, it becomes organized or clear in your mind","examples":["Then I found his diary and it all began to fall into place."],"opposite":"","synonyms":""},{"def":"friends, people, etc. in positions of power and influence","examples":["He has friends in high places."],"opposite":"","synonyms":""},{"def":"to be replaced by somebody/something","examples":["Houses and factories gave place to open fields as the train gathered speed."],"opposite":"","synonyms":""},{"def":"to be very dear to somebody","examples":["He'll always have a place in my heart."],"opposite":"","synonyms":""},{"def":"used to say that somebody’s intentions are kind and sincere even though they sometimes do the wrong thing","examples":[],"opposite":"","synonyms":""},{"def":"used to introduce a piece of advice you are giving to somebody","examples":["If I were in your place, I'd resign immediately."],"opposite":"","synonyms":""},{"def":"used at the end of a sentence to talk about why something was done or whether it should have been done or not","examples":["I still don't understand why you chose that name in the first place.","I should never have taken that job in the first place."],"opposite":"","synonyms":""},{"def":"used at the beginning of a sentence to introduce the different points you are making in an argument","examples":["Well, in the first place he has all the right qualifications."],"opposite":"","synonyms":""},{"def":"in my, your, etc. situation","examples":["I wouldn't like to be in your place."],"opposite":"","synonyms":""},{"def":"in the correct position; ready for something","examples":["Carefully lay each slab in place.","The receiver had already clicked into place.","She tapped the lid into place.","It was held in place with tape."],"opposite":"","synonyms":""},{"def":"working or ready to work","examples":["All the arrangements are now in place for their visit.","How long has the import ban been in place?"],"opposite":"","synonyms":""},{"def":"in one exact place, without moving in any direction","examples":["Running in place is good exercise."],"opposite":"","synonyms":""},{"def":"instead of somebody/something","examples":["You can use milk in place of cream in this recipe.","He was unable to come to the ceremony, but he sent his son to accept the award in his place."],"opposite":"","synonyms":""},{"def":"an unusual or unpleasant event is not likely to happen in the same place or to the same people twice","examples":[],"opposite":"","synonyms":""},{"def":"to look extremely clean and neat","examples":[],"opposite":"","synonyms":""},{"def":"not in the correct place","examples":["Some of these files seem to be out of place."],"opposite":"","synonyms":""},{"def":"not suitable for a particular situation","examples":["Her remarks were out of place.","I felt completely out of place among all these successful people."],"opposite":"","synonyms":""},{"def":"a position in which you are comfortable or have an advantage over other people","examples":[],"opposite":"","synonyms":""},{"def":"the position in which something is most easily seen, that is given to the most important thing in a particular group","examples":["The photo was given pride of place on the mantelpiece."],"opposite":"","synonyms":""},{"def":"to make somebody feel stupid or embarrassed for showing too much confidence","examples":["At first she tried to take charge of the meeting but I soon put her in her place."],"opposite":"","synonyms":""},{"def":"to imagine that you are in somebody else’s situation","examples":["Of course I was upset—just put yourself in my place."],"opposite":"","synonyms":""},{"def":"to stay indoors during an emergency in order to protect yourself and others","examples":["Residents of the city have been ordered to shelter in place for at least the next three weeks."],"opposite":"","synonyms":""},{"def":"to happen, especially after previously being arranged or planned","examples":["The film festival takes place in October.","We may never discover what took place that night."],"opposite":"","synonyms":""},{"def":"to replace somebody/something","examples":["She couldn't attend the meeting so her assistant took her place.","Computers have taken the place of typewriters in most offices."],"opposite":"","synonyms":""},{"def":"to go to the physical position that is necessary for an activity","examples":["Take your places for dinner."],"opposite":"","synonyms":""},{"def":"to take or accept the status in society that is correct or that you deserve","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"all over the place","def":"everywhere","examples":["New restaurants are appearing all over the place.","Your calculations are all over the place (= completely wrong)."]},{"idiom":"be going places","def":"to be getting more and more successful in your life or career","examples":["a young architect who’s really going places"]},{"idiom":"behave/act as if you own the place | think you own the place","def":"to behave in a very confident way that annoys other people, for example by telling them what to do","examples":["She was acting as if she owned the place."]},{"idiom":"be in a good, bad, dark, etc. place","def":"to be feeling happy, sad, worried, etc. about something; to be in a good, bad, unhappy, etc. state","examples":["I'm happy now. I'm in a good place.","Me and Ed are in a good space right now.","The economy is in a better place than it was a year ago.","He was in a bad place, mentally and emotionally.","She was in a dark place after her mother's death."]},{"idiom":"be in the right place at the right time","def":"to be able to take advantage of opportunities when they come","examples":["His success was down to being in the right place at the right time."]},{"idiom":"(caught/stuck) between a rock and a hard place","def":"in a situation where you have to choose between two things, both of which are unpleasant","examples":[]},{"idiom":"change/swap places (with somebody)","def":"to be in somebody else’s situation","examples":["I'm perfectly happy—I wouldn't change places with anyone."]},{"idiom":"fall/slot into place","def":"if something complicated or difficult to understand falls or slots into place, it becomes organized or clear in your mind","examples":["Then I found his diary and it all began to fall into place."]},{"idiom":"friends, people, etc. in high places","def":"friends, people, etc. in positions of power and influence","examples":["He has friends in high places."]},{"idiom":"give place to somebody/something","def":"to be replaced by somebody/something","examples":["Houses and factories gave place to open fields as the train gathered speed."]},{"idiom":"have/hold a place in somebody's heart","def":"to be very dear to somebody","examples":["He'll always have a place in my heart."]},{"idiom":"somebody’s heart is in the right place","def":"used to say that somebody’s intentions are kind and sincere even though they sometimes do the wrong thing","examples":[]},{"idiom":"if I was/were in your place","def":"used to introduce a piece of advice you are giving to somebody","examples":["If I were in your place, I'd resign immediately."]},{"idiom":"in the first place","def":"used at the end of a sentence to talk about why something was done or whether it should have been done or not","examples":["I still don't understand why you chose that name in the first place.","I should never have taken that job in the first place."]},{"idiom":"in the first, second, etc. place","def":"used at the beginning of a sentence to introduce the different points you are making in an argument","examples":["Well, in the first place he has all the right qualifications."]},{"idiom":"in my, your, etc. place","def":"in my, your, etc. situation","examples":["I wouldn't like to be in your place."]},{"idiom":"in place","def":"in the correct position; ready for something","examples":["Carefully lay each slab in place.","The receiver had already clicked into place.","She tapped the lid into place.","It was held in place with tape.","All the arrangements are now in place for their visit.","How long has the import ban been in place?","Running in place is good exercise."]},{"idiom":"in place of somebody/something | in somebody’s/something’s place","def":"instead of somebody/something","examples":["You can use milk in place of cream in this recipe.","He was unable to come to the ceremony, but he sent his son to accept the award in his place."]},{"idiom":"lightning never strikes (in the same place) twice","def":"an unusual or unpleasant event is not likely to happen in the same place or to the same people twice","examples":[]},{"idiom":"not have a hair out of place","def":"to look extremely clean and neat","examples":[]},{"idiom":"out of place","def":"not in the correct place","examples":["Some of these files seem to be out of place.","Her remarks were out of place.","I felt completely out of place among all these successful people."]},{"idiom":"a place in the sun","def":"a position in which you are comfortable or have an advantage over other people","examples":[]},{"idiom":"pride of place","def":"the position in which something is most easily seen, that is given to the most important thing in a particular group","examples":["The photo was given pride of place on the mantelpiece."]},{"idiom":"put somebody in their place","def":"to make somebody feel stupid or embarrassed for showing too much confidence","examples":["At first she tried to take charge of the meeting but I soon put her in her place."]},{"idiom":"put yourself in somebody else’s/somebody’s place","def":"to imagine that you are in somebody else’s situation","examples":["Of course I was upset—just put yourself in my place."]},{"idiom":"shelter in place","def":"to stay indoors during an emergency in order to protect yourself and others","examples":["Residents of the city have been ordered to shelter in place for at least the next three weeks."]},{"idiom":"take place","def":"to happen, especially after previously being arranged or planned","examples":["The film festival takes place in October.","We may never discover what took place that night."]},{"idiom":"take somebody’s/something’s place | take the place of somebody/something","def":"to replace somebody/something","examples":["She couldn't attend the meeting so her assistant took her place.","Computers have taken the place of typewriters in most offices."]},{"idiom":"take your place","def":"to go to the physical position that is necessary for an activity","examples":["Take your places for dinner."]}],"phrasal":[],"related":["no place","place mat","happy place","place card","place kick","place name","another place","decimal place","hiding place","meeting place","Peyton Place","place setting","resting place","dwelling place","watering place","in place","place cards","place kicks"]},{"pos":"verb","level":"B1","meanings":[{"def":"to put something in a particular place, especially when you do it carefully or deliberately","examples":["He placed his hand on her shoulder.","A bomb had been placed under the seat.","The parking areas in the town are few, but strategically placed.","He placed the letter in a drawer.","She produced a long silver whistle and placed it firmly between her lips.","The books were placed haphazardly on the shelf.","The boots were neatly placed side by side.","The boots, neatly placed side by side, were near the bed.","The table was placed centrally.","There are candles strategically placed—in case we have another blackout.","an attempt to place the question firmly back on the political agenda","Her bag was removed and placed on the ground beside her.","Place the chicken pieces in a warm serving dish.","She placed the plant in a sunny position on the windowsill.","He placed himself directly in front of the window."],"opposite":"","synonyms":""},{"def":"used to express the attitude somebody has towards something/somebody","examples":["place something on something They place a high value on punctuality.","Great importance is placed on education.","The blame was placed squarely on the doctor.","place something on doing something We have always placed emphasis on delivering customer satisfaction.","The company places importance on developing information networks.","I never place reliance on the weather forecasts."],"opposite":"","synonyms":""},{"def":"to give instructions about something or make a request for something to happen","examples":["to place an order/a bet","We placed an advertisement for a cleaner in the local paper.","When placing the order, indicate the desired delivery date.","She was looking for new staff and decided to place an ad in the newspaper.","Place your bets, ladies and gentlemen please!"],"opposite":"","synonyms":""},{"def":"to put somebody/yourself in a particular situation","examples":["to place somebody in command","She was placed in the care of an uncle.","His resignation placed us in a difficult position.","The job places great demands on me.","He has placed himself above party politics.","highly placed officials in the government","You will be placed on the waiting list.","to place restrictions/a burden on somebody","They are placing lives at risk."],"opposite":"","synonyms":""},{"def":"to find a suitable job, home, etc. for somebody","examples":["place somebody The agency placed about 2 000 secretaries last year.","place somebody with somebody/something The children were placed with foster parents.","place somebody in something children who are difficult to place in foster homes"],"opposite":"","synonyms":""},{"def":"to decide that somebody/something has a particular position or rank compared with other people or things","examples":["I would place her among the top five tennis players in the world.","Nursing attracts people who place relationships high on their list of priorities."],"opposite":"","synonyms":""},{"def":"used to describe a person, a team, a horse, etc. finishing in a particular position in a race","examples":["place somebody/something + adj. He was placed fifth in last Saturday's race.","My horse has been placed several times (= it was among the first three or four to finish the race).","(North American English) His horse placed in the last race (= it was among the first three to finish the race, usually in second place)."],"opposite":"","synonyms":""},{"def":"to recognize somebody/something and be able to identify them/it","examples":["I've seen her before but I just can't place her.","His accent was impossible to place.","I've heard his name before, but I can't quite place him.","She tried to place the faint West Country burr in his voice."],"opposite":"","synonyms":""},{"def":"to be in a good, very good, etc. position or have a good, etc. opportunity to do something","examples":["Engineering graduates are well placed for a wide range of jobs.","The company is ideally placed to take advantage of the new legislation.","The company is ideally placed to win the contract."],"opposite":"","synonyms":""},{"def":"to be located in a pleasant or convenient place","examples":["The hotel is well placed for restaurants, bars and clubs."],"opposite":"","synonyms":""},{"def":"to say something publicly or officially so that it may be written down and repeated","examples":["He didn't want to go on the record as either praising or criticizing the proposal.","I should like to place on record my sincere thanks to all those who have given support.","He is the latest public figure to go on (the) record about corruption in politics.","Would you go on (the) record as saying that?","She is on record as saying that she once took drugs."],"opposite":"","synonyms":""},{"def":"to think that somebody/something is particularly important or valuable","examples":["The company places a high premium on initiative.","They put a high premium on customer loyalty."],"opposite":"","synonyms":""},{"def":"to admire somebody so much that you do not see their faults","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be well, ideally, uniquely, better, etc. placed for something/to do something","def":"to be in a good, very good, etc. position or have a good, etc. opportunity to do something","examples":["Engineering graduates are well placed for a wide range of jobs.","The company is ideally placed to take advantage of the new legislation.","The company is ideally placed to win the contract.","The hotel is well placed for restaurants, bars and clubs."]},{"idiom":"put/place something on (the) record | be/go on (the) record (as saying…)","def":"to say something publicly or officially so that it may be written down and repeated","examples":["He didn't want to go on the record as either praising or criticizing the proposal.","I should like to place on record my sincere thanks to all those who have given support.","He is the latest public figure to go on (the) record about corruption in politics.","Would you go on (the) record as saying that?","She is on record as saying that she once took drugs."]},{"idiom":"put/place/set a premium on somebody/something","def":"to think that somebody/something is particularly important or valuable","examples":["The company places a high premium on initiative.","They put a high premium on customer loyalty."]},{"idiom":"to put/place somebody on a pedestal","def":"to admire somebody so much that you do not see their faults","examples":[]}],"phrasal":[],"related":[]}]