[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pla/plant/plant__us_1.mp3","phonsUS":"/plænt/","level":"A1","meanings":[{"def":"a living thing that grows in the earth and usually has a stem, leaves and roots, especially one that is smaller than a tree or bush","examples":["All plants need light and water.","flowering plants","native/medicinal/wild plants","a tomato/potato plant","It's becoming more popular to grow plants organically.","The area is home to many rare plant species.","the animal and plant life of the area","Plants absorb carbon in the form of carbon dioxide.","The butterfly's sole food plant is wild lupine.","food plants of rare butterflies"],"opposite":"","synonyms":""},{"def":"a factory or place where power is produced or an industrial process takes place","examples":["a nuclear power plant","a processing/manufacturing plant","Japanese car plants","a water treatment plant","a chemical/steel/coal plant","a chocolate/​cigarette/​clothing factory","a nuclear power plant","a manufacturing plant","a cotton/​paper/​textile/​woollen mill","a brickworks","a steelworks","Raw materials were carried to the works by barge.","a shipyard","a car repair workshop","an iron foundry","a waste reprocessing plant","a nuclear power plant","a sewage (treatment) plant","an assembly plant"],"opposite":"","synonyms":"factory"},{"def":"the large machines that are used in industrial processes","examples":["The company has been investing in new plant and equipment."],"opposite":"","synonyms":""},{"def":"something that somebody has deliberately placed among another person’s clothes or possessions in order to make them appear guilty of a crime","examples":["He claimed that the drugs found in his house were a plant."],"opposite":"","synonyms":""},{"def":"a person who joins a group of criminals or enemies in order to get and secretly report information about their activities","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["air plant","plant out","plant pot","pot plant","face plant","face-plant","plant-based","power plant","bedding plant","rubber plant","sewage plant","specimen plant","sewage treatment plant","plant something"]},{"pos":"verb","level":"A2","meanings":[{"def":"to put plants, seeds, etc. in the ground to grow","examples":["to plant a tree/seed/crop","to plant and harvest rice","Plant the bulbs in pots for a spring display.","Carefully plant your cutting in the soil.","Zinfandel is California's most widely planted red grape.","recently planted maples","weeds that had not been deliberately planted","Plant these shrubs in full sun."],"opposite":"","synonyms":""},{"def":"to cover or supply a garden, area of land, etc. with plants","examples":["plant something The children are planting a garden next to the school.","They have planted five acres of vines.","a densely planted orange grove","be planted with something The field had been ploughed and planted with corn.","The garden was planted with roses and other shrubs.","The Bordeaux area is densely planted with vine."],"opposite":"","synonyms":""},{"def":"to place something or yourself in a particular place or position","examples":["They planted a flag on the summit.","He planted himself squarely in front of us.","She was determined to keep both feet firmly planted on dry land.","She planted a kiss squarely on his cheek.","Demonstrators planted themselves right in front of the convoy of trucks."],"opposite":"","synonyms":""},{"def":"to hide something such as a bomb in a place where it will not be found","examples":[],"opposite":"","synonyms":""},{"def":"to hide something, especially something illegal, in somebody’s clothing, possessions, etc. so that when it is found it will look as though they committed a crime","examples":["He claims that the drugs were planted on him."],"opposite":"","synonyms":""},{"def":"to send somebody to join a group, etc., especially in order to make secret reports on its members","examples":["The police had planted an informer in the gang."],"opposite":"","synonyms":""},{"def":"to make somebody think or believe something, especially without them realizing that you gave them the idea","examples":["He planted the first seeds of doubt in my mind."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["plant out"],"related":[]}]