[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pla/plann/planning__us_3.mp3","phonsUS":"/ˈplænɪŋ/","level":"B1","meanings":[{"def":"the act or process of making plans for something","examples":["The department is responsible for all financial planning.","After months of careful planning the event went without a hitch.","The consultants recommended more emphasis on strategic planning.","We are currently in the planning stages.","Costs can be reduced by effective contingency planning.","Deciding the agenda is the most vital aspect of pre-meeting planning.","Planning for future development is vital for the community.","The festival was four years in the planning.","The idea is still at the planning stage.","The industry needs to do some long-term planning.","The trip calls for careful advance planning.","This can be done, but it will take careful planning.","an attorney who specializes in estate planning","the Soviet system of central planning","the initial planning stage","He attended a business planning course.","Planning for the future makes some people nervous.","Sensible planning will minimize disruption to the schedule.","Teachers should always be involved in the curriculum planning process.","The team leader emphasized the importance of planning.","The whole process will be easier if you do some careful planning.","Thoughtful planning is the key to dinner party success.","With a bit of forward planning you can avoid debt."],"opposite":"","synonyms":""},{"def":"the control of the development of towns and their buildings, roads, etc. so that they can be pleasant and convenient places for people to live in","examples":["She now works in urban planning.","to submit a planning application","The plans were considered by the local planning authority.","Your local council's planning department should be able to give you guidance on whether or not you need planning permission.","Planning consent has been applied for.","The development has yet to be submitted to the council for planning approval."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["city planning","town planning","event planning","family planning","planning permission","succession planning"]}]