[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pla/plan_/plan__us_1.mp3","phonsUS":"/plæn/","level":"A1","meanings":[{"def":"something that you intend to do or achieve","examples":["plan for something Do you have any plans for the summer?","plan to do something There are no plans to build new offices.","Your best plan (= the best thing to do) would be to go by car.","There's been a change of plan.","We can't change our plans now.","She told us about her future plans.","retirement/travel/wedding plans","Our campaign’s main purpose is to raise money.","She went to London with the aim of finding a job.","Our main aim is to increase sales in Europe.","I have no intention of going to the wedding.","She’s full of good intentions but they rarely work out.","There are no plans to build new offices.","What’s the point of all this violence?","The point of the lesson is to compare the two countries.","The whole idea of going was so that we could meet her new boyfriend.","What’s the idea behind this?","A spokeswoman confirmed there was no definite plan to stage a concert in the park.","Let's stick to our original plan","Plans are afoot to stage a new opera.","The best plan is for me to meet you at the airport.","The strike ruined my travel plans.","I like to make plans well in advance.","What are your immediate plans?","How are your wedding plans coming along?"],"opposite":"","synonyms":"purpose"},{"def":"a set of things to do in order to achieve something, especially one that has been considered in detail in advance","examples":["an action plan","a plan of action","a development/management plan","a five-point plan","a three-year plan","These ambitious plans were continually revised.","The company has developed a five-year strategic plan.","plan for something We need to make plans for the future.","plan for doing something Both sides agreed to a detailed plan for keeping the peace.","contingency plans for dealing with an epidemic","plan to do something The government has announced plans to create one million new training places.","to develop/devise a plan","to unveil/outline a plan","to implement a plan","to stick to/change a plan","according to plan Let's hope everything will go according to plan.","under a plan Under this plan, 98% of all Americans will get a tax cut.","A new plan for reducing traffic accidents was unveiled.","Do you have any contingency plans if the scheme doesn't work?","Do you have any contingency plans if there is a delay?","Even the best-laid plans can go wrong.","Local residents have vowed to fight plans to build a new road.","Plans to build a dam have been shelved following protests.","The airline intends to file a reorganization plan within three months.","The government has ambitious plans for prison reform.","The government launched a five-year plan aimed at diversifying the economy.","The moves contravene the peace plan agreed by both sides.","The plan calls for investments totalling $100 million.","The plan calls for massive investment in the region.","The plan contains four main elements.","The president will now press ahead with his plans for reform.","To change anything in this organization, we'll need a plan of action.","We need to develop a sound business plan.","a three-point action plan to improve hygiene at work","Senators signed a letter opposing the plan.","Senior officials put forward a three-year plan.","The corporation is pressing ahead with plans to build a new power station.","The peace plan was agreed at an international summit meeting.","The plan will be put into action within the next three months.","They are working on an economic development plan.","You will need a clear and realistic business plan.","a plan of campaign","a six-week low-fat eating plan"],"opposite":"","synonyms":""},{"def":"a detailed map of a building, town, etc.","examples":["Do you have a plan of the museum?","We asked for a street plan of the city.","The main markets were clearly marked on the plan.","The plan shows the exact location of the house."],"opposite":"","synonyms":""},{"def":"a detailed drawing of a machine, building, etc. that shows its size, shape and measurements","examples":["The original plans of the building have not survived.","plan for something The architect is drawing up plans for the new offices.","Plans for our extension have been submitted for approval.","A final version of the plans and specifications has been produced.","She drew some plans and elevations of the church's structure.","The plan shows where all the electrical points will go.","The plans were made some time ago, but work on the building has not yet started.","He produced a plan of the house.","Enemy spies stole the plans for the new aircraft.","Site plans were filed with the city this week."],"opposite":"","synonyms":""},{"def":"a diagram that shows how something will be arranged","examples":["a seating plan (= showing where each person will sit, for example at a dinner)","a floor plan (= showing how furniture is arranged)","Who was responsible for the seating plan?","The floor plan is very simple."],"opposite":"","synonyms":""},{"def":"a way of investing money for the future or buying insurance for something","examples":["a savings plan","a health plan"],"opposite":"","synonyms":""},{"def":"to think of something you can do to solve a problem or make something happen","examples":["It's going to be difficult to find the time but I'll make a plan.","I’ll make a plan to get it copied and sent to you.","If the pain hasn’t gone by tomorrow, I’ll make a plan."],"opposite":"","synonyms":""},{"def":"used to agree to a suggestion that you think is good","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"make a plan","def":"to think of something you can do to solve a problem or make something happen","examples":["It's going to be difficult to find the time but I'll make a plan.","I’ll make a plan to get it copied and sent to you.","If the pain hasn’t gone by tomorrow, I’ll make a plan."]},{"idiom":"(it) sounds like a plan (to me)","def":"used to agree to a suggestion that you think is good","examples":[]}],"phrasal":[],"related":["Plan A","Plan B","plan out","game plan","open-plan","floor plan","ground plan","master plan","American plan","business plan","pension plan","installment plan","retirement plan","Marshall Plan","Canada Pension Plan","Personal Equity Plan"]},{"pos":"verb","level":"A1","meanings":[{"def":"to make detailed arrangements for something you want to do in the future","examples":["plan something to plan a trip","to plan a wedding/holiday/party","The men were planning a terror attack.","We planned the day down to the last detail.","Everything went exactly as planned.","The whole event had been carefully/meticulously planned.","plan something for something A meeting has been planned for early next year.","plan for something It's never too early to start planning for the future.","plan how, what, etc… I've been planning how I'm going to spend the day.","plan that… They planned that the two routes would connect.","plan ahead You can avoid a lot of stress by planning ahead.","A well-planned advertising campaign is necessary to bring in visitors.","Everything has been planned down to the last detail.","The government had originally planned to launch the review in June.","We must plan for the future.","You will need to plan your shopping carefully in advance.","He never really planned for the future.","His future had been planned down to the last detail.","I've been planning how I'm going to spend my last week here.","It had been planned that the winners would get a free vacation.","It took six months to plan the expedition.","It's always a good idea to plan ahead.","centrally planned economies"],"opposite":"","synonyms":""},{"def":"to intend or expect to do something","examples":["plan on doing something We hadn't planned on going anywhere this evening.","plan to do something She originally planned to be a doctor.","plan something We're planning a trip to France in the spring—are you interested?","I had planned on staying here for two or three years.","Both men plan to appeal against the ruling.","If you're planning a family, you may be thinking about a bigger home.","They plan to arrive some time after three."],"opposite":"","synonyms":""},{"def":"to make a design or an outline for something","examples":["to plan an essay/a garden","The architects planned and designed the building with students in mind.","This is the place to visit if you are planning a new garden.","You should always plan your essay before you start writing it.","It's vital to plan your kitchen well."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["plan out"],"related":[]}]