[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pla/platf/platform__us_1.mp3","phonsUS":"/ˈplætfɔːrm/","level":"A2","meanings":[{"def":"the raised flat area next to the track at a train station where you get on or off the train","examples":["(British English) What platform does it go from?","(British English) The train now standing at platform 1 is for Leeds.","The train drew into the platform.","The couple met on a train platform.","The Edinburgh train is waiting at platform 4.","The train for Chicago is on track 9.","The next train to depart from platform 2 is the 10.30 for London Paddington.","The train at platform 3 is the 13.15 service to Liverpool.","the waiting room on platform 7"],"opposite":"","synonyms":""},{"def":"a flat surface raised above the level of the ground or floor, used by public speakers or performers so that the audience can see them","examples":["Coming onto the platform now is tonight's conductor, Jane Glover.","Representatives of both parties shared a platform (= they spoke at the same meeting).","The king mounted the platform to loud cheers.","Union leaders shared the platform with business leaders in a debate on the future of the industry.","The concert platform was high and almost semi-circular at the front."],"opposite":"","synonyms":""},{"def":"a raised level surface, for example one that equipment stands on or is operated from","examples":["an oil/gas platform","a viewing platform giving stunning views over the valley","a launch platform (= for spacecraft)","The table and chairs were on a raised platform."],"opposite":"","synonyms":""},{"def":"the type of computer system or the software that is used","examples":["a multimedia platform","a mobile gaming platform","The prevalence of smartphones has resulted in the migration of company information to mobile platforms."],"opposite":"","synonyms":""},{"def":"the aims of a political party and the things that they say they will do if they are elected to power","examples":["They are campaigning on an anti-immigration platform.","They fought the election on a platform of low taxes.","They adopted a platform of non-intervention in foreign conflicts.","There were few alternative platforms to choose from in the election.","The party is debating its new platform.","She campaigned on a platform of zero tolerance towards racist behaviour.","the promises in their election platform","They fought the election on a platform of economic reform."],"opposite":"","synonyms":""},{"def":"an opportunity or a place for somebody to express their opinions publicly or make progress in a particular area","examples":["She used the newspaper column as a platform for her feminist views."],"opposite":"","synonyms":""},{"def":"a type of shoe with a high, thick sole; the sole on such a shoe","examples":["platform shoes"],"opposite":"","synonyms":""},{"def":"the open part at the back of a double-decker bus where you get on or off","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["platform game","cross-platform","wave-cut platform","oil platform","platform games"]}]