[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pla/plate/plate__us_1.mp3","phonsUS":"/pleɪt/","level":"A2","meanings":[{"def":"a flat, usually round, dish that you put food on","examples":["sandwiches on a plate","There was an enormous pile of dirty plates in the kitchen sink.","The set includes four dinner plates, four side plates and four soup bowls.","They filled their plates with spaghetti.","I could see how hungry she was from the way she cleared her plate.","She ate everything on her plate.","He barely touched the food on his plate.","He came in carrying a plate of sandwiches.","We used plastic cutlery and ate off paper plates."],"opposite":"","synonyms":""},{"def":"the amount of food that you can put on a plate","examples":["a plate of sandwiches","two large plates of pasta","At dinner, Paul ate several plates of stew."],"opposite":"","synonyms":""},{"def":"a whole main course of a meal, served on one plate","examples":["Try the seafood plate."],"opposite":"","synonyms":""},{"def":"a thin flat piece of metal, used especially to join or make something stronger","examples":["The tanks were mainly constructed of steel plates.","She had a metal plate inserted in her arm."],"opposite":"","synonyms":""},{"def":"a flat piece of metal with some information on it, for example somebody’s name","examples":["A brass plate beside the door said ‘Dr Alan Tate’."],"opposite":"","synonyms":""},{"def":"the pieces of metal or plastic at the front and back of a vehicle with numbers and letters on it","examples":[],"opposite":"","synonyms":""},{"def":"ordinary metal that is covered with a thin layer of silver or gold","examples":["The cutlery is plate, not solid silver."],"opposite":"","synonyms":""},{"def":"dishes, bowls, etc. that are made of silver or gold","examples":["the family plate"],"opposite":"","synonyms":""},{"def":"one of the thin flat pieces of horn or bone that cover and protect an animal","examples":["the armadillo’s protective shell of bony plates"],"opposite":"","synonyms":""},{"def":"one of the very large pieces of rock that form the earth’s surface and move slowly","examples":["the Pacific plate","Earthquakes are caused by two tectonic plates bumping into each other."],"opposite":"","synonyms":""},{"def":"a photograph that is used as a picture in a book, especially one that is printed on a separate page on high quality paper","examples":["The book includes 55 colour plates.","See plate 4.","She looked like a fashion plate."],"opposite":"","synonyms":""},{"def":"a sheet of metal, plastic, etc. that has been treated so that words or pictures can be printed from it","examples":["a printing plate"],"opposite":"","synonyms":""},{"def":"a thin sheet of glass, metal, etc. that is covered with chemicals so that it reacts to light and can form an image, used in larger or older cameras","examples":[],"opposite":"","synonyms":""},{"def":"a thin piece of plastic with wire or artificial teeth attached to it which fits inside your mouth in order to make your teeth straight","examples":[],"opposite":"","synonyms":""},{"def":"the place where the person hitting the ball stands and where they must return to after running around all the bases","examples":[],"opposite":"","synonyms":""},{"def":"a flat dish that is used to collect money from people in a church","examples":[],"opposite":"","synonyms":""},{"def":"to give something to somebody without that person making any effort","examples":["Nobody's going to hand you success on a plate."],"opposite":"","synonyms":""},{"def":"to have a lot of work or problems, etc. to deal with","examples":[],"opposite":"","synonyms":""},{"def":"to do what is necessary in order to benefit from an opportunity or deal with a crisis","examples":["It's important for world leaders to step up to the plate and honor their commitments on global warming.","It’s time for businesses to step up to the plate and accept responsibility."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"hand something to somebody on a plate","def":"to give something to somebody without that person making any effort","examples":["Nobody's going to hand you success on a plate."]},{"idiom":"have enough/a lot/too much on your plate","def":"to have a lot of work or problems, etc. to deal with","examples":[]},{"idiom":"step up to the plate","def":"to do what is necessary in order to benefit from an opportunity or deal with a crisis","examples":["It's important for world leaders to step up to the plate and honor their commitments on global warming.","It’s time for businesses to step up to the plate and accept responsibility."]}],"phrasal":[],"related":["GB plate","L-plate","gold plate","home plate","paper plate","plate glass","plate-glass","side plate","license plate","number plate","silver plate","vanity plate","plate tectonics","Sheffield plate","registration plate","automatic license plate recognition","automatic number plate recognition"]},{"pos":"verb","level":"","meanings":[{"def":"to cover a metal with a thin layer of another metal, especially gold or silver","examples":["be plated (with something) a silver ring plated with gold","platinum-plated jewellery"],"opposite":"","synonyms":""},{"def":"to cover something with sheets of metal or another hard substance","examples":["be plated (with something) The walls of the vault were plated with steel.","nickel-plated wire"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]