[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pla/play_/play__us_1.mp3","phonsUS":"/pleɪ/","level":"A1","meanings":[{"def":"to do things for pleasure, as children do; to enjoy yourself, rather than work","examples":["You'll have to play inside today.","There's a time to work and a time to play.","play with somebody/something A group of kids were playing with a ball in the street.","I haven't got anybody to play with!","play something Let's play a different game.","There are three bars, with live entertainment seven nights a week.","It wasn’t serious—it was all done in fun.","We didn’t mean to hurt him. It was just a bit of fun.","The lottery provides harmless fun for millions.","His only form of recreation is playing football.","I go hill-walking for relaxation.","the happy sounds of children at play","Are you in Paris for business or pleasure?","What do you do for amusement round here?","The other children wouldn't let him play.","The little girl was playing with her toys.","The children spent too much time playing computer games.","I used to spend hours playing with Lego."],"opposite":"","synonyms":"entertainment"},{"def":"to pretend to be or do something for fun","examples":["play something Let's play pirates.","play at something Let's play at pirates!","play at doing something They were playing at being cowboys."],"opposite":"","synonyms":""},{"def":"to be involved in a game; to compete against somebody in a game","examples":["play something to play football/cards","play something with/against somebody I usually play chess with my brother.","play somebody France are playing Wales tomorrow.","play somebody at something Have you played her at squash yet?","play for somebody He plays for Cleveland.","play against somebody France are playing against Wales on Saturday.","play with somebody I like football, but I don't have anyone to play with.","+ adv./prep. Evans played very well.","I've never played John at tennis.","She has played in every game this season.","She was playing cards with her mother.","These guys make the team very difficult to play against.","United are difficult to play against.","Do you want to play cards with me?","Have you ever played her at chess?","They play basketball on Saturday mornings.","They've played six games in the last month.","If you are interested in playing or coaching, please contact the club president.","He plays golf on Sundays.","Both teams played well.","She plays for the local team.","Matches were played on Sunday."],"opposite":"","synonyms":""},{"def":"to take a particular position in a sports team","examples":["+ adv./prep. Who's playing on the wing?","+ noun I've never played right back before."],"opposite":"","synonyms":""},{"def":"to include somebody in a sports team","examples":["I think we should play Matt on the wing."],"opposite":"","synonyms":""},{"def":"to make contact with the ball and hit or kick it in the way mentioned","examples":["She played the ball and ran forward.","He played a backhand volley."],"opposite":"","synonyms":""},{"def":"to move a piece in chess, etc.","examples":["She played her bishop."],"opposite":"","synonyms":""},{"def":"to put a card face upwards on the table, showing its value","examples":["to play your ace/a trump","He played out of turn!"],"opposite":"","synonyms":""},{"def":"to perform music on a musical instrument","examples":["play (something) She played Mozart's Piano Concerto No. 20.","The music is well played and beautifully recorded.","In the distance a band was playing.","play on something He sat in the corner, playing softly on his guitar.","play something on something He played a tune on his harmonica.","play something to somebody Play that new piece to us.","play somebody something Play us that new piece.","Have you ever heard her play?","The band will be playing live in the studio.","a piece that is relatively easy to play","She was playing songs on her ukelele.","Classical music was playing in the background.","He played the bride in with ‘The Arrival of the Queen of Sheba’."],"opposite":"","synonyms":""},{"def":"to have the skill of performing on a musical instrument","examples":["Do you play a musical instrument?","to play the piano/violin/flute","I'm learning to play sax.","learning to play the violin","They learnt to dance, sing and play musical instruments.","In my twenties, I played trombone at a fairly high level."],"opposite":"","synonyms":""},{"def":"to use an MP3 player, a CD player, etc. to make it possible to hear a song, an album, a CD, etc.","examples":["I played some music to drown out the noise.","They're always playing that song on the radio."],"opposite":"","synonyms":""},{"def":"(of a song, an album, etc.) to be heard","examples":["My favourite song was playing on the radio."],"opposite":"","synonyms":""},{"def":"to start working; to make a video or DVD start working","examples":["These videos won't play on my computer.","play something Click below to play videos.","Nothing happens when I try to play a DVD.","A short video was played to the court showing the inside of the house."],"opposite":"","synonyms":""},{"def":"to act in a play, film, etc.; to act the role of somebody","examples":["play something to play a role/part","The part of Elizabeth was played by Cate Blanchett.","He had always wanted to play Othello.","He was chosen to play the role of Judas.","She usually plays historical characters.","play opposite somebody She played opposite Brad Pitt (= she and Brad Pitt played the two leading roles)."],"opposite":"","synonyms":""},{"def":"to pretend to be something that you are not","examples":["The children were dressed as soldiers, but they were just playing.","+ adj. I decided it was safer to play dead.","+ noun She enjoys playing the wronged wife."],"opposite":"","synonyms":""},{"def":"to behave as though you are a particular type of person","examples":["This is no time to play the hero.","She always did enjoy playing the victim."],"opposite":"","synonyms":""},{"def":"to be performed","examples":["A production of ‘Carmen’ was playing to packed houses."],"opposite":"","synonyms":""},{"def":"to give a performance in a particular place","examples":["The band are playing 11 cities around the country.","I've played some fantastic venues."],"opposite":"","synonyms":""},{"def":"to have an effect or influence on something","examples":["Social media played an important part in the last election.","Farming plays a crucial role in maintaining the landscape.","High environmental temperatures may also play a role.","Businesses can play their part by contributing some of their profits.","All countries have a part to play in protecting the environment.","Pesticides play a very important role in food production.","Sugar plays a major part in dental cavities.","Zinc may play an important part in the health of the prostate.","The media has a role to play in informing the public debate."],"opposite":"","synonyms":""},{"def":"to trick somebody for fun","examples":["Children ran around the village playing tricks.","I played a trick on him just to see his reaction."],"opposite":"","synonyms":""},{"def":"to deal with a situation in the way mentioned","examples":["He played the situation carefully for maximum advantage."],"opposite":"","synonyms":""},{"def":"to do something without being serious about it or putting much effort into it","examples":["play at something He was just playing at it before—now he's serious.","play at doing something They were playing at being villains, like in the movies.","play something (with something) Officials are playing politics with farm programs."],"opposite":"","synonyms":""},{"def":"to be willing to work with other people in a helpful way, especially so that somebody can get what they want","examples":["He needs another loan, but the bank won't play."],"opposite":"","synonyms":""},{"def":"to move or appear quickly and lightly, often changing direction or shape","examples":["Sunlight played on the surface of the lake.","A small smile played on her lips."],"opposite":"","synonyms":""},{"def":"when a fountain plays, it produces a steady stream of water","examples":["Two huge fountains were playing outside the entrance."],"opposite":"","synonyms":""},{"def":"to have plenty of money, time, etc. for doing something","examples":[],"opposite":"","synonyms":""},{"def":"to masturbate","examples":[],"opposite":"","synonyms":""},{"def":"used to ask in an angry way about what somebody is doing","examples":["What do you think you are playing at?"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"have money, time, etc. to play with","def":"to have plenty of money, time, etc. for doing something","examples":[]},{"idiom":"play with yourself","def":"to masturbate","examples":[]},{"idiom":"what is somebody playing at?","def":"used to ask in an angry way about what somebody is doing","examples":["What do you think you are playing at?"]}],"phrasal":["play about","play along","play A off against B","play around","play away","play back","play down","play itself out","play on","play out","play up","play upon","play with","play yourself out"],"related":["play-act","play-off","play on","play out","play up","run play","fair play","foul play","pass play","play away","play back","play date","Play-Doh™","play down","play upon","play with","role-play","soft play"]},{"pos":"noun","level":"A1","meanings":[{"def":"a piece of writing performed by actors in a theatre or on television or radio","examples":["a stage/radio play","She wrote a play for the students to perform.","to put on/stage a play","to produce/direct a play","play by somebody a play by Shakespeare","They are performing a play by Pinter.","The theatre was refused permission to stage the play.","Kate's class decided to put on a play for the school.","a play about teenage runaways","The play is reviewed in most of today's papers.","Her script was adapted and turned into a stage play.","The first version of the story was a radio play.","The play was first staged at the end of the 19th century."],"opposite":"","synonyms":""},{"def":"things that people, especially children, do for pleasure rather than as work","examples":["the importance of learning through play","Making time for both work and play is not easy.","at play the happy sounds of children at play","The site offers sports facilities, including tennis courts, and a children's play area.","Children spend hours at play.","The local council runs some good play schemes.","They are raising money for an outdoor play area.","There are lots of opportunities for imaginative play."],"opposite":"","synonyms":""},{"def":"the playing of a game","examples":["Rain stopped play.","There was some excellent play in yesterday's match.","The spectators were asked to be quiet during play.","This video game has fast and exciting game play.","Does online play have a negative effect on gaming?","Rain stopped play 40 minutes into the match.","At close of play he had scored 38 not out.","There was some nice defensive play by the local champion.","Team play is very important.","They took an early lead thanks to some splendid forward play by Cooper.","She is returning to tournament play for the first time since losing the Wimbledon final.","A short while later, play resumed.","He significantly changed the game of basketball with his influential style of play.","The score after eleven minutes of play was 9-7."],"opposite":"","synonyms":""},{"def":"an action or move in a game","examples":["He made several nice defensive plays.","They are playing better now, making big plays at key times.","The offensive coordinator has called 60 running plays and 44 passes.","There were ten double plays completed.","They ran 10 plays inside the 30 in the fourth quarter.","the final play of the first half","the team's ability to execute a play"],"opposite":"","synonyms":""},{"def":"the activity or operation of something; the influence of something on something else","examples":["the free play of market forces","in play More powerful forces are in play.","The financial crisis has brought new factors into play.","Personal feelings should not come into play when you are making business decisions.","at play Other issues such as market power could be at play.","There are several measures in play at one time.","Both of these factors are in play.","All of his skills were called into play.","There is more at play here than simply reputations.","They were more independent and given freer play than many women of their time."],"opposite":"","synonyms":""},{"def":"the possibility of free and easy movement","examples":["We need more play in the rope."],"opposite":"","synonyms":""},{"def":"a light, quick movement that keeps changing","examples":["the play of sunlight on water"],"opposite":"","synonyms":""},{"def":"it is not healthy to spend all your time working; you need to relax too","examples":[],"opposite":"","synonyms":""},{"def":"to be very easy to do, so not even a child would find it difficult","examples":[],"opposite":"","synonyms":""},{"def":"to make use of something","examples":["Chess is a game that calls into play all your powers of concentration."],"opposite":"","synonyms":""},{"def":"to spend time playing with a toy, game, etc.","examples":["I had a play with the new computer game."],"opposite":"","synonyms":""},{"def":"inside/outside the area allowed by the rules of the game","examples":["She just managed to keep the ball in play.","The ball is still in play.","He kicked the ball out of play."],"opposite":"","synonyms":""},{"def":"to emphasize the importance of a particular fact","examples":["He made great play of the fact that his uncle was a duke."],"opposite":"","synonyms":""},{"def":"to try to obtain something; to do things that are intended to produce a particular result","examples":["She was making a play for the sales manager's job."],"opposite":"","synonyms":""},{"def":"the humorous use of a word or phrase that can have two different meanings","examples":[],"opposite":"","synonyms":""},{"def":"the stage that has been reached in a process, etc. which has not yet been completed","examples":["What is the current state of play in the peace talks?"],"opposite":"","synonyms":""},{"def":"the score in a sports match, especially in cricket","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"all work and no play (makes Jack a dull boy)","def":"it is not healthy to spend all your time working; you need to relax too","examples":[]},{"idiom":"be child’s play","def":"to be very easy to do, so not even a child would find it difficult","examples":[]},{"idiom":"call something into play","def":"to make use of something","examples":["Chess is a game that calls into play all your powers of concentration."]},{"idiom":"have a play (with something)","def":"to spend time playing with a toy, game, etc.","examples":["I had a play with the new computer game."]},{"idiom":"in/out of play","def":"inside/outside the area allowed by the rules of the game","examples":["She just managed to keep the ball in play.","The ball is still in play.","He kicked the ball out of play."]},{"idiom":"make great/much play of something","def":"to emphasize the importance of a particular fact","examples":["He made great play of the fact that his uncle was a duke."]},{"idiom":"make a play for somebody/something","def":"to try to obtain something; to do things that are intended to produce a particular result","examples":["She was making a play for the sales manager's job."]},{"idiom":"a play on words","def":"the humorous use of a word or phrase that can have two different meanings","examples":[]},{"idiom":"the state of play","def":"the stage that has been reached in a process, etc. which has not yet been completed","examples":["What is the current state of play in the peace talks?"]}],"phrasal":[],"related":[]}]