[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/ple/pleas/pleasure__us_1.mp3","phonsUS":"/ˈpleʒər/","level":"B1","meanings":[{"def":"a state of feeling or being happy or satisfied","examples":["His eyes lit up with pleasure.","for pleasure Encourage your child to read for pleasure.","pleasure in something He takes no pleasure in his work.","pleasure in doing something She took pleasure in shocking her parents.","pleasure from/out of something A large number of people fail to derive any pleasure at all from horror movies.","pleasure from/out of doing something He gets a lot of pleasure out of watching his children perform.","pleasure of doing something She had the pleasure of seeing him look surprised.","pleasure of something (formal) We request the pleasure of your company at the marriage of our daughter Lisa.","(formal) May I have the pleasure of the next dance?","the sheer pleasure of performing music","pleasure at something I was touched by her genuine pleasure at her mother's present.","pleasure at doing something The band's pleasure at being back in Dublin was clear.","It gives me great pleasure to introduce our guest speaker.","Caring for a sick relative is a task that brings both pleasure and pain.","(formal) The photographs are now available for your viewing pleasure.","We had a lot of fun at Sarah’s party.","Sailing is good/​great fun.","Reading for pleasure and reading for study are not the same.","We had a good time in Spain.","I get a lot of enjoyment from music.","We had a really great time together.","Children find endless pleasure in playing with water.","He beamed with pleasure at seeing her.","He gained vicarious pleasure from watching people laughing and joking.","I hope to have the pleasure of meeting you again.","My grandfather got immense pleasure out of life until the end.","She was deriving a perverse pleasure from his discomfort.","The audience nodded with quiet pleasure at her remark.","the dubious pleasure of growing up in the public eye"],"opposite":"","synonyms":"fun"},{"def":"the activity of enjoying yourself, especially in contrast to working","examples":["Are you in Paris on business or pleasure?","a pleasure boat/trip","There are three bars, with live entertainment seven nights a week.","It wasn’t serious—it was all done in fun.","We didn’t mean to hurt him. It was just a bit of fun.","The lottery provides harmless fun for millions.","His only form of recreation is playing football.","I go hill-walking for relaxation.","the happy sounds of children at play","Are you in Paris for business or pleasure?","What do you do for amusement round here?","I often meet useful people at parties, so I combine business with pleasure.","I never mix business with pleasure."],"opposite":"","synonyms":"entertainment"},{"def":"a thing that makes you happy or satisfied","examples":["pleasure of something the simple pleasures of the countryside","the pleasures and pains of everyday life","Swimming is one of my greatest pleasures.","Chocolate is one of life’s little pleasures.","This movie was one of the unexpected pleasures of the Film Festival.","it is a pleasure to do something It's a pleasure to meet you.","‘Thanks for doing that.’ ‘It's a pleasure.’","the pleasures and pains of everyday life","It’s been a pleasure meeting you.","the delights of living in the country","the joys and sorrows of childhood","It was a great privilege to hear her sing.","You’ve never been to this area before? Then you’re in for a real treat.","It was a great honour to be invited here today."],"opposite":"","synonyms":"pleasure"},{"def":"as you want; as somebody else wants","examples":["The land can be sold at the owner's pleasure."],"opposite":"","synonyms":""},{"def":"something that you enjoy, even though you feel it is not really a good thing","examples":["Daytime TV is one of my guilty pleasures."],"opposite":"","synonyms":""},{"def":"used as a polite way of replying when somebody thanks you for doing something, to show that you were happy to do it","examples":[],"opposite":"","synonyms":""},{"def":"used as a polite way of accepting or agreeing to something","examples":["‘May I sit here?’ ‘Yes, with pleasure.’"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"at your/somebody’s pleasure","def":"as you want; as somebody else wants","examples":["The land can be sold at the owner's pleasure."]},{"idiom":"a guilty pleasure","def":"something that you enjoy, even though you feel it is not really a good thing","examples":["Daytime TV is one of my guilty pleasures."]},{"idiom":"my pleasure","def":"used as a polite way of replying when somebody thanks you for doing something, to show that you were happy to do it","examples":[]},{"idiom":"with pleasure","def":"used as a polite way of accepting or agreeing to something","examples":["‘May I sit here?’ ‘Yes, with pleasure.’"]}],"phrasal":[],"related":["pleasure boat","pleasure craft","a guilty pleasure"]}]