[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/ple/pledg/pledge__us_1.mp3","phonsUS":"/pledʒ/","level":"C1","meanings":[{"def":"to formally promise to give or do something","examples":["pledge something Japan has pledged $100 million in humanitarian aid.","The government pledged their support for the plan.","pledge something to somebody/something We all had to pledge allegiance to the flag (= state that we are loyal to our country).","pledge to do something The group has pledged to continue campaigning.","pledge (that)… The group has pledged that they will continue campaigning.","The country pledged not to interfere in its neighbour's affairs.","The government has pledged that it will not raise taxes."],"opposite":"","synonyms":""},{"def":"to make somebody or yourself formally promise to do something","examples":["pledge somebody/yourself (to something) They were all pledged to secrecy.","pledge somebody/yourself to do something The government has pledged itself to root out corruption."],"opposite":"","synonyms":""},{"def":"to leave something with somebody as a pledge","examples":[],"opposite":"","synonyms":""},{"def":"to promise to become a junior member of a fraternity or sorority","examples":["Do you think you'll pledge this semester?","pledge something My brother pledged Sigma Nu (= promised to join the Sigma Nu fraternity)"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Pledge of Allegiance","sign/take the pledge"]},{"pos":"noun","level":"C1","meanings":[{"def":"a serious promise","examples":["pledge (of something) a pledge of support","pledge to do something Will the government honour its election pledge not to raise taxes?","to fulfil/break/abandon a pledge","pledge that… Management has made a pledge that there will be no job losses this year.","The new leader demanded a pledge of loyalty from each of his allies.","manifesto pledges on greater public spending","The party's election pledge was to cut income taxes by a third over the next five years.","spending pledges made by the government","The new owners gave a pledge that there would be no job losses."],"opposite":"","synonyms":""},{"def":"a sum of money or something valuable that you leave with somebody to prove that you will do something or pay back money that you owe","examples":[],"opposite":"","synonyms":""},{"def":"to make a promise never to drink alcohol","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"sign/take the pledge","def":"to make a promise never to drink alcohol","examples":[]}],"phrasal":[],"related":[]}]