[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/plo/plot_/plot__us_1.mp3","phonsUS":"/plɑːt/","level":"B1","meanings":[{"def":"the series of events that form the story of a novel, play, film, etc.","examples":["It's hard to follow the plot of the film.","plot about something a conventional plot about love and marriage","The book is well organized in terms of plot.","Plot twists (= unexpected developments) keep you guessing throughout the series.","She has constructed a complicated plot, with a large cast of characters.","The main plot revolves around a suspicious death.","There are several unexpected twists in the plot before the murderer is revealed.","This car chase does nothing to advance the plot."],"opposite":"","synonyms":""},{"def":"a secret plan made by a group of people to do something wrong or illegal","examples":["He had been the victim of an elaborate murder plot.","plot to do something The rebels hatched a plot to overthrow the government.","plot against somebody Police uncovered a plot against the president.","They had taken part in a Jacobite plot against William III."],"opposite":"","synonyms":""},{"def":"a small piece of land that is used or intended for a special purpose","examples":["She bought a small plot of land to build a house on.","a vegetable plot","agricultural land","building lots","a parking lot","The kids were playing on waste ground near the school.","the site of an ancient burial ground","The city has plenty of open space.","the wide open spaces of the Canadian prairies","She bought a small plot of land to build a house.","a vegetable plot","The plots each measure 10 metres by 20 metres.","They own a five-acre plot of land.","He was buried in the family plot at the cemetery."],"opposite":"","synonyms":"land"},{"def":"to lose your ability to understand or deal with what is happening","examples":[],"opposite":"","synonyms":""},{"def":"used to say that a situation is becoming more complicated and difficult to understand","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"lose the plot","def":"to lose your ability to understand or deal with what is happening","examples":[]},{"idiom":"the plot thickens","def":"used to say that a situation is becoming more complicated and difficult to understand","examples":[]}],"phrasal":[],"related":["plot hole","Popish Plot","Gunpowder Plot","plot holes"]},{"pos":"verb","level":"B2","meanings":[{"def":"to make a secret plan to harm somebody, especially a government or its leader","examples":["plot with somebody It is claimed he plotted with the country's enemies.","plot against somebody/something They were accused of plotting against the state.","plot with somebody against somebody/something He was accused of having secretly plotted with Tipu against the British.","plot to do something They were plotting to overthrow the government.","She constantly plotted and schemed to catch me in some sort of lie.","plot with somebody to do something Taylor plotted with his daughter to murder her husband.","plot something Military officers were suspected of plotting a coup.","She spends every waking hour plotting her revenge.","They used the internet to plot their murderous attacks.","He was arrested on suspicion of plotting against the king.","The killings were carefully plotted and not impulsive."],"opposite":"","synonyms":""},{"def":"to mark something on a map, for example the position or course of something","examples":["The earthquake centres had been plotted on a world map.","He plotted a new route across the Atlantic.","The positions of the archaeological finds are accurately plotted."],"opposite":"","synonyms":""},{"def":"to make a diagram or chart from some information","examples":["We carefully plotted each patient's response to the drug on a chart.","Greenhouse temperature can be plotted against plant growth."],"opposite":"","synonyms":""},{"def":"to mark points on a graph and draw a line or curve connecting them","examples":["First, plot the temperature curve on the graph."],"opposite":"","synonyms":""},{"def":"to write the plot of a novel, play, etc.","examples":["a tightly-plotted thriller"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]