[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/plu/plug_/plug__us_1.mp3","phonsUS":"/plʌɡ/","level":"C1","meanings":[{"def":"to fill a hole with a substance or piece of material that fits tightly into it","examples":["He plugged the hole in the pipe with an old rag.","Divers succeeded in plugging the leaks from the tanker."],"opposite":"","synonyms":""},{"def":"to provide something that has been missing from a particular situation and is needed in order to improve it","examples":["A cheaper range of products was introduced to plug the gap at the lower end of the market."],"opposite":"","synonyms":""},{"def":"to give praise or attention to a new book, film, etc. in order to encourage people to buy it or see it","examples":["She came on the show to plug her latest album."],"opposite":"","synonyms":""},{"def":"to shoot somebody","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["plug away","plug in","plug into"],"related":["plug-in","plug in","jack plug","plug away","plug into","plug-ugly","wall plug","spark plug","Plug and Play","plug-and-play","plug-ins","sparking plug","plug something","plug into something"]},{"pos":"noun","level":"C1","meanings":[{"def":"a small plastic object with two or three metal pins that connects a piece of electrical equipment to the main supply of electricity","examples":["The iron is fitted with a three-pin plug.","I'll have to change the plug on my hairdryer."],"opposite":"","synonyms":""},{"def":"a small opening in a wall, by which you connect a piece of electrical equipment to the main supply of electricity","examples":["Can I use this plug for my iron?"],"opposite":"","synonyms":""},{"def":"a small object that connects a wire from one piece of electrical equipment to an opening in another","examples":["the plug from the computer to the printer","I pushed the jack plug into the amp."],"opposite":"","synonyms":""},{"def":"a part in a car engine that produces a spark (= a flash of electricity) which makes the fuel burn and starts the engine","examples":[],"opposite":"","synonyms":""},{"def":"a thick round piece of plastic, rubber or metal that you put in the hole in a bath or a sink to stop the water flowing out","examples":["She pulled out the plug and let the water drain away.","There was plenty of hot water, but there was no bath plug.","a jar with a tight-fitting lid","a bath plug"],"opposite":"","synonyms":"lid"},{"def":"a round piece of material that fits into a hole and blocks it","examples":["She took the plug of cotton wool from her ear.","We fixed the leak with a plug made from an old cloth."],"opposite":"","synonyms":""},{"def":"an object that fits into the top of a bottle to close it","examples":["a jar with a tight-fitting lid","a bath plug"],"opposite":"","synonyms":"lid"},{"def":"a small plastic tube that you put into a hole in a wall so that it will hold a screw","examples":[],"opposite":"","synonyms":""},{"def":"praise or attention that somebody gives to a new book, film, etc. in order to encourage people to buy or see it","examples":["He managed to get in a plug for his new book."],"opposite":"","synonyms":""},{"def":"to put an end to somebody’s project, a plan, etc.","examples":["The television company pulled the plug on the series after only five episodes.","They decided to pull the plug on the project."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"pull the plug on somebody/something","def":"to put an end to somebody’s project, a plan, etc.","examples":["The television company pulled the plug on the series after only five episodes.","They decided to pull the plug on the project."]}],"phrasal":[],"related":[]}]