[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pol/polic/police__us_1.mp3","phonsUS":"/pəˈliːs/","level":"A1","meanings":[{"def":"an official organization whose job is to make people obey the law and to prevent and solve crime; the people who work for this organization","examples":["Get out of the house or I'll call the police.","Contact the police if you see anything suspicious.","The police arrested three men and took them for questioning.","Police are investigating the break-in.","Armed police soon arrived on the scene.","traffic/transport police","Hundreds of police in riot gear struggled to control the violence.","a police car","the police investigation into the killings","Contact your local police department to file a report.","I'd really rather not involve the police.","No arrest has been made, but a man is helping the police with their enquiries.","Police have appealed for witnesses to come forward.","The police arrived to break up the battle.","The police charged him with impaired driving.","I had a police record.","All prosecution witnesses were given police protection.","He spent the night in a police cell after his arrest.","He was held in police custody for a month","Nine arrests were made in a series of police raids across the city.","Some protesters managed to break through the police cordon.","The visiting fans returned to the railway station under police escort.","There was a huge police presence at the demonstration.","A man was arrested by the police and held for questioning.","Police suspect a local gang."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["police dog","riot police","police force","police state","secret police","kitchen police","military police","police constable","police department","police officer","police procedural","police station","thought police","police commissioner","Metropolitan Police","Los Angeles Police Department","New York City Police Department","Police and Criminal Evidence Act","Police Service of Northern Ireland"]},{"pos":"verb","level":"","meanings":[{"def":"to go around a particular area to make sure that nobody is breaking the law there","examples":["The border will be policed by UN officials."],"opposite":"","synonyms":""},{"def":"to make sure that a particular set of rules is obeyed","examples":["The profession is policed by its own regulatory body.","The government has called on newspapers to police themselves.","These sort of regulations are very difficult to police."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]