[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pol/polic/policy__us_1.mp3","phonsUS":"/ˈpɑːləsi/","level":"B1","meanings":[{"def":"a plan of action agreed or chosen by a political party, a business, etc.","examples":["policy on something the present government’s policy on education","The company has adopted a firm policy on shoplifting.","The new managers are expected to implement new policies.","policy of something We have tried to pursue a policy of neutrality.","policy of doing something We have a policy of refusing to comment on such matters.","policy towards somebody/something This marked the beginning of a more open policy towards the rest of the world.","US foreign/economic policy","The document does not represent government policy.","He implemented an aggressive monetary policy to stimulate the economy.","They have had a significant change in policy on paternity leave.","This would be a radical shift in policy.","a policy adviser/decision","a policy statement/objective/initiative/document","Some have criticized universities for their admissions policies.","The company operates a strict no-smoking policy.","The company's policy of expansion has created many new jobs.","The government followed a policy of restraint in public spending.","The magazine has a misguided editorial policy.","We have a zero-tolerance policy for drugs.","a deliberate policy to involve people of all ages in the scheme","a policy adviser who made his name as a health reformer","a policy aimed at halting economic recession","a policy prohibiting sexual harassment","affirmative-action policies that aim to help members of historically disadvantaged groups","an open-door policy for migrant workers","policies designed to support and encourage marriage","policies governing the management of the environment","the need to address public policy issues at the national level","the need to reform our flawed agricultural policy","the party's policy on housing","As far as crime goes, they seem to have no coherent policy.","The party is undertaking a wide-ranging policy review.","The party's new policy on education has yet to be revealed.","Their social policy is good, but will it work in practice?"],"opposite":"","synonyms":""},{"def":"a principle that you believe in that influences how you behave; a way in which you usually behave","examples":["She is following her usual policy of ignoring all offers of help.","(saying) Honesty is the best policy.","Silence must be our policy!","It is my policy not to say anything to the press."],"opposite":"","synonyms":""},{"def":"a written statement of a contract of insurance","examples":["Check the terms of the policy before you sign.","The policy covers (you for) accidental loss or damage.","risks defined in the policy","the types of claims covered under the policy"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["endowment policy","insurance policy","reservation policy","Good Neighbor Policy","scorched earth policy","Common Agricultural Policy"]}]