[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pol/polit/politics__us_1.mp3","phonsUS":"/ˈpɑːlətɪks/","level":"B1","meanings":[{"def":"the activities involved in getting and using power in public life, and being able to influence decisions that affect a country or a society","examples":["world/international politics","domestic/national/local politics","progressive/radical politics","in politics She is aiming for a career in politics.","a major figure in British politics","Have you considered going into politics (= trying to become a Member of Parliament, Congress, etc.)?","The economy has been the major issue in electoral politics.","This issue is beyond partisan politics (= when people strongly support one party or another).","As a churchman, he was accused of interfering in politics.","He abandoned politics and went into business.","He argued that it was not practical politics to abolish private schools.","I have always followed politics closely.","In their world politics dominates everything.","Let's not talk politics now.","The Democrats are simply engaging in partisan politics.","The legislation has been driven by populist politics.","reforms that are intended to reshape Italian politics","the issues which have dominated Irish politics"],"opposite":"","synonyms":""},{"def":"matters connected with getting or using power within a particular group or organization","examples":["I don't want to get involved in office politics.","the internal politics of the legal profession","racial/gender/sexual politics (= connected with relationships of power between different groups in society)","the politics of something the politics of identity/race/gender","the politics of fear/envy/division/hate (= when people are influenced by fear, envy, etc.)","He used dirty politics to trash his opponent's record.","the politics surrounding reproduction and fertility","I don't understand the politics of it all."],"opposite":"","synonyms":""},{"def":"a person’s political views or beliefs","examples":["His politics are extreme.","His manners were as mild as his politics were extreme.","My personal politics are pretty simple."],"opposite":"","synonyms":""},{"def":"the study of government and politics","examples":["a degree in Politics"],"opposite":"","synonyms":""},{"def":"a system of political beliefs; a state of political affairs","examples":["A politics of the future has to engage with new ideas."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["identity politics","party politics","power politics"]}]