[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pol/poll_/poll__us_1.mp3","phonsUS":"/pəʊl/","level":"C1","meanings":[{"def":"the process of questioning people who are representative of a larger group in order to get information about the general opinion","examples":["to carry out/conduct a poll","A recent poll suggests some surprising changes in public opinion.","A nationwide poll revealed different food preferences in the North and the South.","The poll asked voters what was the most important moral issue that affected their vote.","Nelson has a clear lead in the opinion polls.","Only 22 per cent of poll respondents say they have a positive opinion of him.","The latest tracking poll shows the Democrats leading by four percentage points.","The president's poll numbers are sinking fast in the West.","poll data on consumer attitudes","the results generated by the poll question"],"opposite":"","synonyms":""},{"def":"the process of voting at an election; the process of counting the votes","examples":["The final result of the poll will be known tomorrow.","Thursday is traditionally the day when Britain goes to the polls (= when elections are held).","Polls close (= voting ends) at 9 p.m.","at the polls Their defeat at the polls came as a big shock.","Who did you vote for in the last election?","They took a vote on who should go first.","They suffered a defeat at the polls.","The leader will be chosen by secret ballot.","success in the polls","The party is leading in the polls.","Counting will begin as soon as the polls close.","Clearer policies might have widened our lead in the polls."],"opposite":"","synonyms":"election"},{"def":"the number of votes given in an election","examples":["Labour is ahead in the poll.","They gained 20 per cent of the poll."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["poll tax","deed poll","exit poll","push poll","straw poll","Gallup poll™","Harris Poll™","opinion poll","poll taxes"]},{"pos":"verb","level":"","meanings":[{"def":"to receive a particular number of votes in an election","examples":["poll something They polled 39 per cent of the vote in the last election.","+ adv./prep. The Republicans have polled well (= received many votes) in recent elections."],"opposite":"","synonyms":""},{"def":"to ask a large number of members of the public what they think about something","examples":["Over 50 per cent of those polled were against the proposed military action.","The film was voted top by critics polled by ‘Movie’ magazine."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]