[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/poo/pool_/pool__us_1.mp3","phonsUS":"/puːl/","level":"A1","meanings":[{"def":"an area of water that has been created for people to swim in","examples":["an indoor/outdoor pool","Does the hotel have a pool?","relaxing by the pool","He swam three lengths of the pool.","I left the diving pool after my session on the springboards.","A girl invited me over to her pool party.","I slipped on the wet pool deck and fell down.","Jack works there as a pool boy.","a 25 m lap pool","a unique new wave pool"],"opposite":"","synonyms":""},{"def":"the building that contains a public pool","examples":[],"opposite":"","synonyms":""},{"def":"a small area of still water, especially one that has formed naturally","examples":["freshwater/thermal pools","Rhinos are fond of wallowing in muddy pools and sandy riverbeds.","The waterfall cascades into the pool below.","There was a pool of water at the bottom of the garden.","The park is full of hot water springs and bubbling mud pools.","a shallow pool full of red carp"],"opposite":"","synonyms":""},{"def":"a small amount of liquid or light lying on a surface","examples":["pool of something The body was lying in a pool of blood.","a pool of light","The water ran down out of their clothes and formed a pool on floor.","The wick floated in a pool of oil.","pools of water"],"opposite":"","synonyms":""},{"def":"a supply of things or money that is shared by a group of people and can be used when needed","examples":["a pool of cars used by the firm’s sales force","a pool car","They draw on funds from a common pool.","They will share a limited pool of money with other defendants.","a shrinking pool of assets","The purpose of an insurance company is to provide a pool of funds from which to meet claims made by its customers.","a growing pool of data","a vast pool of knowledge on best practices"],"opposite":"","synonyms":""},{"def":"a group of people available for work when needed","examples":["a pool of cheap labour","I started my career in the typing pool (= a group of people who shared a company’s typing work) over 40 years ago.","A member of the press pool shouted out a question to the president.","There's a great talent pool in the business community.","We need to increase our applicant pool.","a method of expanding the pool of potential investors","a strong pool of talent in the company","the available pool of really good people"],"opposite":"","synonyms":""},{"def":"a game for two people played with 16 balls on a table, often in pubs and bars. Players use cues (= long sticks) to try to hit the balls into pockets at the edge of the table.","examples":["a pool table","to shoot (= play) pool","Do you play pool?"],"opposite":"","synonyms":""},{"def":"a form of gambling in the UK in which people try to win money by saying what the results of football matches will be","examples":["He does the pools every week.","a pools winner"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["car pool","gene pool","rock pool","tide pool","motor pool","plunge pool","wading pool","infinity pool","paddling pool","swimming pool"]},{"pos":"verb","level":"","meanings":[{"def":"to collect money, information, etc. from different people so that it can be used by all of them","examples":["The students work individually, then pool their ideas in groups of six.","Police forces across the country are pooling resources in order to solve this crime."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]