[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/poo/poor_/poor__us_1_rr.mp3","phonsUS":"/pʊr/","level":"A1","meanings":[{"def":"having very little money; not having enough money for basic needs","examples":["They were too poor to buy shoes for the kids.","We aim to help the poorest families.","It's among the poorer countries of the world.","This is a relatively poor neighbourhood.","Andrew grew up desperately poor.","They were so poor that they couldn't afford to feed their family.","They were too poor to buy shoes for the kids.","socially disadvantaged sections of the community","It’s a charity that provides help for needy children.","Thousands of impoverished peasants are desperate to move to the cities.","He died penniless in Paris.","I was always hard up as a student.","He was getting richer and richer as they got poorer and poorer.","They remained poor all their lives.","Poor people need income not handouts.","She was too poor to afford a bike.","Half a million poor children around the world suffer from vitamin A deficiency.","The gap between rich and poor nations grows.","Farmers in poor countries are generally the victims.","They build low-cost housing for poor families.","The rural south has historically been the poorest region of the country."],"opposite":"rich","synonyms":"poor"},{"def":"people who have very little money","examples":["They provided food and shelter for the poor."],"opposite":"the rich","synonyms":""},{"def":"deserving sympathy","examples":["Have you heard about poor old Harry? His wife's left him.","It's hungry—the poor little thing.","‘I have stacks of homework to do.’ ‘Oh, you poor thing.’","Some poor soul will have to clean the house after the party.","Come over here and help your poor old mother.","Those poor horses have far too much to carry.","The poor kid isn't being properly cared for."],"opposite":"","synonyms":""},{"def":"not good; of a quality that is low or lower than expected","examples":["the party’s poor performance in the election","The food was of very poor quality.","She's been in poor health for some time now.","The cottage was in poor physical condition.","It was raining heavily and visibility was poor.","poor food/light/soil","to have a poor opinion of somebody (= to not think well of somebody)","The work was of an extremely poor standard.","He makes some pretty poor decisions throughout the novel.","Many health problems are related to poor diet and sedentary lifestyles.","Her guitar playing is poor.","He was frustrated about his poor exam performance.","There was a reduced crop because of poor growing conditions.","He showed poor judgement by hiring her.","Poor management has damaged the land in the past.","The soil was so poor that it couldn't support any vegetation.","Watching the concert on TV was a poor substitute for being at the live performance.","The city has the poorest exam results in the region.","We received a very poor return on our investment.","He wanted to be a Navy pilot but was disqualified due to poor eyesight.","The country is criticised for its poor human rights record."],"opposite":"","synonyms":""},{"def":"not good at something","examples":["a poor swimmer","a poor judge of character","She's a good teacher but a poor manager.","a poor sailor (= somebody who easily gets sick at sea)","poor at (doing) something Many companies are poor at dealing with telephone complaints."],"opposite":"","synonyms":""},{"def":"having very small amounts of something","examples":["a country poor in natural resources","soil poor in nutrients","There's very little soil here and it's poor in quality."],"opposite":"rich","synonyms":""},{"def":"to finish a long way behind the winner in a race, competition, etc.","examples":[],"opposite":"","synonyms":""},{"def":"a person or thing that is similar to but of a lower quality than a particular famous person or thing","examples":["Sparkling white wine is the poor man's champagne."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be/come a poor second, third, etc.","def":"to finish a long way behind the winner in a race, competition, etc.","examples":[]},{"idiom":"the poor man’s somebody/something","def":"a person or thing that is similar to but of a lower quality than a particular famous person or thing","examples":["Sparkling white wine is the poor man's champagne."]}],"phrasal":[],"related":["dirt poor","piss-poor","time-poor","poor relation","Poor Law","Standard & Poor's","working poor","Poor Richard's Almanack","poor relations","the poor man’s somebody/something","be in bad, poor, the worst possible, etc. taste","make a better, good, poor, etc. fist of something"]}]