[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pop/popul/popular__us_1.mp3","phonsUS":"/ˈpɑːpjələr/","level":"A1","meanings":[{"def":"liked or enjoyed by a large number of people","examples":["Andalucia is a popular tourist destination.","an extremely/immensely popular TV show","This annual event is wildly popular.","This is one of our most popular designs.","The use of case studies has become increasingly popular in higher education.","popular with somebody These policies are unlikely to prove popular with middle-class voters.","I'm not very popular with my parents (= they are annoyed with me) at the moment.","popular among somebody Pizza is more popular among younger adults.","(ironic) ‘Our dog got into the neighbour's garden again!’ ‘You'll be popular.’","He was one of those people who are instantly popular.","What makes this subject so popular?","Seaside holidays are always popular.","Jack was not exactly popular after the incident with the fire extinguisher.","The restaurant is deservedly popular with all who enjoy Mexican food.","This area is immensely popular with tourists.","These animals are quite popular as pets.","The events are popular and generally successful.","The market has quickly become a popular local landmark.","Caramel is an increasingly popular ice cream flavour.","His policies are popular with working people.","Her unique style has made her paintings popular among collectors."],"opposite":"unpopular","synonyms":""},{"def":"right or appropriate for the taste and knowledge of ordinary people","examples":["popular music/songs/culture/fiction","This story has been widely reported in the popular press.","The band's success is largely due to the popular appeal of the lead singer.","Their art had more in common with American popular culture than with European high art.","She works in the popular music industry."],"opposite":"","synonyms":""},{"def":"shared by a large number of people","examples":["There's a popular misconception that it's a difficult instrument to play.","Contrary to popular belief, women cause fewer road accidents than men.","Popular opinion was divided on the issue.","By popular demand, the tour has been extended by two weeks.","Their story has captured the popular imagination.","Contrary to popular opinion, many women play video games.","The show is back by popular demand.","There was an association in the popular mind of the city with crime and violence."],"opposite":"","synonyms":""},{"def":"connected with the ordinary people of a country","examples":["The party still has widespread popular support.","a share of the popular vote","The regime was overthrown by a popular uprising.","There was a popular outcry against the proposals.","There is a growing popular movement for democracy in the country."],"opposite":"","synonyms":""},{"def":"the view or belief that most people hold","examples":["Conventional wisdom has it that riots only ever happen in cities.","Conventional wisdom has it that all sense of community has gone, but that is not the case where I live.","The received wisdom is that the book is always better than the film.","Contrary to conventional wisdom, stress is not always a bad thing.","Popular wisdom has it that higher oil prices are bad for economic growth."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"conventional/received/popular wisdom","def":"the view or belief that most people hold","examples":["Conventional wisdom has it that riots only ever happen in cities.","Conventional wisdom has it that all sense of community has gone, but that is not the case where I live.","The received wisdom is that the book is always better than the film.","Contrary to conventional wisdom, stress is not always a bad thing.","Popular wisdom has it that higher oil prices are bad for economic growth."]}],"phrasal":[],"related":["popular front","popular vote","popular culture","popular etymology","popular fronts","popular etymologies","the popular vote","by popular demand","conventional/received/popular wisdom"]}]