[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pop/popul/population__us_1.mp3","phonsUS":"/ˌpɑːpjuˈleɪʃn/","level":"A2","meanings":[{"def":"all the people who live in a particular area, city or country; the total number of people who live there","examples":["One third of the world’s population consumes/consume two thirds of the world’s resources.","The country has a total population of 65 million.","The entire population of the town was at the meeting.","countries with ageing populations","Muslims make up 55 per cent of the population.","an increase in population","areas of dense/sparse population (= where many/not many people live)","The population is increasing at about 6 per cent per year.","population growth/density","Japan has a population of nearly 130 million.","India's population growth rate has been more than twice that of China's.","No reliable population estimates exist.","The population now stands at about 4 million.","The population fluctuated between 16 000 and 31 000.","The general population was against the measures.","The majority of the population live in these two towns.","These farmers are relatively poor when compared with the rest of the population.","The rapid growth of population led to an acute shortage of housing.","huge population shifts within metropolitan regions","major population centres along the coast","research in matters of sexual health and population control","the population boom which followed World War Two","Agriculture employs 20 per cent of the country's total population.","A growing segment of the population is interested in organic products.","The country is relatively large, measured by population size.","a population decline/​explosion","demands on the health services from an ageing population","They claim that GM crops will feed our growing population."],"opposite":"","synonyms":""},{"def":"a particular group of people or animals living in a particular area","examples":["the adult/student/working population","the rural/urban population","The disease is relatively uncommon in the general population.","The prison population (= the number of people in prison) is continuing to rise.","He was accused of war crimes against the civilian population.","Oil spillages are disastrous for fish populations.","the growing Hispanic population in the United States","Most of the economically active population is employed in the primary industries.","The estuary is home to the largest breeding population of birds in Australia.","natural populations of plants and animals","62 per cent of the entire student population qualified for financial assistance.","This land is sacred to the indigenous population.","She promised to improve conditions for the local population.","The policies are aimed at protecting wild cheetah populations.","Poverty is increasing among the urban population.","The spray is effective in reducing populations of some perennial weeds."],"opposite":"","synonyms":""},{"def":"a collection of items being statistically analysed","examples":["When populations are small, random events can lead them to behave atypicallly."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["population explosion","population explosions"]}]