[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pos/pose_/pose__us_1.mp3","phonsUS":"/pəʊz/","level":"B2","meanings":[{"def":"to create a threat, problem, etc. that has to be dealt with","examples":["to pose a threat/risk/challenge/danger","the threat posed by terrorism","Obesity poses real risks to health and happiness.","The task poses no special problems.","to pose a hazard/obstacle/barrier","Pollutants in the river pose a real risk to the fish.","the dangers posed by the possession of nuclear weapons","the environmental threat posed by oil spillages"],"opposite":"","synonyms":""},{"def":"to ask a question, especially one that needs serious thought","examples":["The new play poses some challenging questions."],"opposite":"","synonyms":""},{"def":"to sit or stand in a particular position in order to be painted, drawn or photographed","examples":["The delegates posed for a group photograph.","They posed briefly for pictures before driving off.","She was only too delighted to pose for the cameras.","He was persuaded to pose for his portrait."],"opposite":"","synonyms":""},{"def":"to pretend to be somebody in order to trick other people","examples":["The gang entered the building posing as workmen."],"opposite":"","synonyms":""},{"def":"to dress or behave in a way that is intended to impress other people","examples":["I saw him out posing in his new sports car."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["strike a pose/an attitude"]},{"pos":"noun","level":"","meanings":[{"def":"a particular position in which somebody stands, sits, etc., especially in order to be painted, drawn or photographed","examples":["He adopted a relaxed pose for the camera.","He struck a heroic pose, and cried, ‘I will do it!’","I can't hold this pose much longer!"],"opposite":"","synonyms":""},{"def":"a way of behaving that is not sincere and is intended to impress or trick people","examples":["This show of concern is just a pose.","His air of absent-mindedness was no more than a pose concealing a very acute mind.","His pose as an impoverished artist fooled several wealthy patrons."],"opposite":"","synonyms":""},{"def":"to hold your body in a particular way to create a particular impression","examples":["to strike a dramatic pose","(figurative) He strikes an attitude of bravery and lonely defiance."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"strike a pose/an attitude","def":"to hold your body in a particular way to create a particular impression","examples":["to strike a dramatic pose","(figurative) He strikes an attitude of bravery and lonely defiance."]}],"phrasal":[],"related":[]}]