[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pos/posit/position__us_2.mp3","phonsUS":"/pəˈzɪʃn/","level":"A2","meanings":[{"def":"the place where somebody/something is located","examples":["Where would be the best position for the lights?","from a/your position From his position on the cliff top, he had a good view of the harbour.","She looked down over the scene from a raised position.","in a position These plants will grow well in a sheltered position.","The hotel stands in an elevated position looking out over the lake.","This would be a good place for a picnic.","They’ve chosen a site for the new school.","the hotel reception area","Move the cursor to a blank area on the screen.","From his position at the top of the hill, he could see the harbour.","the point at which the river divides","The company is moving to a new location.","the scene of the accident","The lake is one of the local beauty spots.","Could you tell us your exact position please?","Radars determine the aircraft's position.","This device tracks the ship's position and orientation.","Throughout the house, the position and size of each window is carefully calculated."],"opposite":"","synonyms":"place"},{"def":"the place where somebody/something is meant to be; the correct place","examples":["He took up his position by the door.","in position Is everybody in position?","The dancers all got into position.","She was learning to change her hand from first to third position (= on the strings of a violin).","Fix the pieces in position before gluing them together.","Hordes of journalists jostled for position outside the conference hall.","The guards took up their positions on either side of the door.","Two of his vertebrae had slipped out of position.","The players returned to their starting positions and began again.","The wall panels are hoisted into position by a crane."],"opposite":"","synonyms":""},{"def":"the way in which somebody is sitting or standing, or the way in which something is arranged","examples":["a sitting/standing/kneeling position","My arms were aching so I shifted (my) position slightly.","The soldiers had to stand for hours without changing position.","in a… position Keep the box in an upright position.","Make sure that you are working in a comfortable position.","She moved the seat into a reclining position."],"opposite":"","synonyms":""},{"def":"the situation that somebody is in, especially when it affects what they can and cannot do","examples":["The company's financial position is not certain.","The company hopes to maintain its position as market leader.","in your position What would you do in my position?","in a… position This put him and his colleagues in a difficult position.","This recent sale puts us in a strong position.","to be in a position of power/strength/authority","in a position to do something I'm afraid I am not in a position to help you.","You are in no position to complain.","the present economic situation","The ship sank in mysterious circumstances.","She felt she was in a position of power.","We were forced to work outside in freezing conditions.","Hi, Jane! How are things?","Think things over before you decide.","If that is the case (= if the situation described is true), we need more staff.","How did this unhappy state of affairs come about?","He left the club in a precarious financial position with debts of £36 million.","I was in the embarrassing position of having completely forgotten her name.","It has taken years to achieve the position we are now in.","It put me in an awkward position when he asked me to keep a secret.","Film has always had a dominant position in the entertainment industry.","She was put in the difficult position of having to betray her friends.","They are in a better position than most to understand his needs.","We are all in the same position.","As a teacher, you were in a position of trust.","I was in no position to judge them."],"opposite":"","synonyms":"situation"},{"def":"an opinion on or an attitude towards a particular subject","examples":["She has made her position very clear.","to change/reconsider/shift your position","position on something the party’s position on education reforms","position that… My parents always took the position that early nights meant healthy children.","The managing director was urged to reconsider his position on the takeover.","He took an extreme position on religious matters.","The country's official position is that there is no famine in the area.","The official position was that of refusing to talk to terrorists.","We take a strong position on artificial growth hormones in our cows.","She refuses to take a position on this controversial issue."],"opposite":"","synonyms":""},{"def":"a person or organization’s level of importance when compared with others","examples":["the position of women in society","the company’s dominant position in the world market","Atkins occupies a remarkable position in the history of photography.","Wealth and position (= high social status) were not important to her.","They occupy a lowly position in society.","I'm afraid my position within the organization is not very high.","This latest novel confirms her pre-eminent position among today's writers.","His main aim is to improve his social position.","Their obvious desperation strengthens our bargaining position.","the trading position of the British economy","the role and position of farm workers in our society","This film consolidates his position as one of the most exciting directors in Europe.","The officials have abused their position by accepting bribes.","We are trying to improve our competitive position in a global market."],"opposite":"","synonyms":""},{"def":"a job","examples":["He held a senior position in a large company.","I should like to apply for the position of Sales Director.","They are advertising for a clinic coordinator and hope to fill the position by June.","We need more women in leadership positions.","He’s trying to get a job in a bank.","a senior position in a large corporation","a key post in the new government","We have several vacancies for casual workers.","This is a permanent appointment, requiring commitment and hard work.","She has taken up a key position in our head office.","She was offered the position of general manager.","He's been promoted from his previous position as team coach.","Please tell us about your previous position, and what salary you earned.","She will assume the position of director next month.","We anticipate that this position will be made full-time shortly.","He resigned from his position of twenty years and started out on his own.","I have held positions of responsibility in several companies."],"opposite":"","synonyms":"job"},{"def":"a place in a race, competition, or test, when compared to others","examples":["United's 3–0 win moved them up to third position."],"opposite":"","synonyms":""},{"def":"the place where somebody plays and the responsibilities they have in some team games","examples":["What position does he play?","Nakata had to play out of position when the defender was injured."],"opposite":"","synonyms":""},{"def":"a place where a group of people involved in fighting have put men and guns","examples":["They attacked the enemy positions at dawn.","The defence stuck firmly to its position."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["pole position","lotus position","position paper","recovery position","missionary position","position papers"]},{"pos":"verb","level":"B2","meanings":[{"def":"to put somebody/something in a particular position","examples":["position somebody/something/yourself + adv./prep. She quickly positioned herself behind the desk.","Large television screens were positioned at either end of the stadium.","Position your hands correctly on the shaft of the club.","be positioned to do something The company is now well positioned to compete in foreign markets.","Police marksmen were positioned on the roof.","The company is uniquely positioned to compete in foreign markets.","The markers were not positioned centrally.","The radiologist firmly positioned Phoebe in front of the machine.","Position the cursor at the beginning of the word and click.","A television camera was positioned inside the cubicle.","She wants to position her company as a top brand around the globe.","He was positioned by the door to watch for any visitors."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]