[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pos/posit/positive__us_2.mp3","phonsUS":"/ˈpɑːzətɪv/","level":"A1","meanings":[{"def":"good or useful","examples":["The tests have so far yielded positive results.","The contributions have a positive impact on the lives of hundreds of children.","Overseas investment has had a positive effect on exports.","His family have been a very positive influence on him.","The only positive outcome of that day was that our country came together.","to make a positive contribution to a discussion"],"opposite":"negative","synonyms":""},{"def":"expressing agreement or support","examples":["It's always nice to get positive feedback.","We've had a very positive response to the idea.","The company expects a positive reaction to these new products.","There were some overwhelmingly positive reviews.","I should probably say something positive.","Most of his remarks were positive, but there were a few criticisms.","The feedback from the public was very positive."],"opposite":"negative","synonyms":""},{"def":"directed at dealing with something or producing a successful result","examples":["We must take positive steps to deal with the problem.","In the last few years, positive changes have been made.","It will require positive action by all in the industry."],"opposite":"negative","synonyms":""},{"def":"thinking about what is good in a situation; feeling confident and sure that something good will happen","examples":["a positive attitude/outlook","the power of positive thinking","positive about something She tried to be more positive about her new job.","On the positive side, profits have increased.","The report ended on a positive note.","There were times when it was difficult to remain positive.","Analysts remain positive on the outlook for the shares over the long term.","Another positive sign is that many companies have recently raised their dividend payouts.","The goal was to create a positive image of older workers.","He sounded very positive about his chances.","He took a highly positive view of the matter."],"opposite":"negative","synonyms":""},{"def":"showing clear evidence that a particular substance or medical condition is present","examples":["a positive pregnancy test","The athlete tested positive for steroids.","If your test results are positive, it means that blood was detected.","to be HIV positive","The test proved positive."],"opposite":"negative","synonyms":""},{"def":"completely sure that something is correct or true","examples":["positive about something I can't be positive about what time it happened.","positive (that)… She was positive that he had been there.","I'm absolutely positive it was him.","‘Are you sure?’ ‘Positive.’","‘Is that John over there?’ ‘I’m not sure.’","Are you sure about that?","England must win this game to be sure of qualifying.","I’m quite confident that you’ll get the job.","The team feels confident of winning.","I’m convinced that she’s innocent.","Are you absolutely certain about this?","She was positive that he’d been there.","‘Are you sure?’ ‘Positive.’","My memory isn’t really clear on that point."],"opposite":"","synonyms":"sure"},{"def":"giving clear and definite proof or information","examples":["The results show a positive correlation between exercise and self-esteem.","We have no positive evidence that she was involved.","(formal) This is proof positive that he stole the money."],"opposite":"","synonyms":""},{"def":"complete and definite","examples":["He has a positive genius for upsetting people.","It was a positive miracle that we survived."],"opposite":"","synonyms":""},{"def":"expressing something that is true, did happen, etc.; not containing words such as ‘no’, ‘not’, ‘never’, etc.","examples":["A positive statement has a negative question tag."],"opposite":"negative","synonyms":""},{"def":"greater than zero","examples":[],"opposite":"negative","synonyms":""},{"def":"containing or producing the type of electricity that is carried by a proton","examples":["a positive charge","the positive terminal of a battery"],"opposite":"negative","synonyms":""}],"idioms":[],"phrasal":[],"related":["positive vetting","positive discrimination"]},{"pos":"noun","level":"B2","meanings":[{"def":"a good or useful quality or aspect","examples":["What are the positives and negatives of going this route?","I get a lot of positives from my job.","The deal is seen as a positive for both companies.","Take your weaknesses and translate them into positives.","To manage your way out of recession, accentuate the positive."],"opposite":"","synonyms":""},{"def":"the result of a test or an experiment that shows that a substance or condition is present","examples":["The result can be a false positive—indicating a problem where none actually exists."],"opposite":"negative","synonyms":""},{"def":"a developed film showing light and dark areas and colours as they actually were, especially one printed from a negative","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]