[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pos/possi/possible__us_1.mp3","phonsUS":"/ˈpɑːsəbl/","level":"A1","meanings":[{"def":"that can be done or achieved","examples":["possible to do something New technology has made it possible to communicate more easily.","it is possible to do something It is possible to get there by bus.","It's just not physically possible to finish all this by the end of the week.","it is possible for somebody to do something Would it be possible for me to leave a message for her?","This wouldn't have been possible without you.","I'd like the money back by next week if possible.","Try to avoid losing your temper if at all possible (= if you can).","Use public transport whenever possible (= when you can).","The doctors did all that was humanly possible to save him.","We spent every possible moment on the beach.","Expansion was made possible by the investment of government money.","This film was better than I thought possible.","I'm sorry, smoking isn't allowed./You're not allowed to smoke here.","Would you mind not talking during the music?","Could I ask you not to use your phone here, please?","I'm afraid I have to ask you not to take pictures here.","Would you mind if I opened the window?","Could I possibly borrow your phone?","I hate to ask, but could I please borrow your phone?","Do you happen to have a pair of gloves I could borrow for the evening?","Would it be all right if I left five minutes early?","Is there any chance that we could stay at your house the night before our flight?","Would it be OK to leave my bag here?","Yes, of course.","Go ahead.","That's fine.","I'd rather you didn't, if you don't mind.","I'd prefer it if you asked somebody else.","If there's someone else you can ask, I'd be grateful.","In those circumstances, I thought it possible to work with him.","Do everything possible to get it finished on time."],"opposite":"impossible","synonyms":""},{"def":"that might exist or happen but is not certain to","examples":["the possible side effects of the drug","a possible future president","Frost is possible, although unlikely, at this time of year.","it is possible (that)… It is quite possible that the river will flood again.","It's just possible that I gave them the wrong directions.","‘You might be wrong, of course!’ ‘It’s possible, but I doubt it.’","With the possible exception of the Beatles, no other band has become so successful so quickly.","‘Do you think he’ll resign?’ ‘Anything’s possible where he’s concerned.’","a possible outcome/effect/consequence","We have to look at every possible scenario.","Most cybercrime involves traditional crimes, such as theft and fraud, being committed in new ways. Phishing is perhaps/possibly/probably the best-known example of this.","It seems/appears that the more personal data which organizations collect, the more opportunity there is for this data to be lost or stolen.","It seems clear that introducing national ID cards would do little to prevent identity theft.","It could be argued that the introduction of national ID cards might actually make identity theft easier.","It is possible that/It may be that the only way to protect ourselves against DNA identity theft is to avoid the creation of national DNA databases.","It is just possible that he's still here.","It's theoretically possible but highly unlikely ever to happen.","It's scarcely possible that he knew nothing about it."],"opposite":"","synonyms":""},{"def":"reasonable or acceptable in a particular situation","examples":["There are several possible explanations.","Please suggest possible ways in which you would improve the existing program.","a possible solution","One possible cause/reason is…","She's perfectly possible as our main speaker.","What are the possible interpretations of this message?","What possible reason can you have for stopping me going?"],"opposite":"","synonyms":""},{"def":"used after adjectives to emphasize that something is the best, worst, etc. of its type","examples":["It was the best possible surprise anyone could have given me.","Don't leave your packing until the last possible moment.","Jacobs faces the maximum possible sentence of five years imprisonment."],"opposite":"","synonyms":""},{"def":"as quickly, much, soon, etc. as you can","examples":["We will get your order to you as soon as possible.","Try to give as much detail as possible in your answer.","She did as much as possible to help him."],"opposite":"","synonyms":""},{"def":"a situation in which you have all the possible advantages/disadvantages together","examples":["In the best of all possible worlds, you should be able to develop your career and enjoy a rewarding family life."],"opposite":"","synonyms":""},{"def":"the benefits of two or more completely different situations that you can enjoy at the same time","examples":["If you enjoy the coast and the country, you'll get the best of both worlds on this walk.","Maybe in the best of all possible worlds things would be different."],"opposite":"","synonyms":""},{"def":"a situation in which you have all the possible disadvantages at the same time","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"as quickly, much, soon, etc. as possible","def":"as quickly, much, soon, etc. as you can","examples":["We will get your order to you as soon as possible.","Try to give as much detail as possible in your answer.","She did as much as possible to help him."]},{"idiom":"the best/worst of all possible worlds","def":"a situation in which you have all the possible advantages/disadvantages together","examples":["In the best of all possible worlds, you should be able to develop your career and enjoy a rewarding family life."]},{"idiom":"the best of both worlds/all possible worlds","def":"the benefits of two or more completely different situations that you can enjoy at the same time","examples":["If you enjoy the coast and the country, you'll get the best of both worlds on this walk.","Maybe in the best of all possible worlds things would be different."]},{"idiom":"the worst of all (possible) worlds","def":"a situation in which you have all the possible disadvantages at the same time","examples":[]}],"phrasal":[],"related":["be in good, the best possible, etc. taste","be in bad, poor, the worst possible, etc. taste"]},{"pos":"noun","level":"","meanings":[{"def":"a person or thing that is suitable for a particular job, purpose, etc. and might be chosen","examples":["Out of all the people interviewed, there are only five possibles."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]