[{"pos":"adverb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pos/possi/possibly__us_1.mp3","phonsUS":"/ˈpɑːsəbli/","level":"B1","meanings":[{"def":"used to say that something might exist, happen or be true, but you are not certain","examples":["It was possibly their worst performance ever.","She found it difficult to get on with her, possibly because of the difference in their ages.","‘Will you be around next week?’ ‘Possibly.’","‘I’m sure he didn’t mean to be rude.’ ‘Quite possibly (= you may be right), but the damage has been done.’","Last year, his mother died, possibly due to heart failure.","a popular but possibly dangerous type of extreme diet","Most cybercrime involves traditional crimes, such as theft and fraud, being committed in new ways. Phishing is perhaps/possibly/probably the best-known example of this.","It seems/appears that the more personal data which organizations collect, the more opportunity there is for this data to be lost or stolen.","It seems clear that introducing national ID cards would do little to prevent identity theft.","It could be argued that the introduction of national ID cards might actually make identity theft easier.","It is possible that/It may be that the only way to protect ourselves against DNA identity theft is to avoid the creation of national DNA databases.","It's pretty much inevitable that prices will go up this year.","I think it's likely to rain this afternoon.","I’m probably going to be away then.","I guess there's a fifty per cent chance that they'll say no.","It's unlikely, but not totally impossible, I suppose.","They can't possibly/​really be serious about buying a boat!","Let's start without them. They're bound to be late."],"opposite":"","synonyms":""},{"def":"used with can/could to emphasize that you are surprised, annoyed, etc. about something","examples":["You can't possibly mean that!","How could you possibly think that I had anything to do with it!","He turned out to be the nicest guy you could possibly imagine.","(usually ironic) What could possibly go wrong?"],"opposite":"","synonyms":""},{"def":"used with could to ask somebody politely to do something","examples":["Could you possibly open that window?"],"opposite":"","synonyms":""},{"def":"used with can/could to say that somebody will do or has done as much as they can in order to make something happen","examples":["I will come as soon as I possibly can.","They tried everything they possibly could to improve the situation.","We don’t want these rumours to spread if we can possibly avoid it.","I don't see what more he could possibly do."],"opposite":"","synonyms":""},{"def":"used with negatives, especially can't/couldn't, to say strongly that you cannot do something or that something cannot or could not happen or be done","examples":["I can't possibly tell you that!","You can't possibly carry all those bags.","‘Let me buy it for you.’ ‘That's very kind of you, but I couldn't possibly (= accept).’"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]