[{"pos":"prefix","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pos/post_/post__1_us_1.mp3","phonsUS":"/pəʊst/","level":"","meanings":[{"def":"after","examples":["a postgraduate","a post-Impressionist","the post-1945 period"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["fly-post","post hoc","Post-it™","post-war","blog post","lamp post","post-date","post-free","post-paid","post room","post-sync","cross post","cross-post","newel post","parcel post"]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pos/post_/post__us_1.mp3","level":"A1","meanings":[{"def":"the official system used for sending and delivering letters, packages, etc.","examples":["by post I'll send the original to you by post.","I sent it by first-class post.","in the post I'll put the documents in the post to you tomorrow.","My application got lost in the post."],"opposite":"","synonyms":""},{"def":"letters, packages, etc. that are sent and delivered","examples":["There was a lot of post this morning.","Have you opened your post yet?"],"opposite":"","synonyms":""},{"def":"an occasion during the day when letters, etc. are collected or delivered","examples":["to catch/miss the post","in the post The parcel came in this morning's post.","The form should arrive in the post tomorrow.","Payment should be sent by return of post (= immediately).","Do you get a second post here?","I’ll put an application form in the post/​mail for you today.","Send your fee by post/​mail to this address.","the Royal Mail.","the US Postal Service.","Was there any post/​mail this morning?","I sat down to open my post/​mail.","I’ll post the letter when I go out.","I’ll mail the letter when I go out.","The book arrived in the morning post.","If you hurry you'll just catch the post."],"opposite":"","synonyms":""},{"def":"a message sent to a discussion group on the internet; a piece of writing that forms part of a blog","examples":["I love reading her posts because I learn so much.","They have deleted all my posts.","post about somebody/something She wrote a post about the experience on her blog.","post by somebody This post by Mark Brady is very interesting.","post from somebody The forum does not allow posts from non-members.","To respond to your comments, please see my previous post.","Here's a link to my recent posts.","More info can be found in my first post on the subject.","Do leave a comment on this post.","Seth made a blog post titled ‘Rules of Engagement’."],"opposite":"","synonyms":""},{"def":"a job, especially an important one in a large organization","examples":["an academic/a government post","She took up a teaching post at Basle University.","to resign (from)/quit/leave a post","We will be creating 15 new posts next year.","The company has been unable to fill the post.","He has held the post for three years.","She was offered a key post in the new government.","post of something He accepted the post of deputy prime minister.","He’s trying to get a job in a bank.","a senior position in a large corporation","a key post in the new government","We have several vacancies for casual workers.","This is a permanent appointment, requiring commitment and hard work.","He was dismissed from his post when he was found to have accepted bribes.","She applied for the new post of training officer.","Three company directors have resigned (from) their posts.","a Cabinet post"],"opposite":"","synonyms":"job"},{"def":"an act of sending somebody to a particular place to do their job, especially for a limited period of time","examples":["an overseas post","The island is rated by diplomats as a hardship post (= one that people do not like to be sent to because it is not a very comfortable place to live)."],"opposite":"","synonyms":""},{"def":"the place where somebody, especially a soldier, does their job","examples":["a police/military/customs post","an observation post","Three soldiers were shot dead at a border post.","The guards were ordered not to leave their posts.","The guard took up his post at the gate.","The gun crew were at their posts.","The sentries had deserted their posts."],"opposite":"","synonyms":""},{"def":"a piece of wood or metal that is set in the ground in a position pointing upwards, especially to support something or to mark a point","examples":["She tied the dog to a post.","corner posts (= that mark the corners of a sports field)","The team’s ‘net’ was a piece of string tied to two posts."],"opposite":"","synonyms":""},{"def":"the place where a race finishes, especially in horse racing","examples":["The first horse past the post wins the race.","She led for most of the way before being pipped at the post (= beaten at the last moment)."],"opposite":"","synonyms":""},{"def":"one of the two posts that form part of a goal","examples":["The ball hit the post and bounced in.","He steered a shot between the goalkeeper and the near post."],"opposite":"","synonyms":""},{"def":"to be forced to go from one person or situation to another without achieving anything","examples":["Morale is very low. People have just had enough of being thrown from pillar to post."],"opposite":"","synonyms":""},{"def":"very deaf (= unable to hear anything)","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be driven, pushed, etc. from pillar to post","def":"to be forced to go from one person or situation to another without achieving anything","examples":["Morale is very low. People have just had enough of being thrown from pillar to post."]},{"idiom":"(as) deaf as a post","def":"very deaf (= unable to hear anything)","examples":[]}],"phrasal":[],"related":[]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pos/post_/post__us_1.mp3","level":"A1","meanings":[{"def":"to send a letter, etc. to somebody by post","examples":["post something The cost of posting a letter has gone up again.","post something off Have you posted off your order yet?","post something to somebody Is it OK if I post the documents to you next week?","post somebody something Is it OK if I post you the documents next week?"],"opposite":"","synonyms":""},{"def":"to put a letter, etc. into a postbox","examples":["Could you post this letter for me?","I’ll put an application form in the post/​mail for you today.","Send your fee by post/​mail to this address.","the Royal Mail.","the US Postal Service.","Was there any post/​mail this morning?","I sat down to open my post/​mail.","I’ll post the letter when I go out.","I’ll mail the letter when I go out."],"opposite":"","synonyms":""},{"def":"to put something through a hole into a container","examples":["Let yourself out and post the keys through the letter box."],"opposite":"","synonyms":""},{"def":"to put information or pictures on a website","examples":["post something on something More details will be posted on the website tomorrow.","post something Many thanks to all who have posted comments.","I'll post some pictureswhen I get back.","to post a video/photo/message/link","post on something The photos have been provided by fans who post on the message board.","I’ve been posting now and again at ‘British Moneymaker’."],"opposite":"","synonyms":""},{"def":"to announce something publicly or officially, especially financial information or a warning","examples":["post something The company posted a $1.1 billion loss.","A snow warning was posted for Ohio.","be posted + adj. The aircraft and its crew were posted missing."],"opposite":"","synonyms":""},{"def":"to send somebody to a place for a period of time as part of their job","examples":["be posted + adv./prep. She's been posted to Washington for two years.","Most of our employees get posted abroad at some stage.","Balden was later posted to Luqa as station commander."],"opposite":"","synonyms":""},{"def":"to put somebody, especially a soldier, in a particular place so that they can guard a building or area","examples":["be posted + adv./prep. Guards have been posted along the border.","A police officer was posted outside the door to make sure the suspect didn’t leave the building."],"opposite":"","synonyms":""},{"def":"to put a notice, etc. in a public place so that people can see it","examples":["be posted + adv./prep. A copy of the letter was posted on the noticeboard."],"opposite":"","synonyms":""},{"def":"to pay money to a court so that a person accused of a crime can go free until their trial","examples":["She was released after posting $100 cash bond and her driver's license."],"opposite":"","synonyms":""},{"def":"to regularly give somebody the most recent information about something and how it is developing","examples":["I’ll keep you posted on his progress."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"keep somebody posted (about/on something)","def":"to regularly give somebody the most recent information about something and how it is developing","examples":["I’ll keep you posted on his progress."]}],"phrasal":[],"related":[]}]