[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pot/poten/potential__us_3.mp3","phonsUS":"/pəˈtenʃl/","level":"B2","meanings":[{"def":"that can develop into something or be developed in the future","examples":["potential customers/buyers/investors/clients","We have compiled a list of 10 potential candidates.","the potential benefits of European integration","potential risks","a potential threat","the potential impact of the latest surge in oil prices","First we need to identify actual and potential problems.","Have you looked into the potential side effects of the treatment?","a potential prime minister","a potential source of conflict"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["potential energy"]},{"pos":"noun","level":"B2","meanings":[{"def":"the possibility of something happening or being developed or used","examples":["potential for something the potential for change","potential for doing something The European marketplace offers excellent potential for increasing sales.","potential of something the huge potential of the American market","potential to do something The disease has the potential to cause a global health emergency.","John Cadbury could see the potential for his product.","The new business offers great potential for growth.","They were among the first companies to exploit the potential of the internet.","an industry that has the potential for growth"],"opposite":"","synonyms":""},{"def":"qualities that exist and can be developed","examples":["All children should be encouraged to realize their full potential.","to reach/fulfil/achieve your potential","an artist of great potential","John shows great potential in the swimming pool.","potential as somebody/something She has great potential as an artist.","her belief in art's potential as a healing agent","potential to do something He has the potential to become a world-class musician.","with potential We're looking for a trainee with potential.","The house has a lot of potential.","Zambia has large unexploited tourism potential.","He believes that religion allows us to develop our human potential.","Signing for a top club would enable him to fulfil his true potential.","This young man has enormous potential.","You aren't using your computer to its full potential."],"opposite":"","synonyms":""},{"def":"the difference in voltage between two points in an electric field or circuit","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]