[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pow/power/power__us_2.mp3","phonsUS":"/ˈpaʊər/","level":"A2","meanings":[{"def":"the ability to control people or things","examples":["power to do something He has the power to make things very unpleasant for us.","Religion is losing its power to shape our behaviour.","power over somebody/something The aim is to give people more power over their own lives.","The government wields enormous power over the economy.","in your power She had him completely in her power (= was able to do what she liked with him).","In those days the king exercised real political power.","He sits on the board but has no executive power.","The company was too small to hold two such power-hungry men.","They held us in their power.","the father's position of power and influence in the home"],"opposite":"","synonyms":""},{"def":"political control of a country or an area","examples":["Hitler seized power in Germany in 1933.","The following year he took power in a military coup.","Labour won two elections in 1974, but lost power in 1979.","in power The present regime has been in power for two years.","The party came to power at the last election.","They are hoping to return to power.","a power struggle between rival factions within the party","The Crown prince assumed power in his father's place.","People say that the First Lady is the power behind the throne.","The emperor held no real power.","The real legislative power still rests with the lower chamber.","The war brought about a shift in the balance of power.","They fell from power in 1992.","They held power for 18 years.","the transfer of power from a military to a civilian government","He seized power in a military coup.","The Emperor had absolute power over all his subjects."],"opposite":"","synonyms":""},{"def":"energy that can be collected and used to operate a machine, to make electricity, etc.","examples":["nuclear/wind/solar power","engine power","wave power","They used these streams to generate power for the mill.","Solar power generation is greatly affected by cloud cover.","The generator supplies power for lighting,","The plane was still climbing at full power.","The transmitter is operating on reduced power.","This wheel provides the power to the cutting machine.","Wind power is used to drive the machinery.","The cost of solar power is falling all the time."],"opposite":"","synonyms":""},{"def":"the public supply of electricity","examples":["They've switched off the power.","She was in the elevator when the power went off.","The country's power supply is stretched to the limit.","the national power grid","a power failure","(also especially North American English) a power outage"],"opposite":"","synonyms":""},{"def":"the quality of having great power or force, or of being very effective","examples":["The ship was helpless against the power of the storm.","They were impressed by the power of her arguments.","Researchers are harnessing the power of computer modelling to find solutions to these challenges.","It was a performance of great power.","He wants to change the world through the power of prayer.","the destructive power of a hurricane","the healing power of sleep","the raw power of their music"],"opposite":"","synonyms":""},{"def":"physical strength used in action; physical strength that somebody possesses and might use","examples":["with power He hit the ball with as much power as he could.","the sheer physical power of the man"],"opposite":"","synonyms":""},{"def":"the ability or opportunity to do something","examples":["in your power I will do everything in my power to help you.","within your power It is not within my power (= I am unable) to help you.","He did everything in his power to find us somewhere to live.","a task still beyond any computer's power"],"opposite":"","synonyms":""},{"def":"a particular ability of the body or mind","examples":["Spiderman uses his powers to fight crime.","power of something He had lost the power of speech.","The drug may affect your powers of concentration.","He had to use all his powers of persuasion.","a tribute to his powers as a teacher","her powers of observation","He felt his mental powers failing.","They believe he has supernatural powers."],"opposite":"","synonyms":""},{"def":"all the abilities of a person’s body or mind","examples":["At 26, he is at the height of his powers and ranked fourth in the world."],"opposite":"","synonyms":""},{"def":"the right or authority of a person or group to do something","examples":["The powers of the police must be clearly defined.","The court can only exercise powers granted to it by statute.","City rulers abused their power by using public funds for private purposes.","This sort of abuse of power is unacceptable.","power to do something The Secretary of State has the power to approve the proposals.","power of something The president has the power of veto over all new legislation.","Police in riot gear used their powers under the Public Order Act to move on 300 protesters.","The court has no power to order a psychiatric examination of the child's parents.","The government has limited legal powers over television.","The new law delegates many of these powers to school governors.","certain powers that were granted to the government","Some states delegate police power to municipalities."],"opposite":"","synonyms":""},{"def":"a country with a lot of influence in world affairs, or with great military strength","examples":["He transformed a backward country into a world power.","major European powers such as France and Germany","Turkey is growing as an economic power.","The influence of the former colonial power is still very much in evidence."],"opposite":"","synonyms":""},{"def":"strength or influence in a particular area of activity","examples":["These companies have enormous economic power.","the exercise of military power","air/sea power (= military strength in the air/at sea)","The purchasing power of today's youth is higher than ever.","Several years ago, computer processing power was considerably less than it is now.","The country's dominance was assured by its technological and military power."],"opposite":"","synonyms":""},{"def":"the influence of a particular thing or group within society","examples":["Hollywood star power","Parent power has helped save the school from closure.","power of something the power of the media","Values are distorted by the power of advertising."],"opposite":"","synonyms":""},{"def":"the number of times that an amount is to be multiplied by itself","examples":["to the power of something 4 to the power of 3 is 43 (= 4 × 4 × 4 = 64)."],"opposite":"","synonyms":""},{"def":"the amount by which a lens can make objects appear larger","examples":["the power of a microscope/telescope"],"opposite":"","synonyms":""},{"def":"a good or evil spirit that controls the lives of others","examples":["the powers of darkness (= the forces of evil)","She believed in the existence of a benevolent power.","belief in a higher power"],"opposite":"","synonyms":""},{"def":"the higher levels of government, where important decisions are made","examples":["She had considerable influence in the corridors of power.","She was a minister with considerable influence in the corridors of power."],"opposite":"","synonyms":""},{"def":"to be very good for somebody’s physical or mental health","examples":["A break would do us all a power of good."],"opposite":"","synonyms":""},{"def":"used to encourage somebody or express support for their actions","examples":[],"opposite":"","synonyms":""},{"def":"the person who really controls an organization, a country, etc. in contrast to the person who is legally in charge","examples":["His assistant was thought to be the real power behind the throne."],"opposite":"","synonyms":""},{"def":"the people who control an organization, a country, etc.","examples":["The powers that be are still trying to decide what should be done."],"opposite":"","synonyms":""},{"def":"to win an election by a large number of votes; to make somebody win an election with a large number of votes","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the corridors of power","def":"the higher levels of government, where important decisions are made","examples":["She had considerable influence in the corridors of power.","She was a minister with considerable influence in the corridors of power."]},{"idiom":"do somebody a power of good","def":"to be very good for somebody’s physical or mental health","examples":["A break would do us all a power of good."]},{"idiom":"more power to somebody’s elbow","def":"used to encourage somebody or express support for their actions","examples":[]},{"idiom":"the (real) power behind the throne","def":"the person who really controls an organization, a country, etc. in contrast to the person who is legally in charge","examples":["His assistant was thought to be the real power behind the throne."]},{"idiom":"the powers that be","def":"the people who control an organization, a country, etc.","examples":["The powers that be are still trying to decide what should be done."]},{"idiom":"sweep (somebody) to power","def":"to win an election by a large number of votes; to make somebody win an election with a large number of votes","examples":[]}],"phrasal":[],"related":["power on","power up","power-up","air power","power cut","power nap","power-nap","power off","sea power","Black Power","girl power","hard power","power base","power brick","power down","power-down","power grab","power line","power pack"]},{"pos":"verb","level":"B2","meanings":[{"def":"to supply a machine or vehicle with the energy that makes it work","examples":["be powered (by something) The aircraft is powered by a jet engine.","The mill’s machinery is powered by waterwheels.","power something The plant generates enough energy to power a town of 6 000 people."],"opposite":"","synonyms":""},{"def":"to move or move something very quickly and with great power in a particular direction","examples":["+ adv./prep. He powered through the water.","power something + adv./prep. She powered her way into the lead.","He powered his header past the goalie."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["power down","power off","power on","power up"],"related":[]}]