[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pra/pract/practical__us_2.mp3","phonsUS":"/ˈpræktɪkl/","level":"B1","meanings":[{"def":"connected with real situations rather than with ideas or theories","examples":["to have gained practical experience of the work","He offered her some practical advice.","What are the practical implications of the proposal?","There are some obvious practical applications of the research.","In practical terms, it means spending less.","From a practical point of view, it isn't a good place to live.","Yoga helps with practical matters such as injury prevention.","Of how much practical use was the conference?","Try to find a course which will allow you to develop the practical skills employers want.","The fog could present some practical difficulties.","I'll do something practical now and answer some mail.","It's time to get practical!"],"opposite":"","synonyms":""},{"def":"right or sensible; likely to be successful","examples":["practical to do something I soon realized that it would have been more practical to walk.","practical for somebody (to do something) It wouldn't be practical for us to go all that way just for the weekend.","It was difficult to find a practical solution to the problem.","The government is taking practical steps to deal with this issue.","Travel by boat was often faster and more practical than travel along the primitive roads."],"opposite":"impractical","synonyms":""},{"def":"useful or suitable","examples":["a practical little car, ideal for the city","Cool, loose-fitting clothes are practical in a hot climate.","practical for (doing) something a briefcase that is practical for both traveling and days at the office","a feature that makes the system more practical"],"opposite":"impractical","synonyms":""},{"def":"sensible and realistic","examples":["Let's be practical and work out the cost first.","She always adopted a severely practical tone.","practical about something Sarah is quite practical about love and relationships."],"opposite":"impractical","synonyms":""},{"def":"good at making or repairing things","examples":["Bob's very practical. He does all the odd jobs around the house."],"opposite":"","synonyms":""},{"def":"almost complete or total","examples":["She married a practical stranger.","They’re a practical certainty to win the game."],"opposite":"","synonyms":""},{"def":"used when you are stating what the reality of a situation is","examples":["There's still another ten minutes of the game to go, but for practical purposes it's already over."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"for (all) practical purposes","def":"used when you are stating what the reality of a situation is","examples":["There's still another ten minutes of the game to go, but for practical purposes it's already over."]}],"phrasal":[],"related":["practical joke","practical joker","practical nurse","practical jokes","practical jokers","practical nurses","licensed practical nurse"]},{"pos":"noun","level":"SYMBOL","meanings":[{"def":"a lesson or an exam in science or technology in which students have to do or make things, not just read or write about them","examples":["a biology practical","The second part of the exam is a three-hour practical.","I passed the written exam but failed the practical.","The course involves lectures, demonstrations and practicals."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]