[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pre/prefe/prefer__us_3.mp3","phonsUS":"/prɪˈfɜːr/","level":"A1","meanings":[{"def":"to like one thing or person better than another; to choose one thing rather than something else because you like it better","examples":["prefer something ‘Coffee or tea?’ ‘I'd prefer tea, thanks.’","I would prefer it if you didn't tell anyone.","A local firm is to be preferred.","A short-term fixed rate is the preferred option.","prefer something to something I much prefer jazz to rock music.","I prefer quality to quantity.","prefer something over something A few people still prefer landlines over mobiles.","Relevant experience is preferred over formal education.","prefer something + adj. I prefer my coffee black.","prefer to do something I much prefer to travel by train.","The donor prefers to remain anonymous.","I prefer not to think about it.","She won't discuss her plans in detail, preferring instead to wait until after the election.","prefer somebody/something to do something Would you prefer me to stay?","prefer doing something I prefer playing in defence.","prefer that… (formal) I would prefer that you did not mention my name.","I like the red one better than/​more than the green one.","I prefer beef to lamb.","I'd prefer to wait here.","I'd rather go to the concert than the play.","I think I'd rather stay in than go out tonight.","I like swimming better than jogging.","I think that colour's much more attractive.","It doesn’t really matter to me whether we eat here or go out.","I don't really mind whether we talk now or later.","I’m happy either way.","I don't really care either way.","If it were up to me, I'd choose the green one.","If you ask me, the old one looks better than the new one.","I’m not an expert but Design B seems more eye-catching.","Why are you wanting a new phone when your current one works perfectly well?","What shall we do tonight? I’m thinking bowling.","I’m loving the weather today!","Employers naturally prefer candidates with some previous experience of the job.","I greatly prefer this version.","I happen to prefer action movies myself.","I prefer his earlier paintings to his later ones.","Industries still tend to prefer virgin raw materials to recycled ones.","I would really prefer to teach girls.","We can eat out if you like, but I would prefer to stay in.","You may simply prefer just to sit on the terrace with a cocktail."],"opposite":"","synonyms":""},{"def":"to accuse somebody formally of a crime so that there can be a trial in court","examples":["Police have brought a charge of dangerous driving against the man.","Many victims of crime are reluctant to press charges against their attackers.","She laid charges against the firm for not complying with the regulations."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"bring/press/lay/prefer charges against somebody","def":"to accuse somebody formally of a crime so that there can be a trial in court","examples":["Police have brought a charge of dangerous driving against the man.","Many victims of crime are reluctant to press charges against their attackers.","She laid charges against the firm for not complying with the regulations."]}],"phrasal":[],"related":["bring/press/lay/prefer charges against somebody"]}]