[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pre/preju/prejudice__us_1.mp3","phonsUS":"/ˈpredʒədɪs/","level":"C1","meanings":[{"def":"an unreasonable dislike of or preference for a person, group, custom, etc., especially when it is based on their race, religion, sex, etc.","examples":["a victim of racial prejudice","Their decision was based on ignorance and prejudice.","prejudice against somebody/something There was often prejudice against people with disabilities.","prejudice in favour of somebody/something She admitted to a prejudice in favour of British universities.","It's hard to break down old prejudices.","She had never encountered such deep prejudice before.","She has not been afraid to challenge popular prejudices.","The tale is told without prejudice or bias.","We must not pander to the irrational prejudices of a small minority.","deep-rooted prejudice against non-gender-conforming people","Anti-Islamic prejudice has increased considerably in recent years.","Anti-gay prejudice was extremely common among people in the army.","He was just talking out of blind prejudice.","I encountered quite serious prejudice when I worked in the construction industry.","I'm afraid all the debate did was confirm my own prejudices.","Irrational prejudice is what drives most racial discrimination in society.","Prejudice towards new immigrants meant that many were unable to find work.","There is still widespread prejudice against people who are HIV positive."],"opposite":"","synonyms":""},{"def":"without affecting any other legal matter","examples":["They agreed to pay compensation without prejudice (= without admitting guilt)."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"without prejudice (to something)","def":"without affecting any other legal matter","examples":["They agreed to pay compensation without prejudice (= without admitting guilt)."]}],"phrasal":[],"related":["Pride and Prejudice"]},{"pos":"verb","level":"","meanings":[{"def":"to influence somebody so that they have an unfair or unreasonable opinion about somebody/something","examples":["The prosecution lawyers have been trying to prejudice the jury against her.","Poor handwriting might prejudice people against the applicant."],"opposite":"","synonyms":""},{"def":"to have a harmful effect on something","examples":["Any delay will prejudice the child's welfare.","This could seriously prejudice her safety.","She did not disclose evidence that was likely to prejudice her client's case.","I can't comment on that as I don't wish to prejudice the outcome of the talks."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]