[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pre/prepa/preparation__us_2.mp3","phonsUS":"/ˌprepəˈreɪʃn/","level":"B2","meanings":[{"def":"the act or process of getting ready for something or making something ready","examples":["food preparation","preparation for something Preparation for the party started early.","Careful preparation for the exam is essential.","No athlete would dream of entering a big race without adequate preparation.","Did you get any chance to do any preparation?","in preparation The third book in the series is currently in preparation.","in preparation for something The team has been training hard in preparation for the big game.","preparation of something She helped in the preparation of several of his manuscripts.","An awful lot of advance preparation must have gone into this summit.","As with any business, proper preparation is required.","Get a good night's sleep in preparation for the drive.","He found it good preparation for the diplomatic skills needed in his new job.","He had received inadequate preparation for a professional career.","He's done a lot of preparation for this meeting.","It is the initial preparation that takes the time.","Prior preparation is vital for achieving success.","her mental preparation for the games","two years of intense preparation","This dish doesn't require much preparation.","Decide how much preparation time you will need.","Many Taiwanese children take preparation courses for the SATs.","The preparation program was well designed."],"opposite":"","synonyms":""},{"def":"things that you do to get ready for something or make something ready","examples":["preparation for something The country is making preparations for war.","Was going to college a good preparation for your career?","preparation to do something We made preparations to move to new offices.","wedding preparations","She flew in from Paris to oversee the final preparations.","The family can now go ahead with preparations for the funeral.","military preparations for full-scale action","Preparations are now in hand to close half the factories.","The gallery is making preparations to celebrate the artist's centenary."],"opposite":"","synonyms":""},{"def":"a substance that has been specially prepared for use as a medicine, cosmetic, etc.","examples":["a pharmaceutical preparation","preparations for the hair and skin"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]