[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pre/prepa/prepare__us_4.mp3","phonsUS":"/prɪˈper/","level":"A1","meanings":[{"def":"to make something or somebody ready to be used or to do something","examples":["prepare something/somebody to prepare a report","prepare something/somebody for somebody/something A hotel room is being prepared for them.","The college prepares students for a career in business.","prepare somebody/something to do something The training has prepared me to deal with any medical issue.","prepare for something We all set about preparing for the party.","I haven't had time to prepare my arguments properly.","The lectures were carefully prepared.","to prepare students for exams"],"opposite":"","synonyms":""},{"def":"to make yourself ready to do something or for something that you expect to happen","examples":["I had no time to prepare.","prepare for something The whole class is working hard preparing for the exams.","prepare yourself for something The police are preparing themselves for trouble at the demonstration.","I had been preparing myself for this moment.","Her condition is not improving as we hoped. You must prepare yourselves for the worst.","prepare yourself As I waited, I closed my eyes to mentally prepare myself.","prepare to do something I was preparing to leave.","prepare yourself to do something The troops prepared themselves to go into battle.","How do you go about mentally preparing yourself for a project?","Penn needs to prepare for a medical school interview.","The family are preparing for the worst."],"opposite":"","synonyms":""},{"def":"to make food ready to be eaten","examples":["He was in the kitchen preparing lunch.","to prepare meals/food/dinner","I was busily preparing a salad for the evening meal.","Just prepare according to package directions.","a meal that is very quick and easy to prepare","a table full of specially prepared food","She had prepared a chicken casserole for dinner.","The women were busy preparing the wedding feast."],"opposite":"","synonyms":""},{"def":"to make a medicine or chemical substance, for example by mixing other substances together","examples":["remedies prepared from herbal extracts"],"opposite":"","synonyms":""},{"def":"to make it possible or easier for something to be achieved","examples":["The committee will prepare the ground for next month's meeting.","Early experiments with rockets prepared the ground for space travel."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"prepare the ground (for something)","def":"to make it possible or easier for something to be achieved","examples":["The committee will prepare the ground for next month's meeting.","Early experiments with rockets prepared the ground for space travel."]}],"phrasal":[],"related":["prepare the ground (for something)"]}]