[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pre/prese/present__us_1.mp3","phonsUS":"/ˈpreznt/","level":"A1","meanings":[{"def":"existing or happening now","examples":["I am not satisfied with the present situation.","The present study has two main aims.","the present owner of the house","a list of all club members, past and present","We do not have any more information at the present time.","A few brief comments are sufficient for present purposes.","You can’t use it in its present condition.","I need the actual figures, not an estimate.","How long have you been in your present job?","The factory cannot continue its current level of production."],"opposite":"","synonyms":""},{"def":"being in a particular place","examples":["I wasn’t present when the doctor examined him.","The mistake was obvious to all those present.","present at something There were 200 people present at the meeting.","Most fathers wish to be present at the birth of their child.","Simply to be physically present was all that was required."],"opposite":"absent","synonyms":""},{"def":"existing in a particular place or thing","examples":["The threat of force was always present.","the ever present risk of pollution","present in something Levels of pollution present in the atmosphere are increasing.","Analysis showed that traces of arsenic were present in the body."],"opposite":"absent","synonyms":""},{"def":"used to say that all the things or people who should be there are now there","examples":[],"opposite":"","synonyms":""},{"def":"used after being rude or critical about somebody to say that the people you are talking to are not included in the criticism","examples":["The people in this office are so narrow-minded, present company excepted, of course."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"all present and correct","def":"used to say that all the things or people who should be there are now there","examples":[]},{"idiom":"present company excepted","def":"used after being rude or critical about somebody to say that the people you are talking to are not included in the criticism","examples":["The people in this office are so narrow-minded, present company excepted, of course."]}],"phrasal":[],"related":["present-day","re-present","present day","present participle","present tense","historic present","present perfect","clear and present danger","the present","present participles","all present and accounted for","present arms","present company excepted","for the moment/present","for the present/moment","all present and correct","form, present, etc. a united front"]},{"pos":"noun","level":"A1","meanings":[{"def":"a thing that you give to somebody as a gift","examples":["What can I get him for a birthday present?","Christmas/wedding presents","I want to give you a little present.","as a present He gave her the painting as a present.","present for somebody We have a present for you.","I still need to buy a present for my boyfriend.","present from somebody That dress was a present from my sister.","At Christmas, family and friends exchange presents.","Customers may return unwanted presents in exchange for vouchers.","It's a present to us all from Granny.","My nephew loves this bike so I'm going to make him a present of it.","Santa Claus handed out presents to the children.","a present for my daughter"],"opposite":"","synonyms":""},{"def":"the time now","examples":["in the present You've got to forget the past and start living in the present.","at present I'm sorry he's out at present (= now).","to the present The book covers the period from the early 1990s to the present."],"opposite":"","synonyms":""},{"def":"the form of a verb that expresses an action that is happening now or at the time of speaking","examples":[],"opposite":"","synonyms":""},{"def":"for now; for a short time","examples":["This house is big enough for the moment, but we'll have to move if we have children."],"opposite":"","synonyms":""},{"def":"for now; for a short time","examples":["This house is big enough for the present, but we'll have to move if we have children."],"opposite":"","synonyms":""},{"def":"now is the best time to do something, not in the future","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"for the moment/present","def":"for now; for a short time","examples":["This house is big enough for the moment, but we'll have to move if we have children."]},{"idiom":"for the present/moment","def":"for now; for a short time","examples":["This house is big enough for the present, but we'll have to move if we have children."]},{"idiom":"(there is) no time like the present","def":"now is the best time to do something, not in the future","examples":[]}],"phrasal":[],"related":[]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pre/prese/present__us_3.mp3","phonsUS":"/prɪˈzent/","level":"A2","meanings":[{"def":"to show or offer something for other people to look at or consider","examples":["present something Are you presenting a paper at the conference?","She presented some data on the 2016 presidential election.","The paper presents no evidence of a link.","The results presented here confirm our prediction.","Findings are presented in Table 9.","He presents a convincing case.","present something to somebody The committee will present its final report to Parliament in June.","present something for something Eight options were presented for consideration.","The banks will begin to present their arguments today.","The opinions presented here are the author's.","He presented the information to his colleagues.","The arguments were well researched and clearly presented.","The papers are only briefly presented here.","We have tried to present both sides of the debate.","These two techniques are presented for illustration only.","She was presented with a choice of three dates."],"opposite":"","synonyms":""},{"def":"to give something to somebody, especially formally at a ceremony","examples":["present something The local MP will start the race and present the prizes.","present somebody with something Last year she was presented with an award for lifetime achievement.","On his retirement, colleagues presented him with a set of golf clubs.","present something to somebody The sword was presented by the family to the museum."],"opposite":"","synonyms":""},{"def":"to show or describe something/somebody in a particular way","examples":["present something The company has decided it must present a more modern image.","It is essential that we present a united front (= show that we all agree).","present yourself + adv./prep. You need to present yourself better.","present something/somebody/yourself as something He likes to present himself as a radical politician.","The press presents this as a kind of victory.","The article presents these proposals as misguided.","Hotel brochures are designed to present the most attractive aspects of the hotel.","This book fails to present her story in a coherent manner.","I aim to tell the truth, present a product fairly, and please both the advertiser and the purchaser.","The results are presented graphically in Figure 2.","The results can be presented visually in the form of a graph."],"opposite":"","synonyms":""},{"def":"to cause something to happen or be experienced","examples":["present something The course presents an excellent learning opportunity.","Freezing temperatures can present problems.","Each year has presented slightly different challenges.","Use of these chemicals may present a fire risk.","Irradiation presents environmental dangers.","None of these parasites presents a threat to human health.","present somebody with something Your request shouldn't present us with any problems.","I was presented with the opportunity to play abroad."],"opposite":"","synonyms":""},{"def":"to suddenly happen or become available","examples":["present itself One major problem did present itself, though.","As soon as the opportunity presented itself, she would get another job.","present itself to somebody Thankfully, a solution presented itself to him surprisingly soon."],"opposite":"","synonyms":""},{"def":"to appear in a radio or television programme and introduce the different items in it","examples":["She used to present a gardening programme on TV."],"opposite":"","synonyms":""},{"def":"to produce a show, play, broadcast, etc. for the public","examples":["Compass Theatre Company presents a new production of ‘King Lear’.","The string orchestra of the Music School of Lemgo will present a concert in the Guildhall.","We plan to present the film uncensored and without commercial breaks.","They are going to present the new model at the trade fair.","The launch is to be formally presented to trade partners in early summer."],"opposite":"","synonyms":""},{"def":"to introduce somebody formally, especially to somebody of higher rank or status","examples":["May I present my fiancé to you?"],"opposite":"","synonyms":""},{"def":"to officially appear somewhere","examples":["You will be asked to present yourself for interview.","She was ordered to present herself in court on 20 May."],"opposite":"","synonyms":""},{"def":"to offer or express something in speech or writing","examples":["Please allow me to present my apologies."],"opposite":"","synonyms":""},{"def":"to give somebody a cheque or bill that they should pay","examples":["A cheque presented by Mr Jackson was returned by the bank.","The builders presented a bill for several hundred pounds."],"opposite":"","synonyms":""},{"def":"to have or show particular symptoms","examples":["present with something The patient presented with a chest complaint.","present as something This illness rarely presents as a chest wall tumour in young patients.","present something All these patients presented a chief complaint of frequent headaches."],"opposite":"","synonyms":""},{"def":"to hold a rifle straight upwards in front of the body as a mark of respect","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"present arms","def":"to hold a rifle straight upwards in front of the body as a mark of respect","examples":[]}],"phrasal":[],"related":[]}]