[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pre/prese/presence__us_2.mp3","phonsUS":"/ˈprezns/","level":"B2","meanings":[{"def":"the fact of being in a particular place","examples":["He hardly seemed to notice my presence.","Her presence during the crisis had a calming effect.","(formal) Your presence is requested at the meeting.","presence of somebody They married in the presence of their family members.","He acknowledged our presence with a nod of his head.","Her comforting presence made him feel safe.","How nice of you to grace us with your presence!","I could see no signs of human presence.","The King requested our presence this morning.","The mere presence of children in the room is enough to upset him.","the physical presence of actors among the audience","The nuisance was her younger sister's continued presence."],"opposite":"absence","synonyms":""},{"def":"the fact of being in a particular place or thing","examples":["presence of something The test can identify the presence of abnormalities in the unborn child.","One of the first things I note when I walk into a client's home is the presence or absence of pictures around the room.","The company now has a strong presence in Germany.","Tests confirmed the presence of the disease.","These chemicals could indicate the presence of water on the planet.","(figurative) the overwhelming presence of the church in daily lives","The company plans to expand its presence in emerging markets.","a small business that doesn't have a Web presence"],"opposite":"absence","synonyms":""},{"def":"a group of people, especially soldiers, who have been sent to a place to deal with a particular situation","examples":["The government is maintaining a heavy police presence in the area.","The United States has a substantial military presence in the country.","The army maintains a constant presence in the area.","There was a strong police presence throughout the demonstration.","the visible presence of campus security"],"opposite":"","synonyms":""},{"def":"a person or spirit that you cannot see but that you feel is near","examples":["She felt a presence behind her.","Flame has always symbolized a divine presence.","I felt as though there was some ghostly presence.","She sensed an evil presence, and it was growing stronger."],"opposite":"","synonyms":""},{"def":"the quality of making a strong impression on other people by the way you talk or behave; a person who has this quality","examples":["a man of great presence","She has a strong voice but absolutely no stage presence.","She has a great screen presence.","He remained a dominant presence in the art world.","He had a commanding presence in meetings.","He was still an intimidating presence.","She was a formidable presence on the set."],"opposite":"","synonyms":""},{"def":"with somebody in the same place","examples":["The document was signed in the presence of two witnesses.","She asked them not to discuss the matter in her presence.","He should never have made those remarks in your presence."],"opposite":"","synonyms":""},{"def":"when something exists in a particular place","examples":["Litmus paper turns red in the presence of an acid."],"opposite":"","synonyms":""},{"def":"to do something to make people very aware of the fact that you are there; to have a strong influence on a group of people or a situation","examples":["She’s only been here a couple of weeks but she is already making her presence felt.","She certainly made her presence felt in the boardroom."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in the presence of somebody | in somebody’s presence","def":"with somebody in the same place","examples":["The document was signed in the presence of two witnesses.","She asked them not to discuss the matter in her presence.","He should never have made those remarks in your presence."]},{"idiom":"in the presence of something","def":"when something exists in a particular place","examples":["Litmus paper turns red in the presence of an acid."]},{"idiom":"make your presence felt","def":"to do something to make people very aware of the fact that you are there; to have a strong influence on a group of people or a situation","examples":["She’s only been here a couple of weeks but she is already making her presence felt.","She certainly made her presence felt in the boardroom."]}],"phrasal":[],"related":["presence of mind","make your presence felt"]}]