[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pre/press/pressure__us_2.mp3","phonsUS":"/ˈpreʃər/","level":"B1","meanings":[{"def":"the act of trying to persuade or to force somebody to do something","examples":["pressure for something The pressure for change continued to mount.","pressure on somebody We are determined to keep up the pressure on the other member states.","pressure on somebody to do something There is intense pressure on her to resign.","pressure to do something In every society there is strong pressure to conform.","Do you feel any pressure to dress in a certain way?","We must bring pressure to bear on our government to reverse this decision.","pressure from somebody/something The company is facing increasing pressure from shareholders","The government eventually bowed to popular pressure (= they agreed to do what people were trying to get them to do).","pressure from religious groups","pressure for change in the country's economy","This has heightened pressure for economic sanctions against the regime.","Retailers face added pressure to have the products available by Christmas.","Large companies were criticized for using pressure tactics against small suppliers.","This concession would not have happened but for the pressure that was brought to bear on the authorities."],"opposite":"","synonyms":""},{"def":"difficulties and worries that are caused by the need to achieve or to behave in a particular way","examples":["You need to be able to handle pressure in this job.","pressure of something She was unable to attend because of the pressure of work.","How can anyone enjoy the pressures of city life?","pressure on somebody The economic pressures on small businesses are intense.","She was unable to attend because of the pressures of work.","stress-related illnesses","nervous tension","I found it a strain looking after four children.","His own desires conflict with external pressures to conform.","When more people move into an area, that creates pressures.","They are looking for ways to ease the pressure of their stress-filled, competitive existence.","There's a lot of pressure on the soldiers preparing for battle."],"opposite":"","synonyms":"pressure"},{"def":"the force or weight with which something presses against something else","examples":["The nurse applied pressure to his arm to stop the bleeding.","The barriers gave way under the pressure of the crowd.","Last year he had brain surgery to relieve pressure from a blood clot.","Pressure sensors in the seats tell the system which ones aren't occupied.","Reducing the swelling will relieve the pressure on her spine.","The door swung open beneath the gentle pressure of Jill's hand."],"opposite":"","synonyms":""},{"def":"the force produced by a particular amount of gas or liquid in a container or a limited space; the amount of this","examples":["air/water pressure","Check the tyre pressure (= the amount of air in a tyre) regularly.","a pressure gauge (= an instrument used for measuring the pressure of a liquid or a gas)"],"opposite":"","synonyms":""},{"def":"the effect that something has on the way a situation develops, especially when this causes problems","examples":["This puts upward pressure on prices.","The high unemployment rate was exerting downward pressure on wage growth.","These measures are intended to relieve the pressure on the prison system.","They raised the starting threshold for income tax to ease the pressure on family budgets."],"opposite":"","synonyms":""},{"def":"the force of the atmosphere on the earth’s surface","examples":["A band of high/low pressure is moving across the country."],"opposite":"","synonyms":""},{"def":"to force or to try to persuade somebody to do something","examples":["Advertisements put pressure on girls to be thin.","My parents never put any pressure on me to get a job.","Her family put great pressure on her not to marry him.","the use of the internet to put international pressure on authoritarian regimes"],"opposite":"","synonyms":""},{"def":"if a liquid or a gas is kept under pressure, it is forced into a container so that when the container is opened, the liquid or gas escapes quickly","examples":["Draught beer is pumped out of the barrel under pressure."],"opposite":"","synonyms":""},{"def":"being forced to do something","examples":["The director is under increasing pressure to resign.","Hospital staff are coming under pressure to work longer hours.","The pound came under pressure from foreign currencies today, increasing the chances of a rise in interest rates.","Management is under pressure to set an example on pay restraint.","Manufacturers are under pressure to put profit ahead of safety.","The President is coming under pressure to call a referendum."],"opposite":"","synonyms":""},{"def":"made to feel anxious about something you have to do","examples":["The team performs well under pressure.","He's felt under pressure since his wife had the operation."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"put pressure on somebody (to do something)","def":"to force or to try to persuade somebody to do something","examples":["Advertisements put pressure on girls to be thin.","My parents never put any pressure on me to get a job.","Her family put great pressure on her not to marry him.","the use of the internet to put international pressure on authoritarian regimes"]},{"idiom":"under pressure","def":"if a liquid or a gas is kept under pressure, it is forced into a container so that when the container is opened, the liquid or gas escapes quickly","examples":["Draught beer is pumped out of the barrel under pressure.","The director is under increasing pressure to resign.","Hospital staff are coming under pressure to work longer hours.","The pound came under pressure from foreign currencies today, increasing the chances of a rise in interest rates.","Management is under pressure to set an example on pay restraint.","Manufacturers are under pressure to put profit ahead of safety.","The President is coming under pressure to call a referendum.","The team performs well under pressure.","He's felt under pressure since his wife had the operation."]}],"phrasal":[],"related":["high pressure","high-pressure","low pressure","peer pressure","pressure hose","pressure suit","blood pressure","pressure cooker","pressure group","pressure point","pressure washer","pressure groups","pressure points","pressure suits","pressure cookers"]},{"pos":"verb","level":"","meanings":[{"def":"to persuade somebody to do something, especially by making them feel that they have to or should do it","examples":["pressure somebody No one has the right to pressure you. You can always say no.","pressure somebody into (doing) something Don't let yourself be pressured into making a hasty decision.","pressure somebody to do something His father pressured him to accept a job in the bank.","They're beginning a postcard campaign to pressure the Department of the Environment.","He pressured her to take on more wealthy clients."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]