[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pre/prese/preserve__us_4.mp3","phonsUS":"/prɪˈzɜːrv/","level":"B2","meanings":[{"def":"to keep a particular quality, feature, etc.; to make sure that something is kept","examples":["He was anxious to preserve his reputation.","Efforts to preserve the peace have failed.","She managed to preserve her sense of humour under very trying circumstances.","He was insistent on preserving the integrity of the brand.","The Act contained provisions designed to preserve the status quo.","She was determined to preserve her independence and way of life.","The style of the original film is preserved perfectly.","We were anxious to preserve the character of the house."],"opposite":"","synonyms":""},{"def":"to keep something in its original state in good condition","examples":["preserve something/somebody a perfectly preserved 14th century house","(humorous) Is he really 60? He's remarkably well preserved.","We need knowledgeable gallery curators to preserve great masterpieces for posterity.","preserve something + adj. This vase has been preserved intact.","She carefully preserved all his letters.","The collection has been sold to the British Museum where it will be preserved for the nation.","The prison is preserved as a tourist attraction.","They were thrilled to discover a beautifully preserved specimen of Roman pottery.","You need to say why the building is worth preserving.","campaigners fighting to preserve a historic building","The National Trust preserves the house and its grounds.","Three miles away is a perfectly preserved stretch of Roman road.","The iron coins are poorly preserved and have rusted."],"opposite":"","synonyms":""},{"def":"to prevent something, especially food, from decaying (= being destroyed by natural processes) by treating it in a particular way","examples":["preserve something Wax polish preserves wood and leather.","preserved lemons","preserve something in something olives preserved in brine","preserve something from something an attempt to preserve the corpse from decomposition"],"opposite":"","synonyms":""},{"def":"to keep somebody/something alive, or safe from harm or danger","examples":["The society was set up to preserve endangered species from extinction.","We need to take action to help preserve fish stocks.","She wanted to preserve him from harassment.","To preserve life should always be the goal."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["game preserve"]},{"pos":"noun","level":"","meanings":[{"def":"an activity, a job, an interest, etc. that is thought to be suitable for one particular person or group of people","examples":["Football is no longer the preserve of men.","I began my career in the days when nursing was a female preserve.","Higher education is no longer the preserve of the wealthy."],"opposite":"","synonyms":""},{"def":"a type of jam made by boiling fruit with a large amount of sugar","examples":[],"opposite":"","synonyms":""},{"def":"a type of pickle made by cooking vegetables with salt or vinegar","examples":[],"opposite":"","synonyms":""},{"def":"a piece of land that is a protected area for animals, plants, etc.","examples":[],"opposite":"","synonyms":""},{"def":"an area of private land or water where animals and fish are kept for people to hunt","examples":["This land is protected as a wildlife preserve."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]