[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pre/press/press__us_1.mp3","phonsUS":"/pres/","level":"B1","meanings":[{"def":"newspapers and magazines","examples":["the local/national/foreign press","the popular/tabloid press (= newspapers with a lot of pictures and stories about famous people)","the music/sporting press (= newspapers and magazines about music/sport)","The mainstream press is ignoring this story.","Unlike the American, the British press operates on a national scale.","in the press The case has been widely reported in the press.","the freedom of the Press/press freedom (= the freedom to report any events and express opinions)","The event is bound to attract wide press coverage (= it will be written about in many newspapers).","According to French press reports, three people have been killed.","a White House press briefing","He issued a press statement insisting on his innocence.","He kept a scrapbook containing press cuttings of his concerts.","The right-wing press mostly backed the government.","There was no mention of the incident in the national press.","She is constantly being attacked by the press."],"opposite":"","synonyms":""},{"def":"the journalists and photographers who work for newspapers and magazines","examples":["The Press was/were not allowed to attend the trial.","She has been harassed by the press, who desperately need a story.","He told the press that there had been ‘further progress’.","She told them not to talk to the press.","Did the senator deliberately mislead the press?","She showed the doorman her press pass.","Someone must have alerted the press that she was going to be there.","The company's press office did not return the call.","The president was briefed before meeting the press.","The spokesman addressed an international press corps.","They introduced measures including muzzling the press and illegal detainment.","We got to sit in the press box since my dad would be writing about the game."],"opposite":"","synonyms":""},{"def":"the type or amount of reports that newspapers write about somebody/something","examples":["The airline has had a bad press recently (= journalists have written unpleasant things about it).","The demonstration got very little press.","His latest novel didn't get (a) very good press (= was not praised in the media)."],"opposite":"","synonyms":""},{"def":"a machine for printing books, newspapers, etc.; the process of printing them","examples":["We were able to watch the books rolling off the presses.","These prices are correct at the time of going to press.","a story that is hot off the press (= has just appeared in the newspapers)","The newspaper goes to press at 6 o'clock.","The presses are already rolling.","Their new book is in press."],"opposite":"","synonyms":""},{"def":"a business that prints and publishes books","examples":["Oxford University Press"],"opposite":"","synonyms":""},{"def":"a piece of equipment that is used for creating pressure on things, to make them flat or to get liquid from them","examples":["a trouser press","a garlic press"],"opposite":"","synonyms":""},{"def":"an act of pushing something with your hand or with a tool that you are holding","examples":["He gave the bell another press.","Those shirts need a press (= with an iron)."],"opposite":"","synonyms":""},{"def":"a large number of people or things competing for space or movement","examples":["the press of bodies all moving the same way","Among the press of cars he glimpsed a taxi."],"opposite":"","synonyms":""},{"def":"a large cupboard, usually with shelves, for holding clothes, books, etc.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["press on","press-up","press box","press for","bench press","body press","press agent","press ahead","press corps","press gang","press-gang","press stud","stop press","French press™","garlic press","press agency","press cutting","press gallery","press office"]},{"pos":"verb","level":"B1","meanings":[{"def":"to push part of a device, etc. in order to make it work","examples":["press something to press a button/key","press something + adj. He pressed the lid firmly shut.","(+ adv./prep.) Press here to open.","She pressed down hard on the gas pedal.","Press the button marked ‘Stop’.","Press any key to restart your computer.","Only press the buzzer if you have the right answer.","I pressed hard on the doorbell."],"opposite":"","synonyms":""},{"def":"to push something closely against something; to be pushed in this way","examples":["press something/somebody/yourself against something She pressed her face against the window.","press something to something He pressed a handkerchief to his nose.","press something together She pressed her lips together.","press something Her lips softly pressed my cheek.","press against something His body was pressing against hers.","press (down) (on something) She pressed down harder on the paper.","He pressed up closer against the wall, terrified of being seen.","She curled up, her knees pressed tightly to her chest."],"opposite":"","synonyms":""},{"def":"to put something in a place by pushing it","examples":["He pressed a coin into her hand and moved on.","She pressed a finger into the dough."],"opposite":"","synonyms":""},{"def":"to put gentle pressure on somebody’s hand or arm, especially to show care or kind feelings","examples":["He gently pressed her arm, then left."],"opposite":"","synonyms":""},{"def":"to move in the direction mentioned by pushing","examples":["The photographers pressed around the royal visitors.","(figurative) A host of unwelcome thoughts were pressing in on him.","The crowd pressed forward."],"opposite":"","synonyms":""},{"def":"to make strong efforts to persuade or force somebody to do something","examples":["press somebody If pressed, he will admit that he knew about the affair.","press somebody for something The bank is pressing us for repayment of the loan.","press somebody to do something They are pressing us to make a quick decision.","press somebody into (doing) something Don't let yourself be pressed into doing something you don't like.","press somebody on something I did not press him further on the issue.","+ speech ‘Are you sure?’ she pressed gently.","When pressed by journalists, he refused to comment.","He was pressed into giving her a job.","Pressed by the opposition to resign, he stood firm.","We will continue to press the government to provide details of the agreement."],"opposite":"","synonyms":""},{"def":"to express or repeat something with force","examples":["I don't want to press the point, but you do owe me $200.","She is still pressing her claim for compensation.","They were determined to press their case at the highest level.","In the interview he strongly pressed his point of view.","The party will continue to press the case for a new electoral system."],"opposite":"","synonyms":""},{"def":"to make something flat or smooth by using force or putting something heavy on top","examples":["press something pressed flowers (= pressed between the pages of a book)","press something + adj. Press the soil flat with the back of a spade."],"opposite":"","synonyms":""},{"def":"to make clothes smooth using a hot iron","examples":["My suit needs pressing.","his immaculately pressed suit"],"opposite":"","synonyms":""},{"def":"to get the juice out of fruit or vegetables by using force or weight","examples":[],"opposite":"","synonyms":""},{"def":"to make something from a material, using pressure","examples":["press something to press a CD","press something from/out of something The car bodies are pressed out of sheets of metal."],"opposite":"","synonyms":""},{"def":"to accuse somebody formally of a crime so that there can be a trial in court","examples":["Police have brought a charge of dangerous driving against the man.","Many victims of crime are reluctant to press charges against their attackers.","She laid charges against the firm for not complying with the regulations."],"opposite":"","synonyms":""},{"def":"to do exactly the right things to please somebody","examples":["a new satirical comedy show that presses all the right buttons"],"opposite":"","synonyms":""},{"def":"to say hello to people by shaking hands","examples":[],"opposite":"","synonyms":""},{"def":"to get as much advantage as possible from a situation by attacking or arguing in a determined way","examples":["to press home an attack/an argument/a point","Simon saw she was hesitating and pressed home his advantage."],"opposite":"","synonyms":""},{"def":"to use somebody/something for a purpose that they were not trained or intended for because there is nobody or nothing else available","examples":["Every type of boat was pressed into service to rescue passengers from the sinking ferry."],"opposite":"","synonyms":""},{"def":"to react in a sudden or extreme way to something unexpected that has frightened you","examples":["The prime minister pressed the panic button yesterday as Britain’s economy plunged deeper into crisis."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"bring/press/lay/prefer charges against somebody","def":"to accuse somebody formally of a crime so that there can be a trial in court","examples":["Police have brought a charge of dangerous driving against the man.","Many victims of crime are reluctant to press charges against their attackers.","She laid charges against the firm for not complying with the regulations."]},{"idiom":"press all the (right) buttons","def":"to do exactly the right things to please somebody","examples":["a new satirical comedy show that presses all the right buttons"]},{"idiom":"press (the) flesh","def":"to say hello to people by shaking hands","examples":[]},{"idiom":"press something home","def":"to get as much advantage as possible from a situation by attacking or arguing in a determined way","examples":["to press home an attack/an argument/a point","Simon saw she was hesitating and pressed home his advantage."]},{"idiom":"press somebody/something into service","def":"to use somebody/something for a purpose that they were not trained or intended for because there is nobody or nothing else available","examples":["Every type of boat was pressed into service to rescue passengers from the sinking ferry."]},{"idiom":"press/push the panic button","def":"to react in a sudden or extreme way to something unexpected that has frightened you","examples":["The prime minister pressed the panic button yesterday as Britain’s economy plunged deeper into crisis."]}],"phrasal":["press ahead","press for","press on"],"related":[]}]