[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pri/pride/pride__us_1.mp3","phonsUS":"/praɪd/","level":"B2","meanings":[{"def":"a feeling of being pleased or satisfied that you get when you or people who are connected with you have done something well or own something that other people admire","examples":["The sight of her son graduating filled her with pride.","He felt a glow of pride as people stopped to admire his garden.","Success in sport is a source of national pride.","pride in something I take (a) pride in my work.","They have a strong sense of pride in their work.","Their reputation for fairness is a matter of pride.","pride in doing something We take great pride in offering the best service in town.","with pride I looked with pride at what I had achieved.","He derived great satisfaction from knowing that his son was happy.","Money can’t buy you happiness.","The sight of her son graduating filled her with pride.","They found contentment in living a simple life.","her search for personal fulfilment","He smiled with fatherly pride.","He swelled with pride as he held the trophy.","I wear my policeman's uniform with pride.","the politics of racial pride and Black Power","They have a fierce pride in their traditions.","She expressed pride in her child's achievement.","Businesses rushed to include images of patriotic pride in their marketing.","We want to restore pride in our public services."],"opposite":"","synonyms":"satisfaction"},{"def":"a person or thing that makes people feel pleased or satisfied","examples":["The new sports stadium is the pride of the town."],"opposite":"","synonyms":""},{"def":"the feeling of respect that you have for yourself","examples":["Pride would not allow him to accept the money.","Her pride was hurt.","Losing his job was a real blow to his pride.","It's time to swallow your pride (= hide your feelings of pride) and ask for your job back.","He was nursing his hurt pride.","They managed to salvage some pride with a late goal.","She refused his offer tactfully, allowing him to go away with his pride intact.","I don't want your money—I have my pride, you know!","She refused their help out of pride."],"opposite":"","synonyms":""},{"def":"the feeling that you are better or more important than other people","examples":["She was full of pride and arrogance and despised ordinary people.","His masculine pride would not let him admit that a girl had defeated him."],"opposite":"","synonyms":""},{"def":"a group of lions","examples":[],"opposite":"","synonyms":""},{"def":"a person or thing that causes somebody to feel very pleased or satisfied","examples":["The car is her pride and joy.","He loves that boat, it's his pride and joy."],"opposite":"","synonyms":""},{"def":"if you have too high an opinion of yourself or your abilities, something will happen to make you look stupid","examples":[],"opposite":"","synonyms":""},{"def":"the position in which something is most easily seen, that is given to the most important thing in a particular group","examples":["The photo was given pride of place on the mantelpiece."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"somebody’s pride and joy","def":"a person or thing that causes somebody to feel very pleased or satisfied","examples":["The car is her pride and joy.","He loves that boat, it's his pride and joy."]},{"idiom":"pride comes/goes before a fall","def":"if you have too high an opinion of yourself or your abilities, something will happen to make you look stupid","examples":[]},{"idiom":"pride of place","def":"the position in which something is most easily seen, that is given to the most important thing in a particular group","examples":["The photo was given pride of place on the mantelpiece."]}],"phrasal":[],"related":["gay pride","pride yourself on","Pride and Prejudice","pride yourself on (doing) something","pride of place","somebody’s pride and joy","be puffed up with pride, etc.","pride comes/goes before a fall"]},{"pos":"verb","level":"","meanings":[],"idioms":[],"phrasal":["pride yourself on"],"related":[]}]