[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pri/prime/prime__us_1.mp3","phonsUS":"/praɪm/","level":"B2","meanings":[{"def":"main; most important; basic","examples":["My prime concern is to protect my property.","Winning is not the prime objective in this sport.","The care of the environment is of prime importance.","He's the police's prime suspect in this case.","Be careful crossing the main road.","The main thing is to remain calm.","He played a major role in setting up the system.","He was a key figure in the campaign.","The central issue is that of widespread racism.","The principal reason for this omission is lack of time.","Unemployment was the chief cause of poverty.","My prime concern is to protect my property."],"opposite":"","synonyms":"main"},{"def":"of the best quality; excellent","examples":["prime (cuts of) beef","The store has a prime position in the mall.","Over £100 000 worth of prime lamb was destroyed in the fire.","a prime location in the centre of town"],"opposite":"","synonyms":""},{"def":"a prime example of something is one that is typical of it","examples":["The building is a prime example of 1960s architecture."],"opposite":"","synonyms":""},{"def":"most likely to be chosen for something; most suitable","examples":["The house is isolated and a prime target for burglars.","He's a prime candidate for promotion."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["prime rib","sub-prime","prime cost","prime mover","prime rate","prime time","prime number","Prime Suspect","prime minister","Prime Minister's Questions","prime costs","prime rates","prime ribs","prime times"]},{"pos":"noun","level":"","meanings":[{"def":"the time in your life when you are strongest or most successful","examples":["a young woman in her prime","He was barely 30 and in the prime of (his) life.","These flowers are long past their prime.","She was cut off in her prime, and never lived to see the poems published.","You're still in the prime of life."],"opposite":"","synonyms":""},{"def":"a number that can be divided exactly only by itself and 1, for example 7, 17 and 41","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to prepare somebody for a situation so that they know what to do, especially by giving them special information","examples":["prime somebody (with something) They had been primed with good advice.","prime somebody (for something) She was ready and primed for action.","prime somebody to do something He had primed his friends to give the journalists as little information as possible."],"opposite":"","synonyms":""},{"def":"to make something ready for use or action","examples":["The bomb was primed, ready to explode."],"opposite":"","synonyms":""},{"def":"to prepare wood, metal, etc. for painting by covering it with a special paint that helps the next layer of paint to stay on","examples":[],"opposite":"","synonyms":""},{"def":"to encourage the growth of a new or weak business or industry by putting money into it","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"prime the pump","def":"to encourage the growth of a new or weak business or industry by putting money into it","examples":[]}],"phrasal":[],"related":[]}]