[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pri/princ/principal__us_1.mp3","phonsUS":"/ˈprɪnsəpl/","level":"B2","meanings":[{"def":"most important; main","examples":["The principal reason for this omission is lack of time.","New roads will link the principal cities of the area.","Tourist revenue is now our principal source of wealth.","My principal concern is to get the job done fast.","The violins have the principal tune.","They were joined on stage by their principal conductor.","The college is excited to announce the appointment of a new principal.","Many green activists oppose GM crops on principle.","Be careful crossing the main road.","The main thing is to remain calm.","He played a major role in setting up the system.","He was a key figure in the campaign.","The central issue is that of widespread racism.","The principal reason for this omission is lack of time.","Unemployment was the chief cause of poverty.","My prime concern is to protect my property."],"opposite":"","synonyms":"main"}],"idioms":[],"phrasal":[],"related":["principal boy","principal girl","principal parts","principal boys","principal girls"]},{"pos":"noun","level":"C1","meanings":[{"def":"the person who is in charge of a college or (in Scotland and Canada) a university","examples":["Peter Brown, principal of St John’s College","They were joined on stage by their principal conductor.","The college is excited to announce the appointment of a new principal.","Many green activists oppose GM crops on principle.","She was appointed as the first principal of Cambridge Training College.","The college principal says he's pleased with this year's results."],"opposite":"","synonyms":""},{"def":"a teacher who is in charge of a school","examples":["Principal Ray Smith","The regulations have been opposed by local high school principals."],"opposite":"","synonyms":""},{"def":"an amount of money that you lend to somebody or invest to earn interest","examples":["The principal must be repaid in full within ten years."],"opposite":"","synonyms":""},{"def":"the person who has the most important part in a play, an opera, etc.","examples":["The performance of the two principals is disappointing."],"opposite":"","synonyms":""},{"def":"a person that you are representing, especially in business or law","examples":["The shareholders are principals and the managers are agents."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]