[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pri/princ/principle__us_2.mp3","phonsUS":"/ˈprɪnsəpl/","level":"B2","meanings":[{"def":"a moral rule or a strong belief that influences your actions","examples":["He has high moral principles.","Stick to your principles and tell him you won't do it.","against your principles I refuse to lie about it; it's against my principles.","on principle He doesn't invest in the arms industry on principle.","She refuses to allow her family to help her as a matter of principle.","They were joined on stage by their principal conductor.","The college is excited to announce the appointment of a new principal.","Many green activists oppose GM crops on principle.","I refuse to compromise my principles by eating meat.","As a man of principle, he would not cover up for his former friend.","As a matter of principle she won't be visiting the president.","I can't accept his offer without seriously compromising my principles.","The group never departed from its principle of non-violence."],"opposite":"","synonyms":""},{"def":"a law, a rule or a theory that something is based on","examples":["The same principles apply to both humans and animals.","an important legal principle","‘You learn general principles from studying particular things,’ he asserts.","principle of something the basic principles of car maintenance","There are three fundamental principles of teamwork.","to learn the basic/general principles of something","the principles of justice/law","principle of doing something the principles and practice of writing reports","principle for something draft principles for the management of shared natural resources","principle for doing something a document setting out principles for resolving the dispute","principle behind something The principle behind it is very simple.","Discussing all these details will get us nowhere; we must get back to first principles (= the most basic rules).","The court derived a set of principles from this general rule.","His novels reject chronology as an organizing principle.","She is interested in actual human relationships rather than abstract principles.","She went on to explain the principles behind what she was doing.","The house incorporates many principles of modern environmentally aware design.","This principle applies to all kinds of selling."],"opposite":"","synonyms":""},{"def":"a belief that is accepted as a reason for acting or thinking in a particular way","examples":["The welfare of the child is the guiding principle of the family courts.","They were accused of violating the principles of democracy.","The principle of equality is enshrined in the Constitution.","principle that… the application of the principle that men and women should receive equal pay for equal work","The UN declaration sought to establish the principle that everyone is entitled to the same basic rights","the principle that free education should be available for all children","in accordance with a principle Ethical behaviour entails acting in accordance with established principles of right and wrong","The order to show no mercy was contrary to the most basic principles of their religion.","Freedom is the founding principle of our Republic.","She sticks to the principle that everyone should be treated equally.","the principles underlying Western philosophy"],"opposite":"","synonyms":""},{"def":"a general or scientific law that explains how something works or why something happens","examples":["O'Sullivan was among the first chemists to apply scientific principles to brewing beer.","principle that… the principle that heat rises","in principle A tidal current turbine is similar in principle to a windmill."],"opposite":"","synonyms":""},{"def":"if something can be done in principle, there is no good reason why it should not be done although it has not yet been done and there may be some difficulties","examples":["In principle there is nothing that a human can do that a machine might not be able to do one day."],"opposite":"","synonyms":""},{"def":"in general but not in detail","examples":["They have agreed to the proposal in principle but we still have to negotiate the terms.","I agree with you in principle, but we'll need to discuss the details."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in principle","def":"if something can be done in principle, there is no good reason why it should not be done although it has not yet been done and there may be some difficulties","examples":["In principle there is nothing that a human can do that a machine might not be able to do one day.","They have agreed to the proposal in principle but we still have to negotiate the terms.","I agree with you in principle, but we'll need to discuss the details."]}],"phrasal":[],"related":["KISS principle"]}]