[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pri/prior/priority__us_1_rr.mp3","phonsUS":"/praɪˈɔːrəti/","level":"B2","meanings":[{"def":"something that you think is more important than other things and should be dealt with first","examples":["a high/low priority","Education is a top priority.","Our first priority is to improve standards.","National security is our main priority.","Public sector reform is a key priority.","Financial security was high on his list of priorities.","You need to get your priorities right (= decide what is important to you).","(North American English) You need to get your priorities straight.","The department must start setting priorities.","Material possessions have always been a low priority for Mike.","To reduce stress you may have to rethink your priorities in life.","Using the internet is one of the company's top strategic priorities.","We assign a high priority to research and development.","We need to place a higher priority on family and social issues.","You need to sort out your priorities before making a decision about the future.","The development of a nuclear arsenal became a priority for Stalin.","Each candidate repeatedly promised to make education a national priority."],"opposite":"","synonyms":""},{"def":"the most important place among various things that have to be done or among a group of people","examples":["Club members will be given priority.","The search for a new vaccine will take priority over all other medical research.","A clean ocean must have priority over the profits of polluting industries.","Priority cases, such as homeless families, get dealt with first.","The bank seems to give priority to new customers.","The government is giving priority to school leavers in its job-creation programme.","Her family takes priority over her work.","When hospital funds are being allocated children take priority.","List the tasks in order of priority."],"opposite":"","synonyms":""},{"def":"the right of a vehicle to go before other traffic at a particular place on a road","examples":["Buses have priority at this junction."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]