[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pri/prize/prize__us_1.mp3","phonsUS":"/praɪz/","level":"A2","meanings":[{"def":"an award that is given to a person who wins a competition, race, etc. or who does very good work","examples":["She was awarded the Nobel Peace Prize.","He won first prize in the woodwind section.","The prize went to the grey long-haired cat.","prize for something She has received numerous prizes for her work.","prize for doing something There are no prizes for guessing (= it is very easy to guess) who she was with.","a cash prize of $5 000","The grand prize is a family trip to Hawaii.","His film took the top prize at Cannes last year.","I won £500 in prize money.","a prize fund of £20 000","Win a car in our prize draw!","She was the first woman to win this coveted prize.","The booby prize was awarded to the worst singer in the competition.","The prize was presented by the mayor.","a prize worth over $3 000","prizes in chemistry, physics and medicine","They said the teenager was a worthy winner of the prize."],"opposite":"","synonyms":""},{"def":"something very important or valuable that is difficult to achieve or obtain","examples":["World peace is the greatest prize of all.","The presidency is the ultimate prize."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["booby prize","door prize","Nobel Prize","prize-giving","consolation prize","Pulitzer Prize","Booker Prize","Mercury Prize","Turner Prize","Orange Prize for Fiction","Women's Prize for Fiction","prize-givings","prize winner"]},{"pos":"adjective","level":"","meanings":[{"def":"good enough to win a prize in a competition","examples":["prize cattle"],"opposite":"","synonyms":""},{"def":"being a very good example of its kind","examples":["a prize student","He's a prize specimen of the human race!","(informal) She's a prize idiot (= very silly)."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to value something highly","examples":["prize something an era when honesty was prized above all other virtues","prize something for something Oil of cedarwood is highly prized for its use in perfumery.","The berries are prized for their healing properties.","The library is prized as the finest of its kind in England.","a precious thing to be prized above all else","two fruits that are much prized on the island"],"opposite":"","synonyms":""},{"def":"to use force to separate something from something else","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]