[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/probl/problem__us_1.mp3","phonsUS":"/ˈprɑːbləm/","level":"A1","meanings":[{"def":"a thing that is difficult to deal with or to understand","examples":["big/serious/major problems","She has a lot of health problems.","financial/social/technical problems","Let me know if you have any problems.","The government must address the problem of child poverty.","We cannot tackle this problem effectively on our own.","We are dealing with a serious problem here.","Money isn't going to solve the problem.","(especially North American English) to fix a problem","If he chooses Mary it's bound to cause problems.","to pose/create a problem","The problem first arose in 2018.","problem with something There is a problem with this argument.","problem of something the problem of drug abuse","problem of doing something Most students face the problem of funding themselves while they are studying.","problem for somebody Unemployment is a very real problem for graduates now.","It’s a nice table! The only problem is (that) it’s too big for our room.","Part of the problem is the shape of the room.","Stop worrying about their marriage—it isn't your problem.","There's no history of heart problems (= disease connected with the heart) in our family.","the magazine’s problem page (= containing letters about readers’ problems and advice about how to solve them)","All the anti-depressant does is mask the problem.","Depression is a natural feeling if your problems seem intractable.","For years I've tried to overlook this problem.","Fortunately, it's easy to avoid any potential problems.","Framing the problem is an important step.","She believes she may have found a solution to the problem.","He developed a drinking problem.","She doesn't really see the problem.","He doesn't seem to understand my problem.","She had to undergo surgery to cure the problem with her knee.","He has been faced with all manner of problems in his new job.","Her new job had taken her mind off her family problems for a while.","I didn't imagine there would be a problem about getting tickets.","I don't anticipate any future problems in that regard.","I forgot my problems for a moment.","I'm glad you finally admitted your problem.","If the problem persists you should see a doctor.","Inadequate resources pose a problem for all members of staff.","Most people can see the ethical problem with accepting such an offer.","No one ever asked why or how the problem originated.","Our greatest problem is the lack of funds.","She had serious substance abuse problems with both cocaine and heroin.","She raised the problem of falling sales at the last meeting.","Success brings its own problems.","Systemic security problems have been identified.","The accident poses a terrible problem for the family.","The basic problem remains the lack of available housing.","The plan has been fraught with problems from the start.","The problem lies in the lack of communication between managers and staff.","Therein lies the problem.","The rail strike is a problem for all commuters.","The role of the sun in climate change is still a big unsolved problem.","The traffic in illegal drugs is a global problem.","These symptoms may indicate a serious problem.","They created a task force to study this problem.","They sold their car to ease their financial problems.","This illustrates another potential problem.","This underscores the biggest problem with electronic voting.","We need to get to the root of the problem before we can solve it.","We're faced with a whole host of new problems.","This is one of the great problems of cosmology: where did the overall structure of the universe come from?"],"opposite":"","synonyms":""},{"def":"a question that can be answered by using logical thought or mathematics","examples":["mathematical problems","to find the answer to the problem","The teacher set us 50 problems to do.","I have five problems to do for homework."],"opposite":"","synonyms":""},{"def":"to disagree with or object to something/somebody","examples":["I have no problem with you working at home tomorrow.","(informal) We are going to do this my way. Do you have a problem with that? (= showing that you are impatient with the person that you are speaking to)","Do you have a problem with her?"],"opposite":"","synonyms":""},{"def":"used to show that you do not care about somebody else’s difficulties","examples":["If they can't afford to go, that's not my problem."],"opposite":"","synonyms":""},{"def":"used to show that you are happy to help somebody or that something will be easy to do","examples":["‘Can I pay by credit card?’ ‘Yes, no problem.’"],"opposite":"","synonyms":""},{"def":"used after somebody has thanked you or said they are sorry for something","examples":["‘Thanks for the ride.’ ‘No problem.’"],"opposite":"","synonyms":""},{"def":"used to show that you think a person should deal with their own difficulties","examples":["‘My parents will be furious!’ ‘That’s your problem.’"],"opposite":"","synonyms":""},{"def":"used to show that you think somebody is being unreasonable","examples":["What's your problem?—I only asked if you could help me for ten minutes."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"have a problem with something/somebody","def":"to disagree with or object to something/somebody","examples":["I have no problem with you working at home tomorrow.","(informal) We are going to do this my way. Do you have a problem with that? (= showing that you are impatient with the person that you are speaking to)","Do you have a problem with her?"]},{"idiom":"it’s/that’s not my problem","def":"used to show that you do not care about somebody else’s difficulties","examples":["If they can't afford to go, that's not my problem."]},{"idiom":"no problem","def":"used to show that you are happy to help somebody or that something will be easy to do","examples":["‘Can I pay by credit card?’ ‘Yes, no problem.’","‘Thanks for the ride.’ ‘No problem.’"]},{"idiom":"that’s her/his/their/your problem","def":"used to show that you think a person should deal with their own difficulties","examples":["‘My parents will be furious!’ ‘That’s your problem.’"]},{"idiom":"what’s your problem?","def":"used to show that you think somebody is being unreasonable","examples":["What's your problem?—I only asked if you could help me for ten minutes."]}],"phrasal":[],"related":["attitude problem","problem-solving","First World problem","a chicken-and-egg situation, problem, etc."]},{"pos":"adjective","level":"","meanings":[{"def":"causing problems for other people or yourself","examples":["She was a problem child, always in trouble with the police.","a new approach to problem drinking","One out of every five people is a problem drinker."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]