[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/proce/process__us_1.mp3","phonsUS":"/ˈprɑːses/","level":"A2","meanings":[{"def":"a series of things that are done in order to achieve a particular result","examples":["the consultation/planning process","Each time we have to go through the whole decision-making process again.","Repeat this process until the entire area is tiled.","I'm afraid getting things changed will be a slow process.","Coming off the drug was a long and painful (= difficult) process for him.","mental/cognitive/thought processes","process of doing something They began the difficult process of reforming the education system.","process for doing something The company has introduced a new process for handling complaints.","Find which food you are allergic to by a process of elimination.","in the process of doing something We're in the process of selling our house.","in the process I was moving some furniture and I twisted my ankle in the process (= while I was doing it).","Any design process evolves over time as new information surfaces.","As part of the registration process, the applicant will report certain information.","Churches are taking a key role in the democratic process.","Disputes and negotiations have slowed down the process.","I was beginning to understand his thought processes.","Protests disrupted the electoral process in the southern region.","Students use thinking processes and skills to gain a knowledge of history.","The company doesn't have a formal complaints process.","The entire process was completed in less than 24 hours.","The selection process takes place over a period of two weeks.","These processes require careful scheduling.","They all have to go through a vetting process.","This is part of the process by which musical works are created.","a legal process for dealing with defrauders","a painstaking process of trial and error","a stalemate in the peace process","places where the process of urbanization is being reversed","the bidding process for media rights","the long review process for his application","the tedious process of creating receipts and invoices","It's a simple process, but it can take some time.","This was a complex process involving four or more steps."],"opposite":"","synonyms":""},{"def":"a series of things that happen, especially ones that result in natural changes","examples":["It's a normal part of the learning process.","The drug has been found to significantly speed up the healing process.","during a process During the ageing process, the rum acquires a golden colour.","Everything is in a process of change."],"opposite":"","synonyms":""},{"def":"a method of doing or making something, especially one that is used in industry","examples":["manufacturing processes","She is involved in the production process from start to finish.","process for doing something a new process for rustproofing car bodies","This diagram illustrates the process of paper-making./This diagram shows how paper is made.","First/First of all, logs are delivered to a paper mill, where the bark is removed and the wood is cut into small chips.","Next/Second, the wood chips are pulped, either using chemicals or in a pulping machine.","Pulping breaks down the internal structure of the wood and enables/allows the natural oils to be removed.","Once/After the wood has been pulped, the pulp is bleached in order to remove impurities. /…is bleached so that impurities can be removed.","The next stage is to feed the pulp into the paper machine, where it is mixed with water and then poured onto a wire conveyor belt.","As the pulp travels along the conveyor belt, the water drains away. This causes the solid material to sink to the bottom, forming a layer of paper.","At this point the new paper is still wet, so it is passed between large heated rollers, which press out the remaining water and simultaneously dry the paper/…dry the paper at the same time.","The final stage is to wind the paper onto large rolls./Finally, the paper is wound onto large rolls.","Most of the process is automated.","His job is to develop new products and processes.","The process was invented in the 19th century.","They are made using the most advanced manufacturing processes."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"B2","meanings":[{"def":"to treat raw material, food, etc. in order to change it, preserve it, etc.","examples":["(be) processed Most of the food we buy is processed in some way.","Soy bean oil is found in hundreds of processed foods.","processed cheese/meats","Many of these foods are made from highly processed ingredients.","process something into something The berries are processed into juice or sauce.","process something for something For many years he grew and processed flax for linen.","When food is processed, many of the nutrients are stripped away.","The plant is then processed for dye.","tobacco specially processed to reduce nicotine","highly processed foods"],"opposite":"","synonyms":""},{"def":"to deal officially with a document, request, etc.","examples":["It will take a week for your application to be processed."],"opposite":"","synonyms":""},{"def":"to perform a series of operations on data in a computer","examples":["The image is processed digitally by computer software."],"opposite":"","synonyms":""},{"def":"to understand the meaning of something that has happened or been said","examples":["process something My brain slowly processed the fact that I was free to leave.","process what, how, etc… It was a second later when I fully processed what he had said."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/proce/process__us_3.mp3","phonsUS":"/prəˈses/","level":"","meanings":[{"def":"to walk or move along slowly in, or as if in, a procession","examples":["The bishop, priests and deacons processed slowly through the cathedral."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]