[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/produ/produce__us_1.mp3","phonsUS":"/prəˈduːs/","level":"A2","meanings":[{"def":"to make things to be sold, especially in large quantities","examples":["Our company mainly produces goods for export.","We pride ourselves on producing high-quality products.","The local factory produces electronic components.","She makes her own clothes.","She made a good impression on the interviewer.","He did a beautiful drawing of a house.","Who’s doing the food for the party?","Scientists disagree about how the universe was created.","to develop new software","a factory that produces microchips","to generate electricity","Brainstorming is a good way of generating ideas.","Rearrange the letters to form a new word.","The chain is formed from 136 links.","to create/​develop/​launch a new product","cotton/​leather goods","electrical goods","rice, flour and other basic commodities","official Olympic merchandise","We sell only fresh local produce.","These goods are more efficiently produced in small associations.","These stores sell items which are produced and sold by cooperatives."],"opposite":"","synonyms":"make"},{"def":"to grow or make something as part of a natural process; to have a baby or young animal","examples":["The region produces over 50 per cent of the country's wheat.","I would like to find out more about how our food is produced.","All our meat is locally produced.","These shrubs produce bright red berries.","Under stress, the body produces adrenalin.","Our cat produced kittens last week.","Her duty was to produce an heir to the throne.","produce something from something The wine is produced from Chardonnay grapes.","The country produces more than two million barrels of oil per day.","the wine-producing regions of France","the sale of sustainably produced timber","These plants produce bell-shaped flowers.","Leptin is a hormone produced by fat cells.","fruit and vegetables that are produced locally","organically produced food"],"opposite":"","synonyms":""},{"def":"to create something, especially when skill is needed","examples":["She produced a delicious meal out of a few leftovers.","By 1912 he was producing purely abstract works.","United produced their best performance of the season.","He produces reports on economic and social trends for manufacturers and trade associations.","He moved to California intending to produce a third novel.","the sounds that are typically produced by an American orchestra","The letter has been produced with digital technology.","this handsomely produced reference work","The technology can be used to produce interactive educational programs.","He argued that wealth is produced by the labour power of the workers."],"opposite":"","synonyms":""},{"def":"to cause a particular result or effect","examples":["A phone call to the manager produced the result she wanted.","His words failed to produce the desired effect.","These reforms will produce little change.","The drug produces a feeling of excitement.","Their strategy produced the desired outcome.","Which method is likely to produce the best results?","The drug produced an improvement in all but one case.","The prime minister's speech produced an angry response from opposition parties.","The questionnaire produced 9 000 replies."],"opposite":"","synonyms":""},{"def":"to show something or make something appear from somewhere","examples":["produce something from/out of something He produced a letter from his pocket.","produce something She failed to produce any evidence to support these claims.","At the meeting the finance director produced the figures for the previous year."],"opposite":"","synonyms":""},{"def":"if a town, country, etc. produces somebody with a particular skill or quality, the person comes from that town, country, etc.","examples":["He is the greatest athlete this country has ever produced."],"opposite":"","synonyms":""},{"def":"to be in charge of preparing a film, play, etc. for the public to see","examples":["She produced a TV series about adopted children.","The series was obviously cheaply produced.","a professionally produced CD","a slickly produced thriller"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["mass-produce"]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/produ/produce__us_3.mp3","phonsUS":"/ˈprəʊduːs/","level":"B2","meanings":[{"def":"things that have been made or grown, especially things connected with farming","examples":["The market is full of farm produce.","The shop sells only fresh local produce.","It says on the label ‘Produce of France’.","I'm eating more fresh produce than ever.","There was limited access to quality produce.","We buy organic produce from the farmers' market.","She grows her own produce."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]