[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/produ/product__us_1.mp3","phonsUS":"/ˈprɑːdʌkt/","level":"A1","meanings":[{"def":"a thing that is grown, produced or created, usually for sale","examples":["food/agricultural/software products","He has eliminated dairy products from his diet.","This product contains nuts.","The coating could appear in consumer products within five years.","The company sells its products around the world.","We are increasingly likely to buy products online.","Where did you purchase the product?","The cooperative helps local farmers successfully market their farm products.","It is the responsibility of the industry to produce safe products.","The company has been developing the product for years.","investment in product development","We have just launched a new product on to the market.","The store offers a wide range of products.","She was very happy with the finished product.","The bank offers a whole range of financial products and services.","(business) We need new product to sell (= a new range of products).","to create/​develop/​launch a new product","cotton/​leather goods","electrical goods","rice, flour and other basic commodities","official Olympic merchandise","We sell only fresh local produce.","It's hard to find a competing product that is as compelling.","Most companies haven't tested their products on humans yet.","Our research enables companies to customize and tailor products to suit individual tastes.","The group says it will introduce nine new products before the end of the year.","Those who used the products were generally satisfied with the quality.","They offer a range of niche products online.","They put a lot of time and money into packaging products.","Ensure you have adequate product descriptions.","She is president of product management.","The company is diversifying its product mix to attract new customers.","We are expanding the product line-up.","We have a good product, but it needs to be marketed better.","agencies giving out promotional products","everyday household products","non-toxic cleaning products","for those still concerned about product safety","products offered by our insurance companies","the company's flagship product","the manufacture of chocolate from cocoa bean to the finished product"],"opposite":"","synonyms":"product"},{"def":"a thing produced during a natural, chemical or industrial process","examples":["One product of any combustion reaction is carbon monoxide.","Methane is a product of this process."],"opposite":"","synonyms":""},{"def":"a person or thing that is the result of something","examples":["The child is the product of a broken home.","Like many of his generation, he was a product of Japan's obsession with technology."],"opposite":"","synonyms":""},{"def":"a cream or liquid that you put on your hair or skin to make it look better","examples":["This product can be used on wet or dry hair.","Don’t put too much product on your skin.","Ken uses the very best styling products for Jessica's fine hair."],"opposite":"","synonyms":""},{"def":"a quantity obtained by multiplying one number by another","examples":["The product of 21 and 16 is 336."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["by-product","end product","waste product","product placement","gross domestic product","gross national product","minimum viable product","Universal Product Code"]}]