[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/produ/production__us_1.mp3","phonsUS":"/prəˈdʌkʃn/","level":"B1","meanings":[{"def":"the process of growing or making food, goods or materials, especially large quantities","examples":["food/oil production","The new plant is due to begin production next year.","Production of the new aircraft will start next year.","in production The new model will be in production by the end of the year.","The car goes into production later this year.","This model went out of production last year.","production costs/processes","Prices have fallen below the cost of production.","The country has resumed normal oil production.","Naples surpassed Rome as a centre of artistic production in the 18th century.","The machine will go into full production in November 2019.","The rate of production was greater in Saskatchewan than in Alberta.","These substances are not allowed in organic production.","a car production plant","special production runs of key components","sustainable crop production","There is not much land available for food production."],"opposite":"","synonyms":""},{"def":"the quantity of goods that is produced","examples":["a decline/an increase in production","The goal is to increase production by 40%.","Industries boosted production last month.","Production declined by 20%.","Production will drop by 60 000 next year.","It is important not to let production levels fall.","Market demand could outpace production capacity."],"opposite":"","synonyms":""},{"def":"the act or process of making something naturally","examples":["Eating cheese stimulates the production of saliva.","Exposure to sunlight increases the production of melanin.","Green tea inhibits the production of this enzyme."],"opposite":"","synonyms":""},{"def":"a film, play or broadcast that is prepared for the public; the act of preparing a film, play, etc.","examples":["a new production of ‘King Lear’","The college will be staging a production of 'The Wizard of Oz'.","Every year the school puts on a musical production.","He wants a career in film production.","in production Series four is currently in production.","The film goes into production next year.","I had seen the original production in 1956.","This is not a big studio production.","a local amateur production of ‘The Sound of Music’","a touring production of ‘Cats’","the movie's direction and production quality"],"opposite":"","synonyms":""},{"def":"when you show something","examples":["Discounts only on production of your student ID card."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"on production of something","def":"when you show something","examples":["Discounts only on production of your student ID card."]}],"phrasal":[],"related":["mass production","post-production","pre-production","production line","production number","production values","production lines","production numbers"]}]