[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/profi/profit__us_1.mp3","phonsUS":"/ˈprɑːfɪt/","level":"B1","meanings":[{"def":"the money that you make in business or by selling things, especially after paying the costs involved","examples":["annual/pre-tax/corporate profits","Profits before tax grew from £615m to £1 168m.","a rise/an increase/a jump/a drop/a fall in profits","to maximize/increase profits","to report/post profits of £50 million","The club may turn a profit (= make a profit) by the end of the year.","The sale generated record profits.","Net profit (= after you have paid costs and tax) was up 16.1 per cent.","The business recorded a gross profit of (= before you pay costs and tax) £1.45 million last year","The division's profit margins are being squeezed.","The directors are driven only by the profit motive.","profit on something The company made a healthy profit on the deal.","profit from something Profit from exports rose 7.7 per cent.","The radio station earns a profit from its advertising.","profit in something There was little or no profit in the products themselves.","profit in doing something There isn’t much profit in running a restaurant these days.","at a profit We should be able to sell the house at a huge profit.","for profit The agency is voluntary and not run for profit.","She's only interested in making a quick profit.","Patents allowed inventors to profit from ownership of their inventions.","With his long white beard, he looks like an Old Testament prophet.","At whose expense are those obscene profits made?","Damaged goods mean lost profit.","He's only interested in making a quick profit.","Investors will take the profits.","Jakob had realized a personal profit of $240 000.","Profits surged 41 per cent to £13 million.","The company started to show a profit in its first year.","The expected profits have not materialized.","The goods were sold for profit.","They closed down after years of low profits.","a commodity that produced steady profits","an annual profit of £50 000","We are continuing our strategy of profit maximization.","The company posted second-quarter profits of $570 million."],"opposite":"loss","synonyms":""},{"def":"the advantage that you get from doing something","examples":["Future lawyers could study this text with profit."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["non-profit","with-profit","profit-making","profit margin","profit-taking","not-for-profit","profit-sharing","profit warning","profit and loss account","profit margins","profit warnings","non-profit-making","profit and loss accounts"]},{"pos":"verb","level":"","meanings":[{"def":"to get something useful from a situation; to be useful to somebody or give them an advantage","examples":["profit (from something) Farmers are profiting from the new legislation.","profit (by something) We tried to profit by our mistakes (= learn from them).","profit something Many local people believe the development will profit them.","She's only interested in making a quick profit.","Patents allowed inventors to profit from ownership of their inventions.","With his long white beard, he looks like an Old Testament prophet.","A few greedy companies are profiting hugely at the expense of the most vulnerable consumers.","Convicted criminals should not be allowed to profit from their crimes.","The private sector will profit by selling the surplus electricity abroad."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]