[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/profe/profession__us_3.mp3","phonsUS":"/prəˈfeʃn/","level":"B1","meanings":[{"def":"a type of job that needs special training or skill, especially one that needs a high level of education","examples":["the medical/legal/teaching profession","to enter/go into/join a profession","(British English) the caring professions (= that involve looking after people)","She was at the very top of her profession.","senior members of the profession","by profession He was a lawyer by profession.","It’s very difficult to find work at the moment.","Only half the people here are in paid employment.","He had a very distinguished career in the Foreign Office.","He hopes to enter the medical profession.","Please state your name, age, and occupation.","Carpentry is a highly skilled trade.","It's time to change your profession for something more exciting.","She entered the legal profession after college.","What made you choose this profession?","We are members of an old and noble profession.","She was shocked at her daughter's choice of profession.","a job where people can learn the profession","the primary reason why nurses leave the profession","I joined the profession when I was in my early twenties.","She's making an impact in her chosen profession."],"opposite":"","synonyms":"work"},{"def":"all the people who work in a particular type of profession","examples":["The legal profession has/have always resisted change.","the licensing laws that regulate the profession"],"opposite":"","synonyms":""},{"def":"the traditional jobs that need a high level of education and training, such as being a doctor or a lawyer","examples":["employment in industry and the professions"],"opposite":"","synonyms":""},{"def":"a statement about what you believe, feel or think about something, that is sometimes made publicly","examples":["a profession of faith","His professions of love did not seem sincere."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]