[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/progr/program__us_1.mp3","phonsUS":"/ˈprəʊɡræm/","level":"A2","meanings":[{"def":"a set of instructions in code that control the operations or functions of a computer","examples":["You'll need to download and install the program on your computer.","To run the program, simply click the icon.","She uses a computer program to produce these maps.","The program creates simulations of real-life driving conditions.","There may be a bug in the program.","This program allows you to edit and catalogue digital photographs.","This program requires at least 24Mb of RAM.","a program for debugging"],"opposite":"","synonyms":""},{"def":"something that people watch on television or listen to on the radio","examples":["a TV/television/radio program","a news program","program on something Did you see that program on India last night?","program about something I watched a program about volcanoes."],"opposite":"","synonyms":""},{"def":"a plan of things that will be done or included in the development of something","examples":["the country's nuclear weapons/space program","We have recently launched a research program.","Talk with your family doctor about developing a weight-loss program.","program for somebody a training program for new staff members","The museum runs an art education program for inner-city children.","Our centers offer training programs designed for all types of athletes.","program of something The government is implementing a program of reform.","program to do something The college has initiated a program to improve student retention."],"opposite":"","synonyms":""},{"def":"a course of study","examples":["a school/an educational program","a teacher education program","The college offers a wide variety of programs of study.","program in something The department has launched a new program in creative writing.","She enrolled in a Master's program in American history.","a physics course","a course of ten lectures.","a physics course/​program","a program of ten lectures.","I have to take a physics course/​class.","a two-year college course.","a two-year college program.","The course leader outlined the program we would be following.","The foundation's online learning program brings the classroom to you.","a graduate program that focuses on a chosen profession","an after-school science program that promotes science literacy","students in an accredited journalism program"],"opposite":"","synonyms":""},{"def":"an organized order of performances or events","examples":["The concert is the highlight of the festival's musical program.","program of something a week-long program of lectures","We're planning an exciting program of events.","What's the program for (= what are we planning to do) tomorrow?"],"opposite":"","synonyms":""},{"def":"a thin book or piece of paper that gives you information about a play, a concert, etc.","examples":["a theater program","Her name doesn't appear in the concert program."],"opposite":"","synonyms":""},{"def":"a series of actions done by a machine, such as a washing machine","examples":["Select a cool program for woolen clothes."],"opposite":"","synonyms":""},{"def":"used to tell somebody that they should change their attitude and do what they are supposed to be doing","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"get with the program","def":"used to tell somebody that they should change their attitude and do what they are supposed to be doing","examples":[]}],"phrasal":[],"related":["object program","source program","Apollo program","Gemini program","Mercury program","program music","diagnostic program","get with the program"]},{"pos":"verb","level":"B1","meanings":[{"def":"to give a computer, etc. a set of instructions to make it perform a particular task","examples":["In this class, students will learn how to program.","program something He taught himself to program a computer.","We can program a robot to walk around the room."],"opposite":"","synonyms":""},{"def":"to plan for something to happen, especially as part of a series of planned events","examples":["(be) programmed Several evening events have been programmed.","The leak was discovered during programmed maintenance work.","be programmed for something The final section of road is programmed for completion next month.","be programmed to do something The exhibition was originally programmed to close in August."],"opposite":"","synonyms":""},{"def":"to make a person, an animal, etc. behave in a particular way, so that they do it without thinking about it","examples":["be programmed to do something Human beings are genetically programmed to learn certain kinds of language."],"opposite":"","synonyms":""},{"def":"to give a machine instructions to do a particular task","examples":["She programmed the heat to come on at eight."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]