[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/progr/progress__us_1_rr.mp3","phonsUS":"/ˈprɑːɡres/","level":"A2","meanings":[{"def":"the process of improving or developing, or of getting nearer to achieving or completing something","examples":["I think we're making progress.","We will continue to monitor progress over the next few months.","economic/scientific/technological progress","rapid/good progress","We hope to see some real progress by March.","progress in something James is making steady progress in his recovery.","progress in doing something Police are making significant progress in fighting computer crime.","The two sides have made very slow progress in resolving the dispute.","progress on something There's been no sign of progress on this issue.","progress towards something The company is making progress towards this target.","They asked for a progress report on the building work.","You can follow the progress of the project on our website.","He's making good progress in maths.","How much progress have the builders made on the extension?","I was frustrated by my apparent lack of progress when I started the violin.","Regular tests enable the teacher to monitor the progress of each child.","The book traced his steady progress from petty theft to serious crime.","We have made significant progress in the fight against HIV/​AIDS.","Who can halt this man's inexorable progress towards yet another championship?","At the present rate of progress we won't be finished by July.","Technological progress is changing the demand for labour."],"opposite":"","synonyms":""},{"def":"movement forwards or towards a place","examples":["She watched his slow progress down the steep slope.","There wasn't much traffic so we made good progress.","We watched the ship's stately progress out of the docks."],"opposite":"","synonyms":""},{"def":"happening at this time","examples":["Work on the new offices is now in progress.","Please be quiet—examination in progress.","I have one file for completed work and one for work in progress.","There was a cricket match in progress."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in progress","def":"happening at this time","examples":["Work on the new offices is now in progress.","Please be quiet—examination in progress.","I have one file for completed work and one for work in progress.","There was a cricket match in progress."]}],"phrasal":[],"related":["work in progress","Rake's Progress","Pilgrim's Progress","Works Progress Administration"]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/progr/progress__us_7.mp3","phonsUS":"/prəˈɡres/","level":"B2","meanings":[{"def":"to improve or develop over a period of time; to make progress","examples":["The course allows students to progress at their own speed.","Work on the new road is progressing slowly.","Things are progressing well.","progress in something to progress rapidly in your career","progress with something They are anxious to progress with the plan.","progress to something She started off playing the recorder and then progressed to the clarinet.","progress from something to something He soon progressed from the basics to more difficult work.","He felt he still needed to progress further in his learning.","The talks are progressing very well."],"opposite":"","synonyms":""},{"def":"to move forward","examples":["The line of traffic progressed slowly through the town.","(figurative) Cases can take months to progress through the courts."],"opposite":"","synonyms":""},{"def":"to go forward in time","examples":["The weather became colder as the day progressed.","The visiting team's confidence increased as the game progressed."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]