[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/proje/project__us_1_rr.mp3","phonsUS":"/ˈprɑːdʒekt/","level":"A1","meanings":[{"def":"a piece of work involving careful study of a subject over a period of time, done by school or college students","examples":["a history project","project on something My class is doing a project on medieval towns.","The final term will be devoted to project work."],"opposite":"","synonyms":""},{"def":"a planned piece of work that is designed to find information about something, to produce something new, or to improve something","examples":["We worked on various projects together.","About 300 schools are involved in the project.","to fund/finance a project","to start/launch/initiate a project","to undertake/complete a project","a building/construction project","project to do something They've set up a research project to investigate the harmful effects of air pollution.","Work has begun on a project to build a new hospital.","project on something They are taking part in a project on the genetics of eating disorders.","a project manager/team","The company runs large construction projects.","He embarked on an ambitious project to translate all the works of Plato.","We are seeking funding for this project.","He needed some financial assistance from the bank to get his project off the ground.","The project aims to reduce homelessness.","The scheme will be extended throughout the country after a successful six-month pilot project.","The wedding became her pet project, and she spent hours organizing it.","The proposed reform project contains some interesting ideas."],"opposite":"","synonyms":""},{"def":"a set of aims, ideas or activities that somebody is interested in or wants to bring to people’s attention","examples":["The party attempted to assemble its aims into a focused political project."],"opposite":"","synonyms":""},{"def":"a group of houses or apartments built for poor families, usually with government money","examples":["Going into the projects alone can be dangerous."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Project HOPE","project onto","housing project","Eden Project","Manhattan Project","Blair Witch Project","Human Genome Project","Project Mercury","project something onto somebody"]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/proje/project__us_2.mp3","phonsUS":"/prəˈdʒekt/","level":"B2","meanings":[{"def":"to estimate what the size, cost or amount of something will be in the future based on what is happening now","examples":["be projected A growth rate of 4 per cent is projected for next year.","Spending cuts will help to reduce huge projected deficits in future years.","be projected at something The overall cost is projected at $11 billion.","be projected to do something Unemployment is projected to rise to over 5 per cent next year.","it is projected that… It is projected that the unemployment rate will fall.","The budget deficit was projected at £30 million.","the population increases projected for Asia","These rates can be projected forward to give figures for the next ten years."],"opposite":"","synonyms":""},{"def":"to plan an activity, a project etc. for a time in the future","examples":["be projected The next edition of the book is projected for publication in March.","The projected housing development will go ahead next year."],"opposite":"","synonyms":""},{"def":"to make light, an image, etc. fall onto a flat surface or screen","examples":["project something onto something They projected the digital image onto the model's surface.","Images are projected onto the retina of the eye.","The videos were projected onto two screens.","project something on something Old photographs were projected on the wall behind her."],"opposite":"","synonyms":""},{"def":"to stick out beyond an edge or a surface","examples":["a building with balconies projecting out over the street","He saw the top of the car projecting above the water.","His feet were projecting beyond the end of the bed.","Two iron bars projected from the wall."],"opposite":"","synonyms":""},{"def":"to present somebody/something/yourself to other people in a particular way, especially one that gives a good impression","examples":["project something They sought advice on how to project a more positive image of their company.","She projects an air of calm self-confidence.","project somebody/something/yourself (as somebody/something) He projected himself as a man worth listening to."],"opposite":"","synonyms":""},{"def":"to send or throw something up or away from yourself","examples":["Actors must learn to project their voices.","(figurative) the powerful men who would project him into the White House"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["project onto"],"related":[]}]