[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/promi/promise__us_1.mp3","phonsUS":"/ˈprɑːmɪs/","level":"A2","meanings":[{"def":"to tell somebody that you will definitely do or not do something, or that something will definitely happen","examples":["‘We haven't got time to go to the park.’ ‘But you promised!’","promise to do something The college principal promised to look into the matter.","‘Promise not to tell anyone!’ ‘I promise.’","They arrived at 7.30 as they had promised.","promise something The government has promised a full investigation into the disaster.","I'll see what I can do but I can't promise anything.","promise (that)… The brochure promised (that) the local food would be superb.","promise somebody (that)… You promised me (that) you’d be home early tonight.","promise something to somebody He promised the money to his grandchildren.","promise somebody something He promised his grandchildren the money.","promise yourself something I've promised myself some fun when the exams are over.","promise (somebody) + speech ‘I'll be back soon,’ she promised.","He repeatedly promised to cut taxes in his campaign.","I am sending you information on holidays as promised.","I can definitely promise you that I'll do all I can to help.","I can't promise I'll be there.","She promised faithfully that she would come.","I've promised my old computer to Jane."],"opposite":"","synonyms":""},{"def":"to make something seem likely to happen; to show signs of something","examples":["it promises to be something It promises to be an exciting few days.","promise something There were dark clouds overhead promising rain.","The plan seemed to promise a new beginning.","It was a disappointing end to a season which had promised so much for the team.","The new drug promises to bring relief to thousands of asthma sufferers."],"opposite":"","synonyms":""},{"def":"used as a way of encouraging or warning somebody about something","examples":["I can promise you, you'll have a wonderful time.","If you don't take my advice, you'll regret it, I promise you."],"opposite":"","synonyms":""},{"def":"to make promises that will be impossible to keep","examples":["Politicians promise the earth before an election, but things are different afterwards."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"I (can) promise you","def":"used as a way of encouraging or warning somebody about something","examples":["I can promise you, you'll have a wonderful time.","If you don't take my advice, you'll regret it, I promise you."]},{"idiom":"promise (somebody) the earth/moon/world","def":"to make promises that will be impossible to keep","examples":["Politicians promise the earth before an election, but things are different afterwards."]}],"phrasal":[],"related":["Promise Keepers","a lick and a promise","promise (somebody) the earth/moon/world","promise (somebody) the moon/earth/world"]},{"pos":"noun","level":"A2","meanings":[{"def":"a statement that tells somebody that you will definitely do or not do something","examples":["to make/keep/fulfil/break a promise","You haven't gone back on your promise, have you?","He simply broke every single promise he ever made me.","The minister was under attack for a series of broken promises.","promise to do something She kept her promise to visit her aunt regularly.","He fulfilled a campaign promise to end the war.","promise to somebody He had now to deliver on his promises to the Canadian electorate.","promise from/by somebody These are empty promises from a party not in a position to honour them.","It is unlikely that these laws will be changed, despite promises by the Prime Minister.","promise of something The government failed to keep its promise of lower taxes.","They were lured by government promises of either money or other benefits.","promise (that…) Do I have your promise that you won't tell anyone about this?","I try not to make promises that I can't keep.","I won't be late. That's a promise!","I'll consider it, but I make no promises.","Politicians should be held to their promises.","She had obviously forgotten her promise to call me.","They've made all sorts of promises about reforming the health system.","We extracted a promise from them that they would repay the money by May.","He repeated his promise that there would be extra help for the poorest pensioners.","You gave me your promise I could use the car tonight.","promises of support"],"opposite":"","synonyms":""},{"def":"a sign that somebody/something will be successful","examples":["Her work shows great promise.","Their research holds considerable promise.","He failed to fulfil his early promise.","Their future was full of promise.","promise for something Stem cell research offers real promise for the treatment of currently incurable diseases.","She showed great promise as a runner.","a pianist of promise","The year began so full of promise, and ended in disappointment.","This new venture holds great promise for the future."],"opposite":"","synonyms":""},{"def":"a sign, or a reason for hope that something may happen, especially something good","examples":["The day dawned bright and clear, with the promise of warm, sunny weather.","The dog approached, attracted by the promise of food.","Organic food seems to hold out the promise of healthy living."],"opposite":"","synonyms":""},{"def":"the act of performing a task quickly and carelessly, especially of washing or cleaning something quickly","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a lick and a promise","def":"the act of performing a task quickly and carelessly, especially of washing or cleaning something quickly","examples":[]}],"phrasal":[],"related":[]}]