[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/promo/promote__us_1.mp3","phonsUS":"/prəˈməʊt/","level":"B1","meanings":[{"def":"to help sell a product, service, etc. or make it more popular by advertising it or offering it at a special price","examples":["promote something The band has gone on tour to promote their new album.","This trade fair will help businesses from Malawi to promote their products.","promote something as something The area is being promoted as a tourist destination.","The company's products have been promoted mainly through advertising in newspapers.","The new products have been very heavily promoted."],"opposite":"","synonyms":""},{"def":"to help something to happen or develop","examples":["to promote democracy/peace/understanding/health","I applaud his efforts to promote world peace.","to promote the development/use of something","policies to promote economic growth","a campaign to promote awareness of environmental issues","The exhibition was intended to promote interest in contemporary sculpture.","We think football can help to promote the idea of a multicultural and multiethnic society.","Vietnam has actively promoted foreign investment.","Bonus payments to staff serve to promote commitment to the company.","Human rights are strongly promoted by all our members.","The idea of equal opportunities was strongly promoted by many Labour MPs.","They claimed that the authorities had deliberately promoted and condoned the violence.","Young people's awareness of agricultural issues is promoted through publicity material.","The aim of the culture festival is to promote friendship between the two countries.","The church tries to promote racial harmony."],"opposite":"","synonyms":""},{"def":"to move somebody to a higher rank or more senior job","examples":["promote somebody She worked hard and was soon promoted.","promote somebody to something He has been promoted to sergeant.","promote somebody from something He was an experienced officer who had been promoted from the ranks.","promote somebody from something to something She was promoted from finance director to chief executive.","He was promoted from deputy minister to minister last year.","He was promoted to the rank of captain.","a recently promoted headteacher"],"opposite":"demote","synonyms":""},{"def":"to move a sports team from playing with one group of teams to playing in a better group","examples":["They were promoted to the First Division last season."],"opposite":"relegate","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]