[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/promo/promotion__us_1.mp3","phonsUS":"/prəˈməʊʃn/","level":"B2","meanings":[{"def":"a move to a more important job or rank in a company or an organization","examples":["The new job is a promotion for him.","promotion to something Her promotion to Sales Manager took everyone by surprise.","a job with excellent promotion prospects","If I can't get promotion soon, I'll look for another job.","She felt she had little chance of promotion in her job.","The company encourages internal promotion.","her promotion from assistant to associate professor","We congratulate Richard on his well-deserved promotion."],"opposite":"","synonyms":""},{"def":"a move by a sports team from playing in one group of teams to playing in a better group","examples":["the team’s promotion to the First Division","The team's chances of promotion took a knock when they lost at home.","With three matches remaining, there are six teams in the promotion race."],"opposite":"","synonyms":""},{"def":"activities done in order to increase the sales of a product or service; a set of advertisements for a particular product or service","examples":["Her job is mainly concerned with sales and promotion.","We are doing a special promotion of Chilean wines.","We're doing a major book promotion at key bookshops this week.","They ran advertisements on TV and on social media.","Dirty streets are no advertisement for a prosperous society.","She works in publicity.","There has been a lot of advance publicity for her new film.","We put an ad on that website.","an ad for a new chocolate bar","a special promotion of local products","She works in sales and promotion."],"opposite":"","synonyms":"advertisement"},{"def":"activity that encourages people to believe in the value or importance of something, or that helps something to succeed","examples":["a society for the promotion of religious tolerance","The new health promotion clinic will provide free check-ups."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["cross-promotion","self-promotion"]}]