[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/proof/proof__us_1.mp3","phonsUS":"/pruːf/","level":"B2","meanings":[{"def":"information, documents, etc. that show that something is true","examples":["conclusive/definitive/scientific proof","The police suspected him of dealing drugs, but they didn't have any proof.","to require/need proof","proof of something Can you provide any proof of identity?","Keep the receipt as proof of purchase.","These results are a further proof of his outstanding ability.","proof (that)… There is no proof that the knife belonged to her.","Today's unemployment figures are proof positive the government's economic plan isn't working.","In criminal cases the burden of proof (= requirement to provide proof) is on the prosecution.","plans to lower the standard of proof required to convict people of crimes under the Terrorism Act","We need conclusive proof before we can take this matter to court.","He is unlikely to make wild accusations without proof.","The men were acquitted for lack of proof.","I am living proof that the treatment works.","The photo was final proof of her husband's infidelity.","Her account gives us no concrete proof of his guilt.","Have you got any positive proof that she took the money?","I have no real proof that he was in the country at the time.","We have proof positive that he is in hiding."],"opposite":"","synonyms":""},{"def":"the process of testing whether something is true or a fact","examples":["Is the claim capable of proof?"],"opposite":"","synonyms":""},{"def":"a way of proving that a statement is true or that what you have calculated is correct","examples":[],"opposite":"","synonyms":""},{"def":"a copy of printed material which is produced so that mistakes can be corrected","examples":["She was checking the proofs of her latest novel."],"opposite":"","synonyms":""},{"def":"a standard used to measure the strength of alcoholic drinks","examples":[],"opposite":"","synonyms":""},{"def":"to show by your actions or qualities that a particular fact is true","examples":["These figures are living proof of the government's incompetence.","He is living proof that age is no barrier to new challenges."],"opposite":"","synonyms":""},{"def":"you can only judge if something is good or bad when you have tried it","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be living proof of something/that…","def":"to show by your actions or qualities that a particular fact is true","examples":["These figures are living proof of the government's incompetence.","He is living proof that age is no barrier to new challenges."]},{"idiom":"the proof of the pudding (is in the eating)","def":"you can only judge if something is good or bad when you have tried it","examples":[]}],"phrasal":[],"related":["page proof","future-proof","shatter-proof","tamper-proof","proof of concept","damp-proof course","burden of proof","damp-proof courses","be living proof of something/that…","the proof of the pudding (is in the eating)"]},{"pos":"adjective","level":"","meanings":[{"def":"that can resist the damaging or harmful effects of something","examples":["The sea wall was not proof against the strength of the waves."],"opposite":"","synonyms":""},{"def":"that can resist or protect against the thing mentioned","examples":["rainproof/windproof clothing","The car has childproof locks on the rear doors.","an inflation-proof pension plan"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to put a special substance on something, especially cloth, to protect it against water, fire, etc.","examples":["proofed canvas"],"opposite":"","synonyms":""},{"def":"to produce a test copy of a piece of printed work so that mistakes can be corrected","examples":["colour proofing"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]