[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/prope/proper__us_1.mp3","phonsUS":"/ˈprɑːpər/","level":"B1","meanings":[{"def":"right, appropriate or correct; according to the rules","examples":["We should have had a proper discussion before voting.","Please follow the proper procedures for dealing with complaints.","Manufacturers provide these directions to indicate the proper use of their products","It is vital that they're given the proper training.","The Government is failing to deliver proper care and treatment to people with dementia.","Nothing is in its proper place.","He is never referred to by his proper name in the play."],"opposite":"","synonyms":""},{"def":"that you consider to be real and of a good enough standard","examples":["I haven't had a proper meal in days.","Eat some proper food, not just toast and jam!","When are you going to get a proper job?"],"opposite":"","synonyms":""},{"def":"socially and morally acceptable","examples":["It is right and proper that parents take responsibility for their children's attendance at school.","The development was planned without proper regard to the interests of local people.","He is always perfectly proper in his behaviour.","It seemed proper to pay tribute to her in this way.","It was not considered proper for young ladies to go out alone.","She has a reputation for being prim and proper.","The tribunal decided that his actions were entirely proper.","I'll do whatever I think proper."],"opposite":"improper","synonyms":""},{"def":"according to the most exact meaning of the word","examples":["The celebrations proper always begin on the last stroke of midnight."],"opposite":"","synonyms":""},{"def":"complete","examples":["We're in a proper mess now."],"opposite":"","synonyms":""},{"def":"belonging to a particular type of thing; natural in a particular situation or place","examples":["They should be treated with the dignity proper to all individuals created by God."],"opposite":"","synonyms":""},{"def":"completely; to the greatest extent possible","examples":["That's messed things up good and proper."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"good and proper","def":"completely; to the greatest extent possible","examples":["That's messed things up good and proper."]}],"phrasal":[],"related":["proper noun","proper fraction","proper name","proper nouns","proper fractions"]}]