[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/propo/proportion__us_1.mp3","phonsUS":"/prəˈpɔːrʃn/","level":"B2","meanings":[{"def":"a part or share of a whole","examples":["Water covers a large proportion of the earth's surface.","Loam is a soil with roughly equal proportions of clay, sand and silt.","The proportion of regular smokers increases with age.","A significant proportion of the books have been translated from other languages.","A higher proportion of Americans go on to higher education than is the case in Britain.","A proportion of the land is used for agriculture.","The proportion of small cars on America’s roads is increasing.","A high proportion of five-year-olds have teeth in poor condition","The chart shows government spending expressed as a proportion of national income.","The unskilled section of the working class was diminishing as a proportion of the workforce."],"opposite":"","synonyms":""},{"def":"the relationship of one thing to another in size, amount, etc.","examples":["proportion of something to something The proportion of men to women in the college has changed dramatically over the years.","in the proportion… The basic ingredients are limestone and clay in the proportion 2:1.","in proportion to something The room is very long in proportion to (= relative to) its width.","According to this pie chart, a third of students’ leisure time is spent watching TV.","One in five hours is/​are spent socializing.","Socializing accounts for/makes up/comprises about 20 per cent of leisure time.","Students spend twice as much time playing computer games as doing sport.","Three times as many hours are spent playing computer games as reading.","The figure for playing computer games is three times higher than the figure for reading.","The largest proportion of time is spent playing computer games.","The cost of insurance increases in proportion to the performance of the car.","The human population in the region is expanding in inverse proportion to the wildlife."],"opposite":"","synonyms":""},{"def":"the correct relationship in size, degree, importance, etc. between one thing and another or between the parts of a whole","examples":["in proportion (to something) You haven't drawn the figures in the foreground in proportion.","out of proportion (with something) The head is out of proportion with the body.","an impressive building with fine proportions","There is an entrance hall of perfect proportions, twice as long as it is wide.","(figurative) Always try to keep a sense of proportion (= of the relative importance of different things)."],"opposite":"","synonyms":""},{"def":"the measurements of something; its size and shape","examples":["This method divides the task into more manageable proportions.","a food shortage that could soon reach crisis proportions","a room of fairly generous proportions"],"opposite":"","synonyms":""},{"def":"the equal relationship between two pairs of numbers, as in the statement ‘4 is to 8 as 6 is to 12’","examples":[],"opposite":"","synonyms":""},{"def":"to react to something in a sensible way and not think it is worse or more serious than it really is","examples":["The problem of hooliganism should be kept in proportion. Only a small number of young people act in this way."],"opposite":"","synonyms":""},{"def":"larger, more serious, etc. in relation to something than is necessary or appropriate","examples":["They earn salaries out of all proportion to their ability.","The media have blown the incident up out of all proportion.","The costs of the plan are out of proportion to the budget available.","The problem has been exaggerated out of all proportion."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"keep something in proportion","def":"to react to something in a sensible way and not think it is worse or more serious than it really is","examples":["The problem of hooliganism should be kept in proportion. Only a small number of young people act in this way."]},{"idiom":"out of (all) proportion (to something)","def":"larger, more serious, etc. in relation to something than is necessary or appropriate","examples":["They earn salaries out of all proportion to their ability.","The media have blown the incident up out of all proportion.","The costs of the plan are out of proportion to the budget available.","The problem has been exaggerated out of all proportion."]}],"phrasal":[],"related":[]}]