[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/propo/propose__us_2.mp3","phonsUS":"/prəˈpəʊz/","level":"B2","meanings":[{"def":"to suggest a plan, an idea, etc. for people to think about and decide on","examples":["propose something The government proposed changes to the voting system.","The Board of Directors is proposing an amendment to Article I.","The three countries had proposed a plan for him to hand over power to a chosen successor.","What would you propose?","Other services will not be affected by the proposed legislation.","It is one of several proposed hospital developments around town.","Since the idea was first proposed, no action has been taken.","a proposed reform/rule/law/project","This year we propose a tax increase of 3.9 percent.","propose that… She proposed that the book be banned.","(British English also) She proposed that the book should be banned.","it is proposed that… It was proposed that the president be elected for a period of two years.","propose doing something He proposed changing the name of the company.","it is proposed to do something It was proposed to pay the money from public funds.","The measures have been proposed as a way of improving standards.","The plan originally proposed was ruled completely unrealistic.","the newly proposed amendments","She proposed a reduction in the state president's powers.","The proposed trip to Spain had to be cancelled at the last minute.","Are you seriously proposing that we should allow this situation to continue?"],"opposite":"","synonyms":""},{"def":"to intend to do something","examples":["propose to do something What do you propose to do now?","propose doing something How do you propose getting home?","We do not propose to take any further action in the matter."],"opposite":"","synonyms":""},{"def":"to ask somebody to marry you","examples":["He was afraid that if he proposed she might refuse.","propose to somebody She proposed to me!","propose something (to somebody) to propose marriage"],"opposite":"","synonyms":""},{"def":"to suggest something at a formal meeting and ask people to vote on it","examples":["propose somebody (for/as something) I propose Tom Ellis for chairman.","He was proposed for the job of treasurer.","propose something to propose a motion (= to be the main speaker in support of an idea at a formal debate)"],"opposite":"","synonyms":""},{"def":"to suggest an explanation of something for people to consider","examples":["She proposed a possible solution to the mystery."],"opposite":"","synonyms":""},{"def":"to ask people to wish somebody health, happiness and success by raising their glasses and drinking","examples":["I'd like to propose a toast to the bride and groom."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"propose a toast (to somebody) | propose somebody’s health","def":"to ask people to wish somebody health, happiness and success by raising their glasses and drinking","examples":["I'd like to propose a toast to the bride and groom."]}],"phrasal":[],"related":["propose somebody’s health","propose a toast (to somebody)"]}]