[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/prosp/prospect__us_1.mp3","phonsUS":"/ˈprɑːspekt/","level":"B2","meanings":[{"def":"the possibility that something will happen","examples":["prospect of something There is no immediate prospect of peace.","They faced the prospect of defeat in the elections.","There was insufficient evidence for a realistic prospect of conviction.","It's a move that raises the prospect of a takeover battle for the airline.","prospect of doing something Her family is having to come to terms with the increasingly unlikely prospect of ever finding her.","prospect (that)… There's a reasonable prospect that his debts will be paid.","in prospect A place in the semi-finals is in prospect (= likely to happen).","There is little prospect of any improvement in the weather.","Major developments are in prospect for the company."],"opposite":"","synonyms":""},{"def":"an idea of what might or will happen in the future","examples":["an exciting prospect","Travelling alone around the world is a daunting prospect.","prospect of something Her heart sank at the prospect of marriage to a man she loathed.","prospect of doing something The prospect of becoming a father filled him with alarm.","I don't relish the prospect of having to share an office.","I'm very excited at the prospect of joining the team."],"opposite":"","synonyms":""},{"def":"the chances of being successful","examples":["good job/employment/career prospects","industries with excellent growth prospects","At 25 he was an unemployed musician with no prospects.","prospects for something Long-term prospects for the economy have improved.","The war undermines future prospects for economic growth.","prospects of something Their prospects of success are slight.","What are the prospects of promotion in this job?","We are highly optimistic about the future prospects of the company.","Getting the right qualifications will enhance your employment prospects.","Their prospects of employment look better than last year.","This position offers a good starting salary and excellent promotion prospects."],"opposite":"","synonyms":""},{"def":"a person who is likely to be successful in a competition or in a particular career","examples":["She is one of Canada's best prospects for a gold medal.","a list of the hot new prospects on the literary scene"],"opposite":"","synonyms":""},{"def":"a wide view of an area of land, etc.","examples":["a delightful prospect of the lake"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to search an area for gold, minerals, oil, etc.","examples":["Thousands moved to the area to prospect for gold.","(figurative) to prospect for new clients"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]