[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/prote/protect__us_1.mp3","phonsUS":"/prəˈtekt/","level":"A2","meanings":[{"def":"to make sure that somebody/something is not harmed, injured, damaged, etc.","examples":["protect somebody/something/yourself to protect children/citizens/civilians/consumers/workers","Our aim is to protect the jobs of our members.","the section of the treaty that protects the rights of employees","Each company is fighting to protect its own commercial interests.","A majority of Democrats believe that such regulations protect the public.","protect somebody/something/yourself against something Troops have been sent to protect aid workers against attack.","protect somebody/something/yourself from something They huddled together to protect themselves from the wind.","protect against something a paint that helps protect against rust","protect from something Vitamin B12 may have a role in protecting from heart disease.","He felt it was his duty to protect the child.","Keep the camera well protected at all times.","a cream that helps to protect your skin against the sun","Protect the exposed areas of wood with varnish.","Some pieces of music are protected by copyright.","a star who jealously protects her right to privacy","a constitutionally protected right of freedom of speech","The equality of women is protected under law.","The new measures are designed to protect the public from people like these."],"opposite":"","synonyms":""},{"def":"to introduce laws that make it illegal to kill, harm or damage a particular animal, area of land, building, etc.","examples":["a protected area/species","the need to protect the environment","to be protected by something Polar bears have been protected by law in Norway since 1973.","The plant is protected under the Wildlife and Countryside Act.","Many of these sites—of immense scientific interest—are not legally protected.","a federally protected game preserve"],"opposite":"","synonyms":""},{"def":"to help an industry in your own country by taxing goods from other countries so that there is less competition","examples":["protected markets","The Far Eastern markets are heavily protected.","We must take steps to protect the UK as a manufacturing base."],"opposite":"","synonyms":""},{"def":"to provide somebody/something with insurance against fire, injury, damage, etc.","examples":["Many policies do not protect you against personal injury."],"opposite":"","synonyms":""},{"def":"to limit access to data, a web page, etc., for example by using passwords or encryption (= special codes)","examples":["Security products are designed to protect information from unauthorized access.","All these pages are password-protected."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["write-protect","Campaign to Protect Rural England"]}]