[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/prote/protection__us_2.mp3","phonsUS":"/prəˈtekʃn/","level":"B2","meanings":[{"def":"the act of protecting somebody/something; the state of being protected","examples":["protection against something Wear clothes that provide adequate protection against the wind and rain.","protection from something His straw hat offered some protection from the sun.","protection of somebody/something (against/from something) We seek to ensure the protection of human rights.","the conservation and protection of the environment","protection for somebody/something (against/from something) They are campaigning for better protection for workers.","for protection She carries a gun in her bag for personal protection.","under protection He asked to be put under police protection.","under the protection of somebody/something These people remain under the protection of the United Nations.","data protection laws","the importance of environmental protection","A helmet affords the cyclist some degree of protection against injury.","Animal protection supporters gathered to protest against hunting.","Fire protection equipment must be available on all floors.","Governments must provide protection for their workers.","Many British wild animals are now under the protection of the Wildlife and Countryside Act.","She was put into a psychiatric hospital for her own protection.","The couple were found guilty of violation of child protection laws.","The high walls give the garden protection from the wind.","The site is under the protection of UNESCO.","The skunk releases a pungent smell as a means of protection.","a witness-protection program","sun protection products"],"opposite":"","synonyms":""},{"def":"a thing that protects somebody/something against something","examples":["protection against something The plastic sheeting is not a complete protection against the rain.","protection from something The trench served as a protection from enemy gunfire.","as (a) protection He wears a helmet as protection.","as (a) protection against/from something Fill the cooling system with antifreeze as a protection against frost.","They wore the charm as a protection against evil spirits."],"opposite":"","synonyms":""},{"def":"insurance against fire, injury, damage, etc.","examples":["Our policy offers complete protection against fire and theft."],"opposite":"","synonyms":""},{"def":"the system of helping an industry in your own country by taxing foreign goods","examples":["The government is ready to introduce protection for the car industry."],"opposite":"","synonyms":""},{"def":"the system of paying criminals so that they will not attack your business or property","examples":["to pay protection money","to run a protection racket"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["data protection","protection order","Data Protection Act","Environmental Protection Agency","Royal Society for the Protection of Birds","protection orders","sun protection factor"]}]