[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/proud/proud__us_1.mp3","phonsUS":"/praʊd/","level":"B1","meanings":[{"def":"feeling pleased and satisfied about something that you own or have done, or are connected with","examples":["proud parents","the proud owner of a new car","The girls have made me extremely proud.","proud of somebody/something/yourself Your achievements are something to be proud of.","Barry was proud of the fact that he had never missed a day's work in his life.","proud of somebody/something/yourself for doing something He was proud of himself for not giving up.","proud to be/do something I feel very proud to be a part of the team.","I'm proud to say it's now been 17 days since I last smoked.","We are proud to present this award to you.","proud (that)… She was proud that her daughter had so much talent.","He was glad he’d come.","She was glad when the meeting was over.","We are happy to announce the engagement of our daughter.","She was very pleased with her exam results.","You’re coming? I’m so pleased.","I’m delighted at your news.","proud parents","He was proud of himself for not giving up.","You’ll be relieved to know your jobs are safe.","I was thrilled to be invited.","He seemed almost proud of his practical incompetence.","He was not vain, but he was quietly proud of his achievements.","He was tremendously proud of himself.","Londoners have long been perversely proud of a health service that does not serve them well.","She was fiercely proud of family traditions and continuity.","We are all really proud of you!"],"opposite":"","synonyms":"glad"},{"def":"causing somebody to feel proud","examples":["This is the proudest moment of my life.","It was a proud day in the nation’s history","The car had been his proudest possession."],"opposite":"","synonyms":""},{"def":"feeling that you are better and more important than other people","examples":["She comes across as proud and arrogant.","He was too proud now to be seen with his former friends."],"opposite":"","synonyms":""},{"def":"having respect for yourself and not wanting to lose the respect of others","examples":["They were a proud and independent people.","Don't be too proud to ask for help.","What has become of this once proud nation?"],"opposite":"","synonyms":""},{"def":"beautiful, tall and impressive","examples":["The sunflowers stretched tall and proud to the sun."],"opposite":"","synonyms":""},{"def":"very proud/pleased","examples":["Now he's passed his driving test, he's as proud as Punch."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"(as) proud/pleased as Punch","def":"very proud/pleased","examples":["Now he's passed his driving test, he's as proud as Punch."]}],"phrasal":[],"related":["house-proud","do somebody proud","do yourself/somebody proud","(as) pleased/proud as Punch"]},{"pos":"adverb","level":"","meanings":[{"def":"to treat somebody very well by giving them a lot of good food, entertainment, etc.","examples":["The college did us proud at the centenary dinner."],"opposite":"","synonyms":""},{"def":"to do something that makes you proud of yourself or that makes other people proud of you","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"do somebody proud","def":"to treat somebody very well by giving them a lot of good food, entertainment, etc.","examples":["The college did us proud at the centenary dinner."]},{"idiom":"do yourself/somebody proud","def":"to do something that makes you proud of yourself or that makes other people proud of you","examples":[]}],"phrasal":[],"related":[]}]