[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/provi/provision__us_1.mp3","phonsUS":"/prəˈvɪʒn/","level":"C1","meanings":[{"def":"the act of supplying somebody with something that they need or want; something that is supplied","examples":["housing provision","The government is responsible for the provision of healthcare.","There is no provision for anyone to sit down here.","The provision of specialist teachers is being increased.","Several companies are responsible for the provision of cleaning services."],"opposite":"","synonyms":""},{"def":"preparations that you make for something that might or will happen in the future","examples":["He had already made provisions for (= planned for the financial future of) his wife and children before the accident.","You should make provision for things going wrong.","Small businesses are advised to make adequate provisions against bad debts.","The plans for developing the area include provision for both water and field sports.","You need to make adequate provision for your retirement.","The company had made provisions against falls in land prices.","They had made all kinds of provisions against bad weather."],"opposite":"","synonyms":""},{"def":"supplies of food and drink, especially for a long journey","examples":["We have enough provisions to last us two weeks.","We went into town to stock up on provisions."],"opposite":"","synonyms":""},{"def":"a condition or an arrangement in a legal document","examples":["The same provisions apply to foreign-owned companies.","under the provisions of something Under the provisions of the lease, the tenant is responsible for repairs.","The Act contains detailed provisions for appeal against the court's decision.","provisions contained in the contract","Specific provisions had been made for foreign nationals."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["sunset provision"]},{"pos":"verb","level":"","meanings":[{"def":"to supply somebody/something with enough of something, especially food, to last for a particular period of time","examples":["The main business of the port is to provision passing ocean liners."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]