[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pro/prove/prove__us_1.mp3","phonsUS":"/pruːv/","level":"B1","meanings":[{"def":"to use facts, evidence, etc. to show that something is true","examples":["prove something They hope this new evidence will prove her innocence.","‘I know you're lying.’ ‘Prove it!’","He felt he needed to prove his point (= show other people that he was right).","Are you just doing this to prove a point?","What are you trying to prove?","I certainly don't have anything to prove—my record speaks for itself.","The prosecution has failed to prove its case.","She continued to prove her worth to the team.","prove something to somebody Just give me a chance and I'll prove it to you.","prove (that)… This proves (that) I was right.","prove somebody/something/yourself + adj./noun She was determined to prove everyone wrong.","In this country, you are innocent until proved guilty.","prove somebody/something/yourself to be/have something You've just proved yourself to be a liar.","prove what, how, etc… This just proves what I have been saying for some time.","it is proved that… Can it be proved that he did commit these offences?","There is clear evidence that TV advertising influences what children buy.","It is clear from numerous studies that TV advertising influences what children buy.","Recent research demonstrates that TV advertising influences children’s spending habits.","Many parents think that TV advertising influences their children. This view is supported by the findings of a recent study, which show a clear link between television advertisements and children’s spending habits.","The findings also reveal that most children are unaware of the persuasive purpose of advertising.","There is little evidence that children understand the persuasive intent of advertising.","The results contradict claims that advertising is unrelated to children’s spending habits.","Manufacturers argue that it is difficult to prove that advertising alone influences what children buy.","He tried to prove his theory to his friends.","The deaths are being treated as suspicious until we can prove otherwise.","This theory cannot be proved scientifically.","The prosecution must prove guilt beyond reasonable doubt.","I'm delighted he proved so many people wrong."],"opposite":"disprove","synonyms":""},{"def":"if something proves dangerous, expensive, etc. or if it proves to be dangerous, etc., you discover that it is dangerous, etc. over a period of time","examples":["+ adj. The strategy has proved successful.","The new system has proved popular with our clients.","It was proving extremely difficult to establish the truth.","I have some information that may prove useful.","The opposition proved too strong for him.","+ noun The play proved a great success.","Shares in the industry proved a poor investment.","His lack of experience may prove a problem in a crisis.","prove to be something The promotion proved to be a turning point in his career.","Their fears proved to be groundless."],"opposite":"","synonyms":""},{"def":"to show other people how good you are at doing something or that you are capable of doing something","examples":["prove yourself to somebody He constantly feels he has to prove himself to others.","prove yourself She wants a chance to prove herself."],"opposite":"","synonyms":""},{"def":"to show other people that you are a particular type of person or that you have a particular quality","examples":["prove yourself + adj./noun He proved himself determined to succeed.","prove yourself to be something She proved herself to be a skilful negotiator."],"opposite":"","synonyms":""},{"def":"to swell (= become larger or rounder) before being baked because of the action of yeast","examples":[],"opposite":"","synonyms":""},{"def":"people say that something is the exception that proves the rule when they are stating something that seems to be different from the normal situation, but they mean that the normal situation remains true in general","examples":["Most electronics companies have not done well this year, but ours is the exception that proves the rule."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the exception that proves the rule","def":"people say that something is the exception that proves the rule when they are stating something that seems to be different from the normal situation, but they mean that the normal situation remains true in general","examples":["Most electronics companies have not done well this year, but ours is the exception that proves the rule."]}],"phrasal":[],"related":[]}]