[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pub/publi/publish__us_1.mp3","phonsUS":"/ˈpʌblɪʃ/","level":"A2","meanings":[{"def":"to produce a book, magazine, CD-ROM, etc. and sell it to the public","examples":["to publish a book/novel/magazine/paper","The first edition was published in 2007.","He works for a company that publishes reference books.","Most of our titles are also published on CD-ROM.","The book was first published in 1960.","This essay was originally published in German.","Many plays were published anonymously.","Her books have never been widely published in the US.","Her last book was published posthumously in 1948.","a newly published series of essays"],"opposite":"","synonyms":""},{"def":"to print a letter, an article, etc. in a newspaper or magazine","examples":["publish something to publish a story/letter/comment/review","to publish an article/interview","publish something in something Pictures of the suspect were published in all the daily papers.","The editors published a full apology in the following edition."],"opposite":"","synonyms":""},{"def":"to make information available to the public","examples":["to publish work/research/results","The findings of the committee will be published on Friday.","The study was published online.","publish something on something according to the information published on their website","The report will be published on the internet.","The team's report will be published in the journal on 18 August.","This data set is based on a previously published report."],"opposite":"","synonyms":""},{"def":"to have your work printed and sold to the public","examples":["University teachers are under pressure to publish.","publish on something He has published extensively on medieval education.","publish something She hasn't published anything for years.","She has recently published her memoirs."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["publish or perish","publish and be damned"]}]