[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pun/punis/punishment__us_1.mp3","phonsUS":"/ˈpʌnɪʃmənt/","level":"B1","meanings":[{"def":"an act or a way of punishing somebody","examples":["to inflict/impose/mete out punishment","to deserve/face/escape punishment","punishment for something What is the punishment for murder?","I felt sure that it was a punishment for my sin.","punishment for doing something Punishments for killing the king's deer were severe.","There is little evidence that harsher punishments deter any better than more lenient ones.","The punishment should fit the crime.","as (a) punishment He was sent to his room as a punishment.","She had to tidy the classroom as punishment for being late.","punishment of somebody new approaches to the punishment of offenders","He was compelled on pain of punishment to answer the question.","Take your punishment like a man.","They use a system of reward and punishment to discipline their children.","He believed that certain forms of physical punishment could be effective in some cases.","The refugees could not return without fear of punishment."],"opposite":"","synonyms":""},{"def":"rough treatment","examples":["The carpet by the door takes the most punishment."],"opposite":"","synonyms":""},{"def":"a category of very severe punishment that is banned under US law","examples":["This important case confronts the issue of what constitutes cruel and unusual punishment.","Detainees are subjected to malnutrition, forced labor, and to other cruel and unusual punishments."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"cruel and unusual punishment","def":"a category of very severe punishment that is banned under US law","examples":["This important case confronts the issue of what constitutes cruel and unusual punishment.","Detainees are subjected to malnutrition, forced labor, and to other cruel and unusual punishments."]}],"phrasal":[],"related":["capital punishment","corporal punishment","cruel and unusual punishment"]}]