[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/pur/purch/purchase__us_1.mp3","phonsUS":"/ˈpɜːrtʃəs/","level":"B2","meanings":[{"def":"to buy something","examples":["purchase something Please ensure that you purchase your ticket in advance.","to purchase an item/a product","to purchase a property/home","We recently purchased a home just outside Las Vegas.","purchase something from somebody The equipment can be purchased from your local supplier.","The tickets can only be purchased in advance from our website.","purchase something for something They purchased the land for $1 million.","(figurative) Victory was purchased (= achieved) at too great a price.","They purchased the house from an elderly couple.","Tickets can be purchased online.","The land was compulsorily purchased from the owner to make way for the new road."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["hire purchase","purchase tax","purchase price","compulsory purchase","Gadsden Purchase","Louisiana Purchase","purchase taxes","impulse purchase","Advanced Purchase Excursion"]},{"pos":"noun","level":"B2","meanings":[{"def":"the act or process of buying something","examples":["to make a purchase (= buy something)","Keep your receipt as proof of purchase.","The company would not reveal the original purchase price of the stores.","Many developers were delaying the purchase of land until later in the year.","The company has just announced its £27 million purchase of Park Hotel.","An illustrated catalogue is available for purchase.","purchase from somebody/something Our intention is to increase purchases from local suppliers.","purchase by somebody Such massive purchases by single investors were extremely rare.","Companies are moving away from outright purchase of company cars to leasing.","Consumers make a lot of impulse purchases.","I did not notice the defects at the time of purchase.","Ticket holders should return to the point of purchase for a refund.","Make sure all online purchases are made through a secure server.","You can resell books and cut the original cost of purchase.","The company uses software to analyse consumer purchases.","the bulk purchase of paper"],"opposite":"","synonyms":""},{"def":"something that you have bought","examples":["major purchases, such as a new car","Figures suggest that consumers return one in five online purchases.","If you are not satisfied with your purchase we will give you a full refund."],"opposite":"","synonyms":""},{"def":"a strong hold on something with the hands or feet, for example when you are climbing","examples":["She tried to get a purchase on the slippery rock."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]