[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/p/puz/puzzl/puzzle__us_1.mp3","phonsUS":"/ˈpʌzl/","level":"B2","meanings":[{"def":"a game, etc. that you have to think about carefully in order to answer it or do it","examples":["a crossword puzzle","a book of puzzles for children"],"opposite":"","synonyms":""},{"def":"something that is difficult to understand or explain","examples":["The deeper meaning of the poem remains a puzzle.","The detectives were beginning to solve the murder. All the pieces in the puzzle were falling neatly into place.","The origin of the word is something of a puzzle.","The puzzle remains of what happened to the ship.","There is a puzzle about how the plant first came to Britain.","The police didn't know what the message meant, but it was another piece in the puzzle.","They're trying to solve the puzzle of how gravity works.","Traces of explosives found among the wreckage were the key to the puzzle.","They knew who the killer was, but there were still some gaps in the puzzle."],"opposite":"","synonyms":""},{"def":"a picture printed on cardboard (= very thick, stiff card) or wood, that has been cut up into a lot of small pieces of different shapes that you have to fit together again","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["puzzle out","puzzle over","monkey puzzle","jigsaw puzzle","crossword puzzle","monkey puzzle tree","puzzle something","puzzle over something"]},{"pos":"verb","level":"","meanings":[{"def":"to make somebody feel confused because they do not understand something","examples":["What puzzles me is why he left the country without telling anyone.","This question has puzzled scientists for decades.","This is something that has always puzzled me greatly.","How they recognized you is what puzzles me.","It has always puzzled me that he hasn't won more tournaments."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["puzzle out","puzzle over"],"related":[]}]