[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/q/qua/quali/qualification__us_4.mp3","phonsUS":"/ˌkwɑːlɪfɪˈkeɪʃn/","level":"B1","meanings":[{"def":"an exam that you have passed or a course of study that you have successfully completed","examples":["academic/educational/professional/vocational qualifications","a coaching/teaching/nursing qualification","He left school with no formal qualifications.","to have qualifications","to gain/get/obtain/possess/achieve qualifications","In this job, experience counts for more than paper qualifications.","qualification in something Too many school-leavers lack basic qualifications in English and Maths.","Many of those selected lack the academic qualifications to teach.","Only two of the applicants had the necessary qualifications.","The aim of the reform is to give more status to vocational qualifications."],"opposite":"","synonyms":""},{"def":"a skill or type of experience that you need for a particular job or activity","examples":["What qualifications do radio presenters require?","qualification for something Previous teaching experience is a necessary qualification for this job."],"opposite":"","synonyms":""},{"def":"information that you add to a statement to limit the effect that it has or the way it is applied","examples":["I accept his theories, but not without certain qualifications.","The plan was approved without qualification.","I agree with his view, with a few qualifications.","The committee supported her proposal, without qualification.","The term ‘population’ as used here requires qualification."],"opposite":"","synonyms":""},{"def":"the fact of passing an exam, completing a course of training or reaching the standard necessary to do a job or take part in a competition","examples":["Nurses in training should be given a guarantee of employment following qualification.","A victory in this game will earn them qualification for the World Cup.","The job usually has a three-year qualification period.","a qualification programme in business management","the minimum entry qualification for admission"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]