[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/q/qua/quali/qualify__us_1.mp3","phonsUS":"/ˈkwɑːlɪfaɪ/","level":"B1","meanings":[{"def":"to reach the standard of ability or knowledge needed to do a particular job, for example by completing a course of study or passing exams","examples":["How long does it take to qualify?","qualify as something He qualified as a doctor last year.","qualify in something She spent seven years qualifying in law."],"opposite":"","synonyms":""},{"def":"to give somebody the skills and knowledge they need to do something","examples":["qualify somebody for something This training course will qualify you for a better job.","qualify somebody to do something The test qualifies you to drive heavy vehicles."],"opposite":"","synonyms":""},{"def":"to be of a high enough standard to enter a competition; to defeat another person or team in order to enter or continue in a competition","examples":["He failed to qualify.","qualify for something South Korea qualified for the finals when they beat Italy 6–1.","They qualified for the World Cup."],"opposite":"","synonyms":""},{"def":"to have or give somebody the right to do something","examples":["To qualify, you must have lived in this country for at least three years.","qualify for something If you live in the area, you qualify for a parking permit.","In order to qualify for scholarships, students must demonstrate potential for academic excellence.","qualify somebody Your educational background, interests and family history are some of the things that might qualify you.","qualify somebody for something Paying a fee doesn't automatically qualify you for membership.","You will automatically qualify for a pension.","people who qualify for the grant on the grounds of disability","Membership of the scheme qualifies you for the discount.","You have to be over 60 to qualify."],"opposite":"","synonyms":""},{"def":"to have the right qualities to be described as a particular thing","examples":["qualify (as something) Do you think this dress qualifies as evening wear?","qualify something (as something) It's an old building, but that doesn't qualify it as an ancient monument!"],"opposite":"","synonyms":""},{"def":"to add something to a previous statement to make the meaning less strong or less general","examples":["I want to qualify what I said earlier—I didn't mean he couldn't do the job, only that he would need supervision."],"opposite":"","synonyms":""},{"def":"to describe another word in a particular way","examples":["In ‘the open door’, ‘open’ is an adjective qualifying ‘door’."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]