[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/q/qua/quali/quality__us_2.mp3","phonsUS":"/ˈkwɑːləti/","level":"A2","meanings":[{"def":"the standard of something when it is compared to other things like it; how good or bad something is","examples":["Improving the quality of care for nursing home residents is a priority.","When costs are cut product quality suffers.","of… quality The soil here is of poor quality.","The food is fresh and of good quality.","His goal was of top quality.","goods of a high quality","high-quality goods","in quality a decline in water quality","We have seen a marked improvement in the quality of service provided.","The technique is used to enhance the quality of photographs.","Budget cuts are affecting the quality of education for some students.","All our cakes are made with top quality ingredients.","Use the highest quality ingredients you can find.","The photos are of variable quality.","Most of the goods on offer are of very poor quality."],"opposite":"","synonyms":""},{"def":"a high standard","examples":["We aim to provide quality at reasonable prices.","They need to decrease costs while maintaining quality.","of quality contemporary writers of quality","Get it right, even if it takes time; it's quality not quantity that matters.","We offer unbeatable performance and quality in all our products.","How can we increase production without sacrificing quality?"],"opposite":"","synonyms":""},{"def":"a thing that is part of a person’s character, especially something good","examples":["personal qualities such as honesty and generosity","to have leadership qualities","She has all the qualities of a good teacher.","It's hard to find people with the right qualities for the job.","He has a lot of good qualities.","He showed great energy and leadership qualities.","I found him thoroughly unpleasant, with no redeeming qualities whatsoever."],"opposite":"","synonyms":""},{"def":"a feature of somebody/something, especially one that makes them different from somebody/something else","examples":["the special quality of light and shade in her paintings","His voice has a rich, melodic quality.","The ancient city of Assisi has a wonderful magical quality.","The music gives the movie a dreamlike quality.","They have real star quality.","a singer with that elusive quality that sells records"],"opposite":"","synonyms":""},{"def":"a newspaper that deals seriously with issues and has a high standard of editing and comment","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["air quality","quality time","quality assurance","quality control","quality newspaper","quality of life","total quality management","quality newspapers"]},{"pos":"adjective","level":"","meanings":[{"def":"used especially by people trying to sell goods or services to say that something is of a high quality","examples":["We specialize in quality furniture.","quality service at a competitive price","Try our top range of quality products.","We offer a quality service to all customers."],"opposite":"","synonyms":""},{"def":"very good","examples":["‘What was the film like?’ ‘Quality!’"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]