[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/q/qua/quart/quarter__us_3.mp3","phonsUS":"/ˈkwɔːrtər/","level":"A1","meanings":[{"def":"one of four equal parts of something","examples":["quarter of something a quarter of an hour/a century","a quarter of a mile/million","Almost a quarter of respondents reported employment discrimination.","three quarters of all potential customers","The programme lasted an hour and a quarter.","Cut the apple into quarters.","The theatre was about three quarters full.","(especially North American English) He completed his last work a quarter century ago.","Cut the apple into quarters.","Two halves make a whole.","I’ve been waiting here for a whole hour.","Half (of) the work is already finished.","They spent half the time looking for a parking space.","Her house is half a mile down the road.","I waited for half an hour.","I waited for a half an hour.","This meal is only half cooked."],"opposite":"","synonyms":""},{"def":"a period of 15 minutes either before or after every hour","examples":["It’s (a) quarter to four now—I’ll meet you at (a) quarter past.","(North American English also) It's quarter of four now—I'll meet you at quarter after."],"opposite":"","synonyms":""},{"def":"a period of three months, used especially as a period for which bills are paid or a company’s income is calculated","examples":["The rent is due at the end of each quarter.","Our gas bill for the last quarter was much higher than usual.","Sales were down 10% in the first quarter of 2009.","Profits fell during the third quarter.","the current fiscal quarter","six consecutive quarters of improved earnings"],"opposite":"","synonyms":""},{"def":"a district or part of a town","examples":["the historic quarter of the city","As a student in Paris, she loved the Latin quarter.","The robbery took place in a normally quiet quarter of the town."],"opposite":"","synonyms":""},{"def":"a person or group of people, especially as a source of help, information or a reaction","examples":["Support for the plan came from an unexpected quarter.","The news was greeted with dismay in some quarters.","The move was met with complaints from all quarters (= from everyone).","The problem was being discussed in all quarters.","There was no comment from official quarters on the allegations."],"opposite":"","synonyms":""},{"def":"a coin of the US and Canada worth 25 cents","examples":[],"opposite":"","synonyms":""},{"def":"rooms that are provided for soldiers, servants, etc. to live in","examples":["We were moved to more comfortable living quarters.","the servants'/officers' quarters","He was confined to quarters as a punishment.","The corporal and his family lived in married quarters.","the president's private quarters"],"opposite":"","synonyms":""},{"def":"the period of time twice a month when we can see a quarter of the moon","examples":["The moon is in its first quarter."],"opposite":"","synonyms":""},{"def":"one of the four periods of time into which a game of American football is divided","examples":["Ford scored the winning touchdown early in the fourth quarter."],"opposite":"","synonyms":""},{"def":"a unit for measuring weight, a quarter of a pound; 4 ounces","examples":[],"opposite":"","synonyms":""},{"def":"a unit for measuring weight, 28 pounds in the UK or 25 pounds in the US; a quarter of a hundredweight","examples":[],"opposite":"","synonyms":""},{"def":"kind treatment of an enemy or opponent who is in your power","examples":["His rivals knew that they could expect no quarter from such a ruthless adversary."],"opposite":"","synonyms":""},{"def":"very near","examples":["fighting at close quarters"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"at/from close quarters","def":"very near","examples":["fighting at close quarters"]}],"phrasal":[],"related":["quarter day","quarter-final","Quarter Horse","quarter note","quarter-tone","three-quarter","quarter-finalist","quarter sessions","French Quarter","quarter days","quarter notes","quarter-tones","quarter-finals","Quarter Horses","quarter-finalists"]},{"pos":"verb","level":"","meanings":[{"def":"to cut or divide something into four parts","examples":["She peeled and quartered an apple."],"opposite":"","synonyms":""},{"def":"to provide somebody with a place to eat and sleep","examples":["The soldiers were quartered in the town."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]