[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/q/que/quest/question__us_4.mp3","phonsUS":"/ˈkwestʃən/","level":"A1","meanings":[{"def":"a sentence, phrase or word that asks for information","examples":["You didn't answer my question.","You will have the opportunity to ask questions.","Does anyone have any questions?","(formal) I would now like to pose two questions:…","That's a very interesting question.","The question is, how much are they going to pay you?","The big question is, why did they do it?","(formal) The question arises as to whether or not he knew of the situation.","question of something The key question of what caused the leak remains unanswered.","question about something Can I ask you a question about your first novel?","(formal) He put a question to the minister about the recent reforms.","I hope the police don't ask any awkward questions.","This is a difficult question to answer.","The short answer to your question is yes.","The government doesn’t have the answers to these difficult questions.","In an interview try to ask open questions that don't just need ‘Yes’ or ‘No’ as an answer.","I paid cash, no questions asked.","There will be time for questions at the end, if you'd like to save them up till then.","If you don't mind, we'll take all of your questions at the end of the presentation.","We've set aside/​We're saving the last 15 minutes for questions.","If you have questions, please feel free to ask them as we go along.","That's an interesting point. Perhaps I can answer it like this…","I'm not sure I understand your question.","If I understand your question correctly, what you're asking is…","That's something we probably need to look into further.","Does that answer your question?","I hope that answers your question.","Can I come back to that point later?","Does anyone have any questions for our speaker?","Don't be afraid to ask questions as to why things are done in the way they are.","He became embarrassed when a journalist asked him pointed questions about his finances.","She refused to answer questions about her private life.","He easily evaded all the interviewer's most probing questions.","I need to phrase my question rather carefully.","I wanted to find out how old he was without asking him a direct question.","Only one question remains unanswered.","The chairperson fielded technical questions that she could not answer herself.","The former minister faced questions concerning his role in the affair.","The interview panel fired questions at me from all angles.","The children bombarded us with questions.","These photos pose the question: where are they now?"],"opposite":"","synonyms":""},{"def":"a task or request for information that is intended to test your knowledge or understanding, for example in an exam or a competition","examples":["Question 3 was very difficult.","I couldn't do Question 6.","You must answer all ten questions.","question on something In the exam there's sure to be a question on energy."],"opposite":"","synonyms":""},{"def":"a matter or topic that needs to be discussed or dealt with","examples":["This is an issue that raises many important questions.","question of something Let's look at the question of security.","Finally we shall deal with the question of cost.","The question that needs to be addressed is one of funding.","question about something Questions remain about how she was appointed.","The case raises serious questions about the company's conduct.","Which route is better remains an open question (= it is not decided).","The film doesn't answer all the questions it raises.","The research is asking the wrong questions.","The new play poses some challenging questions.","We come now to the vexed question of pension rights.","I would like to address the question of the relationship between a prison and the community."],"opposite":"","synonyms":""},{"def":"doubt or not being certain about something","examples":["His suitability for the job is open to question.","beyond question Her honesty is beyond question.","without question Her version of events was accepted without question.","This case brings into question the whole purpose of the law.","The authenticity of the painting has been thrown into question.","The safety of the system has recently come into question.","His ability has never been called into question.","question as to/about something I did have some questions as to his motive in coming.","She's a great dancer, there's no question about that.","It was, without question, the worst day of my life.","There is no question about her enthusiasm for the job.","The incident brought into question the safety of travellers in the region."],"opposite":"","synonyms":""},{"def":"to make somebody want to ask a question that has not yet been answered","examples":["All of which begs the question as to who will fund the project."],"opposite":"","synonyms":""},{"def":"to talk about something as if it were definitely true, even though it might not be","examples":["These assumptions beg the question that children learn languages more easily than adults."],"opposite":"","synonyms":""},{"def":"used to show that you do not know the answer to a question","examples":["‘How much is all this going to cost?’ ‘Good question!’"],"opposite":"","synonyms":""},{"def":"that is being discussed","examples":["On the day in question we were in Cardiff."],"opposite":"","synonyms":""},{"def":"in doubt; uncertain","examples":["The future of public transport is not in question.","His sincerity is not in question."],"opposite":"","synonyms":""},{"def":"used to say that something is not difficult to predict, explain, do, etc.","examples":["It's merely a question of time before the business collapses.","It's just a question of deciding what you really want.","Now it's just a question of getting the wording right."],"opposite":"","synonyms":""},{"def":"a matter about which there may be difference of opinion or a lack of understanding","examples":["Whether this should be enforced by law or not is a moot point."],"opposite":"","synonyms":""},{"def":"a matter about which there may be difference of opinion or a lack of understanding","examples":["Whether this should be enforced by law or not is a moot question."],"opposite":"","synonyms":""},{"def":"impossible or not allowed and therefore not worth discussing","examples":["Another trip abroad this year is out of the question."],"opposite":"","synonyms":""},{"def":"to ask somebody to marry you","examples":[],"opposite":"","synonyms":""},{"def":"there is/was no possibility of something","examples":["There was no question of his/him cancelling the trip so near the departure date."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"beg the question","def":"to make somebody want to ask a question that has not yet been answered","examples":["All of which begs the question as to who will fund the project.","These assumptions beg the question that children learn languages more easily than adults."]},{"idiom":"good question!","def":"used to show that you do not know the answer to a question","examples":["‘How much is all this going to cost?’ ‘Good question!’"]},{"idiom":"in question","def":"that is being discussed","examples":["On the day in question we were in Cardiff.","The future of public transport is not in question.","His sincerity is not in question."]},{"idiom":"just/merely/only a question of (doing) something","def":"used to say that something is not difficult to predict, explain, do, etc.","examples":["It's merely a question of time before the business collapses.","It's just a question of deciding what you really want.","Now it's just a question of getting the wording right."]},{"idiom":"a moot point/question","def":"a matter about which there may be difference of opinion or a lack of understanding","examples":["Whether this should be enforced by law or not is a moot point."]},{"idiom":"a moot question/point","def":"a matter about which there may be difference of opinion or a lack of understanding","examples":["Whether this should be enforced by law or not is a moot question."]},{"idiom":"out of the question","def":"impossible or not allowed and therefore not worth discussing","examples":["Another trip abroad this year is out of the question."]},{"idiom":"pop the question","def":"to ask somebody to marry you","examples":[]},{"idiom":"there is/was no question of something happening/of somebody doing something","def":"there is/was no possibility of something","examples":["There was no question of his/him cancelling the trip so near the departure date."]}],"phrasal":[],"related":["wh-question","question mark","question tag","Question Time","tag question","cross-question","indirect question","leading question","question master","reported question","yes-no question","Gardeners' Question Time","Question of Sport","West Lothian Question","sixty-four thousand dollar question","question tags","question marks"]},{"pos":"verb","level":"A2","meanings":[{"def":"to ask somebody questions about something, especially officially","examples":["question somebody Police are keen to question any witnesses.","Two men are being questioned by police.","Over half of those questioned said they rarely took any exercise.","question somebody about something She was arrested and questioned about the fire.","question somebody on something The students were questioned on the books they had been studying.","+ speech ‘What's wrong?’ she questioned.","A man is being questioned in connection with the robbery.","He was questioned on his role in the affair.","She was closely questioned about her whereabouts on the night of the murder.","Patients were questioned in detail about their symptoms."],"opposite":"","synonyms":""},{"def":"to have or express doubts about something","examples":["question something I just accepted what he told me. I never thought to question it.","No one has ever questioned her judgement.","At times I question the wisdom of that decision.","I seriously question his ability to do his job.","question whether, what, etc… He questioned whether the accident was solely the truck driver's fault.","Some people might question the validity of these findings.","You could never question her commitment.","I do question the motives behind the timing of this announcement.","People openly question whether he is right for the job."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]