[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rac/race_/race__us_1.mp3","phonsUS":"/reɪs/","level":"A2","meanings":[{"def":"a competition between people, animals, vehicles, etc. to see which one is the faster or fastest","examples":["a boat/horse race","a five-kilometre road race","Who won the race?","Shall we have a race to the end of the beach?","She ran a good race to finish second.","race between A and B a race between the two best runners of the club","race against somebody He's already in training for the big race against Bailey.","in a race Their horse came third in the race last year.","He dropped out of the race with a pulled muscle after two laps.","He was paid $10 000 to throw the race.","I was leading the race until the half-way point.","I'm not in this race.","Let's have a race!","People are saying that the race was fixed.","She had to pull out of the race at the last minute.","She has won the race for the last five years.","The horse was withdrawn from today's race meeting with an injured leg.","There is a rumour that the race was fixed.","a race over two miles","the University Boat Race between Oxford and Cambridge","the race against the Danish team","He took part in a 10-mile road race at the weekend.","He was injured in a fall at a US race meeting a fortnight ago.","He won the 20th stage of the Tour of Spain cycle race yesterday.","I bet I'd win a race between the two of us!","It's a desperately close race, but I think Martinez is just ahead.","The Kenyan took the women's race comfortably."],"opposite":"","synonyms":""},{"def":"a situation in which a number of people, groups, organizations, etc. are competing, especially for political power or to achieve something first","examples":["race for something Who will win the race for the White House?","race to do something The race is on (= has begun) to find a cure for the disease.","race between A and B The 1960 election was a close race between Nixon and Kennedy.","race against somebody She is in a tight race against her Republican opponent.","in a race He has taken a lead in the presidential race.","This week she dropped out of the leadership race.","The rival TV companies are in a race to bring out the first film drama of his life.","a race between the developing countries","the race for nuclear supremacy","Two right-wing candidates lead the presidential race.","We need to halt the nuclear arms race between these countries."],"opposite":"","synonyms":""},{"def":"a series of horse races that happen at one place on a particular day","examples":["to go to the races","We had a great day at the races."],"opposite":"","synonyms":""},{"def":"one of the main groups that humans can be divided into according to their physical differences, for example the colour of their skin; the fact of belonging to one of these groups","examples":["This custom is found in people of all races throughout the world.","legislation against discrimination on the grounds of race or gender","Race is a major issue in this election.","Britain has always been a country of many races and ethnicities.","Her poetry explores questions of race and identity.","We can all work together, regardless of race.","children from all races and religions","greater understanding between nations and races","people of different races and cultures"],"opposite":"","synonyms":""},{"def":"a group of people who share the same language, history, culture, etc.","examples":["the Nordic races","He admired Canadians as a hardy and determined race.","Evidence suggests they were a race of nomadic hunters.","Historically, we tend to view the Vikings as a warlike race.","The Amazons were a race of female warriors."],"opposite":"","synonyms":""},{"def":"a breed or type of animal or plant","examples":["a race of cattle"],"opposite":"","synonyms":""},{"def":"to be involved in a situation so that you will gain or lose according to the result","examples":["I really don't have a dog in this fight, so I can just enjoy the game.","The employees have a dog in the hunt, so their views should be listened to."],"opposite":"","synonyms":""},{"def":"a competition or an election in which there are only one, two, etc. teams or candidates with a chance of winning","examples":["The women’s competition was a two horse race between last year’s winners Surrey and the previous champions Essex."],"opposite":"","synonyms":""},{"def":"a situation in which you have to do something or finish something very fast before it is too late","examples":["Getting food to the starving refugees is now a race against time."],"opposite":"","synonyms":""},{"def":"a situation in which companies and countries compete with each other to produce goods as cheaply as possible by paying low wages and giving workers poor conditions and few rights","examples":["They are caught in the cheap food syndrome, the race to the bottom, the chase for the lowest cost of production globally."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"have a dog in the fight","def":"to be involved in a situation so that you will gain or lose according to the result","examples":["I really don't have a dog in this fight, so I can just enjoy the game.","The employees have a dog in the hunt, so their views should be listened to."]},{"idiom":"a one, two, three, etc. horse race","def":"a competition or an election in which there are only one, two, etc. teams or candidates with a chance of winning","examples":["The women’s competition was a two horse race between last year’s winners Surrey and the previous champions Essex."]},{"idiom":"a race against time/the clock","def":"a situation in which you have to do something or finish something very fast before it is too late","examples":["Getting food to the starving refugees is now a race against time."]},{"idiom":"race to the bottom","def":"a situation in which companies and countries compete with each other to produce goods as cheaply as possible by paying low wages and giving workers poor conditions and few rights","examples":["They are caught in the cheap food syndrome, the race to the bottom, the chase for the lowest cost of production globally."]}],"phrasal":[],"related":["race car","arms race","drag race","race card","race riot","sack race","horse race","master race","mixed-race","obstacle race","pancake race","race meeting","Boat Race","race relations","rat race","human race","space race","Fastnet Race","three-legged race"]},{"pos":"verb","level":"A2","meanings":[{"def":"to compete against somebody/something to see who can go faster or the fastest, do something first, etc.; to take part in a race or races","examples":["They raced to a thrilling victory in the relay.","She'll be racing for the senior team next year.","race against somebody/something Who will he be racing against in the next round?","race somebody/something We raced each other back to the car.","race to do something Television companies are racing to be the first to screen his life story."],"opposite":"","synonyms":""},{"def":"to make an animal or a vehicle compete in a race","examples":["to race dogs/horses/pigeons","to race motorbikes"],"opposite":"","synonyms":""},{"def":"to move very fast; to move somebody/something very fast","examples":["+ adv./prep. He raced up the stairs.","The days seemed to race past.","Her two dogs raced ahead.","She raced through the work in no time at all.","race somebody/something + adv./prep. The injured man was raced to the hospital.","She raced her car through the narrow streets of the town.","Farms and towns raced by.","Most of these movies have characters racing against the clock to save the day.","She raced frantically to catch the train.","Two boys suddenly came racing around the corner.","After lunch, they would race down to the beach and dive into the sea.","Peter raced ahead to be the first to tell his mother the news.","We all raced back to the camp.","He raced clear on goal."],"opposite":"","synonyms":""},{"def":"to function very quickly because you are afraid, excited, etc.","examples":["My mind raced as I tried to work out what was happening.","My heart was racing with fear.","She took a deep breath to calm her racing pulse."],"opposite":"","synonyms":""},{"def":"to run too fast","examples":["The truck came to rest against a tree, its engine racing."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]