[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rai/raid_/raid__us_1.mp3","phonsUS":"/reɪd/","level":"C1","meanings":[{"def":"a short surprise attack on an enemy by soldiers, ships or aircraft","examples":["to conduct/launch a raid","raid on something The carried out a bombing raid on enemy bases.","raid against something The raids against military targets continued.","Guerrillas were carrying out hit-and-run raids on the troops.","He led his men on a cross-border raid.","The raids against Norway continued.","bombers carrying out daylight raids over northern France","Hundreds of civilians were killed in the air raids."],"opposite":"","synonyms":""},{"def":"a surprise visit by the police looking for criminals or for illegal goods or drugs","examples":["They were arrested during a dawn raid.","raid on something He was injured during a police raid on his nightclub.","Police staged an early morning raid on the premises.","a raid by drugs squad detectives","the drugs seized in last night's raid"],"opposite":"","synonyms":""},{"def":"an attack on a building, etc. in order to commit a crime","examples":["an armed bank raid","raid on something Two customers foiled a raid on a local post office.","She was shot during an armed raid on a security van.","the jewels stolen in the raid"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["air raid","ram-raid"]},{"pos":"verb","level":"C1","meanings":[{"def":"to visit a person or place without warning to look for criminals, illegal goods, drugs, etc.","examples":["The house was raided in the early hours."],"opposite":"","synonyms":""},{"def":"to attack a place without warning","examples":["Villages along the border are regularly raided.","a raiding party (= a group of soldiers, etc. that attack a place)"],"opposite":"","synonyms":""},{"def":"to enter a place, usually using force, and steal from it","examples":["Many treasures were lost when the tombs were raided in the last century.","Sales staff were forced to lie on the floor when a gang raided a jewellery store last night.","(humorous) I caught him raiding the fridge again (= taking food from it)."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]