[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/ral/rally/rally__us_1.mp3","phonsUS":"/ˈræli/","level":"C1","meanings":[{"def":"a large public meeting, especially one held to support a particular idea or political party","examples":["to attend/hold a rally","a peace/protest rally","a mass rally in support of the strike","She spoke at a public rally in Hyde Park.","The demonstrators marched to Trafalgar Square where they held a rally.","The government banned all rallies.","The rally dispersed peacefully after six hours.","a massive outdoor rally in Buenos Aires","a rally calling for a boycott of the January elections","a rally for the winning candidate"],"opposite":"","synonyms":""},{"def":"a race for cars, motorcycles, etc. over public roads","examples":["the Monte Carlo rally","rally driving","He will join the team at the rally next week."],"opposite":"","synonyms":""},{"def":"a series of hits of the ball before a point is scored","examples":["That was a great rally!"],"opposite":"","synonyms":""},{"def":"an act of returning to a strong position after a period of difficulty or weakness","examples":["After a furious late rally, they finally scored.","a rally in shares on the stock market","The visiting team staged a late rally.","The US dollar is now ending its bear-market rally.","the recent rally in the Treasury market"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["pep rally","rally round","rally around","rally round somebody","the Brighton car rally","rally around | rally around somebody"]},{"pos":"verb","level":"C1","meanings":[{"def":"to come together or bring people together in order to help or support somebody/something","examples":["rally around/behind somebody/something The cabinet rallied behind the Prime Minister.","rally to somebody/something Many national newspapers rallied to his support.","rally somebody/something They have rallied a great deal of support for their campaign.","The country hastily rallied its defences.","rally somebody/something around/behind/to something The president must rally the country around a clear and credible goal.","BBC leaders rallied to his defence.","Friends and colleagues have rallied to her cause.","Friends rallied to her.","We were at war and everyone was rallying around the flag.","The team captain vainly tried to rally his troops."],"opposite":"","synonyms":""},{"def":"to become healthier, stronger, etc. after a period of illness, weakness, etc.","examples":["He never really rallied after the operation.","The champion rallied to win the second set 6–3."],"opposite":"","synonyms":""},{"def":"to increase in value after falling in value","examples":["The company's shares had rallied slightly by the close of trading.","The pound rallied against the dollar."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["rally around","rally round"],"related":[]}]