[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/ran/rando/random__us_1.mp3","phonsUS":"/ˈrændəm/","level":"B2","meanings":[{"def":"done, chosen, etc. without somebody deciding in advance what is going to happen, or without any regular pattern","examples":["the random killing of innocent people","a random sample/selection (= in which each thing has an equal chance of being chosen)","The information is processed in a random order.","(informal) I find and play a lot of random stuff—Bach, blues, bebop.","He grabbed a random pair of jeans and an old red shirt.","She dodged the random items that were on the concrete floor.","Questionnaires were sent to a random selection of households.","They interviewed a random sample of head teachers.","Random checks are made on the goods leaving the factory.","The school introduced random drug testing.","Random numbers are generated by the computer.","The group to be studied was selected on a random basis."],"opposite":"","synonyms":""},{"def":"not known or not identified","examples":["Some random guy gave me a hundred bucks.","You don’t want some random dude telling you how to live your life."],"opposite":"","synonyms":""},{"def":"a thing or person that is random is strange and does not make sense, often in a way that interests you or makes you laugh","examples":["Mom, you are so random!","The humour is great because it's just so random and unhinged from reality."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["random access","random-access memory","at random"]},{"pos":"noun","level":"","meanings":[{"def":"without deciding in advance what is going to happen, or without any regular pattern","examples":["She opened the book at random (= not at any particular page) and started reading.","The terrorists fired into the crowd at random.","Names were chosen at random from a list."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"at random","def":"without deciding in advance what is going to happen, or without any regular pattern","examples":["She opened the book at random (= not at any particular page) and started reading.","The terrorists fired into the crowd at random.","Names were chosen at random from a list."]}],"phrasal":[],"related":[]}]