[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/ran/range/range__us_1.mp3","phonsUS":"/reɪndʒ/","level":"B1","meanings":[{"def":"a variety of things of a particular type","examples":["range of something The hotel offers a wide range of facilities.","Librarians need a broad range of skills.","There is a full range of activities for children.","This material is available in a huge range of colours.","a narrow/limited range of options","Voters support parties for a whole range of reasons.","The textbook covers a wide range of topics.","across a range Employees across a range of occupations were surveyed.","over a range We have reached agreement over a range of issues.","Many factors limit women's range of job choices.","Our comprehensive range of benefits includes pension and health insurance.","Students can choose from a wide range of options.","The artists have been chosen to represent a range of styles.","The books cover the full range of reading abilities.","The trade show will feature an enormous range of goods.","You can enjoy an excellent range of leisure and sporting facilities.","people from a diverse range of backgrounds"],"opposite":"","synonyms":""},{"def":"a set of products of a particular type","examples":["our new range of hair products","We are looking to expand our product range.","For more information about our product range, call your local branch.","The company is launching a new range of cosmetics."],"opposite":"","synonyms":""},{"def":"the limits between which something varies","examples":["in a range Most of the students are in the 17–20 age range.","It's difficult to find a house in our price range (= that we can afford).","in the range of something There will be an increase in the range of 0 to 3 per cent.","within a range Prices vary only within a narrow range.","outside a range This was outside the range of his experience.","beyond a range This car is beyond the range of most people's pockets.","No, that's completely outside my price range.","The level of mistakes is within the acceptable range of standards for a public organization."],"opposite":"","synonyms":""},{"def":"the extent of somebody's knowledge or abilities","examples":["I think she has quite a limited range as an actor.","range of something The range of his knowledge is impressive."],"opposite":"","synonyms":""},{"def":"the area covered by or included in something","examples":["Her sculptures explore the range of human experience."],"opposite":"","synonyms":""},{"def":"the distance over which something can be seen or heard","examples":["The child was now out of her range of vision (= not near enough for her to see).","It's outside my range of vision.","The receiver has a maximum range of about 30 feet."],"opposite":"","synonyms":""},{"def":"the distance over which a gun or other weapon can hit things","examples":["These missiles have a range of 300 miles.","He shot her at point-blank range.","The missiles are effective over a long range.","a gun for precision shooting at medium range"],"opposite":"","synonyms":""},{"def":"the distance that a vehicle will travel before it needs more fuel","examples":[],"opposite":"","synonyms":""},{"def":"a line or group of mountains or hills","examples":["the great mountain range of the Alps"],"opposite":"","synonyms":""},{"def":"an area of land where people can practise shooting or where bombs, etc. can be tested","examples":["a shooting range","A device was exploded at the main nuclear testing range."],"opposite":"","synonyms":""},{"def":"a large piece of equipment that can burn various fuels and is kept hot all the time, used for cooking, especially in the past","examples":[],"opposite":"","synonyms":""},{"def":"a large piece of equipment for cooking food, containing an oven and gas or electric rings on top","examples":["Cook the meat on a low heat on top of the range.","Many chefs prefer to cook on a gas rather than an electric range."],"opposite":"","synonyms":""},{"def":"a large open area for keeping cows, etc.","examples":[],"opposite":"","synonyms":""},{"def":"from only a short distance away","examples":["The president was shot at close range.","She scored from close range."],"opposite":"","synonyms":""},{"def":"near enough to be reached, seen or heard","examples":["He shouted angrily at anyone within range."],"opposite":"","synonyms":""},{"def":"too far away to be reached, seen or heard","examples":["The cat stayed well out of range of the children.","She hid away in her house, out of range of prying eyes.","Don't shoot yet—he's still out of range.","I listened, but the voices were just out of hearing range."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"at/from close range","def":"from only a short distance away","examples":["The president was shot at close range.","She scored from close range."]},{"idiom":"in/within range (of something)","def":"near enough to be reached, seen or heard","examples":["He shouted angrily at anyone within range."]},{"idiom":"out of range (of something)","def":"too far away to be reached, seen or heard","examples":["The cat stayed well out of range of the children.","She hid away in her house, out of range of prying eyes.","Don't shoot yet—he's still out of range.","I listened, but the voices were just out of hearing range."]}],"phrasal":[],"related":["mid-range","close-range","free-range","long-range","range over","range with","rifle range","short-range","driving range","range against","Range Rover™","top of the range","Home on the Range","range over something","range yourself/somebody with somebody/something","range yourself/somebody against somebody/something","at/from close range"]},{"pos":"verb","level":"B2","meanings":[{"def":"to vary between two particular amounts, sizes, etc., including others between them","examples":["range from A to B Accommodation ranges from tourist class to luxury hotels.","prices ranging from €25 to €60","range in something His four daughters range in age from 9 to 15.","The apartments range in size from 61 to 86 square metres.","range between A and B Estimates of the damage range between $1 million and $5 million.","Her scores ranged from 23% up as high as 88%.","The town's population ranged between 15 000 and 20 000.","Their ages range up to 84.","Prices range from about $10 to $500."],"opposite":"","synonyms":""},{"def":"to include a variety of different things in addition to those mentioned","examples":["range from A to B She has had a number of different jobs, ranging from chef to swimming instructor.","+ adv./prep. The conversation ranged widely (= covered a lot of different topics).","Her lecture ranged over a number of topics.","The disease ranges widely in severity.","The opinions they expressed ranged right across the political spectrum.","an array of lilies, ranging through yellow to purple"],"opposite":"","synonyms":""},{"def":"to arrange people or things in a particular position or order","examples":["The delegates ranged themselves around the table.","Spectators were ranged along the whole route of the procession."],"opposite":"","synonyms":""},{"def":"to move around an area","examples":["+ adv./prep. He ranges far and wide in search of inspiration for his paintings.","range something Her eyes ranged the room.","Bees love apple blossom and will range far and wide to find it.","They ranged over the entire Pacific in their ocean-going boats.","Voles and lemmings range widely across the central and southern tundra.","Wild horses used to range freely around the plains."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["range against","range over","range with"],"related":[]}]