[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/ran/rank_/rank__us_1.mp3","phonsUS":"/ræŋk/","level":"B2","meanings":[{"def":"the position, especially a high position, that somebody has in a particular organization, society, etc.","examples":["She was not used to mixing with people of high social rank.","He rose through the ranks to become managing director.","Within months she was elevated to ministerial rank.","in rank Promotion will mean that I’m immediately above him in rank.","rank of something Barons are the lowest rank of the nobility.","There are few women in the highest ranks of the organization.","a government minister of Cabinet rank","all ranks in society","the lowest ranks of the aristocracy","People of every rank seemed to agree on this.","She rose from the middle ranks of the civil service."],"opposite":"","synonyms":""},{"def":"the position that somebody has in the army, navy, police, etc.","examples":["rank of something He was soon promoted to the rank of captain.","He rose steadily through the ranks and retired as a lieutenant-colonel.","officers of junior/senior rank","officers and other ranks (= people who are not officers)","The colonel was stripped of his rank (= was given a lower position, especially as a punishment).","in rank a military commander similar in rank to a modern general","He came up through the ranks to become a general.","He held officer rank in the air force for many years.","He never rose above the rank of lieutenant.","He was assigned the rank of Commander.","She joined the navy and held the rank of captain.","police officers below the rank of sergeant","I gave them only my name, rank and serial number.","Officers of junior rank had separate accommodation."],"opposite":"","synonyms":""},{"def":"the position of ordinary soldiers rather than officers; the army","examples":["He served in the ranks for most of the war.","He rose from the ranks (= from being an ordinary soldier) to become a warrant officer.","a campaign to attract more women into the military ranks","They had served in the ranks of the Sultan's army.","Death and disease were thinning their ranks."],"opposite":"","synonyms":""},{"def":"the degree to which somebody/something is of high quality","examples":["a painter of the first rank","Britain is no longer in the front rank of world powers.","The findings are arranged in rank order according to performance."],"opposite":"","synonyms":""},{"def":"the members of a particular group or organization","examples":["We have a number of international players in our ranks.","At 50, he was forced to join the ranks of the unemployed.","There were serious divisions within the party's own ranks.","A CIA operative had infiltrated their ranks.","More women are now filling the ranks of the medical profession.","He spent two years on the college golf team before joining the professional ranks.","The group has little influence over those outside its own ranks.","These products appeal to the growing ranks of middle-class consumers."],"opposite":"","synonyms":""},{"def":"a line or row of soldiers, police, etc. standing next to each other","examples":["They watched as ranks of marching infantry passed the window.","They fired at random into the enemy ranks.","The president moved slowly along the ranks of men.","The soldiers marched in three ranks of ten."],"opposite":"","synonyms":""},{"def":"a line or row of people or things","examples":["massed ranks of spectators","The trees grew in serried ranks (= very closely together).","Rank upon rank of caravans filled the field.","There were ranks of trestle tables piled high with food.","He was standing in the second rank."],"opposite":"","synonyms":""},{"def":"a number that gives the position of a member of a set of numbers","examples":[],"opposite":"","synonyms":""},{"def":"to fail to remain in line","examples":["The police broke ranks and started hitting people with their batons."],"opposite":"","synonyms":""},{"def":"to refuse to support the group or the organization of which they are members","examples":["Large numbers of MPs felt compelled to break ranks over the issue.","He broke ranks with his fellow Republicans and opposed the war."],"opposite":"","synonyms":""},{"def":"if a group of people close ranks, they work closely together to defend themselves, especially when they are being criticized","examples":["It's not unusual for the police to close ranks when one of their officers is being investigated."],"opposite":"","synonyms":""},{"def":"if soldiers close ranks, they move closer together in order to defend themselves","examples":[],"opposite":"","synonyms":""},{"def":"to make use of your place or status in society or at work to make somebody do what you want","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"break ranks","def":"to fail to remain in line","examples":["The police broke ranks and started hitting people with their batons.","Large numbers of MPs felt compelled to break ranks over the issue.","He broke ranks with his fellow Republicans and opposed the war."]},{"idiom":"close ranks","def":"if a group of people close ranks, they work closely together to defend themselves, especially when they are being criticized","examples":["It's not unusual for the police to close ranks when one of their officers is being investigated."]},{"idiom":"pull rank (on somebody)","def":"to make use of your place or status in society or at work to make somebody do what you want","examples":[]}],"phrasal":[],"related":["taxi rank","Rank","rank correlation","Rank Group","rank and file","Rank Hovis McDougall","rank correlations","pull rank (on somebody)"]},{"pos":"verb","level":"B2","meanings":[{"def":"to give somebody/something a particular position on a scale according to quality, importance, success, etc.; to have a position of this kind","examples":["rank somebody/something In most Australian elections, electors are required to rank all candidates.","rank somebody/something + adv./prep. The tasks have been ranked in order of difficulty.","She is currently the highest ranked player in the world.","top-ranked players","rank somebody/something as something Forty-five per cent of respondents ranked health as their number one priority.","rank somebody/something as doing something Voters regularly rank education as being more important than defence.","rank + adj At the height of her career she ranked second in the world.","rank somebody/something + adj Last year, he was ranked second in his age group.","rank somebody/something + noun The university is ranked number one in the country for engineering.","rank as something It certainly doesn't rank as his greatest win.","+ adv./prep. The restaurant ranks among the finest in town.","It would certainly rank high on any list of favourite children's books.","Health and education rank highly with voters.","This must rank with (= be as good as) the greatest movies ever made.","(North American English) You just don't rank (= you're not good enough).","The criteria are ranked in order of importance.","He is a high-ranking officer in the Indian Army.","The children were ranked according to academic ability.","It now ranks as Japan's fourth largest market.","He ranks among the greatest boxers of all time.","She is now ranked in the top five hockey players in Britain.","She ranks above any other musician of her generation.","This city ranks alongside London as one of the great tourist attractions of the world.","This ranks with the great paintings of the 19th century.","These subjects ranked low for most students.","We beat a nationally ranked team."],"opposite":"","synonyms":""},{"def":"to arrange objects in a line or row","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adjective","level":"","meanings":[{"def":"having a strong unpleasant smell","examples":["The house was full of the rank smell of urine."],"opposite":"","synonyms":""},{"def":"very unpleasant","examples":["I think the whole situation's pretty rank."],"opposite":"","synonyms":""},{"def":"used to emphasize a particular quality, state, etc.","examples":["an example of rank stupidity/hypocrisy","The winning horse was a rank outsider.","She made the other players look like rank amateurs."],"opposite":"","synonyms":""},{"def":"growing too thickly","examples":["an area overgrown with rank grass and nettles"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]