[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rar/rare_/rare__us_1.mp3","phonsUS":"/rer/","level":"B1","meanings":[{"def":"not done, seen, happening, etc. very often","examples":["a rare disease/occurrence/event","This weekend, visitors will get a rare chance to visit the private apartments.","it is rare for somebody/something to do something It's extremely rare for it to be this hot in April.","it is rare to do something It is rare to find such loyalty these days.","On the rare occasions when they met he hardly even dared speak to her.","The bacteria can cause infection and, in rare cases, blindness.","The current exhibition offers a rare opportunity to see his original drawings.","In a rare moment of candour, she admitted that mistakes had been made.","It was a rare (= very great) honour to be made a fellow of the college.","Most documentaries, with few rare exceptions, aren't worth purchasing.","Serious crime is a relatively rare occurrence here.","Cold spells in Britain are becoming increasingly rare.","He suffers from a rare bone disease.","It is rare for a prison sentence to be imposed for a first offence.","The case provides a rare glimpse into police practice.","The hatching of a baby tortoise is a rare event in captivity.","Then I had one of my rare good ideas.","There are rare cases of human beings bursting into flames.","This is a rare sight: badgers are normally active only at night."],"opposite":"","synonyms":""},{"def":"existing only in small numbers and therefore valuable or interesting","examples":["a rare book","a rare coin/stamp","a rare breed","a rare plant/bird/animal","This species is extremely rare.","The stamps were not rare enough to be interesting.","The farm specializes in rare breeds.","The jade vase was extremely rare and very valuable.","The library has a collection of rare books and manuscripts.","The marshes contain many rare species of plants."],"opposite":"","synonyms":""},{"def":"cooked for only a short time so that the inside is still red","examples":["‘How would you like your steak?’ ‘Rare.’"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["rare gas","rare breed","rare earth","rare breeds","rare earths","rare gases","rare earth element"]}]