[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rat/rate_/rate__us_1.mp3","phonsUS":"/reɪt/","level":"A2","meanings":[{"def":"a measurement of the speed at which something happens","examples":["rate (of something) Figures published today show another fall in the rate of inflation.","at a/the rate of something Most people walk at an average rate of five kilometres an hour.","at a… rate The number of reported crimes is increasing at an alarming rate.","rate (that)… At the rate you work, you'll never finish!","The costs of the project are rising at an alarming rate.","The deficit has recently exceeded the peak rates of the 1980s.","The water was escaping at a rate of 200 gallons a minute.","We need to eat less as we get older and our metabolic rate slows down.","the slow rate of change","trying to hold down the rate of inflation"],"opposite":"","synonyms":""},{"def":"a measurement of the number of times something happens or something does something during a particular period","examples":["We have seen a reduction in the crime rate over the last 12 months.","a high success/failure rate","the youth unemployment rate","His pulse rate dropped suddenly.","rate of something a high/low/rising rate of unemployment","at a/the rate of something Local businesses are closing at the rate of three a year.","Medical students had a high dropout rate.","Michigan's high-school graduation rate","The US has doubled its rate of recycling in ten years.","The seasonally-adjusted unemployment rate in December stood at 5%.","There is a low survival rate among babies born before 22 weeks.","anxiety over rising divorce rates","the accident rate per 10 000 flight hours","the rate of salmonella infections"],"opposite":"","synonyms":""},{"def":"a fixed amount of money that is charged or paid for something","examples":["advertising/insurance/postal rates","A rise in interest rates tends to reduce inflation.","The euro exchange rate is strengthening.","He argued for a reduction in the top tax rate.","We offer special reduced rates for students.","to cut/reduce/increase/raise interest rates","rate of something a low/high hourly rate of pay","the basic rate of tax (= the lowest amount that is paid by everyone)","at a rate (of something) We had to borrow money at a high rate of interest.","a fixed-rate mortgage (= one in which the amount of money paid back each month is fixed for a particular period)","a premium-rate phone number (= one that costs more than the usual rate to call)","a low hourly rate of pay","interest rates","an admission charge","legal fees","an annual membership fee","a parking fine","We have a wide range of vehicles available for hire at competitive rates.","They charge the usual rate of interest.","Their hourly rates have gone up.","The account offers a poor rate of interest.","Standard rates of interest apply to these loans.","Mortgage rates jumped to 15%.","I'll pay you at the going rate.","I pay the top rate of tax.","Global banks have pegged interest rates at 1%.","Exchange rates are fluctuating wildly.","Ask about the special group rates for entrance to the museum.","Borrowers want protection against rising interest rates.","Calls are cheap rate after 6 p.m.","We will hold these rates until 1 April.","You can opt to pay a flat rate for unlimited internet access.","a one-point rise in base lending rates","an increase in the rate of taxation","borrowing money at a high rate of interest","credit companies that charge extortionate rates of interest","current market rates for borrowing","the average rate for an unskilled worker","The bank has announced a cut in interest rates.","The bank offered us a fixed-rate mortgage","The glossy magazines charge very high advertising rates.","The job has a very low hourly rate of pay.","They are on the basic rate of tax.","We were forced to borrow the money at an extortionately high rate of interest.","What is the going rate for bar work?","safe investments which give a good rate of return"],"opposite":"","synonyms":"rate"},{"def":"a tax paid by businesses to a local authority for land and buildings that they use","examples":["income tax","tax cuts","The company has to pay customs duties on all imports.","A general tariff was imposed on foreign imports.","Business rates are very high in the city centre."],"opposite":"","synonyms":"tax"},{"def":"used to say that a particular fact is true despite what has happened in the past or what may happen in the future","examples":["Well, that's one good piece of news at any rate.","I may be away on business next week but at any rate I'll be back by Friday."],"opposite":"","synonyms":""},{"def":"used to show that you are being more accurate about something that you have just said","examples":["He said he'll be coming tomorrow. At any rate, I think that's what he said."],"opposite":"","synonyms":""},{"def":"used to show that what you have just said is not as important as what you are going to say","examples":["There were maybe 60 or 70 people there. At any rate, the room was packed."],"opposite":"","synonyms":""},{"def":"very quickly","examples":["She's getting through her winnings at a rate of knots."],"opposite":"","synonyms":""},{"def":"used to say what will happen if a particular situation continues to develop in the same way","examples":["At this rate, we'll soon be bankrupt."],"opposite":"","synonyms":""},{"def":"the usual amount of money paid for goods or services at a particular time","examples":["They pay slightly more than the going rate."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"at any rate","def":"used to say that a particular fact is true despite what has happened in the past or what may happen in the future","examples":["Well, that's one good piece of news at any rate.","I may be away on business next week but at any rate I'll be back by Friday.","He said he'll be coming tomorrow. At any rate, I think that's what he said.","There were maybe 60 or 70 people there. At any rate, the room was packed."]},{"idiom":"at a rate of knots","def":"very quickly","examples":["She's getting through her winnings at a rate of knots."]},{"idiom":"at this/that rate","def":"used to say what will happen if a particular situation continues to develop in the same way","examples":["At this rate, we'll soon be bankrupt."]},{"idiom":"the going rate (for something)","def":"the usual amount of money paid for goods or services at a particular time","examples":["They pay slightly more than the going rate."]}],"phrasal":[],"related":["rate cap","bank rate","base rate","burn rate","flat rate","peak rate","rack rate","birth rate","bounce rate","churn rate","click rate","death rate","first-rate","heart rate","piece rate","prime rate","second-rate","strike rate","third-rate"]},{"pos":"verb","level":"B2","meanings":[{"def":"to have or think that somebody/something has a particular level of quality, value, etc.","examples":["rate somebody/something + adv./prep. The university is highly rated for its research.","They rated him highly as a colleague.","rate somebody/something + adj. Voters continue to rate education high on their list of priorities.","rate somebody/something (as) something The show was rated (as) a success by critics and audiences.","rate as something The match rated as one of their worst defeats.","+ adj. I'm afraid our needs do not rate very high with this administration.","It is rated as one of the city's best hotels.","Silver was rated more highly than gold.","This airport is consistently rated as the worst in the world.","a golf course that is rated among the top ten in America","The library is rated as one of the best in the country."],"opposite":"","synonyms":""},{"def":"to think that somebody/something is good","examples":["What did you think of the movie? I didn't rate it myself.","How did you rate her speech?"],"opposite":"","synonyms":""},{"def":"to place somebody/something in a particular position on a scale in relation to similar people or things","examples":["be rated (+ adv./prep.) The schools were rated according to their exam results.","The difficulty of each exercise is rated on a scale of 1 to 5.","It's a chance to watch six top-rated players.","rate somebody/something (+ adv./prep.) Users can rate the quality of advice from one to five stars.","be rated + noun She is currently rated number two in the world."],"opposite":"","synonyms":""},{"def":"to be good, important, etc. enough to be treated in a particular way","examples":["The incident didn't even rate a mention in the press.","Her death only rated a few lines in the local paper."],"opposite":"","synonyms":""},{"def":"to state that a film or video is suitable for a particular audience","examples":["be rated + noun The cartoon was rated PG."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]