[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rat/ratin/rating__us_1.mp3","phonsUS":"/ˈreɪtɪŋ/","level":"B2","meanings":[{"def":"a measurement of how good, popular, important, etc. somebody/something is, especially in relation to other people or things","examples":["The poll gave an approval rating of 39 per cent for the president.","Education has been given a high-priority rating by the new administration.","‘The Big Bang Theory’ was the network show with the highest rating.","He has the highest opinion poll rating of any president this century.","She is currently enjoying a favourable rating with more than 50 per cent of the electorate.","Most countries try to preserve their international credit rating in order to secure necessary loans.","Standard & Poor's lowered its credit rating for the company from A to BBB.","The hospital has retained its top three-star rating.","The hotel achieved a four-star rating.","The judges gave her the maximum rating on style.","The overall performance rating puts the new model well ahead of its main rivals.","The president's ratings have suddenly rocketed.","The resort got a low rating for children's facilities.","The university scored a top rating among students.","a drop of 50 points in her personal rating","His popularity rating dropped after the affair was revealed.","It was a very good rating for an amateur performance."],"opposite":"","synonyms":""},{"def":"a set of figures that show how many people watch or listen to a particular television or radio programme, used to show how popular a programme is","examples":["The show has gone up in the ratings.","The BBC is currently ahead in the ratings war.","Bringing her on the show was a cynical attempt to boost the ratings.","His new sitcom was a ratings success.","It has been ousted from top spot in the TV ratings.","The network's prime-time ratings are up 150 per cent.","The programme's ratings have dipped sharply.","The ratings went shooting up overnight.","The show continues to garner high ratings."],"opposite":"","synonyms":""},{"def":"a number or letter that shows which groups of people a particular film is suitable for","examples":["The film was given a 15 rating by British censors.","The movie carries an R rating."],"opposite":"","synonyms":""},{"def":"a sailor in the navy who is not an officer","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["credit rating","movie rating"]}]