[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rea/react/reaction__us_2.mp3","phonsUS":"/riˈækʃn/","level":"B1","meanings":[{"def":"what you do, say or think as a result of something that has happened","examples":["to provoke/cause/get a reaction","a positive/negative/adverse reaction","reaction to something What was his reaction to the news?","Often our actions are based upon an emotional reaction to what someone has done or said to us.","in reaction to something A spokesman said the changes were not in reaction to the company's recent losses.","reaction of somebody The initial reaction of the White House was favourable.","reaction from somebody It's just another knee-jerk reaction from sections of the media.","My immediate reaction was one of shock.","There has been a mixed reaction to her appointment as director.","The decision provoked an angry reaction from local residents.","I tried shaking him but there was no reaction.","He eyed her cautiously, trying to gauge her reaction.","Her outburst was a delayed reaction to an unpleasant letter she'd received that morning.","His reaction is completely understandable.","Judging by her reaction, she liked the present.","She was surprised at the reaction brought by the mention of his name.","The critical reaction to his first novel has been positive.","The incident calls for a measured response, avoiding knee-jerk reactions.","The play met with a mixed reaction from the critics.","The speech got a mixed reaction.","There's been a drop in ticket sales in reaction to the review.","the public reaction to the news"],"opposite":"","synonyms":""},{"def":"a change in people’s attitudes or behaviour caused by disapproval of the attitudes, etc. of the past","examples":["The return to traditional family values is a reaction against the permissiveness of recent decades.","Her rebellious attitude is just a reaction against her strict upbringing."],"opposite":"","synonyms":""},{"def":"a response by the body, usually a bad one, to a drug, chemical substance, etc.","examples":["If you have a bad reaction, discontinue use immediately.","reaction to something to have an allergic reaction to a drug","Adverse reactions to certain foods can take a few days to manifest.","a delayed reaction to the drugs","She had a very bad allergic reaction to the peanuts.","I believe she is experiencing a post-traumatic stress reaction."],"opposite":"","synonyms":""},{"def":"the ability to move quickly in response to something, especially if in danger","examples":["a skilled driver with quick reactions","Alcohol has the effect of slowing down your reactions.","Keenan showed lightning reactions.","She has very quick reactions."],"opposite":"","synonyms":""},{"def":"a chemical change produced by two or more substances acting on each other","examples":["a chemical reaction","a nuclear reaction","To perform the test, add five drops of the solution to the compound and then observe the reaction.","reaction of something with something the reaction of oxygen with other atoms","reaction of A and B the reaction of chlorine atoms and ozone","the energy given out during the reaction","the fuel's chemical reaction with the surrounding water","I am studying the reactions between certain gases."],"opposite":"","synonyms":""},{"def":"a force shown by something in response to another force, which is of equal strength and acts in the opposite direction","examples":["Action and reaction are equal and opposite."],"opposite":"","synonyms":""},{"def":"opposition to social or political progress or change","examples":["The forces of reaction made change difficult."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["reaction time","addition reaction","chain reaction","elimination reaction","reaction times"]}]