[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rea/reach/reach__us_1.mp3","phonsUS":"/riːtʃ/","level":"A2","meanings":[{"def":"to arrive at the place that you have been travelling to","examples":["They didn't reach the border until after dark.","The beach can only be reached by boat.","I hope this letter reaches you.","We finally reached our destination.","He had barely reached the door when he collapsed.","Having reached your destination, you should record your exact time of arrival.","It took them three hours to reach the opposite shore.","It was almost midnight when I reached home.","When we reach the top we'll have a rest."],"opposite":"","synonyms":""},{"def":"to come to somebody’s attention","examples":["The rumours eventually reached the President."],"opposite":"","synonyms":""},{"def":"to increase to a particular level, speed, etc. over a period of time","examples":["The conflict has now reached a new level of intensity.","Daytime temperatures can reach 40°C.","This tree can reach a height of 24 metres.","Her popularity reached its peak in the late 1990s.","Over half the candidates failed to reach the expected standard.","Profits are expected to reach £2 billion this year.","The city's population had nearly reached a million by 1920.","The cost can easily reach six figures."],"opposite":"","synonyms":""},{"def":"to arrive at a particular point or stage of something after a period of time","examples":["We have a good chance of reaching the final.","His parents have not yet reached retirement age.","The problem has now reached crisis point.","I have reached the stage in my career where I need a change.","The negotiations have reached deadlock.","I'd just like to reach the end of the chapter."],"opposite":"","synonyms":""},{"def":"to achieve a particular aim","examples":["Politicians again failed to reach an agreement.","The two men reached the same conclusion.","They have yet to reach a decision.","In the end we reached a compromise.","The jury was unable to reach a verdict.","We will not stop until we have reached our goal.","The jury took two days to reach a verdict.","Greater efforts are needed to reach the goal of universal education.","Doctors cannot reach an accurate diagnosis if they do not have all the relevant information."],"opposite":"","synonyms":""},{"def":"to stretch your hand towards something in order to touch it, pick it up, etc.","examples":["+ adv./prep. She reached inside her bag for a pen.","I reached out to pat the dog.","He reached into his pocket and pulled out his phone.","She reached blindly for the light switch.","He reached across the table to squeeze her hand.","reach something + adv./prep. He reached out his hand to touch her.","I reached inside my pocket for a pen.","He reached into his bag and took out a book.","She reached for the telephone and picked it up.","Slowly he reached out and picked up the gun.","He reached out gingerly to touch it.","He instinctively reached for his camera.","A hand reached down to help her up the ladder."],"opposite":"","synonyms":""},{"def":"to be able to stretch your hand far enough in order to touch something, pick something up, etc.","examples":["(+ adv./prep.) ‘Grab the end of the rope.’ ‘I can't reach that far!’","reach something Can you reach the light switch from where you're sitting?","I can't reach the top shelf.","She had arranged her desk so that she could reach everything easily."],"opposite":"","synonyms":""},{"def":"to stretch your hand out or up in order to get something for somebody","examples":["reach something (down) for somebody Can you reach that box down for me?","reach somebody (down) something Can you reach me down that box?"],"opposite":"","synonyms":""},{"def":"to be big enough, long enough, etc. to arrive at a particular point","examples":["+ adv./prep. The carpet only reached halfway across the room.","His hair reached down to the middle of his back.","reach something Is the cable long enough to reach the socket?","Her skirt almost reached the ground."],"opposite":"","synonyms":""},{"def":"to communicate with somebody, especially by phone","examples":["Do you know where I can reach him?","You can reach me at this number.","No one at the company could be reached for comment."],"opposite":"","synonyms":""},{"def":"to be seen or heard by somebody","examples":["Through the internet we are able to reach a wider audience."],"opposite":"","synonyms":""},{"def":"somebody hears about something, especially when other people already know about it","examples":["News of his affair eventually reached her ears."],"opposite":"","synonyms":""},{"def":"to try to be successful at something that is difficult","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"something comes to/reaches somebody’s ears","def":"somebody hears about something, especially when other people already know about it","examples":["News of his affair eventually reached her ears."]},{"idiom":"reach for the stars","def":"to try to be successful at something that is difficult","examples":[]}],"phrasal":["reach out"],"related":["reach out","reach out (to somebody)","within (easy) reach (of something)","(reach) the end of the line/road"]},{"pos":"noun","level":"B2","meanings":[{"def":"the distance over which you can stretch your arms to touch something; the distance over which a particular object can be used to touch something else","examples":["beyond somebody's reach The shot was well beyond the reach of the goalkeeper.","out of somebody's reach Keep all medicines out of reach of children.","within somebody's reach He lashed out angrily, hitting anyone within his reach.","It's a book I like to keep within arm's reach.","Use shears with a long reach for cutting high hedges.","As a boxer, his long reach gives him a significant advantage.","Gorillas have a very long reach.","I always keep my mobile phone within arm's reach.","The latch was just beyond her reach.","The riverbank was almost in reach.","There was a knife within his reach.","Cleaning fuids should be kept out of the reach of children."],"opposite":"","synonyms":""},{"def":"the limit to which somebody/something has the power or influence to do something","examples":["The brand now has global reach.","The business aims to extend its reach into the North American market.","The compant has now overtaken its main rival in terms of size and reach.","beyond somebody/something's reach Such matters are beyond the reach of the law.","out of somebody/something's reach Victory is now out of her reach.","within somebody/something's reach The basic model is priced well within the reach of most people.","He fled abroad, beyond the reach of German prosecutors.","Humans have extended their reach into space.","Our $30 000 target is now well within our reach.","The business is looking at ways to extend its geographic reach.","The company has a worldwide reach.","The global reach of the internet has exceeded what anyone could have predicted.","The organization has a wide reach.","The price puts it out of the reach of most people."],"opposite":"","synonyms":""},{"def":"a straight section of water between two bends on a river","examples":["the upper/lower reaches of the Nile (= the part that is furthest from/nearest to the sea)"],"opposite":"","synonyms":""},{"def":"the parts of an area or a place that are a long way from the centre","examples":["the outer reaches of space","the eastern reaches of the continent","(figurative) an exploration of the deepest reaches of the human mind","He dreamed of exploring the outermost reaches of space.","the farthest reaches of our universe"],"opposite":"","synonyms":""},{"def":"the higher, etc. sections of an organization, a system, etc.","examples":["There are still few women in the upper reaches of the civil service.","Many clubs in the lower reaches of the league are in financial difficulty.","the upper reaches of the music charts"],"opposite":"","synonyms":""},{"def":"close to something","examples":["The house is within easy reach of schools and sports facilities.","Verona and Padua are both within easy reach for day trips.","a holiday town within reach of Marseilles"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"within (easy) reach (of something)","def":"close to something","examples":["The house is within easy reach of schools and sports facilities.","Verona and Padua are both within easy reach for day trips.","a holiday town within reach of Marseilles"]}],"phrasal":[],"related":[]}]