[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rea/readi/reading__us_1.mp3","phonsUS":"/ˈriːdɪŋ/","level":"A1","meanings":[{"def":"the activity of somebody who reads","examples":["My hobbies include reading and painting.","He needs more help with his reading.","Are you any good at map reading?","He enjoys reading and going to the cinema.","reading glasses (= worn when reading)","a reading lamp/light (= one that can be moved to shine light onto something that you are reading)","She has a reading knowledge of German (= she can understand written German).","reading on something After extensive reading on the subject she set to work on an article.","reading about something He's done a lot of reading about the history of the town.","He asked her about her reading habits.","His reading about Ruskin led him to the works of Turner.","I haven't had time to do much reading lately.","I need to get down to some serious reading.","In the holidays I'll get down to some serious reading.","My map-reading skills are not the best."],"opposite":"","synonyms":""},{"def":"an act of reading something","examples":["A closer (= more detailed) reading of the text reveals just how desperate he was feeling.","We are all expected to attend the reading of her will."],"opposite":"","synonyms":""},{"def":"books, articles, etc. that are intended to be read","examples":["reading material","reading matter","a series of reading books for children","a reading list (= a list of books, etc. that students are expected to read for a particular subject)","further reading (= at the end of a book, a list of other books that give more information about the same subject)","The report makes for interesting reading (= it is interesting to read)","The article is not exactly light reading (= it is serious and requires effort and concentration to understand).","reading for somebody/something His article should be compulsory reading for law students.","Her assigned reading for English class was ‘Great Expectations’.","reading on something a list of suggested reading on this topic","Their story makes compulsive reading.","The book is worthwhile reading for anyone interested in the Industrial Revolution.","Horror is hardly my idea of bedtime reading.","some light holiday reading"],"opposite":"","synonyms":""},{"def":"the particular way in which you understand a book, situation, etc.","examples":["Those conclusions are based on a literal reading of the text.","My own reading of events is less optimistic.","her attentive and insightful reading of the manuscript","These paintings often invite an allegorical reading.","Longinus provides a sensitive reading of Sappho's poem.","He draws his morality from a literal reading of the Old Testament."],"opposite":"","synonyms":""},{"def":"the amount or number shown on an instrument used for measuring something","examples":["Meter readings are taken every three months.","The dials were giving higher readings than we had expected.","Temperature readings were recorded throughout the day.","A reading of 25 or more is abnormally high."],"opposite":"","synonyms":""},{"def":"an event at which something is read to an audience for entertainment; a piece of literature that is read at such an event","examples":["He was invited to give a poetry reading as part of the literary festival.","The evening ended with a reading from her latest novel.","The reading was given by Mrs Smith.","We met at a reading of his poetry.","I saw a staged reading of the new play ‘Light’.","Dickens gave many public readings from his works."],"opposite":"","synonyms":""},{"def":"a short section from a holy text that is read to people as part of a religious service","examples":["The reading today is from the Book of Daniel.","readings from the Koran"],"opposite":"","synonyms":""},{"def":"one of the stages during which a bill (= a proposal for a new law) must be discussed and accepted by a parliament before it can become law","examples":["The bill looks like it will be given a second reading."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Reading","lip-reading","reading age","first reading","reading group","reading list","reading room","sight-reading","speed-reading","third reading","second reading","Ballad of Reading Gaol","reading ages","reading lists"]},{"pos":"","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rea/readi/reading_1_us_2.mp3","phonsUS":"/ˈredɪŋ/","level":"","meanings":[{"def":"a large town in southern England, governed by a unitary authority. It is famous for its music festivals, especially the Reading Rock Festival. Oscar Wilde spent two years in Reading prison (1895-7), and he wrote his Ballad of Reading Gaol there.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]