[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rea/reade/reader__us_1.mp3","phonsUS":"/ˈriːdər/","level":"A1","meanings":[{"def":"a person who reads, especially one who reads a lot or in a particular way","examples":["an avid reader of science fiction","a fast/slow reader","And so, dear reader, our tale comes to its end.","The reader is left to draw his or her own conclusions.","There are many examples to help the reader understand the usefulness of this approach.","Johnson also reminds his readers that ‘the New York School’ was much more than a geographical label.","Readers interested in this period of British history will find much of value in this book.","The book invites young readers to examine the issues.","The book is accessible to the interested reader with basic knowledge of the subject.","a book that will be too difficult for the general reader","She allows readers to experience events from a child's perspective.","The vividness of Dickens's imaginative account of the riots was intended both to shock and to inform his readers.","His insights will undoubtedly encourage the reader to seek out more of Mozart's music."],"opposite":"","synonyms":""},{"def":"a person who reads a particular newspaper, magazine, etc.","examples":["readers’ letters","Are you a ‘Times’ reader?","regular readers of this magazine","Readers of this blog will know my views on the matter.","Alert readers may have noticed the misprint in last week's column.","The magazine asked readers to nominate their favourite celebrities."],"opposite":"","synonyms":""},{"def":"an easy book that is intended to help people learn to read their own or a foreign language","examples":["a series of graded English readers"],"opposite":"","synonyms":""},{"def":"a senior teacher at a British university just below the rank of a professor","examples":["She is Reader in Music at Edinburgh."],"opposite":"","synonyms":""},{"def":"an electronic device that reads data stored in one form and changes it into another form so that a computer can perform operations on it","examples":[],"opposite":"","synonyms":""},{"def":"a machine that produces on a screen a large image of a text stored on a microfiche or microfilm","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["e-reader","card reader","feed reader","mind reader","sight-reader","Guardian reader","Reader's Digest"]}]