[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rea/reali/reality__us_1.mp3","phonsUS":"/riˈæləti/","level":"B1","meanings":[{"def":"the true situation and the problems that actually exist in life, in contrast to how you would like life to be","examples":["She refuses to face reality.","You're out of touch with reality.","The reality is that there is not enough money to pay for this project.","They seemed to have the perfect marriage but the reality was very different.","I'm having a hard time adjusting to the reality of this situation.","reality that… He needs to accept the reality that his time in this job is over.","He has a rather tenuous grasp of reality.","He has no illusions about the underlying reality of army life.","I don't think he understands the reality of the situation.","Most comedy relies on distorting reality.","Most people's ideas of the disease do not have much to do with the reality.","Painters at the time were largely concerned with reproducing external reality.","She will have to face reality sooner or later.","The movie portrays a kind of alternate reality.","We were faced with the awful reality of having nowhere to live.","a book that captures the reality of life during wartime"],"opposite":"","synonyms":""},{"def":"a thing that is actually experienced or seen, in contrast to what people might imagine","examples":["Will time travel ever become a reality?","The paperless office is still far from being a reality.","As children they experienced the harsh realities of life.","This decision reflects the realities of the political situation.","Politicians should not ignore economic realities for short-term political gain.","It took five years to make her idea a reality.","Money is the key to turning dreams into a reality.","the practical realities of running a children's home","the harsh economic realities of life as a student","The novel describes the harsh realities of racism and life on the road.","They are out of touch with the realities of modern warfare.","The director creates a believable, gritty reality.","One day her dream will become a reality.","It's our task to make the proposals a reality.","I don't think you have quite grasped the realities of our situation!","Her parents always tried to shield her from the realities of the world."],"opposite":"","synonyms":""},{"def":"television/shows, etc. that use real people (not actors) in real situations, presented as entertainment","examples":["a reality TV star","the reality show ‘Survivor’"],"opposite":"","synonyms":""},{"def":"used to say that a situation is different from what has just been said or from what people believe","examples":["Outwardly she seemed confident but in reality she felt extremely nervous.","In reality, human beings and dinosaurs never lived on earth at the same time.","The media portray her as happy and successful, but in reality she has a difficult life."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in reality","def":"used to say that a situation is different from what has just been said or from what people believe","examples":["Outwardly she seemed confident but in reality she felt extremely nervous.","In reality, human beings and dinosaurs never lived on earth at the same time.","The media portray her as happy and successful, but in reality she has a difficult life."]}],"phrasal":[],"related":["reality TV","reality check","augmented reality","virtual reality","reality TVs","reality checks","reality television"]}]