[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rea/reali/realize__us_1.mp3","phonsUS":"/ˈriːəlaɪz/","level":"A2","meanings":[{"def":"to understand or become aware of a particular fact or situation","examples":["realize (that)… I didn’t realize (that) you were so unhappy.","The moment I saw her, I realized something was wrong.","I finally came to realize that he would never change.","It is important to realize that there are still potential problems.","realize how, what, etc… I don't think you realize how important this is to her.","They hadn't realized just how much time it would take.","realize something Many families fail to realize the importance of a well-balanced diet","Only later did she realize her mistake.","I hope you realize the seriousness of this crime.","The situation was more complicated than they had at first realized.","They managed to leave without any of us realizing.","it is realized that… There was a cheer when it was realized that everyone was safely back.","I never realized how much it meant to you.","I realized for the first time how difficult this would be.","She dimly realized that she was trembling.","The experience made me realize that people did care.","They are constantly learning, without even realizing it.","We are constantly using historic buildings, without even realizing it.","You don't seem to realize the seriousness of the situation.","I began to realize why the people seemed wary of us.","to soon/​quickly/​gradually/​slowly realize","She soon realized her mistake.","Suddenly I realized what he meant.","We make assumptions all the time without realizing it."],"opposite":"","synonyms":""},{"def":"to achieve something important that you very much want to do","examples":["to realize your dream","We try to help all students realize their full potential (= be as successful as they are able to be).","She never realized her ambition of becoming a professional singer.","He has fully realized the promise which he showed.","He finally realized a life long ambition."],"opposite":"","synonyms":""},{"def":"if somebody’s fears are realized, the things that they are afraid will happen, do happen","examples":["His worst fears were realized when he saw that the door had been forced open."],"opposite":"","synonyms":""},{"def":"to sell things that you own, for example property, in order to get the money that you need for something","examples":[],"opposite":"","synonyms":""},{"def":"to be sold for a particular amount of money","examples":["The paintings realized $2 million at auction."],"opposite":"","synonyms":""},{"def":"to produce something that can be seen or heard, based on written information or instructions","examples":["The stage designs have been beautifully realized."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["see, realize, etc. the error of your ways"]}]