[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rea/reaso/reason__us_4.mp3","phonsUS":"/ˈriːzn/","level":"A1","meanings":[{"def":"a cause or an explanation for something that has happened or that somebody has done","examples":["He said no but he didn't give a reason.","reason for something She gave no reasons for her decision.","reason for doing something I have no particular reason for doubting him.","reason behind something There were a number of reasons behind her departure.","reason (that)… We aren't going for the simple reason that we can't afford it.","Job satisfaction is the main reason people remain in jobs or careers.","The only reason your parents are doing this is because they care so much for you.","reason why… Give me one good reason why I should help you.","I'd like to know the reason why you're so late.","for a reason For some reason (= one that I don't know or don't understand) we all have to come in early tomorrow.","For this reason, it's important to have friends who will support you.","These rules are there for a very good reason.","The man attacked me for no apparent reason.","Sometimes I cry for no reason at all.","She resigned for personal reasons.","For obvious reasons the data is not complete.","He wants to keep them all in his office for reasons best known to himself.","people who, for whatever reason, are unable to support themselves","for reasons of something For reasons of security the door is always kept locked.","‘Why do you want to know?’ ‘No reason’ (= I do not want to say why).","‘Why did she do that?’ ‘She must have her reasons’ (= secret reasons which she does not want to tell).","by reason of something (formal) He was excused by reason of (= because of) his age.","He said no but he didn’t give a reason.","The most likely explanation is that his plane was delayed.","She left the room abruptly without explanation.","You have no grounds for complaint.","On what basis will this decision be made?","Late again! What’s your excuse this time?","It gave me an excuse to take the car.","There seemed to be no motive for the murder.","I can see no possible justification for any further tax increases.","He left the party early on the pretext of having to work.","Today’s children eat more junk food and get less exercise than previous generations of children. It is not surprising, therefore, that rates of childhood obesity are on the increase.","Children who grow up on a diet of junk food find it difficult to change this habit later in life. It is essential, therefore, that parents encourage healthy eating from an early age.","Children who grow up on a diet of junk food find it difficult to change this habit later in life. For this reason,/This is why it is essential that children eat healthily from an early age.","Eating habits formed in childhood tend to continue into adult life. Thus, the best way to prevent heart disease among adults is to encourage healthy eating from an early age.","Eating habits formed in childhood tend to continue into adult life, hence the importance of encouraging healthy eating from an early age.","There are two main reasons why I think it’s the best option: first, there's the cost and second, the quality.","I think/​believe it's the right thing to do because it gives everyone a fair chance.","I would choose the newer one on the grounds that it will last longer.","Of the three houses, the largest one seems to me to be the best, because they need the room.","My choice would be number 3, simply because it's the clearest design.","For reasons of security, you are requested to keep your baggage with you at all times.","For some odd reason, he found it really funny.","For some unexplained reason the pilot jettisoned all his fuel shortly after take-off.","For unknown reasons, the ship sank in the middle of the ocean.","He got angry for no reason.","He married her for all the wrong reasons.","He saw many reasons to be hopeful.","I can think of several reasons why this might happen.","I don't know why he did that, but I'm sure he had his reasons.","I don't see any reason why you can't come with us.","I have no reason to believe that she was lying to me.","I was never good at playing the trumpet for the simple reason that I never practised.","In the letter she carefully set out her reasons for leaving.","Isolation and loneliness are common reasons for depression.","It's difficult to pinpoint the reasons for her success.","People buy things for all sorts of reasons.","She did not tell him the real reason for her change of heart.","The company's stated reason for firing him was misconduct.","The only reason I didn't become a professional golfer was because of my family commitments.","The reasons for her decision soon became clear.","The underlying reasons for these differences will be explored in depth in the next chapter.","There are obvious reasons against such a move.","There is an assumption that a state will protect its citizens. That is the very reason for the existence of states.","There's one big reason why this won't work: cost.","They didn't give any reason for the delay.","This article lists the most common reasons why people pay too much tax.","Tom's problem was that he lacked confidence; Ed failed for precisely the opposite reason.","We are trying to uncover the reasons behind her decision.","You're asking me to help, and that's the exact reason I came.","dismissal for reasons unconnected with misconduct","procedures carried out for reasons of national security","Surely there is no earthly reason why you wouldn't want to come with us?","We see no reason why this band shouldn't be a huge success.","You don't have any reason to complain."],"opposite":"","synonyms":"reason"},{"def":"a fact that makes it right or fair to do something","examples":["reason to do something They have reason to believe she is lying.","We have every reason (= have very good reasons) to feel optimistic.","You have no reason to accuse him of laziness.","She has good reason to be concerned.","There is no reason at all to doubt it.","reason why… There is no reason why we should agree to this.","reason for something This result gives us all the more reason for optimism.","reason for doing something He has every reason for feeling excited.","with reason She complained, with reason (= rightly), that she had been underpaid.","You have little reason to be pleased with yourself.","There is ample reason to be optimistic about the economy.","I know you're angry with me, and you have every reason to be.","They complained about the food, and with good reason.","persons in need of care by reason of old age","He was found not guilty by reason of insanity.","If he's unwell, that's all the more reason to go and see him."],"opposite":"","synonyms":""},{"def":"the power of the mind to think in a logical way, to understand and have opinions, etc.","examples":["Only human beings are capable of reason (= of thinking in a logical way, etc.).","to lose your reason (= become mentally ill)","the conflict between faith and reason","He seems to have lost all sense and reason.","He was beyond all reason.","We possess the human faculty of reason."],"opposite":"","synonyms":""},{"def":"what is possible, practical or right","examples":["I can't get her to listen to reason.","Why can't they see reason?","Look, you're supposed to be the voice of reason here.","Keith appears to be open to reason (= to be willing to accept sensible advice).","within reason He's looking for a job and he's willing to do anything within reason.","I'm willing to do anything — within reason — to get my case heard.","I'll lend you the money you need—within reason, of course!","The residents hope that an appeal to reason will end the rioting.","Sometimes he does things that defy reason.","I tried to persuade her, but she just wouldn't listen to reason.","She was always the voice of reason, persuading him not to buy things they couldn't afford."],"opposite":"","synonyms":""},{"def":"it must be clear to any sensible person who thinks about it","examples":["It stands to reason that they'll leave if you don't pay them enough.","It stands to reason that she wouldn't want them to find out about her personal problems."],"opposite":"","synonyms":""},{"def":"if there is no rhyme or reason to something or it happens without rhyme or reason, it happens in a way that cannot be easily explained or understood","examples":["Suddenly, without rhyme or reason, his mood changed.","There's no rhyme or reason to the new opening hours."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"it stands to reason","def":"it must be clear to any sensible person who thinks about it","examples":["It stands to reason that they'll leave if you don't pay them enough.","It stands to reason that she wouldn't want them to find out about her personal problems."]},{"idiom":"there’s no rhyme or reason to/for something | without rhyme or reason","def":"if there is no rhyme or reason to something or it happens without rhyme or reason, it happens in a way that cannot be easily explained or understood","examples":["Suddenly, without rhyme or reason, his mood changed.","There's no rhyme or reason to the new opening hours."]}],"phrasal":[],"related":["reason out","reason with","Age of Reason","reason something out","reason with somebody"]},{"pos":"verb","level":"","meanings":[{"def":"to form a judgement about a situation by considering the facts and using your power to think in a logical way","examples":["She reasoned that she must have left her bag on the train.","They couldn't fire him, he reasoned. He was the only one who knew how the system worked.","They reasoned, correctly, that the enemy would not attempt an attack at night."],"opposite":"","synonyms":""},{"def":"to use your power to think and understand","examples":["the human ability to reason"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["reason out","reason with"],"related":[]}]