[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rea/reaso/reasonable__us_2_rr.mp3","phonsUS":"/ˈriːznəbl/","level":"B2","meanings":[{"def":"fair, practical, and sensible","examples":["it is reasonable to do something It is reasonable to assume that he knew beforehand that this would happen.","As life expectancy increases, it is reasonable to expect that the retirement age will increase too.","It seems reasonable to conclude that their claims are unfounded.","it is reasonable for somebody to do something Is it not reasonable for the government to look for savings and efficiencies?","Be reasonable! We can't work late every night.","The prosecution has to prove beyond (a) reasonable doubt that he is guilty of murder.","We have reasonable grounds for believing that you are responsible.","Any reasonable person would have done exactly as you did.","You must take all reasonable steps to ensure that the information that you provide is correct.","It seems a perfectly reasonable request to make.","If companies expect work during personal time, it's only reasonable to allow personal time at work.","I considered the evidence in order to decide what is fair and reasonable in the circumstances."],"opposite":"unreasonable","synonyms":""},{"def":"acceptable and appropriate in a particular situation","examples":["The police apparently thought this explanation perfectly reasonable.","The judge said they had a reasonable expectation of privacy relating to the information concerned.","He made us a reasonable offer for the car.","You must submit your claim within a reasonable time.","It can even be done as a class project in a reasonable amount of time.","The adviser must take reasonable care to ensure that the information is correct"],"opposite":"","synonyms":""},{"def":"not too expensive","examples":["We sell good-quality food at reasonable prices.","He believes NASA can reach Mars at a reasonable cost.","If the price is reasonable, we'll buy it."],"opposite":"","synonyms":"cheap"},{"def":"fairly good, but not very good","examples":["Most people here have a reasonable standard of living.","The hotel was reasonable, I suppose (= but not excellent).","There's a reasonable chance that he'll come.","The furniture is in reasonable condition."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]