[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/reb/rebel/rebellion__us_1.mp3","phonsUS":"/rɪˈbeljən/","level":"C1","meanings":[{"def":"an attempt by some of the people in a country to change their government, using violence","examples":["in rebellion (against somebody/something) The north of the country rose in rebellion against the government.","The army put down the rebellion.","In July 1745 Charles sailed for Scotland to raise a rebellion in the Highlands.","Peasant rebellions occurred throughout the 16th century.","Rebellion broke out in India.","Rebellion broke out in the Rhineland.","Simon de Montfort rose in rebellion in 1258.","The country has been plagued by wars, civil wars, and internal rebellions.","The new taxes provoked the population to open rebellion.","The re-introduction of conscription sparked off a major rebellion.","The slaves rose up in rebellion.","They staged a rebellion against British rule in Ireland.","a rebellion against the new king","After years of protest, much of the country was now in open rebellion against the president.","The English Tudors faced six major rebellions and countless minor revolts."],"opposite":"","synonyms":""},{"def":"opposition to authority within an organization, a political party, etc.","examples":["in rebellion (against something) Some members are in rebellion against proposed cuts in spending.","The prime minister faces a rebellion from junior members of her party.","(a) back-bench rebellion","attempts to foment rebellion in the Cabinet","a rebellion over an increase in VAT","The opposition party members threatened rebellion.","They are in rebellion against the conservative hierarchy of the Church."],"opposite":"","synonyms":""},{"def":"opposition to authority; being unwilling to obey rules or accept normal standards of behaviour, dress, etc.","examples":["Teenage rebellion often starts in the home.","rebellion against their parents","The band refused to go on stage and rebellion began to stir in the audience."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["‘15 Rebellion","‘45 Rebellion"]}]