[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rec/recal/recall__us_1_rr.mp3","phonsUS":"/rɪˈkɔːl/","level":"B2","meanings":[{"def":"to remember something","examples":["recall something She could not recall his name.","Many years later Muir recalled his days at Glasgow University.","I cannot recall a time when the country faced such serious problems.","‘I may have; I don't recall,’ she said.","If I recall correctly, he lives in Luton.","recall doing something I can't recall meeting her before.","I vaguely recall seeing the film.","I seem to recall receiving an email from a reader a while ago.","recall somebody/something doing something I seem to recall him mentioning a brother once.","recall that… He recalled that she always came home late on Wednesdays.","He later recalled that he had met her once.","recall what, when, etc. Can you recall exactly what happened?","I can vividly recall where and when I saw them.","recall + speech ‘It was on a Thursday in March,’ he recalled.","Becky could still recall that first meeting clearly.","I am old enough now to wistfully recall moments of my youth.","I couldn't quite recall the date.","I recall reading in an interview that he loved to cook.","I seem to recall that she said she was going away.","I well recall walking the five miles to school every morning.","She could easily recall the smell of the orange groves.","She recalled how she would go for walks along the beach late at night."],"opposite":"","synonyms":""},{"def":"to make somebody think of something","examples":["The poem recalls Eliot's ‘The Waste Land’."],"opposite":"","synonyms":""},{"def":"to order somebody to return","examples":["recall somebody Both countries recalled their ambassadors.","recall somebody to something He was recalled to military duty.","They have both been recalled to the Welsh squad (= selected as members of the team after a time when they were not selected)."],"opposite":"","synonyms":""},{"def":"to ask for something to be returned, often because there is something wrong with it","examples":["The company has recalled all the faulty hairdryers."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["if I recall correctly","beyond recall"]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rec/recal/recall__us_3.mp3","phonsUS":"/ˈriːkɔːl/","level":"","meanings":[{"def":"the ability to remember something that you have learned or something that has happened in the past","examples":["She has amazing powers of recall.","to have instant recall (= to be able to remember something immediately)","to have total recall (= to be able to remember all the details of something)"],"opposite":"","synonyms":""},{"def":"an official order or request for somebody/something to return, or for something to be given back","examples":["Thomas’s recall to the Welsh team","The manufacturer has issued a product recall over safety fears.","Hundreds of machines are still in use in spite of a recall by the manufacturers."],"opposite":"","synonyms":""},{"def":"impossible to bring back to the original state; impossible to remember","examples":["The paintings were damaged beyond recall."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"beyond recall","def":"impossible to bring back to the original state; impossible to remember","examples":["The paintings were damaged beyond recall."]}],"phrasal":[],"related":[]}]