[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rec/recei/receipt__us_1.mp3","phonsUS":"/rɪˈsiːt/","level":"B1","meanings":[{"def":"a piece of paper or an electronic document that shows that goods or services have been paid for","examples":["Can I have a receipt, please?","receipt for something Do you need a receipt for that?","We will email the receipt to you.","I kept the receipt, so I can return it if you don't like it.","to make out (= write) a receipt","They have to submit receipts to support all expenditure.","Could I have a receipt for that please?","His credit-card receipts show he was in New York at the time.","She issued a receipt for the goods.","The machine issues a paper receipt on request.","The original receipt must be produced in order to reclaim your goods.","There was a little receipt printer on the counter.","You can claim a refund provided you keep the receipt.","a receipt made out for £5"],"opposite":"","synonyms":""},{"def":"the act of receiving something","examples":["You will get an automatic reply to your email confirming receipt.","receipt of something to acknowledge receipt of a letter","on receipt of something The goods will be dispatched on receipt of an order form.","in receipt of something Are you in receipt of any state benefits?","The goods will be sent on receipt of your cheque.","The closing date for receipt of your application is July 14.","Upon receipt of payment by the bank, the goods will be dispatched.","organizations in receipt of UN funding","I would be grateful if you would acknowledge receipt of this letter.","Items should be paid for within 14 days of receipt."],"opposite":"","synonyms":""},{"def":"money that a business, bank or government receives","examples":["net/gross receipts","Cash receipts reached £70 million.","Customs and excise receipts rose 2.5 per cent.","Gate receipts have fallen compared to last season.","Match receipts slumped by £89 000 compared to last season.","Tax receipts rose 2.5%.","an estimation of the receipts and expenditure for this financial year","receipts from land sales"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]