[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rec/recei/receive__us_1.mp3","phonsUS":"/rɪˈsiːv/","level":"A2","meanings":[{"def":"to get or accept something that is sent or given to you","examples":["receive something","I was delighted to receive your letter.","She received many messages of support.","Police had received information about a planned post office robbery.","to receive payment/thanks","receive something from somebody/something He received an award for bravery from the police.","I received a phone call from her a few weeks later.","I received a lovely email from Tina.","The programme's website received many complaints from listeners.","The service receives no money from the local council.","Any help or donations will be gratefully received.","I just received a call from a concerned parent.","I received a package from my mother.","They currently receive subsidies from the government.","You can expect to receive compensation for all direct expenses arising out of the accident.","You might be entitled to receive housing benefit.","You will automatically receive updates by text message.","I've just received this letter from an old friend.","Please let me know as soon as you receive payment."],"opposite":"","synonyms":""},{"def":"to experience or be given a particular type of treatment or attention","examples":["receive something Her work has not received the attention it deserves.","She received urgent hospital treatment.","All our staff receive training on dealing with customers.","receive something from somebody We have received overwhelming support from the local community.","We received a warm welcome from our hosts."],"opposite":"","synonyms":""},{"def":"to form an idea or impression of somebody/something as a result of what you see, experience, etc.","examples":["I did not receive the impression that he was afraid."],"opposite":"","synonyms":""},{"def":"to be injured in a particular way","examples":["Several of the passengers received severe injuries.","She received only minor cuts and bruises."],"opposite":"","synonyms":""},{"def":"to react to something new, in a particular way","examples":["be received + adv./prep. The play was well received by the critics.","The speech was warmly received by the audience.","be received with something The proposals have been received with great enthusiasm.","The news was received with dismay.","The speech was badly received by Republican leaders.","The proposals have been favourably received by most political commentators."],"opposite":"","synonyms":""},{"def":"to welcome or entertain a guest, especially formally","examples":["be received (as something) He was received as an honoured guest at the White House.","be received with something We were received with great cordiality."],"opposite":"","synonyms":""},{"def":"to officially recognize and accept somebody as a member of a group","examples":["Three young people were received into the Church at Easter."],"opposite":"","synonyms":""},{"def":"to change broadcast signals into sounds or pictures on a television, radio, etc.","examples":["to receive programmes via satellite","a device for sending and receiving electronic signals"],"opposite":"","synonyms":""},{"def":"to be able to hear a radio message that is being sent by somebody","examples":["I'm receiving you loud and clear."],"opposite":"","synonyms":""},{"def":"to buy or accept goods that you know have been stolen","examples":[],"opposite":"","synonyms":""},{"def":"to be the player that the server hits the ball to","examples":["She won the toss and chose to receive."],"opposite":"","synonyms":""},{"def":"to be the person that an action, etc. is directed at, especially an unpleasant one","examples":["She found herself on the receiving end of a great deal of criticism."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be at/on the receiving end (of something)","def":"to be the person that an action, etc. is directed at, especially an unpleasant one","examples":["She found herself on the receiving end of a great deal of criticism."]}],"phrasal":[],"related":[]}]