[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rec/recip/recipe__us_2.mp3","phonsUS":"/ˈresəpi/","level":"A2","meanings":[{"def":"a set of instructions that tells you how to cook something and the ingredients (= items of food) you need for it","examples":["recipe for something a recipe for chicken soup","vegetarian recipes","a recipe book","You need to follow the recipe carefully.","She eventually convinced her mother to share the recipe.","This recipe calls for 120g of butter.","a collection of 100 delicious recipes from top chefs","I tried some recipes from this book.","The dish is made to a (= according to) traditional Italian recipe.","The jam is based on a 14th century recipe.","Each month we feature easy low-fat recipes.","He is credited with having discovered the first recipe for gin back in the 1600s.","I enjoy trying out new recipes.","I have a good recipe for fudge.","I tried a new recipe and it was a great success.","If you want the dish to turn out right you should follow the recipe.","She always said that if a recipe calls for cream you shouldn't use yogurt instead.","The ales are brewed to an original Yorkshire recipe.","The basic recipe can be adapted by adding grated lemon peel.","The recipe contains lots of fat.","The website offers cocktail recipes and tips.","They talk and share their recipes.","This is delicious—can you give me the recipe?","This recipe can also be made with ricotta cheese.","This recipe makes about thirty biscuits.","This recipe serves four people.","Was there rum in the original recipe?","a magazine filled with recipe ideas"],"opposite":"","synonyms":""},{"def":"a method or an idea that seems likely to have a particular result","examples":["His plans are a recipe for disaster.","What's her recipe for success?","a recipe for failure/chaos/trouble","Turning away under a strong attack is a sure recipe for defeat.","To live every day to the full is a recipe for happiness.","That sounds like a sure-fire recipe for disaster.","It's the perfect recipe for business success."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]