[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rec/recom/recommendation__us_1.mp3","phonsUS":"/ˌrekəmenˈdeɪʃn/","level":"B1","meanings":[{"def":"an official suggestion about the best thing to do","examples":["to accept/reject a recommendation","recommendation for something Her report lists numerous recommendations for the improvement of safety.","recommendation to somebody The committee made recommendations to the board on teachers' pay and conditions.","The major recommendation is for a change in the law.","recommendation on something recommendations on the use of vaccines","recommendation how, what, etc… The commission will make recommendations on how to reduce emissions of greenhouse gases.","recommendation from somebody/something We will be implementing all the recommendations from the report.","The council will follow any recommendations made by the fire investigators.","We accept the 16 recommendations of the report.","on the recommendation of somebody/something I had the operation on the recommendation of my doctor.","The Senate recommendation stated that the privatization of public hospitals should stop.","The UN Security Council endorsed the recommendation submitted by the Secretary General.","The committee has produced a set of recommendations on ethics in healthcare.","The committee put forward broad recommendations for the improvement of safety at sports grounds.","The design of the breakwater was based on the recommendations of an engineering study.","The government gave assurances that it would implement the recommendations in full.","The report made wide-ranging recommendations for government.","a detailed set of recommendations following a comprehensive examination of the subject","recommendations aimed at achieving a more equitable admissions policy","recommendations by the judges","recommendations for improving the quality of service","recommendations in respect of bank officials","recommendations on how health and safety standards might be improved","recommendations with regard to management procedures","the board's recommendations to the minister","to develop a plan in line with the recommendations of national policy","The report made a number of recommendations."],"opposite":"","synonyms":""},{"def":"the act of telling somebody that something is good or useful or that somebody would be suitable for a particular job, etc.","examples":["It's best to find a builder through personal recommendation.","on somebody's recommendation We chose the hotel on their recommendation (= because they recommended it).","Here's the list of my top restaurant recommendations.","The girl lived up to her mother’s recommendation of being ‘good with children’.","Swiss chocolates need no recommendation.","The chef comes with her recommendation.","These two albums get my highest recommendation.","We went to Corfu on your recommendation.","What are your practical recommendations for a healthy diet?","I sent them a résumé and three letters of recommendation.","The new housekeeper came on the highest recommendation.","Many companies hire through word-of-mouth recommendations from existing employees."],"opposite":"","synonyms":""},{"def":"a formal letter or statement that somebody would be suitable for a particular job, etc.","examples":["The company gave her a glowing recommendation.","Will you write me a recommendation letter?"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]