[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rec/recov/recover__us_1.mp3","phonsUS":"/rɪˈkʌvər/","level":"B2","meanings":[{"def":"to get well again after being ill, hurt, etc.","examples":["recover from something He's still recovering from his operation.","She spent many weeks in hospital recovering from her injuries.","He has fully recovered from the shoulder surgery.","She remains in serious condition, but is expected to recover.","The victim is recovering well at home.","Mrs Burton was last night recovering from her injuries in hospital.","She had hardly recovered from the birth of her last baby.","Yates is struggling to recover form a serious knee injury.","Your baby is recovering well.","Mother and baby are recovering well."],"opposite":"","synonyms":""},{"def":"to return to a normal state after an unpleasant or unusual experience or a period of difficulty","examples":["recover from something It can take many years to recover from the death of a loved one.","The economy is at last beginning to recover."],"opposite":"","synonyms":""},{"def":"to get back the same amount of money that you have spent or that is owed to you","examples":["He is unlikely to ever recover his legal costs.","Creditors have a right to recover their debts.","Some investors tried to recover their losses by making further high risk investments."],"opposite":"","synonyms":""},{"def":"to get back or find something that was lost, stolen or missing","examples":["recover something The police eventually recovered the stolen paintings.","recover something from somebody/something Six bodies were recovered from the wreckage."],"opposite":"","synonyms":""},{"def":"to win back a position, level, status, etc. that has been lost","examples":["The team recovered its lead in the second half."],"opposite":"","synonyms":""},{"def":"to get back the use of your senses, control of your emotions, etc.","examples":["recover something It took her a few minutes to recover consciousness.","to recover your sight","recover yourself She seemed upset but quickly recovered herself."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["re-cover"]}]