[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rec/recor/record__us_1.mp3","phonsUS":"/ˈrekərd/","level":"A2","meanings":[{"def":"a written account of something that is kept so that it can be looked at and used in the future","examples":["You should keep a record of your expenses.","medical/dental records","It was the worst flood since records began.","according to… records According to official records, there were 21 murders in the city that year.","on record Last summer was the wettest on record.","people who leave no trace in the historical record (= written documents that provide evidence about the past)","Do you have a record of how much you spent?","He has always kept an accurate record of his spending.","I checked the records but nobody by that name has worked here.","It was the driest summer on record.","Medical records should not be destroyed.","No formal record of the marriage now survives.","No record exists of a battle on this site.","The records contain the bank details of all employees.","The records showed that the building had not been inspected for ten years.","The university records go back as far as the 13th century.","There are cell phone records that prove we were not even in the apartment.","There is no exact record of the number of accidents.","The court records reveal the timing of the crime.","Under the law, every citizen has access to their official records.","We have no record of your conversation with Mr Smith.","a verbatim record of the meeting","records on children's progress","Auditors inspected their financial records.","I asked them to check their records again.","No record of the transaction existed.","The body was identified from dental records.","The company's records were neither complete nor up-to-date.","The computer automatically updates my records every day.","Their records date back to 1846.","This seems to be an authentic record of the events around that time.","Who has your medical records?","We keep all sales records for five years.","According to historical records, she was married at the age of eighteen.","Electronic records confirmed her purchase.","You are required to maintain records of your production activities.","Modern agriculture could not exist without record keeping."],"opposite":"","synonyms":""},{"def":"the best result or the highest or lowest level that has ever been reached, especially in sport","examples":["She holds the world record for the 100 metres.","to break the record (= to achieve a better result than there has ever been before)","to set a new record","There was a record number of candidates for the post.","I got to work in record time.","The UK's biggest banks made record profits last year.","Unemployment has reached a record high (= the highest level ever).","He hopes to equal the Olympic record.","Lewis established a new world record with a time of 9.86 seconds.","He compiled a lifetime record of 209–161.","Bubka rewrote the pole-vault record books during his career.","Bob Beamon's long-standing record for the long jump was eventually broken.","His mile record stood for twelve years.","If she continues like this she could beat the record.","She has just set a new world record.","These viewing figures are an all-time record for a single broadcast.","Who holds the 100 metre sprint record?","The US saw its trade deficit shrink at a record pace in September.","She has broken all previous records."],"opposite":"","synonyms":""},{"def":"the facts that are known about somebody/something’s past behaviour, character, achievements, etc.","examples":["The airline has a good safety record.","record on something The report criticizes the government's record on housing.","record of something He has an impressive record of achievement.","the government's abysmal record on crime","When it comes to quality, our record speaks for itself.","They have the worst human rights record among member countries.","They have a good record for recognizing emerging talent.","The teacher spoke to her about her poor attendance record.","The company has maintained an accident-free record since it started business.","The airline's accident record makes it among the safest.","Apart from a parking ticket ten years before, she had an unblemished driving record.","He has a long arrest record.","He has a brilliant military record.","She has an appalling record for dishonesty.","He has an unenviable record of ill-health.","Her record shows that she is able to compete under great pressure.","Our record compares favourably with that of any similar-sized company.","The team lost their unbeaten record after 49 games.","She has a thirty-year record of achievement as a teacher."],"opposite":"","synonyms":""},{"def":"rocks, fossils, the parts of buildings and objects found in the ground, etc. that provide evidence about the past","examples":["Fossil records suggest that the region was covered in water until relatively recently.","evidence in the geological record","This period of barbarian rule is poorly represented in the archaeological record."],"opposite":"","synonyms":""},{"def":"the fact of having committed crimes in the past","examples":["Does he have a record?","teenagers with a criminal record"],"opposite":"","synonyms":""},{"def":"a thin, round piece of plastic on which music, etc. is recorded","examples":["to play a record","a record collection","The album earned him his second gold record.","Her walls became lined with gold and platinum records."],"opposite":"","synonyms":""},{"def":"a piece or collection of music released as a record, or on CD, the internet, etc.","examples":["a record company (= one which produces and sells records)","They released their first record in 1963.","The band had a hit record in 1973.","His new record is available on CD or as a download.","During her career Billie Holiday made over 100 records.","The band signed their first record deal a year after forming.","I'll put on one of my favourite records."],"opposite":"","synonyms":""},{"def":"used to show that you want what you are saying to be officially written down and remembered","examples":["Just for the record I would like to clarify something my colleague said earlier."],"opposite":"","synonyms":""},{"def":"used to emphasize a point that you are making, so that the person you are speaking to takes notice","examples":["And, for the record, he would be the last person I'd ask."],"opposite":"","synonyms":""},{"def":"in a way that keeps repeating a statement or opinion in an annoying way","examples":["I hate sounding like a broken record, but I have to say again, we must do more to help."],"opposite":"","synonyms":""},{"def":"something that has been recorded as being true","examples":[],"opposite":"","synonyms":""},{"def":"if you tell somebody something off the record, it is not yet official and you do not want them to repeat it publicly","examples":["Strictly off the record, some members of staff will have to be made redundant.","I'm talking to you off the record","Off the record, he told the interviewer what he thought of his colleagues."],"opposite":"","synonyms":""},{"def":"to say something publicly or officially so that it may be written down and repeated","examples":["He didn't want to go on the record as either praising or criticizing the proposal.","I should like to place on record my sincere thanks to all those who have given support.","He is the latest public figure to go on (the) record about corruption in politics.","Would you go on (the) record as saying that?","She is on record as saying that she once took drugs."],"opposite":"","synonyms":""},{"def":"to give people the correct information about something in order to make it clear that what they previously believed was in fact wrong","examples":["To put the record straight, I do not support that idea and never have done.","She called a press conference to set the record straight about her disappearance.","She welcomed the opportunity to set the record straight."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"(just) for the record","def":"used to show that you want what you are saying to be officially written down and remembered","examples":["Just for the record I would like to clarify something my colleague said earlier.","And, for the record, he would be the last person I'd ask."]},{"idiom":"like a broken record","def":"in a way that keeps repeating a statement or opinion in an annoying way","examples":["I hate sounding like a broken record, but I have to say again, we must do more to help."]},{"idiom":"a matter of record","def":"something that has been recorded as being true","examples":[]},{"idiom":"off the record","def":"if you tell somebody something off the record, it is not yet official and you do not want them to repeat it publicly","examples":["Strictly off the record, some members of staff will have to be made redundant.","I'm talking to you off the record","Off the record, he told the interviewer what he thought of his colleagues."]},{"idiom":"put/place something on (the) record | be/go on (the) record (as saying…)","def":"to say something publicly or officially so that it may be written down and repeated","examples":["He didn't want to go on the record as either praising or criticizing the proposal.","I should like to place on record my sincere thanks to all those who have given support.","He is the latest public figure to go on (the) record about corruption in politics.","Would you go on (the) record as saying that?","She is on record as saying that she once took drugs."]},{"idiom":"put/set the record straight","def":"to give people the correct information about something in order to make it clear that what they previously believed was in fact wrong","examples":["To put the record straight, I do not support that idea and never have done.","She called a press conference to set the record straight about her disappearance.","She welcomed the opportunity to set the record straight."]}],"phrasal":[],"related":["gold record","pre-record","tape-record","record holder","record player","track record","criminal record","record-breaker","record-breaking","Congressional Record","Public Record Office","record-breakers","record holders","record players","like a stuck record","like a broken record"]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rec/recor/record__us_2.mp3","phonsUS":"/rɪˈkɔːrd/","level":"A2","meanings":[{"def":"to keep a permanent account of facts or events by writing them down, filming them, storing them in a computer, etc.","examples":["record something Her childhood is recorded in the diaries of those years.","You should record all your expenses during your trip.","record how, what, etc… His job is to record how politicians vote on major issues.","record that… She recorded in her diary that they crossed the Equator on 15 June.","it is recorded that… It is recorded that, by the year 630, four hundred monks were attached to the monastery.","It was all there, faithfully recorded in his uncle's formal style.","She secretly recorded the conversation.","The circumstances of her death were graphically recorded in the local press.","The contract is witnessed by others and duly recorded.","The event is vividly recorded in his journal.","The geographical spread of the industry in the 16th century is poorly recorded.","The mother's occupation was not routinely recorded on the birth certificate.","The names of those who died are recorded for posterity on a tablet at the back of the church.","The time of the accident is recorded as 6.23 p.m.","The weights must be recorded accurately.","historically recorded events","the most famous and deadly influenza outbreak recorded in history","As a war artist she recorded the work of female volunteers.","Examples can be found in every era of recorded history.","The discussion was recorded in detail in his diary.","The events recorded in this book took place more than a century ago.","The figures recorded for 2007 show an increase of 23 per cent.","The lists record how MPs voted on specific issues.","The register recorded the names and addresses of residents.","Their names are recorded for posterity on the monument.","There were five million crimes recorded in Britain last year.","Recorded crime accounts for between only a quarter and a tenth of total crime.","These early experiments were all recorded on film, but this historic footage has sadly been lost.","Last year, they recorded a 38% increase in complaints.","Data are recorded for each completed transaction."],"opposite":"","synonyms":""},{"def":"to make a copy of music, a film, etc. or to convert sound or a performance into a permanent form, so that you can listen to or watch it again","examples":["record (something) Did you remember to record that programme for me?","a recorded concert","Tell me when the machine starts recording.","record somebody/something doing something He recorded the class rehearsing before the performance.","a concert she had recorded from the radio","old movies recorded on videotape","Did you remember to record ‘Game of Thrones’ for me?","There was a recorded message on the customer services helpline."],"opposite":"","synonyms":""},{"def":"to perform music so that it can be copied, stored and played back","examples":["The band is back in the US recording their new album.","to record a song","They spent the summer touring and recording.","This CD has been beautifully recorded.","The songs were originally recorded on tape."],"opposite":"","synonyms":""},{"def":"to make an official or legal statement about something","examples":["The coroner recorded a verdict of accidental death.","It is with great regret that we record the death of one of our founder members."],"opposite":"","synonyms":""},{"def":"to show a particular measurement or amount","examples":["The thermometer recorded a temperature of 40°C."],"opposite":"","synonyms":""},{"def":"to achieve a particular score or result","examples":["The team recorded their first win of the season.","to record a victory/high score"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]