[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rec/recom/recommend__us_1.mp3","phonsUS":"/ˌrekəˈmend/","level":"A2","meanings":[{"def":"to tell somebody that something is good or useful, or that somebody would be suitable for a particular job, etc.","examples":["recommend somebody/something The hotel's new restaurant comes highly recommended (= a lot of people have praised it).","Can you recommend a good hotel?","recommend somebody/something to somebody I recommend the book to all my students.","recommend somebody/something for something/somebody She was recommended for the post by a colleague.","This game is recommended for children aged 12 and above.","recommend somebody/something as something The guidelines recommend low-fat dairy products as excellent sources of calcium","Consult a solicitor who is personally recommended to you.","Food supplements are sometimes recommended for diabetic patients.","I can recommend this book to anyone interested in food.","I definitely recommend this film.","In the 1990s, doctors routinely recommended hormone replacement therapy.","The commission unanimously recommended the proposal.","This book is highly recommended by teachers.","Who would you recommend for the job?","They were invited to recommend likely candidates for the two new positions."],"opposite":"","synonyms":""},{"def":"to advise a particular course of action; to advise somebody to do something","examples":["recommend something The report recommended a 10% pay increase.","It is dangerous to exceed the recommended dose.","a recommended price of $50","recommend doing something He recommended reading the book before seeing the movie.","I recommend using the latest version of the browser.","recommend against something My doctor recommended against surgery.","recommend against doing something Medical guidelines recommend against using this drug to treat migraines.","recommend (that)… I recommend that he see a lawyer.","(British English also) I recommend that he should see a lawyer.","it is recommended that… It is strongly recommended that the machines should be checked every year.","recommend somebody to do something We'd recommend you to book your flight early.","recommend how, what, etc… Can you recommend how much we should charge?","We’d recommend you to book your flight early.","a recommended price of $50","I’d advise you not to tell him.","The group does not advocate the use of violence.","The situation is dangerous and the UN is urging caution.","What would/​do you recommend?","What do you think would be best?","Which of the options do you favour/​prefer?","I can recommend the steak today.","My favourite is the Corner Cafe.","I'd recommend waiting a few months.","I suggest you have another look at the house before you make a decision.","If it were up to me/​If you ask me/​If it were my decision, I'd go for the cheaper one.","I would strongly recommend that you get professional advice.","Here are a few safeguards I recommend to my clients."],"opposite":"","synonyms":"recommend"},{"def":"to make somebody/something seem attractive or good","examples":["This system has much to recommend it.","He described the town as drab with nothing to recommend it.","Your idea has much to recommend it."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]