[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rec/recor/recording__us_1.mp3","phonsUS":"/rɪˈkɔːrdɪŋ/","level":"A2","meanings":[{"def":"sound or pictures that have been recorded on computer files or on CD, DVD, video, etc.","examples":["an audio recording","a sound/live recording","He continued to make recordings with all of these orchestras.","recording of somebody/something a video recording of the wedding","recording by somebody recordings by various artists","on a recording The hijackers can be heard clearly on the recording stating their demands.","I want to play you a recording of the rehearsal.","Make a few test recordings before you start the session in earnest.","The recording gives an account of his kidnapping.","The recording sounds just like a live performance.","a complete recording of Mozart's piano sonatas","a recording by the Amadeus Quartet","field recordings of folk music from Asia","one of the first commercial recordings of the artist","the band's latest recording","to enhance the quality of the original recording","They've released a recording from the 2006 concert in Hamburg.","We were listening to classic jazz recordings from Ella Fitzgerald.","a recording of English music for clarinet and orchestra"],"opposite":"","synonyms":""},{"def":"the process of making a record, film, radio or television show, etc.","examples":["recording of something during the recording of the show","recording equipment","a recording studio/session/artist","the recording industry (= the industry that records and sells music)","We'll be entering a London studio to start recording in June.","The clarinet player has launched her recording career.","The principles of magnetic recording have been around for a long time.","a state-of-the-art digital recording facility","before the invention of sound recording"],"opposite":"","synonyms":""},{"def":"the process or act of writing down and storing information for official purposes","examples":["the recording of financial transactions","an accurate recording of time","a detailed recording of facts"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["digital recording","tape recording","recording engineer","pre-recording","tape-recording","recording engineers"]}]