[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rec/recog/recognize__us_3.mp3","phonsUS":"/ˈrekəɡnaɪz/","level":"A2","meanings":[{"def":"to know who somebody is or what something is when you see or hear them or it, because you have seen or heard them or it before","examples":["recognize somebody/something I recognized him as soon as he came in the room.","Do you recognize this tune?","You might not recognize the name but you'll know her face.","I recognized the voice immediately.","recognize somebody/something by something I recognized her by her red hair.","recognize somebody/something from something I recognized him from the photo in the paper.","recognize somebody/something as something He recognized the man as one of the police officers.","She was able to identify her attacker.","I recognized him as soon as he came in the room.","The victim has not yet been named.","I could just make out a figure in the darkness.","I immediately recognized the building.","I recognized them from a television show.","I vaguely recognized his voice, but couldn't think of his name.","She recognized the song correctly.","Stella hardly recognized her brother.","This is the only species of flamingo in the region, easily recognized by its pink plumage.","You learn to recognize the calls of different birds.","I recognized him by the way he walked.","We barely recognized her—she had changed so much in ten years."],"opposite":"","synonyms":"identify"},{"def":"to admit or to be aware that something exists or is true","examples":["recognize something They recognized the need to take the problem seriously.","Most of us recognize the importance of diet.","The government does recognize the value of the arts in this country.","You must recognize the fact that the situation has changed.","recognize something as something Drugs were not recognized as a problem then.","recognize somebody/something to be/have something Drugs were not recognized to be a problem then.","recognize how, what, etc… Nobody recognized how urgent the situation was.","recognize that… We recognized that the task was not straightforward.","it is recognized that… It is widely recognized that driver fatigue is a problem on motorways.","It was recognized that this solution could only be temporary.","It was a stupid thing to do, I admit.","She refuses to acknowledge the need for reform.","They recognized the need to take the problem seriously.","He was forced to concede (that) there might be difficulties.","She was reluctant to confess her ignorance.","He confessed to the murder.","The strength of this argument is being increasingly recognized.","They fully recognize the need to proceed carefully.","The government has belatedly recognized the danger to health of passive smoking.","The company should publicly recognize its mistake.","The company had been slow to recognize the opportunities available to it.","This issue must be recognized as a priority for the next administration.","It's important to recognize that obesity isn't necessarily caused by overeating.","The law clearly recognizes that a company is separate from those who invest in it.","He readily recognizes the influence of Freud on his thinking."],"opposite":"","synonyms":"admit"},{"def":"to accept and approve of somebody/something officially","examples":["recognize somebody/something The UK has refused to recognize the new regime.","These qualifications are recognized throughout the EU.","internationally recognized human rights","The court explicitly recognized the group's right to exist.","be recognized as somebody/something The organization has not been officially recognized as a trade union.","Such crimes are recognized by international law as crimes against humanity.","be recognized to be/have something He is recognized to be their natural leader.","Criminal law implicitly recognizes a difference between animals and property.","All rivers should be officially recognized as public rights of way.","The qualifications are internationally recognized."],"opposite":"","synonyms":""},{"def":"to be thought of as very good or important by people in general","examples":["The book is now recognized as a classic.","She's a recognized authority on the subject.","The Medway estuary is recognized internationally as a conservation area.","The 1970s are rightly recognized as a golden era of Hollywood film-making."],"opposite":"","synonyms":""},{"def":"to give somebody official thanks for something that they have done or achieved","examples":["His services to the state were recognized with the award of a knighthood."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]