[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rec/recov/recovery__us_1.mp3","phonsUS":"/rɪˈkʌvəri/","level":"B2","meanings":[{"def":"the process of becoming well again after an illness or injury","examples":["My father has made a full recovery from the operation.","to make a remarkable/quick/speedy/slow recovery","She is on the road to (= making progress towards) recovery.","A holiday would speed his recovery.","He's in recovery from the disease.","His injuries have returned as there was insufficient recovery time between games.","Laura made a miraculous recovery.","Many people make remarkable recoveries after strokes.","Mr Fisher made a full physical recovery.","She is well on the road to recovery.","We wish them all a speedy recovery.","a slow recovery to full health"],"opposite":"","synonyms":""},{"def":"the process of improving or becoming stronger again","examples":["The government is forecasting an economic recovery.","The economy is showing signs of recovery.","recovery in something a recovery in consumer spending","A recovery will come only when deflation is conquered.","The FTSE index staged a modest recovery to be 6.5 points down.","The company has made a substantial recovery over the past 12 months.","The economic circumstances are right and recovery is on the way.","The global economic recovery has strengthened significantly.","The region has been damaged by acid rain and rivers are fouled almost beyond recovery.","The world economy staged a strong recovery.","There is a robust recovery in the markets.","There is no hope of recovery.","Unemployment is high and economic recovery is still a long way off.","a disaster recovery plan","a reduction in interest rates to stimulate global economic recovery","the prospects of economic recovery"],"opposite":"","synonyms":""},{"def":"the action or process of getting something back that has been lost or stolen","examples":["There is a reward for information leading to the recovery of the missing diamonds."],"opposite":"","synonyms":""},{"def":"the room in a hospital where patients are kept immediately after an operation","examples":["Your mother is now in recovery.","After the operation she was taken to the recovery room."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["recovery position","recovery positions"]}]