[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rec/recog/recognition__us_1.mp3","phonsUS":"/ˌrekəɡˈnɪʃn/","level":"B2","meanings":[{"def":"the act of remembering who somebody is when you see them, or of identifying what something is","examples":["He glanced briefly towards her but there was no sign of recognition.","the automatic recognition of handwriting and printed text by computer","He looked up, glanced at them without recognition, and went on his way.","He pulled the hood of his cloak over his head to avoid recognition.","One of the main goals of marketing is name recognition.","Recognition slowly dawned, ‘Oh, it's you Mrs Foster!’","Recognition slowly dawned, and I remembered her from my college days.","She stared directly at the witness but he did not show a flicker of recognition.","The monitoring system allows recognition of pollution hot spots.","There was no recognition in his eyes.","a test of children's word recognition","the early recognition of a disease"],"opposite":"","synonyms":""},{"def":"the act of accepting that something exists, is true or is official","examples":["recognition that… a growing recognition that older people have potential too","recognition of something There is a general recognition of the urgent need for reform.","recognition as something to seek international/official/formal recognition as a sovereign state","The government granted full diplomatic recognition to the republics.","a country that has long sought recognition as a major power","to qualify for UN recognition as an International Biosphere Reserve","Twelve states have accorded de facto recognition to the new regime.","They claim that signature of the peace accord did not imply recognition of the state's sovereignty.","equal recognition for the work women do","There needs to be a greater recognition of corporate crime as a social problem.","Official recognition of the change came fast."],"opposite":"","synonyms":""},{"def":"public praise and reward for somebody’s work or actions","examples":["recognition for something She gained only minimal recognition for her work.","in recognition of something He received the award in recognition of his success over the past year.","personal recognition for your achievements","recognition by his superiors of the service he had performed","an award in recognition of his outstanding work","They received recognition for their 20-year commitment to safety at sea.","The judges selected three projects for special recognition.","She has worked actively but without recognition.","The award is being made in belated recognition of her services to the industry.","Recognition of his talent was long overdue.","His recitals have earned him recognition as a talented performer.","The young talent at the club deserves wider recognition."],"opposite":"","synonyms":""},{"def":"to change so much that you can hardly recognize it","examples":["The town has changed beyond recognition since I was last here.","Capitalism has been reformed almost out of all recognition.","Many of those interviewed said their job had changed beyond recognition over the past five years.","The equipment and methods of production have improved out of all recognition."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"to change, alter, etc. beyond/out of (all) recognition","def":"to change so much that you can hardly recognize it","examples":["The town has changed beyond recognition since I was last here.","Capitalism has been reformed almost out of all recognition.","Many of those interviewed said their job had changed beyond recognition over the past five years.","The equipment and methods of production have improved out of all recognition."]}],"phrasal":[],"related":["name recognition","voice recognition","speech recognition","character recognition","optical character recognition","automatic license plate recognition","automatic number plate recognition"]}]