[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rec/recru/recruit__us_1.mp3","phonsUS":"/rɪˈkruːt/","level":"B2","meanings":[{"def":"to find new people to join a company, an organization, the armed forces, etc.","examples":["recruit (somebody) We are trying to recruit officers from more diverse backgrounds.","He's responsible for recruiting at all levels.","recruit somebody to something They recruited several new members to the club.","recruit somebody to do something They recruited more staff to deal with the complaints.","A hundred patients were recruited for the study.","GM recruited heavily in the South.","Most of the workers will be recruited locally.","Peter Watson has been recruited as Sales Manager.","Senior managers are being aggressively recruited by companies.","She personally recruited the teachers.","Soldiers were recruited from the local villages.","Some of the men were recruited into the army.","Staff were recruited specially for the event.","Ten new members were recruited to the committee.","The specialist institutions directly recruit their own staff.","a drive to recruit and retain federal employees"],"opposite":"","synonyms":""},{"def":"to persuade somebody to do something, especially to help you","examples":["We were recruited to help peel the vegetables."],"opposite":"","synonyms":""},{"def":"to form a new army, team, etc. by persuading new people to join it","examples":["to recruit a task force"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"B2","meanings":[{"def":"a person who has recently joined the armed forces or the police","examples":["the training of new recruits","He spoke of us scornfully as raw recruits (= people without training or experience).","Army recruits are all trained in first aid.","Thousands of recruits had been enlisted and partly trained.","raw recruits marching up and down with the drill instructor"],"opposite":"","synonyms":""},{"def":"a person who joins an organization, a company, etc.","examples":["They are stepping up attempts to attract new recruits to the nursing profession.","All members were urged to go out and try to gain new recruits for the party.","Their business schools provide recruits for domestic industry.","It's difficult to attract recruits when working conditions are so poor."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]