[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/red/reduc/reduce__us_1.mp3","phonsUS":"/rɪˈduːs/","level":"A2","meanings":[{"def":"to make something less or smaller in size, quantity, price, etc.; to become less or smaller in size, quantity, etc.","examples":["reduce something Reduce speed now (= on a sign).","Giving up smoking reduces the risk of heart disease.","to reduce costs/numbers","a reduced rate/price","They will require car makers to reduce emissions of carbon dioxide by 30%.","reduce something by something Costs have been reduced by 20% over the past year.","reduce something from something to something The number of employees was reduced from 40 to 25.","reduce something to something The skirt was reduced to £10 in the sale.","reduce in something Towards the coast, the hills gradually reduce in size.","The number of search engines has reduced substantially over the last few years.","Legislation progressively reduced the number of situations in which industrial action could be taken.","Pollution from the works has been reduced by 70 per cent.","The price is reduced from 99 cents to 85 cents.","The risks must be reduced to the absolute minimum.","We need to reduce the speed slightly.","The program aims to reduce or eliminate pesticides.","This could greatly reduce the number of injuries suffered.","She is trying to reduce the amount of time she spends away from home.","Regulating traffic will reduce the accident rate significantly.","Many studios sell ten cards for a reduced rate.","Yoga can help reduce stress levels.","It was a tough decision to reduce the size of the workforce.","The police will be given more resources to reduce violent crime."],"opposite":"","synonyms":""},{"def":"if you reduce a liquid or a liquid reduces, you boil it so that it becomes less in quantity","examples":[],"opposite":"","synonyms":""},{"def":"to lose weight by limiting the amount and type of food that you eat","examples":["a reducing plan"],"opposite":"","synonyms":""},{"def":"to add one or more electrons to a substance or to remove oxygen from a substance","examples":[],"opposite":"","synonyms":""},{"def":"the state of being poorer than you were before. People say ‘living in reduced circumstances’ to avoid saying ‘poor’.","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"reduced circumstances","def":"the state of being poorer than you were before. People say ‘living in reduced circumstances’ to avoid saying ‘poor’.","examples":[]}],"phrasal":["reduce to","reduce to doing"],"related":["reduce to","reduce to doing","reduce something to something","reduce somebody/something (from something) to (doing) something"]}]