[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/red/reduc/reduction__us_3.mp3","phonsUS":"/rɪˈdʌkʃn/","level":"B2","meanings":[{"def":"an act of making something less or smaller; the state of being made less or smaller","examples":["Some staff received wage rises, while others experienced a reduction.","reduction in something This year has seen a 33% reduction in the number of hospital beds available.","a drastic reduction in costs","Business is improving following the reduction in interest rates.","There has been some reduction in unemployment.","a significant/substantial reduction in spending","The report recommends further reductions in air and noise emissions.","Concern over global warming has not led to a reduction in the use of oil and gas.","Greater access to medical care for older people will result in reductions in mortality.","reduction of something There are continuing demands for a reduction of US troop levels in the country.","A small percentage reduction in the cost of materials would mean a significant increase in profit.","Asian elephants have experienced a 50% reduction in numbers over the last three generations.","Every effort is made to secure the highest possible reduction in casualties.","Figures just released show a steady reduction in levels of emissions over the last four years.","I haven't noticed any significant reduction in the performance of my car since switching to unleaded fuel.","I welcome the reduction in road traffic fatalities.","Our average margins dropped to 35%, which represents a reduction in gross margins of £109 million.","Police said they had noticed a significant reduction in crime last year.","She had a breast reduction last year.","She proposed a reduction in the state president's powers.","The IMF claims to put poverty reduction at the heart of its policies.","The budget forecasts a deficit reduction of 27%.","The changes may result in a greater reduction in employee numbers than we had previously expected.","The company has had a reduction in sales.","The government has found it difficult to make real reductions in government spending.","The result is a 75 to 80% size reduction.","There has been a sharp reduction in the number of accidents on motorways.","These simple changes will make a substantial reduction in the fat content of your diet.","They are concerned about the reduction in numbers of people eligible for legal aid.","They suffered a severe reduction in income.","a drug strategy which prioritizes harm reduction","a reduction in the speed limit from 50 to 40 miles per hour","a reduction of carbon dioxide emissions","economic growth through a reduction in interest rates","reduction by 30%","the government's waste reduction targets","the reduction in the number of hospital beds","Both analyses show a reduction in the incidence of cancer.","The study examines how the police can achieve long-term reductions in crime.","deficit/​cost/​poverty/​emissions reduction","risk/​harm reduction"],"opposite":"","synonyms":""},{"def":"an amount of money by which something is made cheaper","examples":["price reductions","reduction for somebody/something There are reductions for children sharing a room with two adults.","reduction on something a sale with massive reductions on selected items","Guests staying 14 nights will receive a 10% reduction.","I asked for a reduction as the dress was damaged.","The gas company has announced price reductions for all customers.","a 25% reduction on normal subscription rates"],"opposite":"","synonyms":""},{"def":"a copy of a photograph, map, picture, etc. that is made smaller than the original one","examples":[],"opposite":"enlargement","synonyms":""},{"def":"the fact of adding one or more electrons to a substance or of removing oxygen from a substance","examples":[],"opposite":"","synonyms":""},{"def":"a sauce made by boiling a liquid until it becomes thick","examples":["a red wine reduction","a reduction of chicken stock, wine and cream"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Strategic Arms Reduction Talks"]}]