[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/ref/refer/reference__us_1.mp3","phonsUS":"/ˈrefrəns/","level":"B1","meanings":[{"def":"a thing you say or write that mentions somebody/something else; the act of mentioning somebody/something","examples":["reference to somebody/something She made no reference to her illness but only to her future plans.","the President’s passing reference to (= brief mention of) the end of the war","Her book contains many biblical references.","His testimony included references to memos by the company's financial managers.","Study their correspondence and you find only three references to George Washington.","She discreetly avoided any specific reference to religion.","reference to doing something The book is full of references to growing up in India.","There are frequent references in the text to the English Civil War.","He dropped casual references to the legacy of his great work.","Her diary contains no reference to the alleged appointment.","In an obvious reference to the president, he talked of corruption in high places.","The article makes no reference to his first marriage.","The audience didn't get the references to colonialism.","The book is filled with references to God.","The new constitution dropped all reference to previous wars.","They could find no further reference to Mr LaMotte in the records.","a reference to page 17","one of the earliest references to the game of chess","He's studying political science with special reference to China."],"opposite":"","synonyms":""},{"def":"the act of looking at something for information","examples":["for reference A copy of the booklet is given to the employee for reference.","Keep the list of numbers near the phone for easy reference.","I wrote down the name of the hotel for future reference (= because it might be useful in the future).","The library contains many popular works of reference (= books that contain facts and information).","We provided reference materials about our Greek vase collection.","reference to something Reference to the guide shows that the word has been used in the latter sense.","You'll find the information in the reference section of your local library.","The summary should be comprehensible without reference back to the source work.","an online reference tool","The book is organized alphabetically for easy reference.","She needs the book for reference purposes.","Retain a copy of the form for future reference.","I made a copy of your work, just for my own reference.","Gene frequencies were calculated then compared with the Finnish population as a reference group.","Our charges are calculated by reference to an hourly rate.","The book is an invaluable source of reference for the art historian.","The book is by far the best general reference (= reference book) on natural history."],"opposite":"","synonyms":""},{"def":"a number, word or symbol that shows where something is on a map, or where you can find a piece of information","examples":["The map reference is Y4.","It is essential that an accurate grid reference is given.","Please quote your reference number when making an enquiry.","Please quote the appropriate reference in your letter.","Please send a full CV, quoting the appropriate reference."],"opposite":"","synonyms":""},{"def":"the act of asking somebody for help or advice","examples":["The emergency nurse can treat minor injuries without reference to a doctor.","The decision was made without reference to local managers."],"opposite":"","synonyms":""},{"def":"a letter written by somebody who knows you, giving information about your character and abilities, especially to a new employer","examples":["I'm sure she'll give you a good reference.","We will take up references (= contact the people who provided them) after the interview.","We'll need a reference from your current employer.","She asked him to provide a reference for her.","Dr Kemp had written a reference for her when she left.","He had a number of good character references, including one from a retired policeman."],"opposite":"","synonyms":""},{"def":"a person who agrees to write a reference, for you, for example when you are applying for a job","examples":["My previous boss will act as a reference for me.","His former employer agreed to act as a reference for him."],"opposite":"","synonyms":""},{"def":"a note in a book that tells you where a particular piece of information comes from","examples":["There is a list of references at the end of each chapter.","For references, see Section D above.","reference to something References to previous research are listed in an appendix.","References to original sources are given at the end of each chapter.","The date of publication should be included in the reference."],"opposite":"","synonyms":""},{"def":"used to say what you are talking or writing about","examples":["With reference to your letter of July 22…","I am writing with reference to your job application."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in/with reference to","def":"used to say what you are talking or writing about","examples":["With reference to your letter of July 22…","I am writing with reference to your job application."]}],"phrasal":[],"related":["cross reference","cross-reference","reference book","reference library","reference point","frame of reference","point of reference","terms of reference","reference books","reference points","reference libraries","frames of reference","Common European Framework of Reference for languages"]},{"pos":"verb","level":"","meanings":[{"def":"to refer to something; to provide a book, etc. with references","examples":["Each chapter is referenced, citing literature up to 2018."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]