[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/ref/refle/reflect__us_1.mp3","phonsUS":"/rɪˈflekt/","level":"B1","meanings":[{"def":"to show the image of somebody/something on the surface of something such as a mirror, water or glass","examples":["be reflected (in something) His face was reflected in the mirror.","She looked into the water and saw her face reflected there.","She could see herself reflected in his eyes."],"opposite":"","synonyms":""},{"def":"to throw back light, heat, sound, etc. from a surface","examples":["reflect something The windows reflected the bright afternoon sunlight.","This material absorbs the sound, and doesn’t reflect it.","reflect something + adv./prep. When the sun's rays hit the earth, a lot of the heat is reflected back into space.","reflect + adv./prep. The sun reflected dully off the stone walls.","Light reflects directly off a face of a crystal.","The screen reflects light from the sun."],"opposite":"","synonyms":""},{"def":"to show or be a sign of the nature of something or of somebody’s attitude or feeling","examples":["Our newspaper aims to reflect the views of the local community.","His music reflects his interest in African culture.","This year's figures simply reflect the fact that we have fewer people out of work.","Does popular culture reflect reality or distort it?","They are constantly revising the dictionary to reflect changes in language.","Her remarks accurately reflect the views of most of us.","Senegalese culture strongly reflects influences from Islamic rulers.","The condition of the house is reflected in its low price.","The exhibition is designed to reflect the diversity of the nation and its regions.","The punishment should adequately reflect the revulsion felt by most people for this appalling crime.","The views expressed in this article do not necessarily reflect those of the editor.","Her face reflected the power of her feelings.","The story reflects very modern concerns and issues.","Schools need to reflect the increasing cultural diversity of modern society."],"opposite":"","synonyms":""},{"def":"to think carefully and deeply about something","examples":["Before I decide, I need time to reflect.","reflect on/upon something She was left to reflect on the implications of her decision.","William had little time to reflect upon these episodes.","reflect that… On the way home he reflected that the interview had gone well.","reflect how, what, etc… She reflected how different it could have been.","+ speech ‘It could all have been so different,’ she reflected.","He reflected ruefully that his money didn't buy as much as it used to","One good thing, he reflected wryly, was that none of his colleagues would find out.","She paused to reflect on what she had achieved.","an opportune time to reflect critically on the city's past","I paused to reflect how I would answer that question."],"opposite":"","synonyms":""},{"def":"to make somebody/something appear to be good, bad, etc. to other people","examples":["This incident reflects badly on everyone involved.","This kind of conduct reflects very poorly on you.","information that may reflect negatively on research participants"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"reflect well, badly, etc. on somebody/something","def":"to make somebody/something appear to be good, bad, etc. to other people","examples":["This incident reflects badly on everyone involved.","This kind of conduct reflects very poorly on you.","information that may reflect negatively on research participants"]}],"phrasal":[],"related":[]}]