[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/ref/refor/reform__us_1.mp3","phonsUS":"/rɪˈfɔːrm/","level":"C1","meanings":[{"def":"change that is made to a social system, an organization, etc. in order to improve or correct it","examples":["a government committed to reform","economic/electoral/constitutional, etc. reform","the reform of the educational system","reforms in education","far-reaching/major/sweeping reforms","Healthcare reform is long overdue.","His administration carried out economic reforms.","His economic reforms failed to improve their lives.","Publishers continue to push for sweeping reforms.","The House narrowly passed the education reform bill.","The Prime Minister promised sweeping reforms of the banking system.","The conservative coalition could delay further reforms or block them altogether.","The country desperately needs broad political and constitutional reform.","The government instituted a tax reform to stimulate demand.","The practice of global politics requires reform.","The reforms went through in spite of opposition from teachers.","There remains reluctance to undertake the structural reforms advocated by Mr Smith.","They have issued a statement advocating reform of the legal system.","They wanted to push through radical reforms.","Top on his list was immigration reform.","We are committed to supporting democracy and reform in the region.","advocates of health-care reform","efforts to accelerate the structural reform of the economy","much-needed reforms","our debate on intelligence reform","tax reforms aimed at encouraging land development","the battle for corporate reform"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["re-form","land reform","Reform Acts","Reform Club","Electoral Reform Society","Howard League for Penal Reform","Reform Act","reform school"]},{"pos":"verb","level":"C1","meanings":[{"def":"to improve a system, an organization, a law, etc. by making changes to it","examples":["proposals to reform the social security system","The law needs to be reformed.","a reforming administration","The education system must be radically reformed.","the near impossibility of truly reforming the system","There are proposals to reform the welfare system."],"opposite":"","synonyms":""},{"def":"to improve your behaviour; to make somebody do this","examples":["He has promised to reform.","reform somebody She thought she could reform him."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]