[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/ref/refus/refuse__us_4.mp3","phonsUS":"/rɪˈfjuːz/","level":"A2","meanings":[{"def":"to say or show that you will not do something that somebody has asked you to do","examples":["Go on, ask her; she can hardly refuse.","refuse to do something He flatly refused to discuss the matter.","She refused to accept that there was a problem.","My brother refused to allow anyone to help him.","She refused to comment further.","He has steadfastly refused to answer my questions.","They simply refuse to give up.","refuse something The demand for an apology was pointedly refused.","Gerard refused point-blank to cooperate.","He didn't dare to refuse.","The Court has repeatedly refused to bend on this point.","Workers should be entitled to refuse to work under these conditions."],"opposite":"","synonyms":""},{"def":"to say that you do not want something that has been offered to you","examples":["I politely refused their invitation.","The job offer was simply too good to refuse.","I must refuse your generous offer.","She offered them cups of tea and it seemed churlish to refuse.","We invited her to the wedding but she refused.","They made me an offer I couldn't refuse.","Two patients refused treatment."],"opposite":"","synonyms":""},{"def":"to say that you will not allow something; to say that you will not give or allow somebody something that they want or need","examples":["refuse something He refused our request for an interview.","The bank refused his demand for a full refund.","The authorities refused permission for the new housing development.","The judge refused her application for bail.","The government has refused all demands for a public inquiry.","refuse somebody something They refused him a visa.","The judge refused them permission to appeal.","She would never refuse her kids anything."],"opposite":"","synonyms":""},{"def":"to fail to do what you want or expect it to do","examples":["The car refused to start.","The problem simply refuses to go away.","My ear infection is refusing to heal.","Once told, these stories refuse to disappear.","The stain refused to budge.","My legs just refused to work."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/ref/refus/refuse__us_2.mp3","phonsUS":"/ˈrefjuːs/","level":"","meanings":[{"def":"waste material that has been thrown away","examples":["domestic/household refuse","the city refuse dump","refuse collection/disposal","People dump their refuse in the surrounding woods instead of taking it to the tip.","People just dump their refuse in the street.","Refuse is collected on Fridays.","What day do they collect the refuse?","Domestic refuse can be burnt to produce electricity.","The local council is responsible for basic services such as refuse collection."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]