[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/reg/regar/regard__us_1.mp3","phonsUS":"/rɪˈɡɑːrd/","level":"B2","meanings":[{"def":"to think about somebody/something in a particular way","examples":["regard somebody/something + adv./prep. They regarded people outside their own town with suspicion.","Her work is very highly regarded.","regard somebody/something/yourself as something He regards himself as a patriot.","Capital punishment was regarded as inhuman and immoral.","She is widely regarded as the current leader's natural successor.","He seemed to regard the whole thing as a joke.","I wouldn’t call German an easy language.","You may find your illness hard to accept.","Who do you consider (to be) responsible for the accident?","Try to see things from her point of view.","How do you view your position within the company?","Civil contempt is not properly regarded as a criminal offence.","Foxes were traditionally regarded as vermin.","He seemed to regard the whole thing as a joke.","I had come to regard him as a close friend.","It would be a mistake to regard the incident as unimportant.","Many of her works are regarded as classics.","She was highly regarded as a sculptor.","The crash could be reasonably regarded as an opportunity to invest.","The project was widely regarded as a success.","The successful are often tempted to regard their success as a kind of reward.","They tend to regard the open expression of emotion as being soft and feminine.","an agency long regarded as ineffectual","She was well regarded by her contemporaries.","Today, the future is typically regarded with dread.","This work is generally regarded as his masterpiece."],"opposite":"","synonyms":"regard"},{"def":"to look at somebody/something, especially in a particular way","examples":["He regarded us suspiciously.","His eyes continued to regard her steadily.","She regarded the mess with distaste."],"opposite":"","synonyms":""},{"def":"relating to or in connection with somebody/something","examples":["I have little information as regards her fitness for the post.","As regards the first point in your letter…"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"as regards somebody/something","def":"relating to or in connection with somebody/something","examples":["I have little information as regards her fitness for the post.","As regards the first point in your letter…"]}],"phrasal":[],"related":["self-regard","in this/that regard","have regard to something","in/with regard to somebody/something"]},{"pos":"noun","level":"B2","meanings":[{"def":"attention to or thought and care for somebody/something","examples":["regard for somebody/something to have scant/little/no regard for somebody/something","to pay/show little regard for other people’s property","Social services should pay proper regard to the needs of inner-city areas.","without regard to somebody/something He was driving without regard to speed limits.","The decision reached has due regard for the safety of the public.","The manifesto pays scant regard to green issues.","These people had little regard for the environment.","They have no regard for the values of our community.","They paid scant regard to my views.","a lack of regard for public safety","a proper regard for human dignity","an attempt to plan the future of an industry without due regard to market forces","They show scant regard for other people's property.","We kept the matter quiet out of regard for his privacy.","She has no regard for the consequences.","We must pay due regard to basic hygiene."],"opposite":"","synonyms":""},{"def":"respect for somebody/something","examples":["He held her in high regard (= had a good opinion of her).","regard for somebody/something I had great regard for his abilities.","Children no longer have proper regard for their parents and teachers.","He is held in the highest regard by his colleagues.","I have the greatest regard for his abilities.","The composer was held in high regard in England.","The film has won critical regard in America.","I had great regard for his abilities as a teacher.","He has a high regard for truth."],"opposite":"","synonyms":""},{"def":"used to send good wishes to somebody at the end of an email or letter, or when asking somebody to give your good wishes to another person who is not present","examples":["With best/kind regards, Yours…","Give your brother my regards when you see him.","My regards to your aunt.","The letter ended, ‘Kindest regards, Felicity.’"],"opposite":"","synonyms":""},{"def":"to remember and think carefully about something","examples":["It is always necessary to have regard to the terms of the contract.","New sites for waste disposal will be determined having regard to environmental matters.","When exercising its discretion, the court will have regard to all the circumstances."],"opposite":"","synonyms":""},{"def":"relating to somebody/something","examples":["a country’s laws in regard to human rights","The company's position with regard to overtime is made clear in their contracts.","I am writing with regard to your recent order."],"opposite":"","synonyms":""},{"def":"relating to what has just been mentioned","examples":["I have nothing further to say in this regard."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"have regard to something","def":"to remember and think carefully about something","examples":["It is always necessary to have regard to the terms of the contract.","New sites for waste disposal will be determined having regard to environmental matters.","When exercising its discretion, the court will have regard to all the circumstances."]},{"idiom":"in/with regard to somebody/something","def":"relating to somebody/something","examples":["a country’s laws in regard to human rights","The company's position with regard to overtime is made clear in their contracts.","I am writing with regard to your recent order."]},{"idiom":"in this/that regard","def":"relating to what has just been mentioned","examples":["I have nothing further to say in this regard."]}],"phrasal":[],"related":[]}]