[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/reg/regim/regime__us_2_rr.mp3","phonsUS":"/reɪˈʒiːm/","level":"C1","meanings":[{"def":"a method or system of government, especially one that has not been elected in a fair way","examples":["a fascist/totalitarian/military, etc. regime","an oppressive/brutal regime","An interim government was elected to replace the ousted regime.","Crowds celebrated the downfall of the old regime.","Education was seen as a way of bolstering the existing regime.","He spoke of the abhorrent crimes that had been committed under the regime.","In 1940 a puppet regime was established by the invaders.","She called for sanctions against the regime.","The communist regime came to power in 1975.","The tyrannical regime violently repressed any opposition.","These regimes pose a grave and growing danger.","a harsh and unrelenting theocratic regime","a military regime headed by the general","a military regime under Franco","collaboration with the secular Egyptian regime","dictatorships and autocratic regimes","the day he and his regime are removed from power","the real war aim of regime change","the threat posed by rogue regimes","He described the government as one of the most brutal and repressive regimes in the world today.","She was imprisoned because of her opposition to the regime.","They are investigating human rights abuses under the previous military regime."],"opposite":"","synonyms":""},{"def":"a method or system of organizing or managing something","examples":["Our tax regime is one of the most favourable in Europe.","It will be necessary to create a regime to monitor compliance with the agreements.","Under the new regime you will be liable for automatic penalties for late submission of tax returns.","a challenge to the global nuclear non-proliferation regime","a financial regime imposed by the government","the UN-enforced sanctions regime","the company's outstanding safety regime","the new regime for accounting for charities"],"opposite":"","synonyms":""},{"def":"a set of rules about food and exercise or medical treatment that you follow in order to stay healthy or to improve your health","examples":["a dietary regime","I'm going swimming every day as part of my new fitness regime.","The children were subjected to a strict regime of meals, walks and lessons.","He suggested to me that I follow his fitness regime.","a regime based on discipline and training"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["regime change","regime changes"]}]