[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/reg/regis/registration__us_1.mp3","phonsUS":"/ˌredʒɪˈstreɪʃn/","level":"B2","meanings":[{"def":"the act of making an official record of something/somebody","examples":["the registration of letters and parcels","the registration of students for a course","registration fees","the registration of a child’s birth","Certain charities are exempt from VAT registration.","I headed to the registration desk to find out where the talk was.","Registration for this event ends on December 10.","Registration with the council is compulsory.","The organization will conduct voter registration for overseas nationals.","The registration deadline is November 4.","Under the new regulation we can grant full registration to foreign lawyers.","You must have the voter registration number on the form.","You should be eligible for registration as a student member.","You will receive a free CD on registration with the club.","a complimentary registration for the 2002 meeting of the society","a failure to comply with the registration requirements","a voter registration campaign","civil registration of births","on-site registration for this week's events","registration as a political party","states that allow same-day voter registration","the registration of the vehicle by the appropriate authority"],"opposite":"","synonyms":""},{"def":"a document showing that an official record has been made of something","examples":["my Democratic party registration","the information on the registration roll","I traced my family history using the civil registration records."],"opposite":"","synonyms":""},{"def":"the series of letters and numbers that are shown on a number plate at the front and back of a vehicle to identify it","examples":["The police are looking for a black car with German registration plates."],"opposite":"","synonyms":""},{"def":"the time when a teacher looks at the list of students on the class register and checks that the students are present","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["registration number","registration plate","registration numbers","registration plates"]}]