[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/reg/regio/region__us_1.mp3","phonsUS":"/ˈriːdʒən/","level":"A2","meanings":[{"def":"a large area of land, usually without exact limits or borders","examples":["mountainous/coastal regions","the northern/southern/central, etc. region","This is one of the most densely populated regions of North America.","in the region There are more than two million people living in the region.","Many new species have been discovered in the Amazon region.","across the region Businesses across the region are supporting the project.","throughout the region The plant is found throughout the western region of the country.","Italy's richest region","Nomads have inhabited this region for thousands of years.","Sanitary facilities varied widely from region to region.","Sports events across the region have been affected by the weather.","The animal is found in the northern regions of Sweden.","The champagne-producing region covers 34 500 hectares.","This bird is largely confined to the southern regions of the country.","This tropical forest region is characterized by frequent heavy rainfall.","Twenty participants from the Asia-Pacific region will be invited to the seminar.","a sparsely populated region","an attempt to bring peace and stability to a troubled region","oil exploration in remote regions of the Russian Far East","the poorer regions of the continent","Many new species have been discovered in the Amazon region.","Soil erosion is particularly serious in dry tropical regions."],"opposite":"","synonyms":""},{"def":"one of the areas that a country is divided into, that has its own customs and/or its own government","examples":["Bilbao is the largest city in the Basque region in northern Spain.","The country is divided into 17 autonomous regions."],"opposite":"","synonyms":""},{"def":"all of a country except the capital city","examples":["People in the regions should not have to travel to London to fly to the United States."],"opposite":"","synonyms":""},{"def":"a part of the body, usually one that has a particular character or problem","examples":["pains in the abdominal region","cells in a particular region of the brain","tissue from the mouth region"],"opposite":"","synonyms":""},{"def":"used when you are giving a number, price, etc. to show that it is not exact","examples":["He earns somewhere in the region of €50 000."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in the region of","def":"used when you are giving a number, price, etc. to show that it is not exact","examples":["He earns somewhere in the region of €50 000."]}],"phrasal":[],"related":[]}]