[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/reg/regis/register__us_1.mp3","phonsUS":"/ˈredʒɪstər/","level":"B2","meanings":[{"def":"to record your/somebody’s/something’s name on an official list","examples":["You can also register online.","to register a birth/marriage/death","to register a company/trademark","register somebody/something The site has 114 million registered users.","a registered charity","We expect about 50 per cent of registered voters to vote in the election.","The police has registered a case against the company.","The regulations require doctors and patients to register in a database.","The ship was registered in Panama.","Six other families were also registered at the same address.","to register at a hotel","register somebody + adj. She is officially registered disabled.","register as something They encouraged all eligible citizens to register as voters.","register somebody/something as something He then registered the name as a trademark.","register with somebody/something to register with a doctor/dentist","register somebody/something with somebody/something All childminders should be registered with the local authority.","register for something About 700 people registered for the conference.","register somebody/something for something The drug has not been registered for use in Australia.","register to do something More than 5 000 people registered to take part in the contest.","register somebody to do something 78 per cent reported that they were registered to vote.","About 68 per cent of illegitimate births were jointly registered by both parents.","As I reached my eighteenth birthday I duly registered for military service.","He registered at his local university.","On completion of the preregistration year, graduates become fully registered by the General Medical Council.","Players must register online before playing the game.","Students living away from home are required to register with a local doctor.","There is still time to register for English classes.","They had not properly registered as required by state law.","You must register the death within three days.","the number of people officially registering as unemployed","the preferences of newly registered voters","All students must be registered with a local doctor.","Many older people have registered for a postal vote.","Not all firms are registered for VAT.","Only 2% of the workforce was registered as unemployed.","The company's logo has not yet been registered as a trademark.","Visitors to the country had to register with the police.","You need to go to the Registrar's Office to register the death."],"opposite":"","synonyms":""},{"def":"to make your opinion known officially or publicly","examples":["China has registered a protest over foreign intervention."],"opposite":"","synonyms":""},{"def":"if a measuring instrument registers an amount or something registers an amount on a measuring instrument, the instrument shows or records that amount","examples":["+ noun The thermometer registered 32°C.","The earthquake registered 3 on the Richter scale.","register something The stock exchange has registered huge losses this week."],"opposite":"","synonyms":""},{"def":"to show or express a feeling","examples":["Her face registered disapproval.","Shock registered on everyone's face."],"opposite":"","synonyms":""},{"def":"to notice something and remember it; to be noticed","examples":["register (something) He barely registered our presence.","I told her my name, but it obviously didn't register.","register that… He vaguely registered that the women had gone.","register where, what, etc… Slowly, my mind began to register where I was: in the hospital.","The pain that stung her hand did not seem to register.","The words registered slowly in her mind.","His eyes failed to register Meredith's surprise."],"opposite":"","synonyms":""},{"def":"to send something by mail, paying extra money to protect it against loss or damage","examples":["Can I register this, please?","a registered letter"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["cash register","Lloyd's Register","parish register","register office","electoral register","register offices"]},{"pos":"noun","level":"B2","meanings":[{"def":"an official list or record of names, items, etc.; a book that contains such a list","examples":["The bride and groom signed the register.","Could you sign the hotel register please, sir?","register of somebody/something They keep a register of all those who have contributed to the fund.","on a register to be on the register of electors","in a register an entry in a register","Income information will also appear in the register.","(British English) The teacher took the register (= checked who was present at school).","(British English) Dr Shaw was struck off the medical register for misconduct.","CEOs who were listed in a social register","He has been placed on the sex offenders' register.","It was the last entry in the register.","She was asked to draw up a register of suitable sites.","The teacher takes the register at the beginning of each class.","Their names had been entered in the register as owners of the company.","There are 36 children on the register.","a register containing details of four million cars","the keeping of an attendance register","ways of reconciling bank statements with check registers","All those appearing on the register must inform the authorities of any change of address.","You can put your name on a register of people who do not wish to receive sales calls."],"opposite":"","synonyms":""},{"def":"the range, or part of a range, of a human voice or a musical instrument","examples":["in the upper/middle/lower register","the lower register of the piano","boy trebles singing in high registers"],"opposite":"","synonyms":""},{"def":"the level and style of a piece of writing or speech, that is usually appropriate to the situation that it is used in","examples":["The essay suddenly switches from a formal to an informal register.","He has adopted an informal register so as not to alienate his audience."],"opposite":"","synonyms":""},{"def":"an opening, with a cover that you can have open or shut, that allows hot or cold air from a heating or cooling system into a room","examples":[],"opposite":"","synonyms":""},{"def":"a machine used in shops, restaurants, etc. for keeping money in, and that shows and records the amount of money received for each thing that is sold","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]