[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/reg/regre/regret__us_1.mp3","phonsUS":"/rɪˈɡret/","level":"B2","meanings":[{"def":"to feel sorry about something you have done or about something that you have not been able to do","examples":["regret something If you don't do it now, you'll only regret it.","The decision could be one he lives to regret.","I soon came to regret my action.","‘I've had a wonderful life,’ she said, ‘I don't regret a thing.’","She regretted the words the moment they were out of her mouth.","regret doing something He bitterly regretted ever having mentioned it.","I never regretted dropping out of college.","regret what, how, etc… I deeply regret what I said.","regret that I regret that I never got to meet him in person.","I immediately regretted not asking for his name and address.","It was a decision she would soon regret.","Pierre told them some things he later regretted telling.","She knew that she would live to regret this decision."],"opposite":"","synonyms":""},{"def":"used to say in a polite or formal way that you are sorry or sad about a situation","examples":["regret something The airline regrets any inconvenience.","The president said that his country deeply regretted the incident.","The United States regrets the loss of innocent civilian lives.","regret that I regret that I am unable to accept your kind invitation.","I very much regret that I cannot be with you this evening.","regret to do something We regret to inform you that your application has not been successful.","I regret to say that we cannot let you have the picture.","it is regretted that… It is to be regretted that so many young people leave school without qualifications."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"B2","meanings":[{"def":"a sad feeling because of something that has happened or something that you have done or not done","examples":["a feeling/pang/twinge of regret","It is a matter of regret that no proper investigation was carried out at the time.","What is your greatest regret (= the thing that you are most sorry about doing or not doing)?","with regret It is with great regret that I accept your resignation.","regret at something She expressed her regret at the decision.","regret at doing something She admitted her regrets at having had to give up her youthful ambitions.","regret about doing something I have no regrets about leaving Newcastle (= I do not feel sorry about it).","regret about something He confessed to a few regrets about his time in Parliament.","regret for something There has still been no official expression of regret for their deaths.","regret for doing something He said he felt deep regret for having been part of a government that had brutally violated human rights.","He gave up teaching in 2009, much to the regret of his students.","Her biggest regret was that she had never had children.","I have absolutely no regrets about resigning.","I never learned to play an instrument and that's a matter of some regret.","It is with deep regret that we announce the death of Mr Fred Fisher.","She enjoyed living alone, but felt a tiny pang of regret for her mother's cooking.","She showed no regret about leaving her country.","She thought of them without regret.","The police offered no expression of regret at his wrongful arrest.","To my regret, I lost touch with her years ago.","my sincere regret at what has happened","James felt a twinge of regret at missing the party."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]