[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/reg/regul/regular__us_2.mp3","phonsUS":"/ˈreɡjələr/","level":"A2","meanings":[{"def":"following a pattern, especially with the same time or space in between each thing and the next","examples":["regular breathing","a regular pulse/heartbeat","A light flashed at regular intervals.","There is a regular bus service to the airport.","regular meetings/visits","We also hold a regular monthly meeting.","The equipment is checked on a regular basis.","She writes a regular column for a national newspaper.","a regular geometric pattern","His blood pressures was taken at regular intervals.","She enjoyed his increasingly regular visits.","The paintings are changed on a regular basis.","at fairly regular intervals","highly regular patterns"],"opposite":"irregular","synonyms":""},{"def":"done or happening often","examples":["Do you take regular exercise?","I'm still in regular contact with friends I met at university.","Domestic violence is a regular occurrence in some families.","a painter whose work is a regular feature of the Summer Exhibition","The key to good anti-virus software is regular updates.","She went on with her regular evening task of doing the accounts.","Eat a healthy diet and take regular exercise.","In the 1950s he made regular appearances on Broadway.","Nightmares and night-time anxiety are a regular feature of his work.","Power cuts were a fairly regular occurrence.","There were regular complaints of obstruction caused by parked vehicles.","The plant requires regular pruning to maintain its shape.","There were regular disputes over boundaries.","This breed of dog benefits from a regular supply of green vegetables in its diet."],"opposite":"irregular","synonyms":""},{"def":"doing the same thing or going to the same place often","examples":["regular readers/customers/users","She is a regular contributor to many journals and magazines","regular offenders (= against the law)","He was a regular visitor to her house.","The parents are not regular churchgoers.","They have been regular customers for many years.","Her views on the subject will be familiar to regular readers of the paper.","Regular smokers also drink more alcohol than non-smokers.","Many of them were regular users of heroin.","He became a regular visitor to Hamilton Road."],"opposite":"","synonyms":""},{"def":"changing their form in the same way as most other verbs and nouns","examples":["The past participle of regular verbs ends in ‘-ed’."],"opposite":"irregular","synonyms":""},{"def":"usual","examples":["I couldn't see my regular doctor today.","On Monday he would have to return to his regular duties.","It's important to follow the regular procedure.","He was mistaken for one of the regular crew.","the last match of the regular season"],"opposite":"","synonyms":""},{"def":"of a standard size","examples":["Regular or large fries?"],"opposite":"","synonyms":""},{"def":"ordinary; without any special or extra features","examples":["Do you want regular or diet cola?","I just want to buy a regular white shirt—nothing fancy.","(approving) He's just a regular guy who loves his dog.","He's a pretty regular guy.","She comes from a perfectly regular middle-class family.","The other bag had my regular clothes in it."],"opposite":"","synonyms":""},{"def":"having an even shape","examples":["a face with regular features","He flashed a smile, showing two rows of white, regular teeth.","Her face was perfectly regular."],"opposite":"irregular","synonyms":""},{"def":"lasting or happening over a long period","examples":["The need to earn a regular income restricted the time he could spend pursuing his real interests.","She couldn't find any regular employment.","I needed to get a regular job.","I decided to give up the freelance work and concentrate on my regular job."],"opposite":"","synonyms":""},{"def":"belonging to or connected with the permanent armed forces or police force of a country","examples":["the regular army","regular soldiers"],"opposite":"irregular","synonyms":""},{"def":"used for emphasis to show that somebody/something is an exact or clear example of the thing mentioned","examples":["The whole thing was a regular disaster."],"opposite":"","synonyms":""},{"def":"very regularly; happening at the same time in the same way","examples":["He is home by six every day, regular as clockwork."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"(as) regular as clockwork","def":"very regularly; happening at the same time in the same way","examples":["He is home by six every day, regular as clockwork."]}],"phrasal":[],"related":["(as) regular as clockwork"]},{"pos":"noun","level":"","meanings":[{"def":"a customer who often goes to a particular shop, pub, restaurant, etc.","examples":["He's one of our regulars."],"opposite":"","synonyms":""},{"def":"a person who often plays in a particular team, takes part in a particular television show, etc.","examples":["We are missing six first-team regulars because of injury."],"opposite":"","synonyms":""},{"def":"a professional soldier who belongs to a country’s permanent army","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]