[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/reg/regul/regulation__us_2.mp3","phonsUS":"/ˌreɡjuˈleɪʃn/","level":"B2","meanings":[{"def":"an official rule made by a government or some other authority","examples":["too many rules and regulations","fire/building regulations","the strict regulations governing the sale of weapons","To comply with government hygiene regulations, there must be a separate sink for hand washing.","against regulations It's against safety regulations to fix these doors open.","under the regulations Under the new regulations spending on office equipment will be strictly controlled.","In practice, the regulations are rarely enforced.","Regulations require water authorities to test seawater for bacteria.","States are enacting new laws and regulations.","The Act imposes more stringent regulations on atmospheric pollution.","The company took advantage of the country's lax environmental regulations.","The government is under pressure to relax censorship regulations.","The notice is in accordance with Regulation 7.","The regulations are designed to encourage lower consumption of water.","The regulations ban the use of genetically modified organisms.","The restaurant owner admitted 13 breaches of food hygiene regulations.","There are strict regulations concerning the adoption of children.","There will be stricter regulations dictating which foods are allowed in schools.","These regulations apply to all cows sold after June 1998.","These restrictions are set out in regulations made by the minister.","Tighter regulations come into force next year.","Under the new regulations, each worker must have a rest every two hours.","regulations governing trade and industry","regulations on hygiene","It's against safety regulations to eat or drink in the laboratory.","There are too many rules and regulations.","Her job is to ensure that the company complies with laws and regulations.","State and federal regulations are being introduced nationwide to restrict unhealthy food in school.","Toxic waste must be handled according to the regulations.","There are heavy fines for those who violate the regulations."],"opposite":"","synonyms":""},{"def":"controlling something by means of rules","examples":["the voluntary regulation of the press","Businesses should be free from excessive government regulation.","Food additives are subject to government regulation.","Theatre, cinema and broadcasting are all subject to regulation by local authorities.","They are calling for tighter regulation of the industry.","the regulation of the medical profession","those opposed to tighter regulation of banks","The enquiry into press self-regulation is expected to report next month.","The government has to set up an effective system of regulation.","There is a need to bring our financial regulation into line with EU standards.","What is the effect of such legal regulation on small businesses?"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["self-regulation"]},{"pos":"adjective","level":"","meanings":[{"def":"that must be worn or used according to the official rules","examples":["in regulation uniform","She was wearing the regulation school uniform."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]