[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rei/reign/reign__us_1.mp3","phonsUS":"/reɪn/","level":"C1","meanings":[{"def":"the period during which a king, queen, emperor, etc. rules","examples":["By the end of his reign, the vast empire was in decline.","in/during a reign The house was built during the reign of Henry VIII.","Look at that rain! We'll be drenched if it doesn't stop.","Take an umbrella—it's going to rain.","The country changed dramatically during her long reign.","Henry Bolingbroke was soon to reign in England as Henry IV.","She's been given free rein to spend the money however she wants.","They should learn to rein in their opinions, otherwise they'll offend somebody."],"opposite":"","synonyms":""},{"def":"the period during which somebody is in charge of an organization, a team, etc.","examples":["Sir Alex Ferguson's reign at Manchester United","The story only came out during the final days of his reign as Chief Executive."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["reign of terror"]},{"pos":"verb","level":"C1","meanings":[{"def":"to rule as king, queen, emperor, etc.","examples":["It was the first visit by a British reigning monarch to Russia.","Queen Victoria reigned from 1837 to 1901.","reign over somebody/something Herod reigned over Palestine at that time.","Look at that rain! We'll be drenched if it doesn't stop.","Take an umbrella—it's going to rain.","The country changed dramatically during her long reign.","Henry Bolingbroke was soon to reign in England as Henry IV.","She's been given free rein to spend the money however she wants.","They should learn to rein in their opinions, otherwise they'll offend somebody."],"opposite":"","synonyms":""},{"def":"to be the best or most important in a particular situation or area of skill","examples":["She will face the reigning champion in her first round match.","In the field of classical music, he still reigns supreme.","a show in which the music reigns supreme","A handful of families have reigned over Bangkok's economy for many years."],"opposite":"","synonyms":""},{"def":"to be the most obvious feature of a place or moment","examples":["At last silence reigned (= there was complete silence).","For a while, chaos and confusion reigned."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]