[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rej/rejec/reject__us_1.mp3","phonsUS":"/rɪˈdʒekt/","level":"B1","meanings":[{"def":"to refuse to accept or consider something","examples":["to reject an argument/a hypothesis/a notion/a plan","to reject a claim/an offer/a request/an application","The bank has the option of accepting or rejecting this offer.","The prime minister rejected any idea of reforming the system.","The proposal was firmly rejected.","School officials flatly rejected the proposal.","All our suggestions were rejected out of hand.","The Government rejected calls for an inquiry.","Don't just reject their suggestions out of hand.","He urged the committee to reject the plans.","It was a badly researched product that consumers rightly rejected.","She firmly rejected the suggestion that she had lied to Parliament.","The paper expressly rejected charges that it had invented the story.","The paper indignantly rejected charges that it had invented the story to boost sales.","The plan was rejected on economic grounds.","The proposal was rejected as too costly.","Their design was rejected in favour of one by a rival company.","Voters emphatically rejected the proposals.","Voters narrowly rejected the plan."],"opposite":"","synonyms":""},{"def":"to refuse to accept somebody for a job, position, etc.","examples":["Please reject the following candidates…","I've been rejected by all the universities I applied to.","Some applicants were rejected outright.","We considered offering him the job, but finally rejected him."],"opposite":"","synonyms":""},{"def":"to decide not to use, sell, publish, etc. something because its quality is not good enough","examples":["Imperfect articles are rejected by our quality control.","The book was at first rejected by publishers."],"opposite":"","synonyms":""},{"def":"to not accept a new organ after a transplant operation, by producing substances that attack the organ","examples":["Her body has already rejected two kidneys.","No one knows why a foetus is not automatically rejected by the mother's immune system.","The organs are automatically rejected by the immune system."],"opposite":"","synonyms":""},{"def":"to fail to give a person or an animal enough love or care","examples":["The lioness rejected the smallest cub, which died.","When her husband left home she felt rejected and useless.","He was only three when his father left and I think he still feels rejected.","She was rejected by her family and moved to another town."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rej/rejec/reject__us_2.mp3","phonsUS":"/ˈriːdʒekt/","level":"","meanings":[{"def":"something that cannot be used or sold because there is something wrong with it","examples":[],"opposite":"","synonyms":""},{"def":"a person who has not been accepted as a member of a team, society, etc.","examples":["one of society’s rejects"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]