[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rel/relat/relationship__us_1.mp3","phonsUS":"/rɪˈleɪʃnʃɪp/","level":"A2","meanings":[{"def":"the way in which two people, groups or countries behave towards each other or deal with each other","examples":["a personal/working relationship","a master-servant relationship","This is an opportunity to build positive customer relationships.","relationship between A and B The relationship between the police and the local community has improved.","the bilateral relationship between the US and China","relationship with somebody She has a very close relationship with her sister.","I have established a good working relationship with my boss.","We have a relationship of trust with our clients.","Spend time developing face-to-face relationships with your clients.","He creates an intimate relationship with the audience.","We formed a terrific relationship and went on to work together many times.","The two leaders succeeded in maintaining a successful relationship.","The company would not have prospered without its close financial relationships with government agencies.","Exercises such as this help forge strong relationships within the team.","Some people think only about themselves, even in family relationships.","The Prime Minister mentioned Britain's special relationship with the US.","We want to create relationships across disciplinary boundaries.","Building strong community relationships is essential.","The focus is on relationships among European countries.","The play is about power relationships at work.","The school has a very good relationship with the community.","They enjoyed a close working relationship.","They established a relationship of trust.","We want to improve the relationship that exists between the university and industry."],"opposite":"","synonyms":""},{"def":"a loving and/or sexual friendship between two people","examples":["Their affair did not develop into a long-term relationship.","It was his first sexual relationship.","Money problems have put a strain on their relationship.","relationship with somebody She was having a relationship with a younger man.","She got involved in a romantic relationship with a colleague.","relationship between A and B The relationship between Joe and Carmen is at the heart of the film.","in a relationship Are you in a relationship?","People in same-sex relationships want equal pension rights.","At the moment he isn't in a relationship.","How long have you been in this relationship?","I'm not ready to get into a new relationship.","He had brief relationships with several women.","These problems have affected all of his intimate relationships.","My husband and I have a very strong relationship.","Some people with autism have difficulty forming relationships.","The two of them have a happy and loving relationship.","People need support to get out of abusive relationships.","She was just getting over a failed relationship.","We want to educate children about sex and relationships.","The songs reflect her experiences of love and relationships.","It takes work to maintain a relationship.","She's had a series of miserable relationships.","He was not married, but he was in a stable relationship.","He's not very good at handling personal relationships.","I tried everything to make our relationship work.","His parents did not know about their relationship.","They have publicly affirmed their relationship.","In any relationship there has to be some give and take.","Lack of trust destroys many relationships.","She ended the relationship when she found out about his gambling.","Their relationship has always been a stormy one."],"opposite":"","synonyms":""},{"def":"the way in which two or more things are connected","examples":["The study demonstrated associations, but no causal relationship.","relationship between A and B They examine the relationship between poverty and crime.","She explores the intimate relationship between creation and pain.","There is often an inverse relationship between the power of the tool and how easy it is to use.","There is a symbiotic relationship (= in which both depend on the other and both get benefits) between our urban centres and the countryside.","relationship to something This comment bore no relationship to the subject of our conversation.","the complex relationship of culture to politics","in relationship to something They measured height in relationship to weight.","relationship with something Job insecurity had a significant relationship with alcohol abuse.","A clear relationship emerged in the study between happiness and level of education.","The purpose of this study was to investigate the relationship of depression to health risk behaviours among college students.","His latest book examines the relationship between spatial awareness and mathematical ability.","I can't see the relationship between the figures and the diagram.","No statistically significant relationship existed between the occurrences.","Our research will explore the relationships among these variables.","The different varieties of the language are in a dynamic relationship with each other.","The fee bears little relationship to the service provided.","There's a close relationship between increased money supply and inflation.","They discovered a relationship between depression and lack of sunlight.","They found no significant relationship between birth order and birth weight.","Numerous studies have shown a positive relationship between home values and proximity to parks and green spaces.","Family instability during adolescence has a strong linear relationship with criminality.","the inverse relationship between gas consumption and air temperature","the relationship of a parasite to its host","the symbiotic relationship between corals and algae","There is an inverse relationship between disability and social contact.","People alter their voices in relationship to background noise.","Women and men stand in a different relationship to language."],"opposite":"","synonyms":""},{"def":"the way in which a person is related to somebody else in a family","examples":["They have a very healthy father-son relationship.","relationship between A and B I'm not sure of the exact relationship between them—I think they're cousins.","relationship to somebody their relationship to each other","relationship with somebody He claimed to have a distant relationship with royalty.","a film about a dysfunctional mother / daughter relationship","We have quite an unconventional sibling relationship.","Different cultures have different ways to classify family relationships.","The relationship between mother and son is a very significant one.","The degree of increased hereditary risk will depend on your relationship to the person affected.","‘What is your relationship with Douglas?’—‘He's my step-father.’","She's my mum's cousin's daughter, so I'm not sure what that makes our relationship.","Patients were also asked about less close relationships such as half siblings and grandparents."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["love-hate relationship"]}]