[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rel/relat/relation__us_3.mp3","phonsUS":"/rɪˈleɪʃn/","level":"B1","meanings":[{"def":"the way in which two people, groups or countries behave towards each other or deal with each other","examples":["diplomatic/international/foreign relations","US-Chinese relations","teacher-student relations","relations with somebody/something Relations with neighbouring countries are under strain at present.","relations between A and B We seek to improve relations between our two countries.","(formal) to have sexual relations (= to have sex)","Relations between the two countries are strained.","Relations between the two states have improved.","Renewed efforts are being made to improve the strained relations between the two countries.","The US broke off diplomatic relations with Cuba's communist government.","The move soured relations between Washington and Moscow.","Venezuela re-established diplomatic relations with Cuba.","a breakdown of marital relations leading to divorce","a period of improved trade relations","the mechanisms that regulate the relations between labour and capital","the need to establish good relations with our European partners","the system governing social relations in India","(formal) She didn't know he was having relations with another girl.","He is responsible for press relations and marketing communications at the company.","There are close relations among firms and their suppliers.","We are moving to deepen the existing bilateral relations between the three countries.","She maintained friendly relations with Stephen's family.","gender relations","The story explores the power relations between men and women.","The meeting will seek to normalize relations between the two countries."],"opposite":"","synonyms":""},{"def":"the way in which two or more things are connected","examples":["relation between A and B the relation between rainfall and crop yields","relation to something the relation of the farmer to the land","The fee they are offering bears no relation to the amount of work involved.","Little of what he said has any relation to fact.","in relation to something (formal) I have some comments to make in relation to (= about) this matter.","Its brain is small in relation to (= compared with) its body.","He established a relation between asthma and certain types of work.","Her work explores the relation between technology and culture.","The right side of the brain deals with spatial relations between objects.","The study shows the close relation between poverty and ill health.","the complex relation between business and society","the relation of the subject to the object","Similar policies were pursued in the 1970s, particularly in relation to health services.","The energy an animal uses is in direct relation to speed and body mass.","The fee bears little relation to the service provided.","The film bore no relation to the book.","There are conflicting views in relation to this issue."],"opposite":"","synonyms":""},{"def":"a person who is in the same family as somebody else","examples":["a close/near/distant relation of mine","a relation by marriage","a party for friends and relations","He's called Brady too, but we're no relation (= not related).","relation to somebody Is he any relation to you?","What relation is Rita to you?"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["poor relation","blood relation"]}]