[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rel/relax/relax__us_1.mp3","phonsUS":"/rɪˈlæks/","level":"A1","meanings":[{"def":"to rest while you are doing something that you enjoy, especially after work or effort","examples":["Just relax and enjoy the movie.","I'm going to spend the weekend just relaxing.","He was relaxing at home, watching TV.","She finished her lunch and then relaxed in the sun.","The boys had been relaxing on the beach at their resort.","You need a little time to relax and unwind.","relax with something When I get home from work I like to relax with the newspaper.","Sit back and relax with a cup of tea.","He gradually relaxed and began to enjoy himself.","He was relaxing on the couch with a book.","Jenna relaxed against the pillows.","Just relax and take it easy.","Just try to relax completely.","Use music to help you relax."],"opposite":"","synonyms":""},{"def":"to become or make somebody become calmer and less worried","examples":["I'll only relax when I know you're safe.","I can't relax until I've spoken to her myself.","'You need to try and relax,' Jane said.","Relax! Everything will be OK.","relax somebody A herbal tea will relax you.","Julie seems to be relaxing a little now.","She instantly relaxed at the sight of him.","She realized how tense she was and consciously relaxed."],"opposite":"","synonyms":""},{"def":"to become or make something become less tight or stiff","examples":["Allow your muscles to relax completely.","relax something The massage relaxed my tense back muscles.","He relaxed his grip on her arm.","He closed his eyes and forced himself to relax his tensed body.","(figurative) The dictator refuses to relax his grip on power.","His severe expression relaxed into a half-smile."],"opposite":"","synonyms":""},{"def":"to allow rules, laws, etc. to become less strict","examples":["to relax rules/restrictions/regulations/requirements","government plans to relax the licensing laws to allow round-the-clock drinking","The council has relaxed the ban on dogs in city parks."],"opposite":"","synonyms":""},{"def":"to allow your attention or effort to become weaker","examples":["You cannot afford to relax your concentration for a moment."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]