[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rel/relat/related__us_1.mp3","phonsUS":"/rɪˈleɪtɪd/","level":"B1","meanings":[{"def":"connected with something/somebody in some way","examples":["related to something/somebody The amount of protein you need is directly related to your lifestyle.","Much of the crime in this area is related to drug abuse.","Parental unemployment was not significantly related to youth unemployment for the total sample.","These problems are closely related.","a related issue","a related question/subject/matter","links on the website to related articles","institutions engaged in similar or related activities","education and training and other related topics","In related news, the star was rushed to a Los Angeles hospital on Wednesday night.","He was suffering from a stress-related illness.","These two incidents are closely related to each other.","Is unemployment causally related to crime?","Scores in the test were not significantly related to gender.","Tax rates were indirectly related to income.","The occurrence of the disease is apparently related to standards of hygiene.","The old rates were at least indirectly related to income; the new tax takes no account of a person's ability to pay.","The traditional approach has tended to regard unemployment and inflation as being inversely related.","The two ideas are very closely related.","What she was reading was not remotely related to her work.","an earnings-related pension scheme","income-related benefits"],"opposite":"unrelated","synonyms":""},{"def":"in the same family","examples":["We're distantly related.","related to somebody Are you related to Margaret?","He claims to be distantly related to the British royal family.","related by something The Logans and the Fishers were related by marriage.","We were closely related by blood."],"opposite":"","synonyms":""},{"def":"belonging to the same group","examples":["related species","related languages","related to something The llama is related to the camel.","All the bees in the colony are genetically related."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["earnings-related","performance-related"]}]