[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rel/relea/release__us_1.mp3","phonsUS":"/rɪˈliːs/","level":"B1","meanings":[{"def":"to let somebody come out of a place where they have been kept or stuck and unable to leave or move","examples":["release somebody to release a prisoner","The hostages were released unharmed.","He was released without charge after questioning by police.","You will be released on bail and a date for your hearing will be set.","release somebody from something to release somebody from prison/jail/hospital","Firefighters took two hours to release the driver from the wreckage.","He was later released from police custody.","(figurative) Death released him from his suffering.","He was released on his own recognizance and could face up to four years in jail.","She was released from prison last week.","It's been three years since he was released from prison.","Several people charged with minor crimes were released without trial.","She was released immediately when the soldiers realized their mistake.","She was released on bail by the New York police.","The government is insisting that the men are released unconditionally.","The kidnappers have agreed to release the hostages by 12 noon.","They were interrogated before being released."],"opposite":"","synonyms":""},{"def":"to stop holding something or stop it from being held so that it can move, fly, fall, etc. freely","examples":["release something He refused to release her arm.","Intense heat is released in the reaction.","10 000 balloons were released at the ceremony.","The chemical reaction releases energy in the form of light.","release something into something the need to limit the amount of greenhouse gases being released into the atmosphere","The birds were cleaned and fed and released again into the wild.","How much radiation was released into the air?","The compound slowly releases iron into the bloodstream.","The dam suddenly released millions of gallons of water.","The factory had accidentally released a quantity of toxic waste into the sea.","the gases that are released from aerosols"],"opposite":"","synonyms":""},{"def":"to express feelings such as anger or worry in order to get rid of them","examples":["She burst into tears, releasing all her pent-up emotions.","She laughed, the tension inside her suddenly released."],"opposite":"","synonyms":""},{"def":"to remove something from a fixed position, allowing something else to move or function","examples":["to release the clutch/handbrake/switch","Now release the clutch and move away from the kerb."],"opposite":"","synonyms":""},{"def":"to make information available to the public","examples":["release something to release a statement/report/document/poll/study","to release figures/results/information/data","Police have released no further details about the accident.","release something to somebody The suspect's name has not been released to the public.","The newly released files reveal the extent of his involvement in the scandal.","Details of the attack have not yet been released to the public.","Figures to be officially released this week reveal that long-term unemployment is still rising.","Police have refused to release the name of the dead man.","The committee is expected to release its findings this summer.","The organization has released a report drawing attention to the appalling conditions.","The actual poll was not released to the media."],"opposite":"","synonyms":""},{"def":"to make a film, recording or other product available to the public","examples":["He's planning to release a solo album.","to release a film/video","They've released a new version of the original film.","There have been a lot of new products released onto the market.","The series has just recently been released on DVD.","They have finally released their debut album.","The album was originally released in 1974.","The book has not yet been released in paperback.","The film was never released theatrically in the US.","The new version is expected to be released shortly.","newly released recordings","When was the film first released?"],"opposite":"","synonyms":""},{"def":"to make something available that had previously been limited","examples":["The new building programme will go ahead as soon as the government releases the funds."],"opposite":"","synonyms":""},{"def":"to free somebody from a duty, responsibility, contract, etc.","examples":["release somebody The club is releasing some of its older players.","release somebody from something The new law released employers from their obligation to recognize unions."],"opposite":"","synonyms":""},{"def":"to make something less tight","examples":["You need to release the tension in these shoulder muscles.","to release a catch/a screw/a nut/the clutch/the brakes"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["day release","press release","time-release","work release","release candidate","shutter release"]},{"pos":"noun","level":"B1","meanings":[{"def":"the act of setting a person or an animal free; the state of being set free","examples":["release of somebody/something The government has been working to secure the release of the hostages.","The judges ordered the release of prisoners who were political opponents of the government.","The public demanded her release.","release from something Following his release from prison, he moved to London.","release of somebody from something The release of female prisoners from government jails was part of the deal.","He was granted early release (= from prison).","She can expect an early release from prison.","on/upon somebody's release from something Upon his release from jail he found work in a restaurant kitchen.","on/upon somebody's release Upon her release, she fled Germany, living first in Geneva, then Paris.","He negotiated the release of American prisoners of war.","On completing his prison sentence Smith will serve three years of supervised release.","There have been calls for his immediate and unconditional release.","his release from hospital"],"opposite":"","synonyms":""},{"def":"the act of making a film, recording or other product available to the public","examples":["The new software is planned for release in April.","It is very difficult for a Brazilian film to get an American release.","The film never received a theatrical release (= was not shown in cinemas).","The movie goes on general release (= will be widely shown in cinemas) next week.","I hadn't seen the movie since its original release.","the release of a film/report","upon (something's) release Upon its release, the film received considerable acclaim.","It's still seven weeks till the film's official release.","A release date has not been announced yet.","With its release on DVD, fans now have a chance to re-evaluate their initial impressions.","The film will go on general release in November.","The controversy threatens to delay the movie's release.","The film never got a theatrical release but went straight to DVD.","The judge authorized the release of the information.","The senator demanded the immediate release of the full report.","Under the current release schedule, the series will be available on DVD early next year.","a publicity tour for the upcoming release of her autobiography","I am anxiously awaiting the release of the next volume.","He has announced the release of his new album."],"opposite":"","synonyms":""},{"def":"a thing that is made available to the public, especially a new film or music recording","examples":["recent/new releases","the latest releases","There are several interesting album releases due out on Friday.","This is a debut release that'll simply take your breath away."],"opposite":"","synonyms":""},{"def":"the act of making information available to the public","examples":["the release of the report","The company issued a news release after the board meeting."],"opposite":"","synonyms":""},{"def":"the act of letting a gas, chemical, etc. move or flow freely","examples":["Release of these hormones gives the body a temporary increase in strength and energy.","disasters resulting from accidental releases of toxic substances","The aim is to control the risks of exposure to chemicals by preventing release at source.","release of something into something the release of carbon dioxide into the atmosphere","to monitor radiation releases"],"opposite":"","synonyms":""},{"def":"the feeling that you are free from pain, worry or some other unpleasant feeling","examples":["a sense of release after the exam","I think her death was a merciful release.","It’s just a release of tension.","She saw death as a welcome release from pain.","Sometimes we just need some release from the pressure.","Laughter is an important release valve for feelings of frustration.","Crying gave some emotional release.","All societies have social mechanisms for the release of tension."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]