[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rel/relig/religion__us_4.mp3","phonsUS":"/rɪˈlɪdʒən/","level":"B1","meanings":[{"def":"the belief in the existence of a god or gods, and the activities that are connected with the worship of them, or in the teachings of a spiritual leader","examples":["Is there always a conflict between science and religion?","He believed in God but had no interest in organized religion.","by religion They are Jewish by religion.","As a result of her brother's death, Maria found religion.","Darwinism contradicted orthodox religion.","He reportedly embraced religion and became a vegetarian.","I don't think the government should try to impose religion on our society.","These people are predominantly Russian Orthodox by religion.","They never discussed religion or politics."],"opposite":"","synonyms":""},{"def":"one of the systems of faith that are based on the belief in the existence of a particular god or gods, or in the teachings of a spiritual leader","examples":["the Jewish religion","Christianity, Islam and other world religions","The law states that everyone has the right to practise their own religion.","Almost all religions offer the idea of sacred space.","Do you still practise your religion?","Eastern religions such as Shintoism","He believes that all religions originated from a single source.","He founded a new religion.","I believe in God, but I don't belong to any organized religion.","I believe we should respect all religions of the world equally.","In their religion, mountains are sacred.","Islam is one of the great world religions.","She believed that her religion needed to be defended by philosophy and logic.","She has no religion.","The law prohibits the government form endorsing a particular religion.","The majority of children adopt the religion of their parents.","The teachers started preaching the Christian religion to us at every opportunity.","These faiths draw on the traditional religions of indigenous peoples.","This popular religion is a blend of Confucianism, Buddhism and Taoism with spirit beliefs.","a religion based on reason"],"opposite":"","synonyms":""},{"def":"a particular interest or influence that is very important in your life","examples":["For him, football is an absolute religion.","Football has become an alternative religion for many people."],"opposite":"","synonyms":""},{"def":"to suddenly start believing in a religion","examples":["We're waiting for the company to get religion on recycling."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"get religion","def":"to suddenly start believing in a religion","examples":["We're waiting for the company to get religion on recycling."]}],"phrasal":[],"related":["revealed religion","freedom of religion"]}]