[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rel/relie/relief__us_1.mp3","phonsUS":"/rɪˈliːf/","level":"B2","meanings":[{"def":"the feeling of happiness that you have when something unpleasant stops or does not happen","examples":["I felt a huge sense of relief when I heard they were all OK.","We all breathed a sigh of relief when he left.","Much to my relief the car was not damaged.","News of their safety came as a great relief.","She sighed with relief.","He smiled in relief as he saw them both.","She had gone through hell and there was no relief in sight for her.","relief to somebody This was a great relief to him.","It was a relief to be able to talk to someone about it.","It was a relief to her to realize that she was not the only one with this problem.","relief that… His mother spoke of her relief that he was now safely home.","It is actually a relief that it's finally happened.","relief at something She expressed relief at the outcome of the investigation.","relief at doing something He described his relief at securing his freedom.","What a relief!","He believes that relief only comes from helping others with their suffering.","He hugged her out of sheer relief.","I felt enormous relief once they phoned.","I felt enormous relief when he walked through the door.","Relief flooded through me as the aeroplane landed safely.","She could sense his relief when she said she wouldn't be leaving.","She smiled in relief.","She smiled with evident relief.","She sought relief in drink.","The news came as a welcome relief to Bobby.","The news of his appointment was received with a certain relief by most people.","The news was a huge relief to her.","Their relief at the news was palpable.","To my great relief, she didn't notice that anything was wrong.","relief at not having been made a fool of"],"opposite":"","synonyms":""},{"def":"the act of removing or reducing pain, worry, etc.","examples":["modern methods of pain relief","relief of something the relief of symptoms/suffering/poverty/pain","relief from something The drugs only provided temporary relief from the pain.","All the tables in the shade were occupied by people seeking relief from the heat.","Massage can bring some relief from tension.","Exercise is good for stress relief.","The injection gives complete pain relief.","Your doctor can give you symptomatic relief, but there is no cure.","Morning brought no relief from the heat.","relief from hunger","He found relief from his fears in a world of fantasy and art."],"opposite":"","synonyms":""},{"def":"food, money, medicine, etc. that is given to help people in places where there has been a war or natural disaster","examples":["disaster relief","relief efforts/operations","relief organizations/supplies/work","We raised £5 000 for famine relief.","One relief agency worker described the situation as ‘catastrophic’.","There was a huge international relief effort to bring help to the stricken area.","We need long-term solutions as well as short-term emergency relief.","The organization provides emergency famine relief.","She said that the fighting has halted almost all relief work in the area.","An effective multinational force will help speed delivery of humanitarian relief."],"opposite":"","synonyms":""},{"def":"financial help given by the government to people who need it","examples":[],"opposite":"","synonyms":""},{"def":"a reduction in the amount of tax you have to pay","examples":["relief on mortgage interest payments","No tax relief is available in respect of this loss.","You can get income tax relief for gifts to charity.","You get mortgage relief of 10% on the next £5 000.","the abolition of mortgage interest relief"],"opposite":"","synonyms":""},{"def":"something that is interesting or fun that replaces something boring, difficult or unpleasant for a short period of time","examples":["a few moments of light relief in an otherwise dull performance","There was little comic relief in his speech.","relief from something The calm of the countryside came as a welcome relief from the hustle and bustle of city life.","The comical characters are brought into the story for a little light relief.","The scene provided some comic relief for the audience."],"opposite":"","synonyms":""},{"def":"a person or group of people that replaces another when they have finished working for the day or when they are sick","examples":["The next crew relief comes on duty at 9 o'clock.","We have a pool of relief drivers available to us."],"opposite":"","synonyms":""},{"def":"the act of freeing a town, etc. from an enemy army that has surrounded it","examples":["the relief of Mafeking"],"opposite":"","synonyms":""},{"def":"a way of decorating wood, stone, etc. by cutting designs into the surface of it so that some parts stick out more than others; a design that is made in this way","examples":["The column was decorated in high relief (= with designs that stick out a lot) with scenes from Greek mythology.","The bronze doors are covered with sculpted reliefs.","The scene has been carved in high relief.","a sculpture in high relief"],"opposite":"","synonyms":""},{"def":"the effect of colours, light, etc. that makes an object easier to notice than others around it","examples":["The snow-capped mountain stood out in sharp relief against the blue sky."],"opposite":"","synonyms":""},{"def":"the quality of a particular situation, problem, etc. that makes it easier to notice than before","examples":["Their differences have been thrown into sharp relief by the present crisis.","The proximity of the wealthy suburb to the squatter camp throws the plight of the squatters into even sharper relief."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["bas-relief","debt relief","haut-relief","relief map","relief road","tax relief","Comic Relief","relief pitcher","Cooperative for American Relief Everywhere","relief maps","relief roads"]}]