[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rem/remai/remain__us_1.mp3","phonsUS":"/rɪˈmeɪn/","level":"B1","meanings":[{"def":"to continue to be something; to be still in the same state or condition","examples":["remain + adj. to remain silent","to remain standing/seated/motionless","to remain calm/confident","Train fares are likely to remain unchanged.","It remains unclear whether Russia will in fact agree to the meeting.","The museum will remain open to the public throughout the building work.","Energy prices might remain high.","His reputation remains intact.","Production levels have remained constant.","He is confident that demand will remain strong.","The rumour was confirmed by a member of the Cabinet,who wished to remain anonymous.","It remains true that sport is about competing well, not winning.","Despite threats of strike action, the management remain hopeful that an agreement can be reached.","remain + noun Her identity remains a mystery.","to remain an issue/a problem","In spite of their quarrel, they remain the best of friends.","Scotland voted to remain part of the United Kingdom","He remains a member of the Labour Party.","remain as something He will remain as manager of the club until the end of his contract.","As a result, sanctions remained in place.","This law remained in force until 1917.","Power remained in the hands of the former Communist leaders.","They were able to remain in power by forming a coalition government.","She remains in office until July.","Interest rates will remain at current levels well into next year.","It remains the case that not enough graduates are going into teaching.","Security at the airport remains tight.","The level of unemployment remains fairly constant at around 10%.","The library will remain closed until next week.","The pilot urged the passengers to remain calm.","There is every prospect of the weather remaining dry this week.","The man was not charged and the case remains under investigation.","There is more evidence today that inflation remains under control.","The company's reputation remains at risk.","She remains on good terms with him.","They remain on course to win the championship.","The brothers remained under house arrest."],"opposite":"","synonyms":""},{"def":"to still be present after the other parts have been removed, used, etc.; to continue to exist","examples":["Very little of the house remained after the fire.","Only about half of the original workforce remains.","There were only ten minutes remaining."],"opposite":"","synonyms":""},{"def":"to stay in the same place; to not leave","examples":["They remained in Mexico until June.","The plane remained on the ground.","She left, but I remained behind.","He remains in police custody until his next court date.","His application to remain in this country failed."],"opposite":"","synonyms":""},{"def":"to still need to be done, said or dealt with","examples":["remain to do something It remains to be seen (= it will only be known later) whether you are right.","Much remains to be done.","There remained one significant problem.","Of course, problems remain.","Questions remain about the president's honesty.","I feel sorry for her, but the fact remains (that) she lied to us.","The puzzle remains of what happened to the ship.","While the film is undoubtedly too long, it is nevertheless an intriguing piece of cinema.","It can be argued that the movie is too long. It is nonetheless an intriguing piece of cinema.","The film is undoubtedly too long. Still, it is an intriguing piece of cinema.","Of course, huge chunks of the book have been sacrificed in order to make a two-hour movie, but it is nevertheless a successful piece of storytelling.","Critics are wrong to argue that the film’s plot is too complicated. Certainly there are a couple of major twists, but audiences will have no difficulty following them.","It is true that you cannot make a good movie without a good script, but it is equally true that a talented director can make a good script into an excellent film.","It remains to be seen whether these two movies herald a new era of westerns, but there is no doubt that they represent welcome additions to the genre."],"opposite":"","synonyms":""},{"def":"to not become involved in something; to show no interest in people","examples":["The Emperor kept himself aloof from the people.","He has remained somewhat aloof from the business of politics.","Some thought that Britain was standing aloof from Europe.","There were many things that had kept her aloof and apart from the crowd.","Angela remained aloof.","She had always kept herself aloof from her colleagues."],"opposite":"","synonyms":""},{"def":"to not become involved in something; to show no interest in people","examples":["He has remained somewhat aloof from the business of politics."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"keep/hold (yourself) aloof | remain/stand aloof","def":"to not become involved in something; to show no interest in people","examples":["The Emperor kept himself aloof from the people.","He has remained somewhat aloof from the business of politics.","Some thought that Britain was standing aloof from Europe.","There were many things that had kept her aloof and apart from the crowd.","Angela remained aloof.","She had always kept herself aloof from her colleagues."]},{"idiom":"remain/stand aloof | keep/hold (yourself) aloof","def":"to not become involved in something; to show no interest in people","examples":["He has remained somewhat aloof from the business of politics."]}],"phrasal":[],"related":["remain/stand aloof","(be, remain, stay, etc.) in the closet"]}]