[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rem/remem/remember__us_1.mp3","phonsUS":"/rɪˈmembər/","level":"A1","meanings":[{"def":"to have or keep an image in your memory of an event, a person, a place, etc. from the past","examples":["remember somebody/something This is Carla. Do you remember her?","I don't remember my first day at school.","I'll always remember this holiday.","She doesn't remember a thing about it.","She fondly remembered her early years in India.","remember somebody/something as something He still remembered her as the lively teenager he'd known years before.","remember somebody/something from something I remember her from university .","remember somebody/something with something He will be remembered with affection by all who knew him.","As far as I can remember, this is the third time we've met.","remember doing something I remember seeing pictures of him when I was a child.","Do you remember switching the lights off before we came out?","I remember thinking what a brilliant idea that was.","I remember reading something in the paper about that.","I remember watching the film on television.","remember somebody/something doing something I can still vividly remember my grandfather teaching me to play cards.","I seem to remember the film being genuinely scary.","(formal) I can't remember his taking a single day off work.","remember (that)… I remember (that) we used to go and see them most weekends.","Why are you wanting a new phone when your current one works perfectly well?","What shall we do tonight? I’m thinking bowling.","I’m loving the weather today!","I distinctly remember Jane saying that the show started at eight.","I mostly remember the art nouveau decor of her living room.","I remember Miss Scott very well.","I remembered back to the time I saw her last.","I specifically remember her saying she would be visiting today.","This is an experience that the kids will enjoy and remember forever.","To this day, people can easily remember the show.","I remember going to Blackpool one summer.","I vaguely remember hearing him come in.","There are books you remember from your childhood.","He was a brave journalist and will be remembered with deep fondness."],"opposite":"","synonyms":""},{"def":"to bring back to your mind a fact, piece of information, etc. that you knew","examples":["You were going to help me with this. Remember?","If I remember correctly, you were supposed to collect the keys on your way here.","remember something I'm sorry—I can't remember your name.","I can't remember a time when I didn't feel this way.","He couldn't remember the words to any of the songs.","remember how, what, etc. Can you remember how much money we spent?","He was trying to remember where he had parked his car the night before.","remember (that)… Remember that we're going out tonight.","I don't exactly remember what she said.","She finally remembered what she was going to say.","Julia belatedly remembered what else she was supposed to do.","I can't remember exactly what happened."],"opposite":"","synonyms":""},{"def":"to keep an important fact in your mind","examples":["remember (that)… Remember (that) you may feel sleepy after taking the pills.","It is important to remember that exercise and a balanced diet are the foundation of any successful fitness plan.","The thing to remember is that all of this will take time.","You have to remember that he is still recovering from injury.","You need to remember that the court has a very wide discretion in such cases.","it is remembered that… It should be remembered that the majority of accidents happen in the home."],"opposite":"","synonyms":""},{"def":"to not forget to do something; to actually do what you have to do","examples":["remember to do something Remember to call me when you arrive!","Remember to keep your doors and windows locked—even if you're in the back garden.","Please remember to include a contact telephone number.","I must remember to check which day they are due to start.","Just remember to take your mosquito repellent.","remember something Did you remember your homework (= to bring it)?"],"opposite":"","synonyms":""},{"def":"to think about somebody with respect, especially when saying a prayer","examples":["a church service to remember the war dead"],"opposite":"","synonyms":""},{"def":"to give money, a present, etc. to somebody/something","examples":["My aunt always remembers my birthday (= by sending a card or present).","His grandfather remembered him (= left him money) in his will."],"opposite":"","synonyms":""},{"def":"to be famous or known for a particular thing that you have done in the past","examples":["He is best remembered as the man who brought jazz to England.","She is best remembered for her first book, ‘In the Ditch’."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be (best) remembered for something | be (best) remembered as something","def":"to be famous or known for a particular thing that you have done in the past","examples":["He is best remembered as the man who brought jazz to England.","She is best remembered for her first book, ‘In the Ditch’."]}],"phrasal":["remember me to"],"related":["remember me to","as far as I remember","remember me to somebody","as far as I can remember, see, tell, etc."]}]