[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rem/remin/remind__us_2.mp3","phonsUS":"/rɪˈmaɪnd/","level":"B1","meanings":[{"def":"to help somebody remember something, especially something important that they must do","examples":["remind somebody/yourself I'm sorry, I've forgotten your name. Can you remind me?","That (= what you have just said, done, etc.) reminds me, I must get some cash.","‘You need to finish that essay.’ ‘Don't remind me (= I don't want to think about it).’","remind somebody/yourself about/of something ‘Don't forget the camera.’ ‘Remind me about it nearer the time.’","I loved her and wanted to remind her of that.","Your advertisements should remind people of your great location.","remind somebody/yourself to do something Remind me to phone Alan before I go out.","remind somebody/yourself (that)… Passengers are reminded that smoking is not allowed on this train.","The paper reminded its readers that 4,500 soldiers were killed on the first day of the Normandy landings.","Members are reminded that the club's annual general meeting will take place on Thursday.","The bathroom mirror constantly reminds me that I am getting old.","He likes to remind everyone that he is a US senator.","I have to keep reminding myself that things could be much worse.","remind somebody/yourself what, how, etc… Can someone remind me what I should do next?","remind somebody/yourself + speech ‘You had an accident,’ he reminded her.","I called to remind him about the party.","I quickly reminded him that I had said ‘maybe’.","I simply remind them that the choice is theirs.","Reading the note suddenly reminded me of my appointment with Angela.","She gently reminded him that the baby was getting cold and should be taken indoors.","She looked at her watch to remind him of the time.","The terrorist attack painfully reminded the Americans that they are vulnerable even at home.","I'm sure I don't need to remind you that we have lost our last ten games."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["remind of"],"related":["remind of","remind somebody of somebody/something"]}]