[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rem/remov/remove__us_1.mp3","phonsUS":"/rɪˈmuːv/","level":"A2","meanings":[{"def":"to take somebody/something away from a place","examples":["remove somebody/something Illegally parked vehicles will be removed.","remove somebody/something from somebody/something He removed his hand from her shoulder.","Three children were removed from the school for persistent bad behaviour.","Remove the pan from the heat and continue to stir the sauce.","Fittings should be completely removed for cleaning.","She removed the dirty dishes from the table.","The old cladding can be easily removed using a claw hammer.","people who have been forcibly removed from their homes"],"opposite":"","synonyms":""},{"def":"to take off clothing, etc. from the body","examples":["She removed her glasses and rubbed her eyes.","Passengers no longer have to remove their shoes during security checks."],"opposite":"","synonyms":""},{"def":"to get rid of something unpleasant, dirty, etc.; to make something disappear","examples":["remove something She has had the tumour removed.","She had surgery to remove the two tumours.","to remove problems/obstacles/objections","Considerable progress has been made in removing barriers to trade within the EU.","The news removed any doubts about the company's future.","This comment has been removed by a moderator.","remove something from somebody/something The police instructed the author to remove the offending material from the website.","She asked for her name to be removed from the list of candidates.","It was impossible to remove the stain from the tablecloth.","the best way to remove stains","These stains can be difficult to remove.","Unsightly moles can be removed surgically.","Bee stings should be removed with tweezers.","By producing an heir, the Queen effectively removed her cousin's hopes of succeeding to the throne.","The proposed law would remove at a stroke the long-cherished right to trial by jury.","Translation software should effectively remove all barriers to communication between people.","A subsequent agreement removed the major obstacles to negotiations."],"opposite":"","synonyms":""},{"def":"to dismiss somebody from their position or job","examples":["The elections removed the government from power.","After his arrest on corruption charges, he was immediately removed as party president.","Only the college's governing body can remove him from office.","The shareholders of a company have the power to remove the board."],"opposite":"","synonyms":""},{"def":"to be very different from something; to not be connected with something","examples":["Many of these books are far removed from the reality of the children's lives."],"opposite":"","synonyms":""},{"def":"belonging to a different generation","examples":["He's my cousin's son so he's my first cousin once removed."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be far/further/furthest removed from something","def":"to be very different from something; to not be connected with something","examples":["Many of these books are far removed from the reality of the children's lives."]},{"idiom":"once, twice, etc. removed","def":"belonging to a different generation","examples":["He's my cousin's son so he's my first cousin once removed."]}],"phrasal":[],"related":[]},{"pos":"noun","level":"","meanings":[{"def":"an amount by which two things are separated","examples":["Charlotte seemed to be living at one remove from reality."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]