[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/ren/rent_/rent__us_2.mp3","phonsUS":"/rent/","level":"B1","meanings":[{"def":"an amount of money that you regularly pay so that you can use a house, room, etc.","examples":["I earn just about enough to pay the rent.","How much rent do you pay for this place?","The landlord has put the rent up again.","The landlord charged them a month's rent in advance.","a high/low/fair rent","He was evicted for rent arrears.","rent for something What's the average rent for homes in your part of town?","rent on something The rent on the two-bedroom flat was £250 a week.","at a … rent The supply of housing at affordable rents became inadequate.","at a rent of something The property is available at a rent of £55,000 per annum.","(British English) a rent book (= used to record payments of rent)","a low hourly rate of pay","interest rates","an admission charge","legal fees","an annual membership fee","a parking fine","He couldn't afford the rent by himself.","The company has paid out a lot of money in rent.","The company receives rent on local property that it owns.","The initial rent will be reviewed annually.","The landlord came around to collect the month's rent.","The large stores have pushed up the rents in the area.","The movement advocated the non-payment of rent and taxes.","The new lease will put her rent up to £200 a week.","The rent charged depends largely on the size and locality of the flat.","The rent for the four-roomed house is affordable.","The rent is due on the last day of the quarter.","The rent will be fixed at 18% of the market value of the property.","The tenants were not prepared to pay the higher rents demanded.","Their rent has increased from $25 200 to $28 600 a year.","There was a sign saying ‘Room for rent’.","They earned rent from their property in London.","They get free rent in return for taking care of the house.","They took the landlord to court over increasing rent levels.","They weren't paying market rent on the properties.","Thousands try to avoid the rent man so they can have more cash to spend.","We gave tenants rent books.","You put your tenancy at risk if you fall behind with the rent.","the rent on a factory","to be liable for arrears of rent","Rents are rising in the business district.","They began falling behind in their rent."],"opposite":"","synonyms":"rate"},{"def":"the amount of money that you pay to use something for a particular period of time","examples":[],"opposite":"","synonyms":""},{"def":"a torn place in a piece of material or clothing","examples":[],"opposite":"","synonyms":""},{"def":"available to rent","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"for rent","def":"available to rent","examples":[]}],"phrasal":[],"related":["low-rent","rent-a-","rent boy","rent-free","ground rent","rent-seeking","peppercorn rent","Rent Act","rent boys"]},{"pos":"verb","level":"B1","meanings":[{"def":"to regularly pay money to somebody so that you can use something that they own, such as a house, a room, some land, etc.","examples":["Are you looking to buy or rent?","rent something to rent a house/an apartment","to live in rented accommodation/housing/property","The property is available to rent on a short-term lease.","We're looking for a house to rent in the area.","rent something from somebody Who do you rent the land from?","We rented a cottage from an agency.","privately rented accommodation","She had to rent from a private landlord."],"opposite":"","synonyms":""},{"def":"to allow somebody to use something that you own such as a house or some land in exchange for regular payments","examples":["rent something (out) We rented our house out for a year when we went abroad.","She bought a three-bedroom flat with the objective of renting two rooms.","He is making a profit from renting out the property.","rent something (out) to somebody He rents rooms in his house to students.","The land is rented out to other farmers.","She agreed to rent the room to me.","rent somebody something She agreed to rent me the room."],"opposite":"","synonyms":""},{"def":"to pay money to somebody so that you can use something for a short period of time","examples":["to rent a film/movie/DVD","We rented a car for the week and explored the area.","to rent a bike/van/boat","They rented a meeting room in a downtown hotel.","She rented a car at the airport.","You can rent mountain bikes and explore the area."],"opposite":"","synonyms":""},{"def":"to be available for somebody to use if they pay a particular amount of money","examples":["The apartment rents for $500 a month."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]