[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rep/repai/repair__us_7.mp3","phonsUS":"/rɪˈper/","level":"A2","meanings":[{"def":"to fix something that is broken, damaged or torn","examples":["to repair a car/television","to repair a road/wall/building/bridge","to repair a hole/crack/leak","to repair an injury/a hernia/a tear/a defect","to repair a ligament/tendon/cartilage","He has had surgery to repair the damage.","His surgically repaired knee is bothering him.","It's almost 15 years old. It isn't worth having it repaired.","We need to get the roof repaired.","the budget for maintaining and repairing equipment","The human body has an amazing capacity to repair itself.","I'm having my car repaired next week.","Most of the damage has now been successfully repaired.","Natural vitamins in the shampoo will help repair damaged hair.","They estimate the cost of repairing the damaged roads at £1 million.","Are you going to get the television repaired?","The builders agreed to repair the structural defects.","The damage to the ship had been repaired.","We'll need to get someone to repair the roof."],"opposite":"","synonyms":""},{"def":"to say or do something in order to improve a bad or unpleasant situation","examples":["to repair relations/a relationship","It was too late to repair the damage done to their relationship.","The home team did well to repair a bad start.","They moved quickly to repair relations between themselves and the US."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["repair to"],"related":["repair to","repair to…","in good, bad, etc. repair","in a good, bad, etc. state of repair"]},{"pos":"noun","level":"B1","meanings":[{"def":"an act of repairing something","examples":["They agreed to pay the costs of any repairs.","The building was in need of repair.","for repair I took my bike in for repair.","beyond repair The car was damaged beyond repair (= it was too badly damaged to be repaired).","under repair The hotel is currently under repair (= being repaired).","The bridge will remain closed until essential repair work has been carried out.","a repair shop","proteins that are involved in DNA repair","repair of something They agreed to pay for the repair of any damage done.","Vitamin A is essential for the growth and repair of skin tissue.","repair to something The money was to be used for repairs to the school.","He quickly carried out a temporary repair to the window.","The meeting will discuss repairs to the church roof.","Investment is needed to reduce the backlog of repairs.","It is unlikely that the repairs will be completed on time.","The damage meant a nine-month repair job.","The drivers carried small toolkits for making running repairs.","The gearbox was damaged beyond repair.","The highway is undergoing major repairs.","The museum is currently closed for structural repairs.","They are responsible for the repair and maintenance of the buildings.","They provide a 24-hour repair service.","We were given a courtesy car to use while our car was under repair.","Why don't you get a TV repair man to have a look at it before you buy a new one?","a repair yard for fishing boats","nutrients needed for energy and tissue repair","to carry out repairs to the railway track"],"opposite":"","synonyms":""},{"def":"in good, etc. condition","examples":["The house is not in good repair.","The paintings were in excellent repair.","Try to keep your vehicle in good repair.","Try to assess the general state of repair of the building.","The old clock tower is in a poor state of repair.","Over half the properties were in poor repair.","The tools are old but in good repair.","The barn was in a poor state of repair."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in good, bad, etc. repair | in a good, bad, etc. state of repair","def":"in good, etc. condition","examples":["The house is not in good repair.","The paintings were in excellent repair.","Try to keep your vehicle in good repair.","Try to assess the general state of repair of the building.","The old clock tower is in a poor state of repair.","Over half the properties were in poor repair.","The tools are old but in good repair.","The barn was in a poor state of repair."]}],"phrasal":[],"related":[]}]