[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rep/repea/repeat__us_1.mp3","phonsUS":"/rɪˈpiːt/","level":"A1","meanings":[{"def":"to say or write something again or more than once","examples":["repeat something to repeat a question/a claim/an assertion/a warning","to repeat a phrase/mantra","She repeated the word several times.","I'm sorry—could you repeat that?","She kept repeating his name softly over and over again.","The opposition have been repeating their calls for the president's resignation.","Are you prepared to repeat these allegations in court?","I mentioned it before, but it bears (= is worth) repeating.","repeat yourself Do say if I'm repeating myself (= if I have already said this).","repeat that… He's fond of repeating that the company's success is all down to him.","repeat + speech ‘Are you really sure?’ she repeated.","‘Oh,’ she repeated lamely.","I can only repeat what I have already said to other journalists.","That message was still being repeated ad nauseam on the radio.","She kept repeating it over and over again like a robot."],"opposite":"","synonyms":""},{"def":"used to emphasize something that you have already said","examples":["The claims are, I repeat, totally unfounded.","Nor, to repeat, can these changes be avoided.","repeat something I am not, repeat not, travelling in the same car as him!"],"opposite":"","synonyms":""},{"def":"to say something that somebody else has said, especially in order to learn it","examples":["repeat something The teacher's statement is then repeated by the students.","repeat something after somebody Listen and repeat each sentence after me.","repeat what… Can you repeat what I've just said word for word?","repeat + speech ‘We were both asleep and didn’t hear anything,’ she repeated.","students repeating drills parrot-fashion","The students repeated each sentence after their teacher.","He repeated what she had said word for word."],"opposite":"","synonyms":""},{"def":"to tell somebody something that you have heard or been told by somebody else","examples":["repeat something to somebody I don't want you to repeat a word of this to anyone.","repeat something The rumour has been widely repeated in the press.","Why did you go and repeat what I said to Ian?","You must not repeat this to anyone.","She faithfully repeated everything he had told her."],"opposite":"","synonyms":""},{"def":"to do or produce something again or more than once","examples":["repeat something to repeat a mistake/process","to repeat an experiment/exercise","Organizers are hoping to repeat the success of last year's event.","He won his first Monaco Grand Prix in 1994 and repeated the feat in 1995, 1997 and 1999.","The treatment should be repeated every two to three hours.","They are hoping to repeat last year's victory.","These offers are unlikely to be repeated.","The programmes will be repeated next year.","to repeat a class/year/grade (= in a school, to take a class/year/grade again)","Lift and lower the right leg 20 times. Repeat with the left leg.","Try not to repeat your mistakes.","They constantly repeat the same mistakes.","There is no point in merely repeating what we've done before.","It may be necessary to repeat the dose several times to effect a cure."],"opposite":"","synonyms":""},{"def":"to happen more than once in the same way","examples":["repeat something/itself History has a strange way of repeating itself.","This phrase is repeated at intervals throughout the song.","a repeating pattern/design","A single note repeated over and over again, throbbing in my head."],"opposite":"","synonyms":""},{"def":"if food repeats, you can taste it for some time after you have eaten it","examples":["Do you find that onions repeat on you?"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"B1","meanings":[{"def":"an event that is very similar to something that happened before","examples":["repeat of something She didn't want a repeat performance of what had happened the night before.","A repeat of the 1906 earthquake could kill up to 11 000 people.","(business) a repeat order (= for a further supply of the same goods)","a repeat prescription (= for more of the same medicine)","a repeat offender (= somebody who commits a crime again)","revenues generated from repeat business","Something needs to be done urgently to prevent a repeat of this incident."],"opposite":"","synonyms":""},{"def":"a television or radio programme that has been broadcast before","examples":["‘Is it a new series?’ ‘No, a repeat.’"],"opposite":"","synonyms":""},{"def":"a passage that is repeated","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]