[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rep/reply/reply__us_1.mp3","phonsUS":"/rɪˈplaɪ/","level":"A2","meanings":[{"def":"to say or write something as an answer to somebody/something","examples":["She didn't even bother to reply.","He was quick to reply.","reply to somebody/something to reply to a question/an email/a query","He hasn't replied to any of my text messages.","She usually replies immediately to comments on her posts.","reply with something She simply replied with a smile.","reply to somebody/something with something He replied to her question with a scowl.","+ speech ‘I won't let you down,’ he replied confidently.","reply that… The senator replied that he was not in a position to comment.","I’m writing to answer your questions","I’m writing to reply to your questions.","I’m writing to answer to your questions.","I haven’t answered her email yet.","I knocked on the door but nobody answered.","‘I won’t let you down,’ he replied.","The directors were unwilling to respond to questions.","I’m writing in answer to your letter.","‘I have no idea,’ she replied calmly.","‘I know!’ she replied matter-of-factly.","‘I really don't care!’ he replied nonchalantly.","‘It was your fault!’ she replied angrily.","‘No, you're not!’ Graham replied bluntly.","‘OK, ’ he replied at length.","Calvin was insulted and replied in kind (= by insulting them back).","He didn't reply to my email.","He simply replied that he hadn't the faintest idea.","She did not reply directly to the allegations.","She replied at length, but not to the point.","Well, you weren't expecting him to reply personally, were you?","She quickly left the room before he had a chance to reply."],"opposite":"","synonyms":""},{"def":"to do something as a reaction to something that somebody has said or done","examples":["reply with something Italy took an early lead but Brazil replied with two goals in the last five minutes.","reply to something (with something) The terrorists replied to the government's statement with more violence."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"A2","meanings":[{"def":"an act of replying to something/somebody in speech, writing or by some action","examples":["I asked her what her name was but she made no reply.","I received a reply from the firm's managing director.","reply to something I got some interesting replies to my post about online banking.","in reply to something (formal) I am writing in reply to your letter of 16 March.","(British English) a reply-paid envelope (= on which you do not have to put a stamp because it has already been paid for)","without reply (British English) Morocco scored four goals without reply to win the game.","I’m writing to answer your questions","I’m writing to reply to your questions.","I’m writing to answer to your questions.","I haven’t answered her email yet.","I knocked on the door but nobody answered.","‘I won’t let you down,’ he replied.","The directors were unwilling to respond to questions.","I’m writing in answer to your letter.","‘I'm in here!’ came the muffled reply.","‘Mmm!’ she grunted in reply.","‘No comment’ is his standard reply to most questions.","‘No!’ came the reply.","When I checked my emails that evening, there were more than ten replies in my inbox.","A reply came back the next day.","Grace could offer no reply.","Have you had a reply to your letter yet?","He made no reply, but simply walked away.","Her reply was simple. ‘No,’ she said.","His reply was short and to the point.","I am grateful to you for having given me a right of reply to the article in your magazine about my company.","I am writing in reply to your request for information on holidays in Italy.","I await your reply with interest.","I'll post the replies later on my web page.","It's easy to just hit the reply button.","Many thanks for your thoughtful reply, we greatly appreciate it.","No reply seemed to be forthcoming.","Please complete the reply card and return it to us as soon as possible.","She heard no reply.","She refused to give a straight reply, deciding rather to defer the question.","The questionnaire produced 9 000 replies.","The report elicited a formal reply from the department.","They waited patiently for a reply but none seemed to be forthcoming.","What did they say in reply?","a reply from the minister","my reply to your query","He muttered a reply but I couldn't understand what he said."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]