[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rep/repla/replace__us_1.mp3","phonsUS":"/rɪˈpleɪs/","level":"A2","meanings":[{"def":"to be used instead of somebody/something else; to do something instead of somebody/something else","examples":["The new design will eventually replace all existing models.","Teachers will never be replaced by computers in the classroom.","These measures in no way replace the need for regular safety checks.","The weird feeling was gradually replaced by shock, and then anger.","replace somebody/something as something She replaced Dr Hales as head teacher.","Green will replace the injured Walker in the starting line-up.","He was selected last week to replace her on the council.","Machines can't replace people in this work.","Many of the workers have been replaced by machines.","These guidelines effectively replaced the official procedure.","Williams has temporarily replaced Reed on the first team.","She replaced Jane Stott as Managing Director.","She has been nominated to replace Justice O'Connor on the Supreme Court."],"opposite":"","synonyms":""},{"def":"to remove somebody/something and put another person or thing in their place","examples":["replace somebody/something He will be difficult to replace when he leaves.","proposed changes to the constitution to replace the current system of government","He was replaced as party leader in 1967.","replace somebody/something with/by somebody/something It is not a good idea to miss meals and replace them with snacks."],"opposite":"","synonyms":""},{"def":"to change something that is old, damaged, etc. for a similar thing that is newer or better","examples":["We're thinking of replacing our phone system.","to replace a window/roof","to replace a battery/light bulb","All the old carpets need replacing.","an operation to replace both hips","You'll be expected to replace any broken glasses.","The club does not have the finances resources to replace the damaged equipment.","We will replace a faulty part immediately.","Putting in a new kitchen can cost very little if you are simply replacing an old one.","We replaced the old television set with a newer one.","It was built to replace the old Victorian jail."],"opposite":"","synonyms":""},{"def":"to put something back in the place where it was before","examples":["I replaced the cup carefully in the saucer.","to replace the handset (= after using the phone).","He carefully replaced the vase on the shelf.","She replaced the dress in the wardrobe."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]