[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rep/repor/report__us_1.mp3","phonsUS":"/rɪˈpɔːrt/","level":"A1","meanings":[{"def":"a written or spoken account of an event, especially one that is published or broadcast","examples":["Are these news reports true?","media/press/newspaper reports","report on something And now over to Jim Muir, for a report on the South African election.","A local news station aired a special report on the controversy.","according to a report According to this evening's weather report, there will be snow tomorrow.","Are these newspaper reports true?","It was many years before the full story was made public.","the front-page story","She gave the police a full account of the incident.","She gave us her version of what had happened that day.","Our correspondent in Kabul files a report most days.","Join us tonight at 10 for a full report on the latest developments.","We could not find any detailed reports of the incident.","The spokesman confirmed a recent report in the Wall Street Journal.","She denied a report in the Las Vegas Sun that the exhibition was closing.","We have reviewed all reports from today's battle.","We'll have a live report from Manila in about 30 minutes.","investigative news reports about glitches in the system","The sites generate detailed travel reports.","The report went on to list her injuries."],"opposite":"","synonyms":"report"},{"def":"a spoken or written description of something containing information that somebody needs to have","examples":["a police report","The company has just released its annual report.","Can you give us a progress report?","report on something You need to compile a report on your findings.","Auditors normally issue a report as to whether the company accounts have been prepared correctly.","The lab report seems to be missing.","She spent hours in the law library browsing through case reports.","The autopsy report revealed that the man had been strangled.","She made her report to her senior colleagues.","Sentencing will be delayed until a psychiatric report is carried out.","I've asked Jen for a full report of the meeting.","I have to do a report for my boss by tomorrow.","A detailed medical report is required of all applicants.","fired for falsifying an expense report","daily status reports as to how and what we were doing","a damaging internal report on the department's organization","I will have to make a full report of the situation to my superiors.","I'll let you have a report as soon as I can.","I typed up a report about the morning's events for our clients.","Her report questions the scientific validity of the experiment.","Following discussion, the annual report was accepted unanimously.","The case has not yet been reported in the law reports.","The chairman's report provides a summary of operations.","They replied citing a report from the finance department.","the consumer report for this 1993 model","the company's summary report for the second quarter of this year","the government's latest employment report","a report to the academic community","The management team must make a full report to the board.","The company was asked to submit its annual report."],"opposite":"","synonyms":""},{"def":"an official document written by a group of people who have examined a particular situation or problem","examples":["to release/issue a report","report on something The committee will publish its report on the health service next week.","according to a report According to the report, we are facing an obesity crisis.","An official report quoted several leading scientists.","A recent report from the US Department of Education estimates that approximately 1.1 million students are being homeschooled.","In a report published today, the committee is expected to call for a new trial of GM crops.","The committee will publish an interim report on its findings to date.","According to a report issued by Morgan Stanley, China is a very significant market for luxury companies.","The UN released a report imploring wealthy countries to double their foreign aid.","The 124-page report was released today.","You can download the full report from our website.","A damning report by the Police Ombudsman was leaked to the press.","Police are still trying to come to terms with the report, which examined racial attitudes within the force.","The government commissioned a report into the rioting.","The report's authors have asked for more time to complete their enquiries.","Very few people in government actually read the report.","We will have to wait until they deliver their report before we can come to any conclusions.","An independent report highlighted some serious flaws in the child protection services.","a report by scientists","a confidential report leaked to the press","a report entitled ‘Kick-start’","an official report on the accident","a report from the select committee","a report linking ill health with industrial pollution","This report is based on the analysis of 600 completed questionnaires.","There have been many new findings since the original report.","The report warns that more job losses are likely.","The report notes evidence that secondary smoke harms unborn children.","The report looks at the health risks linked to obesity.","The report draws attention to the appalling conditions in the country's prisons.","The report called for sweeping changes in the education system.","Criticism has been directed at local businesses in a report out today.","The MPs called for a full report on the nuclear contract.","The committee presented its report to the Attorney General.","The department has launched a report into the bombing.","The findings are summarized in the report.","The government commissioned a report on the state of agriculture in the country.","The report admits to several outstanding questions about the safety of the waste dumps.","The report continued in similar vein.","The report fails to explain his decision.","The report reveals that debt has risen every year for the last ten years."],"opposite":"","synonyms":""},{"def":"a story or piece of information that may or may not be true","examples":["reports of something There are unconfirmed reports of a shooting in the capital.","I don't believe these reports of UFO sightings.","reports that… We are hearing reports that she has quit.","despite reports Despite reports claiming the market is heading for a crash, he predicts that prices will rise.","According to reports, this will be her last film before she retires.","The company made 50 people redundant last month, amid reports it was running out of cash.","We're investigating reports of an explosion in this area.","I based my statement on reports circulating at the time.","We've had reports of a gang shooting in the city.","Police received reports of drug dealing in the area.","We have received reports that civilians have been killed.","They could neither confirm nor deny reports that the chairperson was to be replaced.","This appears to confirm recent reports that the two stars are dating.","The minister denied reports that she was about to quit.","He denied reports of a dispute with the prime minister.","The company denied reports of its interest in a merger.","These reports surfaced throughout the summer.","There have been conflicting reports on the number of people killed.","The pro-democracy rally came amid reports of dissatisfaction among army officers.","Reports have indicated that a growing number of medium-sized companies are under financial pressure.","Reliable intelligence reports suggest that the terrorists have bases in five cities.","First reports of the accident are coming in."],"opposite":"","synonyms":""},{"def":"a written statement about a student’s work at school, college, etc.","examples":["a school report","to get a good/bad report","She got a better report card this time."],"opposite":"","synonyms":""},{"def":"an employee whose work is the responsibility of a particular manager","examples":["a weekly meeting with my direct reports","He was finding one of his reports very difficult to manage."],"opposite":"","synonyms":""},{"def":"the sound of an explosion or of a gun being fired","examples":["a loud report"],"opposite":"","synonyms":""},{"def":"talked about by people in a bad/good way","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"of bad/good report","def":"talked about by people in a bad/good way","examples":[]}],"phrasal":[],"related":["report to","report back","self-report","report stage","minority report","Beveridge Report","Wolfenden Report","US News and World Report","report stages","report to somebody","report back (on something) (to somebody)"]},{"pos":"verb","level":"A2","meanings":[{"def":"to give people information about something that you have heard, seen, done, etc.","examples":["report something The crash happened seconds after the pilot reported engine trouble.","The findings are similar to those reported in previous studies.","The company is expected to report record profits this year.","Call me urgently if you have anything to report.","report on something The committee will report on its research next month.","report on something to somebody He regularly reports on his activities to his family.","report doing something The neighbours reported seeing him leave the building around noon.","report somebody/something doing something Six months later, an inspector reported the problem recurring.","report somebody/something + adj. The doctor reported the patient fully recovered.","report somebody/something as (doing) something The house was reported as being in excellent condition.","be reported to be/have something The house was reported to be in excellent condition.","She was reported by the hospital spokesman to be making excellent progress.","report (that)… Employers reported that graduates were deficient in writing and problem-solving skills.","report what, how, etc… She failed to report what had occurred.","+ speech ‘The cabin's empty,’ he reported.","Other researchers reported similar results.","Most participants in the study reported an increase in appetite.","The company reported a pretax loss of $9.8 million for the year.","They were the only steelmaker in North America to report a profit that quarter.","The co-op reported record sales.","The sportswear manufacturer recently reported stronger earnings than market analysts expected.","Retailers reported a high response rate to the campaign.","I'll be reporting on our progress from time to time.","The club Vice Chairman reported to members on the activities of the committee.","Only 11 per cent of managers reported having problems retaining female workers.","Witnesses reported hearing a popping noise.","Most Americans report feeling more stress today than 20 years ago.","The child's mother reported him feeling better.","Both men and women in the study report family as their number one priority.","He reports his health as having declined over the past six months.","17% of the sample were reported to have used drugs.","One recent study reported that only 34% of employees felt a strong sense of loyalty to their employers.","Witnesses reported how the pilot had been performing stunts when the aircraft suddenly nose-dived.","Patients can report what treatment they find most helpful.","I am pleased to report that the plan is going well.","I am sad to report that she is not very well.","It is with regret that I have to report the death of one of our members.","if the facts that have been reported publicly are true","The results suggest that gender differences in learning are not as pronounced as previously reported.","Investors are sometimes sceptical of a company's reported earnings."],"opposite":"","synonyms":""},{"def":"to present a written or spoken account of an event in a newspaper, on television, etc.","examples":["report something The stabbing was widely reported in the press.","Our job is to report the news, not to create it.","report (that)… The TV news reported that several people had been arrested.","As previously reported, Norfolk police are investigating the case.","it is reported (that)… It was reported that several people had been arrested.","report somebody/something as doing something The media reported me as saying things I did not say.","report on something She reports on royal stories for the BBC.","report from something She has reported from many war zones.","report for somebody/something This is Andrew Black reporting for Channel 4 News.","In October, the New York Times reported the death of Allen Walker Read.","Local media has reported hundreds of people killed.","Newspapers reported that the child had been kidnapped.","CNN reports that there has been a serious nuclear incident.","The food packets were later found to be poisoned with cyanide, the BBC reported.","In this article it was reported that a new theory had been developed.","The incident was widely reported in the British press.","This is John Hutchins, reporting from Zimbabwe.","Reporting live from election headquarters, here's Sara Tindale.","Tonight we report on the situation in central Africa.","One article reported on the success of a local educational project.","A newspaper wrongly reported him as having died.","Reporting restrictions on the trial have been lifted."],"opposite":"","synonyms":""},{"def":"used to show that something has been stated, and you do not know if it is true or not","examples":["be reported to do something She is reported to earn over $10 million a year.","be reported as doing something The president is reported as saying that he needs a break.","be reported as something Opinion has been reported as fact.","it is reported (that)… It was reported that changes were being considered.","Local hotels and restaurants were reported to be hiking their prices for the duration of the tournament.","The drug has been reported to cause unpleasant dreams.","The plane was falsely reported to have a bomb on board.","She was reported as saying that she did not need anyone's permission.","The result was reported as being their worst ever.","At first the issue was reported as a minor problem.","It was originally reported he had died at the scene.","It's been widely reported that the two are bitter rivals.","Was this, as has been reported, a deliberate decision on your part?"],"opposite":"","synonyms":""},{"def":"to tell a person in authority about a crime, an accident, an illness, etc. or about something bad that somebody has done","examples":["report something (to somebody) Have you reported the incident to the police?","a decrease in the number of reported cases of AIDS","report somebody for (doing) something He's already been reported twice for arriving late.","report somebody to somebody for (doing) something She threatened to report him to the authorities for hunting without a licence.","report somebody I’m going to report you if you do that again!","report somebody/something + adj. She has reported her daughter missing.","He was charged with careless driving and failing to report an accident.","The Ministry of Health reported five human cases of H5N1 bird flu.","Teachers must report any suspected cases of child abuse to social services.","We have a duty to report and investigate fraudulent claims.","Always report any suspicious activity on your credit card.","I'm calling to report a crime.","He was accused of falsely reporting a burglary.","Symptoms of infectious illness must be reported.","His friends did not report his death to the authorities.","Report the theft to the police as soon as possible.","He reported the loss of his passport.","Some insurance companies have a 24-hour claims service that allows you to report an injury and complete a report over the phone.","She had dutifully reported this to her superiors.","Companies are sometimes reluctant to report economic espionage.","He was reported for verbal abuse.","Bacterial blight of soybeans was first reported in Nebraska in 1906.","How many people who lose their phone falsely report it stolen to claim on the insurance?","There has been an increase in reported crime."],"opposite":"","synonyms":""},{"def":"to tell somebody that you have arrived, for example for work or for a meeting with somebody","examples":["report for something You should report for duty at 9.30 a.m.","Private Smith reporting for duty, sir!","report to somebody/something All visitors must report to the reception desk on arrival.","report + adv./prep. Volunteers have been instructed on where to report.","He had gone for a run before reporting for duty that day.","She failed to report for work the following morning.","The midfielder reported for training on Tuesday.","Brown was to report for basic training on June 21st.","He reported to army headquarters in Rome.","On arrival, I reported to the MT (Motor Transport) office.","She has to report to a probation officer on Monday.","I reported at the signal office for duty.","Offered an appointment in September 1928, he reported at the Edinburgh office the following day.","Fire fighters answering the call were held up by traffic jams and confusion about where to report.","If you aren't sure where to report for your chosen group, go to the information desk."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["report back","report to"],"related":[]}]