[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rep/repro/reproduce__us_1.mp3","phonsUS":"/ˌriːprəˈduːs/","level":"C1","meanings":[{"def":"to make a copy of a picture, piece of text, etc.","examples":["It is illegal to reproduce these worksheets without permission from the publisher.","The photocopier reproduces colours very well.","This material can be reproduced without payment.","All illustrations are reproduced by kind permission of the Mercury Gallery.","It is difficult to reproduce a signature exactly.","Photographs can be easily reproduced with a negative.","The article may not be reproduced without written permission of the author.","The colours can be reproduced fairly accurately.","The interview is reproduced by courtesy of ‘Attitude’.","The map is reproduced here from a 19th-century original.","The painting is reproduced here by courtesy of the Tate Gallery.","The painting is reproduced very accurately.","The photos are beautifully reproduced.","These works were popular and widely reproduced.","They do not reproduce well in print."],"opposite":"","synonyms":""},{"def":"to produce something very similar to something else in a different medium or context; to make something happen again in the same way","examples":["The atmosphere of the novel is successfully reproduced in the movie.","Unfortunately, he was never able to reproduce this level of performance in a competition.","I was able to reproduce the same results with subsequent tests.","The book's characters are faithfully reproduced in the film.","The computer program reproduces the effects of earthquakes on buildings.","Writing grew out of an attempt to reproduce speech in a permanent form."],"opposite":"","synonyms":""},{"def":"if people, plants, animals, etc. reproduce or reproduce themselves, they produce young","examples":["Most reptiles reproduce by laying eggs on land.","reproduce itself cells reproducing themselves (= making new ones)","Many single cell organisms reproduce by splitting in two.","The salmon would begin reproducing naturally.","a frog species successfully reproducing","These cells reproduce themselves every twenty minutes.","The offspring have to be able to reproduce in their turn."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]