[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rep/repre/representation__us_1_rr.mp3","phonsUS":"/ˌreprɪzenˈteɪʃn/","level":"C1","meanings":[{"def":"the act of presenting somebody/something in a particular way; something that shows or describes something","examples":["the negative representation of single mothers in the media","The snake swallowing its tail is a representation of infinity.","The film offers a realistic representation of life in rural Spain.","There are many ways of generating a two-dimensional representation of an object.","a book showing graphic representations of the periodic table","a realistic cinematic representation of the Depression","artistic representations of the parent/​child relationship","contemporary media representations of youth","the written representation of a spoken text"],"opposite":"","synonyms":""},{"def":"the fact of having representatives who will speak or vote for you or act in your place","examples":["The green movement lacks effective representation in Parliament.","The accused was not allowed legal representation.","workers that seek union representation","shareholder representation on the boards of directors","representation from all parties","representation for employees","representation by a lawyer","direct representation in Parliament","Whether guilty or innocent, we are still entitled to legal representation.","They had a strong representation in government.","The task force had broad representation with members drawn from different departments.","The party has increased its representation in Parliament.","Textile workers wanted collective representation.","He claims that their electoral system ensures fair representation of all parties."],"opposite":"","synonyms":""},{"def":"formal statements made to somebody in authority, especially in order to make your opinions known or to protest","examples":["We have made representations to the prime minister, but without success."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["proportional representation"]}]