[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rep/repre/representative__us_4.mp3","phonsUS":"/ˌreprɪˈzentətɪv/","level":"B2","meanings":[{"def":"a person who has been chosen to speak or vote for somebody else or for a group of people, or to take the place of somebody else","examples":["Our elected representatives in government should be doing something about this.","Management are obliged to consult with union representatives about changes to conditions.","The actor's legal representatives have strongly denied the allegations.","He was the Queen's representative at the ceremony.","representative of somebody/something a representative of the UN","representative from something The committee includes representatives from industry.","We met with representatives from various technology companies.","I was the sole representative of the committee.","The association is sending representatives to the conference.","The country has a new supreme representative body.","The negotiations were attended by representatives of several states.","They have recalled their representatives from the negotiations.","a nursing representative on the infection control committee","a panel of media representatives","representatives from citizens' groups","the Algerian permanent representative at the UN","the UN special representative for Cyprus","I was voted student representative for my class."],"opposite":"","synonyms":""},{"def":"a person who works for a company and travels around selling its products","examples":["a sales representative","She's our representative in France.","a representative for international shipping companies","his success as a full-time financial representative","He works as a sales representative for an insurance company."],"opposite":"","synonyms":""},{"def":"a person who is typical of a particular group","examples":["The singer is regarded as a representative of the youth of her generation."],"opposite":"","synonyms":""},{"def":"(in the US) a member of the House of Representatives, the Lower House of Congress; a member of the House of Representatives in the lower house of a state parliament","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["sales representative"]},{"pos":"adjective","level":"B2","meanings":[{"def":"typical of a particular group of people; that is a typical example of something","examples":["Is a questionnaire answered by 500 people truly representative of the population as a whole?","The paper-thin models in magazines are not representative of most women.","Some residents argued that the protesters were not representative of the community.","The painting is not representative of his work of the period."],"opposite":"","synonyms":""},{"def":"containing or including examples of all the different types of people or things in a large group","examples":["We interviewed a representative sample of teachers.","Exhibits include a widely representative collection of Greek vases.","a broadly representative sample","a nationally representative picture of the employment situation"],"opposite":"","synonyms":""},{"def":"consisting of people who have been chosen to speak or vote for the rest of a group","examples":["a representative democracy","the advent of modern representative government"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]