[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rep/reput/reputation__us_1.mp3","phonsUS":"/ˌrepjuˈteɪʃn/","level":"B2","meanings":[{"def":"the opinion that people have about what somebody/something is like, based on what has happened in the past","examples":["to have a good/bad reputation","to build/earn a reputation","reputation as something She soon established a reputation as a first-class cook.","reputation for something The company enjoys an international reputation for quality of design.","a politician with a reputation for honesty","reputation for doing something I'm aware of Mark's reputation for being late.","reputation of being something He has the reputation of being a hard worker.","to damage/tarnish/ruin somebody’s reputation","The weather in England is living up to its reputation (= is exactly as expected).","by reputation She is, by reputation, very difficult to please.","Franklin's historical reputation has fluctuated.","He can still salvage his reputation if he acts quickly.","He emerged from the trial with his reputation intact.","He has staked his reputation on the success of the play.","He was by reputation difficult to please.","Her extensive research enhanced her reputation.","Her international reputation is built on an impressive list of publications.","Her posthumous reputation has begun to grow.","His reputation preceded him.","If the profession wishes to restore its reputation, it must get its act together.","It has given them a good reputation with their customers.","It seems that nothing can tarnish his reputation.","My reputation rests on the success of this party!","November is certainly living up to its reputation—we've had nothing but rain all week.","She found it hard to live down her reputation as a second-rate actress.","She garnered a reputation as an incisive commentator.","She has built up an enviable reputation as a harpist.","That reputation is based on hard work.","The club has an unenviable reputation for attracting trouble.","The company has a well-deserved reputation for being reliable.","The company has built up a positive reputation.","The company's reputation suffered when it had to recall thousands of products that were unsafe.","The country has definitively shed its reputation for economic mismanagement.","The town's unsavoury reputation was bad for business.","They may be damaging their corporate reputation.","This cemented his reputation as a civil rights militant.","You've made quite a reputation for yourself as a rebel!","his undeserved reputation for stinginess","our reputation of excellence in journalism","the need to save his political life and personal reputation","the player's legendary reputation for accuracy","the publisher's reputation among critics","the school's academic reputation","He acquired a dubious reputation for dealing in stolen goods.","I began to understand why he had such a formidable reputation.","The restaurant has an excellent reputation.","The school has a good reputation.","They don't really deserve the bad reputation they have gained over the years."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]