[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/req/requi/requirement__us_1.mp3","phonsUS":"/rɪˈkwaɪərmənt/","level":"B2","meanings":[{"def":"something that you need or want","examples":["the basic requirements of life","a software solution to meet your requirements","All products can be customized to suit your specific requirements.","Our immediate requirement is extra staff.","These goods are surplus to requirements (= more than we need).","300 workers at the factory have been told they are surplus to requirements.","I have some very simple requirements.","Large buildings have specific requirements for fire-brigade access.","Our conservatories and porches can be designed to your exact requirements.","The public sector borrowing requirement is expected to rise.","We can arrange a holiday to meet your requirements exactly.","We grow enough vegetables for our own requirements.","patients with special dietary requirements","your daily requirement of vitamin C"],"opposite":"","synonyms":""},{"def":"something that you must have in order to do something else","examples":["to meet/fulfil/satisfy the requirements","What is the minimum entry requirement for this course?","Banks now face stricter regulatory requirements.","to relax university entrance requirements","Be sure to check passport and visa requirements with your travel agent.","She kept herself up to date with financial affairs, an essential requirement of her job.","core curriculum requirements","The initial investment requirement is often waived for existing customers.","There's no absolute requirement to disclose your age.","There is no formal requirement that Parliament assent to such decisions.","An open system of criminal justice is a fundamental requirement of any democratic society.","The school can decide which pupils will be given priority of admission, subject to the requirements of the law.","The government has imposed strict safety requirements on fairground rides."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Public Sector Borrowing Requirement","Public Sector Net Cash Requirement"]}]