[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/req/requi/require__us_3.mp3","phonsUS":"/rɪˈkwaɪər/","level":"B1","meanings":[{"def":"to need something; to depend on somebody/something","examples":["require something These pets require a lot of care and attention.","Deciphering the code requires an expert.","This condition requires urgent treatment.","Do you require anything else? (= in a shop/store, for example)","These plants absolutely require shade.","require somebody/something to do something True marriage requires us to show trust and loyalty.","require that… The situation required that he be present.","(British English also) The situation required that he should be present.","require doing something Lentils do not require soaking before cooking.","The scheme will require a high level of investment.","Friendships do not just happen; they require effort.","They are trying to reduce the time required to complete the process.","These changes require vast amounts of capital","Sufficient moisture is required for good growth.","More research is urgently required before conclusions can be drawn.","The plants usually require treatment each year.","Your services are no longer required.","Force is required in order to open it.","Applying online requires less time and effort."],"opposite":"","synonyms":""},{"def":"to make somebody do or have something, especially because it is necessary according to a particular law or set of rules","examples":["require something I just require a signature on the form.","be required (by something) The wearing of seat belts is required by law.","‘Hamlet’ is required reading (= must be read) for this course.","Several students failed to reach the required standard.","be required of somebody What exactly is required of a receptionist (= what are they expected to do)?","be required to do something All candidates will be required to take a short test.","All adults are legally required to pay the tax.","require that… We require that you comply with the following rules:…","The law requires that everyone wear a seat belt.","The government's ruling will require widespread changes in classroom practices.","Graduates should possess the knowledge and skills required by industry.","Students were required to provide a written proposal.","Such use may require approval by federal regulatory agencies.","The workshop is free, but booking is required.","Farmers will be required to pay for the testing.","These are the conditions required under the terms of the agreement.","She demanded an immediate explanation.","All candidates will be required to take a short test.","I expect to be paid promptly for the work.","I didn’t want to go but he insisted.","We insist on the highest standards at all times.","You’re asking too much of him."],"opposite":"","synonyms":"demand"}],"idioms":[],"phrasal":[],"related":[]}]