[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/req/reque/request__us_1.mp3","phonsUS":"/rɪˈkwest/","level":"A2","meanings":[{"def":"the action of asking for something formally and politely; a thing that you formally ask for","examples":["request for something a request for information","They made a request for further aid.","request to do something He submitted a request to adopt a flexible working routine.","to grant a request","to refuse/decline/reject/deny a request","at somebody's request She went to the wedding at her mother's request (= because her mother had asked her to go).","at the request of somebody He was there at the request of his manager (= because his manager had asked him to go).","by request The writer's name was withheld by request (= because the writer asked for this to be done).","on request Application forms are available on request.","request that… She left her address with a request that any mail should be sent on to her.","My request was granted.","Additional copies will be made available on request.","We will arrange accommodation on request.","The play was written by Agatha Christie at the request of Queen Mary.","The film is being shown again by popular request.","The book was withdrawn at the author's request.","I made my initial request for material in February.","His request was always met with the same answer.","I could not deny a direct request like that.","I got a couple of email requests for it.","I've put in a request for a room with a view of the sea.","The Commission approved a request for $700 000 in tax refunds.","The helpline was inundated with requests for information on the crash.","We have had repeated requests for a pedestrian crossing near the school.","an extradition request by the US","the State Department budget request","The judge will now consider this request from the plaintiffs.","He has refused all interview requests.","Her last request before she died was that she be buried at sea.","The bank received numerous requests for information from government regulators."],"opposite":"","synonyms":""},{"def":"an instruction to a computer to perform a task","examples":["When the software has finished processing the request, a download window pops up."],"opposite":"","synonyms":""},{"def":"a song or tune that somebody asks to have played on a radio programme","examples":["The next request is from a listener in Aberdeen.","a radio request programme"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["request stop","friend request","request stops"]},{"pos":"verb","level":"B1","meanings":[{"def":"to ask for something or ask somebody to do something in a polite or formal way","examples":["request something She requested permission to film at the White House.","You can request a free copy of the leaflet.","She requested anonymity because she wasn't authorized to speak to the press.","request something from somebody/something The government has requested information from the companies involved in the scandal.","be requested to do something Visitors are requested not to touch the exhibits.","We were requested to assemble in the lobby.","request that… She requested that no one be told of her decision until the next meeting.","(British English also) She requested that no one should be told of her decision.","+ speech ‘Please come with me,’ he requested.","Call us now if you’d like to request a song (= ask for it to be played on the radio)","Auditors will be required to provide any information reasonably requested by the bank.","She had left him a message, simply requesting that he call her back.","Aid agencies have urgently requested help.","You are politely requested not to bring food or drink into the library."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]