[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/res/rescu/rescue__us_2.mp3","phonsUS":"/ˈreskjuː/","level":"B2","meanings":[{"def":"to save somebody/something from a dangerous or harmful situation","examples":["rescue somebody/something from something/somebody The coastguard rescued six people from the sinking boat.","The woman was rescued from her burning home by firefighters.","You rescued me from an embarrassing situation.","The house was rescued from demolition.","rescue somebody/something from doing something He rescued a child from drowning.","rescue somebody/something The hostages were rescued and brought to safety.","The shelter rescues stray dogs.","rescue somebody/something + adj. She had despaired of ever being rescued alive.","Doctors were unable to save him.","a campaign to save the panda from extinction","They were rescued by a passing cruise ship.","Don’t expect me to bail you out if it all goes wrong.","He was a sinner, redeemed by the grace of God.","The bank rescued the company from bankruptcy.","They were eventually rescued by helicopter.","He died while trying to rescue his children from the blaze.","Police officers helped to rescue motorists stranded by the floods.","The little boy had to be rescued by firemen.","He was drowned in an attempt to rescue the child.","The pony had been rescued from near starvation by a kindly old lady.","They were rescued by a passing cruise ship."],"opposite":"","synonyms":"save"}],"idioms":[],"phrasal":[],"related":["rescue worker","air-sea rescue","rescue and resuscitation"]},{"pos":"noun","level":"B2","meanings":[{"def":"the act of saving somebody/something from a dangerous or difficult situation; the fact of being saved","examples":["We had given up hope of rescue.","A wealthy benefactor came to their rescue with a generous donation.","a rescue operation/mission","a mountain rescue team","rescue helicopters/boats/workers","The United Nations is helping to coordinate rescue efforts.","a rescue attempt","Her wails of distress brought him running from the house, like a knight to the rescue.","New Zealand fire and rescue services carried out several extensive searches for survivors.","No one came to their rescue until the following day.","The navy are on a search and rescue mission.","a financial rescue package for the company","an animal rescue centre","his rescue from a burning building","the rescue of a man from a burning building"],"opposite":"","synonyms":""},{"def":"an occasion when somebody/something is saved from a dangerous or difficult situation","examples":["Ten fishermen were saved in a daring sea rescue.","Her own boat capsized after she attempted a rescue."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]