[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/res/reser/reserve__us_4.mp3","phonsUS":"/rɪˈzɜːrv/","level":"B2","meanings":[{"def":"a supply of something that is available to be used in the future or when it is needed","examples":["cash/foreign currency reserves","large oil and gas reserves","reserve funds","reserve of something He discovered unexpected reserves of strength.","The country has the world's largest reserves of coal.","The company has substantial reserves of capital."],"opposite":"","synonyms":""},{"def":"a piece of land that is a protected area for animals, plants, etc.","examples":["a wildlife/forest reserve"],"opposite":"","synonyms":""},{"def":"an area of land in the US that is kept separate for Native Americans to live in","examples":[],"opposite":"","synonyms":""},{"def":"the quality that somebody has when they do not talk easily to other people about their ideas, feelings, etc.","examples":["She found it difficult to make friends because of her natural reserve.","Jaime always talked to people without reserve."],"opposite":"","synonyms":""},{"def":"a feeling that you do not want to accept or agree to something, etc. until you are quite sure that it is all right to do so","examples":["with reserve Any contract should be treated with reserve until it has been checked.","without reserve She trusted him without reserve (= completely)."],"opposite":"","synonyms":""},{"def":"an extra player who plays in a team when one of the other players is injured or not available to play","examples":[],"opposite":"","synonyms":""},{"def":"a team that is below the level of the main team","examples":[],"opposite":"","synonyms":""},{"def":"an extra military force, etc. that is not part of a country’s regular forces, but is available to be used when needed","examples":["the Army Reserve","the reserve police"],"opposite":"","synonyms":""},{"def":"the lowest price that somebody will accept for something, especially something that is sold at an auction","examples":["The painting failed to reach to its reserve and was withdrawn from the sale."],"opposite":"","synonyms":""},{"def":"available to be used in the future or when needed","examples":["The money was being kept in reserve for their retirement.","200 police officers were held in reserve."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in reserve","def":"available to be used in the future or when needed","examples":["The money was being kept in reserve for their retirement.","200 police officers were held in reserve."]}],"phrasal":[],"related":["game reserve","gold reserve","reserve bank","nature reserve","Federal Reserve Bank","National Nature Reserve","Royal Naval Reserve","Federal Reserve System","Volunteer Reserve Forces","reserve banks","Federal Reserve Banks","the Federal Reserve","Reserve Officers’ Training Corps","reserve (your) decision/judgement"]},{"pos":"verb","level":"B2","meanings":[{"def":"to ask for a seat, table, room, etc. to be available for you or somebody else at a future time","examples":["reserve something for somebody/something I'd like to reserve a table for three for eight o'clock.","reserve something I've reserved a room in the name of Jones."],"opposite":"","synonyms":""},{"def":"to keep something for somebody/something, so that it cannot be used by any other person or for any other reason","examples":["These seats are reserved for special guests.","The team captain reserved special praise for his players after the match.","She said this in the tone of voice she reserved for addressing small children."],"opposite":"","synonyms":""},{"def":"to have or keep a particular power","examples":["The management reserves the right to refuse admission.","(law) All rights reserved (= nobody else can publish or copy this)."],"opposite":"","synonyms":""},{"def":"to not decide or make a judgement about something until a later time","examples":["I'd prefer to reserve judgement until I know all the facts.","Three judges have decided to reserve their decision until a later date."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"reserve (your) decision/judgement","def":"to not decide or make a judgement about something until a later time","examples":["I'd prefer to reserve judgement until I know all the facts.","Three judges have decided to reserve their decision until a later date."]}],"phrasal":[],"related":[]}]