[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/res/resis/resistance__us_1.mp3","phonsUS":"/rɪˈzɪstəns/","level":"C1","meanings":[{"def":"dislike of or opposition to a plan, an idea, etc.; the act of refusing to obey","examples":["As with all new ideas it met with resistance.","resistance to somebody/something There has been a lot of resistance to this new law.","Resistance to change has nearly destroyed the industry.","There was fierce resistance to the new laws.","They mounted stiff resistance to the proposal."],"opposite":"","synonyms":""},{"def":"the act of using force to oppose somebody/something","examples":["There were a number of episodes of armed resistance during the early years of occupation.","The defenders put up a strong resistance.","resistance to somebody/something The demonstrators offered little or no resistance to the police.","armed resistance against the Nazis","The attacks did not take place without resistance.","The advancing army met with little resistance."],"opposite":"","synonyms":""},{"def":"the power not to be affected by something","examples":["AIDS lowers the body's resistance to infection.","Many viruses develop resistance to drugs.","These varieties produce a lot of fruit and have excellent disease resistance.","You need to build up your resistance to colds."],"opposite":"","synonyms":""},{"def":"a force that stops something moving or makes it move more slowly","examples":["wind/air resistance (= in the design of planes or cars)"],"opposite":"","synonyms":""},{"def":"the opposition of a substance or device to the flow of an electrical current","examples":[],"opposite":"","synonyms":""},{"def":"a secret organization that resists the authorities, especially in a country that an enemy has control of","examples":["resistance fighters"],"opposite":"","synonyms":""},{"def":"(to choose, etc.) the easiest way of doing something","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"(choose, follow, take, etc.) the line/path of least resistance","def":"(to choose, etc.) the easiest way of doing something","examples":[]}],"phrasal":[],"related":["passive resistance","pièce de résistance","pièces de résistance","(choose, follow, take, etc.) the line/path of least resistance"]}]