[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/res/resis/resist__us_1.mp3","phonsUS":"/rɪˈzɪst/","level":"B2","meanings":[{"def":"to refuse to accept something and try to stop it from happening","examples":["resist something They are determined to resist pressure to change the law.","People naturally resist change.","resist doing something The bank strongly resisted cutting interest rates.","Residents who oppose the plans are threatening to resist.","She steadfastly resisted all attempts to help her.","I believe we should resist calls for tighter controls.","They successfully resisted pressure from their competitors to increase prices.","Employer groups fiercely resisted the introduction of the minimum wage.","Trends in the national economy confront companies with pressures they are unable to resist."],"opposite":"","synonyms":""},{"def":"to fight back when attacked; to use force to stop something from happening","examples":["He tried to pin me down, but I resisted.","resist something She was charged with resisting arrest.","He gathered forces to resist the invasion.","The civil population passively resisted."],"opposite":"","synonyms":""},{"def":"to stop yourself from having something you like or doing something you very much want to do","examples":["resist something I finished the cake. I couldn't resist it.","The Chancellor resisted the temptation to raise business taxes.","I found the temptation to miss the class too hard to resist.","She could hardly resist the urge to turn and run.","resist doing something He couldn't resist showing off his new car.","Eric couldn’t resist a smile when she finally agreed.","She was powerless to resist the attraction that she felt to him."],"opposite":"","synonyms":""},{"def":"to not be harmed or damaged by something","examples":["A healthy diet should help your body resist infection.","The castle was built to resist attack.","This new paint is designed to resist heat.","Aluminium resists corrosion and rust.","They are treated with silicone to enable them to resist damp.","crops that resist disease and pest attack"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]