[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/res/resou/resource__us_1_rr.mp3","phonsUS":"/ˈriːsɔːrs/","level":"B1","meanings":[{"def":"a supply of something that a country, an organization or a person has and can use, especially to increase their wealth","examples":["the exploitation of minerals and other natural resources","They promote the use of renewable resources like soybean oil.","water/mineral/energy resources","The school does the best it can with limited resources (= money).","a valuable/precious/scarce resource","Think carefully about how you allocate resources.","We agreed to pool our resources (= so that everyone gives something).","Police have had to devote more resources to these cases.","Lack of resources has prevented the company from investing in new technology.","More resources need to be committed to the development.","Resources are being poured into the Olympic site.","The Olympics may stretch the country's resources to breaking point.","What a criminal waste of resources.","Water is a scarce resource in this part of the world.","We do not have the resources (= money) to update our computer software.","It is up to the government to put sufficient resources into the scheme.","They may not have adequate resources for their own retirement needs.","Shrimp farming competes with rice production for land and water resources.","They passed a constitutional reform that put all mineral resources in public hands.","As a manager you develop plans, allocate resources, control processes.","They are focusing their resources on improving the infrastructure.","We need to manage our resources better.","Green architecture tries to conserve important resources like water, land, and energy.","The plant consumed vast timber resources.","We'll get by if we pool our resources.","the government's role in diverting resources into social policies","to mobilize resources in the community to provide shelter for the homeless","We must make the most efficient use of the available financial resources.","Make proper use of the resources available."],"opposite":"","synonyms":""},{"def":"something that can be used to help achieve an aim, especially a book, equipment, etc. that provides information for teachers and students","examples":["The website is an invaluable educational resource.","This is an online resource for anyone interested in digital design.","The library is a vast resource for historians of medieval France.","Time is your most valuable resource, especially in examinations.","resource books for teachers","a library resource centre","The database could be used as a teaching resource in colleges.","Williams' text is also a useful resource for college writing instructors.","The online directory is a new way to access an age-old resource.","The company installs a firewall to prevent outsiders from accessing its private data resources.","The Institute's website offers many free information resources online.","The photographs will provide an invaluable visual resource for students, artists and scholars.","The NHS can be used as a research resource, for example in population genetics.","The site features a resource guide for people interested in self-publishing.","The firm acts as an international resource centre, a library of new materials providing information on developments in technology."],"opposite":"","synonyms":""},{"def":"personal qualities such as courage and imagination that help you deal with difficult situations","examples":["He has no inner resources and hates being alone.","She is someone of considerable personal resources."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["uniform resource name","uniform/universal resource indicator","uniform/universal resource locator"]},{"pos":"verb","level":"","meanings":[{"def":"to provide something with the money or equipment that is needed","examples":["Schools in the area are still inadequately resourced."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]