[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/res/resol/resolution__us_1.mp3","phonsUS":"/ˌrezəˈluːʃn/","level":"B2","meanings":[{"def":"a definite decision to do or not to do something","examples":["Have you made any New Year's resolutions (= for example, to give up smoking from 1 January)?","resolution to do something She made a resolution to visit her relatives more often.","I made a New Year resolution to give up smoking."],"opposite":"","synonyms":""},{"def":"a formal statement of an opinion agreed on by a committee or a council, especially by means of a vote","examples":["to pass/adopt/approve a resolution","The UN Security Council unanimously adopted a resolution calling for a halt to hostilities.","The General Assembly rejected the resolution on the subject of arms control.","The assembly adopted a resolution approving the plan.","The legislature has approved a resolution calling for the removal of such advertising.","The resolution called for the resumption of negotiations.","The resolution was carried unanimously.","a joint US-British resolution","a resolution condemning the invasion","a resolution declaring independence","weapons banned under Resolution 687"],"opposite":"","synonyms":""},{"def":"the act of solving or settling a problem, argument, etc.","examples":["dispute/conflict resolution","The government is pressing for an early resolution of the dispute.","resolution to something Hopes of a peaceful resolution to the conflict were fading.","methods of conflict resolution","the likelihood of achieving a satisfactory resolution to the problem","the non-violent resolution of conflict","She has worked in the field of conflict resolution and mediation for many years."],"opposite":"","synonyms":""},{"def":"the quality of being resolute or determined","examples":["The reforms owe a great deal to the resolution of one man.","Her resolution never faltered.","She showed great resolution in her dealings with management."],"opposite":"","synonyms":""},{"def":"the power of a computer screen, printer, etc. to give a clear image, depending on the size of the dots (= marks) that make up the image","examples":["The graphics look fine, even at low resolution.","The higher the resolution, the sharper the image.","a monitor capable of a 1 024 by 768 pixel resolution"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["high-resolution","joint resolution","low-resolution","War Powers Resolution"]}]