[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/res/resol/resolve__us_1.mp3","phonsUS":"/rɪˈzɑːlv/","level":"B2","meanings":[{"def":"to find an acceptable solution to a problem or difficulty","examples":["resolve something to resolve an issue/a dispute/a conflict/a crisis","Attempts are being made to resolve the problem of security in schools.","Both sides met in order to try to resolve their differences.","We hope to resolve the matter as soon as possible.","Everything is being done to resolve the situation.","The dispute has not been fully resolved.","resolve itself Be patient and the situation may resolve itself.","The crisis was finally resolved through high-level negotiations.","The family feuding could resolve itself.","The matter is not yet fully resolved.","The two countries have failed to resolve their differences on this.","They met in a last-ditch attempt to resolve their differences.","We hope that the dispute can be resolved peacefully.","Fortunately, the issue has now been amicably resolved.","The UN was supposed to be a forum for resolving disputes by peaceful means.","The matter has never really been satisfactorily resolved.","The prime minister flew home immediately to try to resolve the crisis.","Where can ordinary people get help with resolving family problems?"],"opposite":"","synonyms":""},{"def":"to make a definite decision to do something","examples":["resolve to do something He resolved not to tell her the truth.","He resolved to do something to help the children he had met.","resolve (that)… She resolved that she would never see him again.","resolve on doing something We had resolved on making an early start."],"opposite":"","synonyms":""},{"def":"to reach a decision by means of a formal vote","examples":["it is resolved that… It was resolved that the matter be referred to a higher authority.","resolve that… They resolved that the matter be referred to a higher authority.","The committee unanimously resolved that the party chairman should step down.","resolve to do something The Supreme Council resolved to resume control over the national press.","resolve on something The board of directors has called a meeting to resolve on the merger."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["resolve into"],"related":["resolve into","resolve into something | resolve something into something"]},{"pos":"noun","level":"","meanings":[{"def":"a determined desire to achieve something","examples":["The difficulties in her way merely strengthened her resolve.","It was a test of his stamina and resolve.","She did not weaken in her resolve.","resolve to do something The government reiterated its resolve to uncover the truth."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]