[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/res/respo/responsibility__us_5.mp3","phonsUS":"/rɪˌspɑːnsəˈbɪləti/","level":"B1","meanings":[{"def":"a duty to deal with or take care of somebody/something, so that you may be blamed if something goes wrong","examples":["to be in a position of responsibility","It's time for someone to take responsibility and get the job done.","responsibility for something She assumed responsibility for recruitment.","We are recruiting a sales manager with responsibility for the European market.","responsibility for doing something They have responsibility for ensuring the rules are enforced.","The responsibility for doing this rests with the department managers.","responsibility to do something It is their responsibility to ensure the rules are enforced.","parental rights and responsibilities","She is no longer able to fulfil her responsibilities.","I did it on my own responsibility (= without being told to and being willing to take the blame if it had gone wrong).","Governors carry a special burden of responsibility.","Responsibility is devolved down to the people who are affected.","She has responsibility for public spending.","As a nation we have shirked responsibility for our emissions.","We encourage students to share responsibility for shaping the content of the course.","Every employee shares responsibility for the company's success.","The assistants were handling their responsibilities in the only way they could.","The heads of school departments have particular responsibilities for the curriculum.","The sergeant assumed his command responsibilities.","Ultimate responsibility rests with the president.","We retain all responsibility for any shortcomings.","What are the main responsibilities in your job?","Will you take responsibility for arranging the food?","As you delegate responsibility, you may feel a loss of control.","With great power comes great responsibility.","He avoids responsibility at work.","people on the verge of assuming adult responsibilities","to shift legal responsibility for the correct labelling of goods onto the shopkeeper","I'm not ready to be in a position of responsibility."],"opposite":"","synonyms":""},{"def":"blame for something bad that has happened","examples":["The bank refuses to accept responsibility for the mistake.","Nobody has claimed responsibility for the bombing.","It is for the court to decide who bears responsibility.","We take full responsibility for any errors in the text.","They wanted to shift responsibility for the failure onto their employees.","Full responsibility for the fiasco lies with the PR department.","I take personal responsibility for what has happened.","The cabinet must take collective responsibility for this disastrous decision.","Everyone is trying to shuffle blame and shirk responsibility.","He attributed responsibility for the killing to the secret service.","No organization has yet claimed responsibility for the bomb attack.","The blame should not rest entirely on the director's shoulders; the screenwriter has to share responsibility.","They continue to deny responsibility for their actions.","They cannot evade responsibility for helping to create the mess in the first place.","We cannot avoid responsibility for the choices we make.","The group openly admitted responsibility for the murder.","They acknowledge their responsibility for the legacy of colonialism."],"opposite":"","synonyms":""},{"def":"a moral duty to do something or to help or take care of somebody because of your job, position, etc.","examples":["We want to instil a sense of personal responsibility in children.","responsibility to/towards somebody She feels a strong sense of responsibility towards her employees.","We have a responsibility to our shareholders.","responsibility to do something I think we have a moral responsibility to help these countries.","The media has abdicated its reponsibility to report the facts.","She feels a sense of responsibility towards her employees.","She has plans for her future, but feels a responsibility towards her grieving dad.","What, if anything, is the responsibility of an artist towards the world?","She acknowledges the social responsibility of the writer.","The welfare of children is a collective responsibility.","There has to be a place in any ethical system for personal responsibility.","He feels a responsibility to his community.","an obligation to meet family responsibilities","The government of the time placed responsibility for the poor on the Church.","It is a great responsibility caring for other people's children.","He seems unwilling to face up to his responsibilities as a father.","It is our responsibility as members of Congress to speak out against this injustice.","We have a responsibility as architects to conserve resources.","The club has a responsibility to its members.","She has to cope with her grief and shoulder the responsibility of bringing up children alone."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["corporate responsibility","diminished responsibility"]}]