[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/res/respo/respond__us_1.mp3","phonsUS":"/rɪˈspɑːnd/","level":"A2","meanings":[{"def":"to give a spoken or written answer to somebody/something","examples":["I asked him his name, but he didn't respond.","respond to something/somebody The government did not respond to our questions.","She never responded to my letter.","+ speech ‘I'm not sure,’ she responded.","respond that… When asked about the company's future, the director responded that he remained optimistic.","respond with something He responded with a question.","I’m writing to answer your questions","I’m writing to reply to your questions.","I’m writing to answer to your questions.","I haven’t answered her email yet.","I knocked on the door but nobody answered.","‘I won’t let you down,’ he replied.","The directors were unwilling to respond to questions.","I’m writing in answer to your letter.","He responded politely to her questions.","I wrote responding to their call for feedback.","More than fifty people responded to the advertisement.","127 students responded to the survey.","The company did not respond to requests for an interview.","They usually respond to email quickly.","We try to respond to complaints within 48 hours.","The federal agency failed to respond to the petition within a reasonable time.","If you send us an online enquiry, we will respond as soon as possible.","She wasn't sure how he was likely to respond.","She responded with a smile.","You can respond by email or phone.","If you see an opportunity that interests you, you can respond immediately via the link.","You have to listen to what someone says and respond appropriately.","He immediately responded, “Why me?”","She responded that she hadn't had any complaints."],"opposite":"","synonyms":""},{"def":"to do something as a reaction to something that somebody has said or done","examples":["respond (to something/somebody) How did they respond to the news?","to respond to a call/need/demand","The public is responding positively to these changes.","to respond favourably/enthusiastically","respond by doing something The government responded by banning all future demonstrations.","respond with something The audience responded with enthusiasm.","The demonstrators threw stones and the police responded with tear gas.","The Blues responded with a goal from Tim Janz.","He responded to the report by calling on schools to do more to tackle bullying.","The authorities responded to the protests with force.","Responding to calls for a more diverse canon, we are reviewing our curriculum.","Part of our strategy is to go into neglected markets and respond to these needs.","Companies are responding to the growing demand for no-sugar products.","We do not have a strategy. We merely respond to ideas from local people.","The government needs to listen to the public and respond accordingly.","The government responded by tightening the law on gun ownership.","The terrorists declared all-out war on the government and the government responded in kind.","How a plant responds to an unfavourable change in its environment often depends on its health at the time.","Workers may respond negatively to management decisions if they are not consulted.","Consumers respond differently to different types of packaging.","She responded angrily to the criticisms.","He promptly responded to the threat by issuing one of his own."],"opposite":"","synonyms":""},{"def":"to react quickly or in the correct way to something/somebody","examples":["The car responds very well to the controls.","You can rely on him to respond to a challenge.","Our company is small enough to respond quickly.","He tried to move but his body wouldn't respond.","We asked for help and people responded.","Voters responded to his simple message.","The plants readily respond to these stimuli.","The teams responded magnificently to the challenge.","He has to be able to respond appropriately to the situation as it unfolds.","The lifeboat crew was responding to a distress call.","Police responded to a domestic dispute call at the couple's home shortly after midnight.","These are front-line workers responding to emergencies.","Businesses want to make money online, and web developers have responded accordingly.","This chapter discusses how companies can respond effectively to environmental change.","Architects have responded creatively to the challenge of building in historic locations.","The young designer was able to respond to criticism with great insight.","The system enables teachers to respond flexibly to the needs of their students.","Members of the public responded immediately to the charity's appeal for funds.","Companies have to respond to the changing economic climate.","The music seems to respond emotionally to the landscape.","When people walk into this gallery, they respond immediately.","People really respond to her honesty and directness.","The students immediately responded to the idea.","Generally, social structures respond to crises by adapting.","Government can be slow to respond to innovations.","We were quick to respond to this new threat.","Presented with a clear opportunity, the opposition failed to respond.","We respond to business problems in creative ways."],"opposite":"","synonyms":""},{"def":"to improve as a result of a particular kind of treatment","examples":["The infection did not respond to the drugs.","Their son is responding well to the treatment.","His condition failed to respond to the treatment."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]