[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/res/respo/responsible__us_2.mp3","phonsUS":"/rɪˈspɑːnsəbl/","level":"B1","meanings":[{"def":"having the job or duty of doing something or taking care of somebody/something, so that you may be blamed if something goes wrong","examples":["responsible for doing something Mike is responsible for designing the entire project.","responsible for somebody/something Even where parents no longer live together, they each continue to be responsible for their children.","The management team is directly responsible for the day-to-day operations of the company.","I'd like to talk to whoever is responsible here.","All members of the Cabinet are collectively responsible for decisions taken.","Both parents are equally responsible for raising the children.","I am making you responsible for the cooking.","I'm leaving you responsible for Juliet's protection.","The board is ultimately responsible for policy decisions.","The company could not indicate a person even nominally responsible for staff training.","They're responsible for cleaning the engine.","Thompson is directly responsible for all aspects of the business unit.","We are all equally responsible for its success.","if you're solely responsible for your family's welfare","the person nominally responsible for staff training"],"opposite":"","synonyms":""},{"def":"being able to be blamed for something","examples":["responsible for something Who's responsible for this mess?","He is mentally ill and cannot be held responsible for his actions.","We will ensure that anyone found responsible for the accident is held accountable.","Everything will be done to bring those responsible to justice.","You mustn't feel responsible in any way.","Did he think her somehow responsible for Eddie's death?","He was almost single-handedly responsible for the flourishing drug trade in the town.","She was very distressed at the time and cannot be held responsible for her actions.","I believe the press to be partly responsible for the recent rise in racist attacks.","Who was responsible for the mistake?","They held him responsible for the failure of the policy.","The commander was personally responsible for ordering the attack on the village."],"opposite":"","synonyms":""},{"def":"being the cause of something","examples":["responsible for something Cigarette smoking is responsible for about 90 per cent of deaths from lung cancer.","He believes that man-made carbon dioxide is directly responsible for global warming.","Hormonal changes may be partly responsible for these mood swings.","It's been one of the factors chiefly responsible for improved public health.","No single pathogen seems wholly responsible for the disease.","An investigation into the contamination of the water supply revealed that fracking was responsible."],"opposite":"","synonyms":""},{"def":"that you can trust and rely on","examples":["The child should be accompanied by a parent or other responsible adult.","We need to teach our children to act as responsible citizens.","the importance of using medicines in a responsible manner","Clare has a mature and responsible attitude to work.","The firm specializes in socially responsible investments.","responsible with something They are not very responsible with money.","Resources must be allocated in a morally responsible way.","In California you have to be 21 to be considered responsible enough to drink.","their efforts to make the industry more responsible and responsive to concerns","The organization needs to become more environmentally responsible."],"opposite":"irresponsible","synonyms":""},{"def":"needing somebody who can be trusted and relied on; involving important duties","examples":["a responsible position"],"opposite":"","synonyms":""},{"def":"having to report to somebody/something with authority or in a higher position and explain to them what you have done","examples":["The Council of Ministers is responsible to the Assembly.","a complex web of party bodies ultimately responsible to the Central Committee","The prime minister is directly responsible to Parliament."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]