[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/res/restr/restraint__us_1.mp3","phonsUS":"/rɪˈstreɪnt/","level":"C1","meanings":[{"def":"a rule, a fact, an idea, etc. that limits or controls what people can do","examples":["The government has imposed export restraints on some products.","social restraints on drinking alcohol","The EU has set strict limits on pollution levels.","the speed limit","There are no restrictions on the amount of money you can withdraw.","arms control","We have to work within severe constraints of time and money.","The government has imposed export restraints on some products.","The unions are unlikely to accept any sort of wage restraint.","They would resist any limitation of their powers.","The government imposed restraints on spending.","They balked at the notion of prior restraints on research.","We did the best we could within the limited time restraints.","What happens when the conventional restraints on human cruelty are removed?","agreements on voluntary export restraints","There are certain social restraints on drinking alcohol."],"opposite":"","synonyms":"limit"},{"def":"the act of controlling or limiting something because it is necessary or sensible to do so","examples":["The unions are unlikely to accept any sort of wage restraint.","without restraint They said that they would fight without restraint (= completely freely) for what they wanted.","talks on voluntary wage restraint","the government's need to exercise fiscal restraint","Prices continued to rise without restraint."],"opposite":"","synonyms":""},{"def":"the quality of behaving calmly and with control","examples":["The police appealed to the crowd for restraint.","He exercised considerable restraint in ignoring the insults.","Finally he was able to cry properly, without restraint.","He abandoned all restraint and yelled at the top of his lungs.","Journalists have exercised remarkable restraint in not reporting all the sordid details of the case.","Somehow I had the restraint not to tell Peter that.","The government called for restraint by both sides.","The media should have used more restraint in disclosing his private life.","The role requires a certain restraint.","They reacted with restraint.","the mutual restraint shown by police and protesters."],"opposite":"","synonyms":""},{"def":"the use of physical force to control somebody who is behaving in a violent way","examples":["the physical restraint of prisoners","Sometimes the care workers need to use physical restraint on the hospital patients.","guilty of the charge of unlawful restraint"],"opposite":"","synonyms":""},{"def":"a type of seat belt or safety device","examples":["Children must use an approved child restraint or adult seat belt."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["child restraint","self-restraint","judicial restraint"]}]