[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/res/resto/restore__us_1.mp3","phonsUS":"/rɪˈstɔːr/","level":"B2","meanings":[{"def":"to bring back a situation or feeling that existed before","examples":["restore something The measures are intended to restore public confidence in the economy.","Order was quickly restored after the riots.","Such kindness restores your faith in human nature (= makes you believe most people are kind).","The operation restored his sight (= made him able to see again).","restore something to somebody Peace has now been restored to the area.","Full diplomatic relations have now been restored.","Troops were sent to the area to restore order.","We need to restore public confidence in the industry.","an attempt to restore the company's finances"],"opposite":"","synonyms":""},{"def":"to bring somebody/something back to a former condition, place or position","examples":["He is now fully restored to health.","We hope to restore the garden to its former glory (= make it as beautiful as it used to be).","This cream claims to restore your skin to its youthful condition.","She was now restored to health and ready to go back to work.","The army restored him to the throne."],"opposite":"","synonyms":""},{"def":"to repair a building, work of art, piece of furniture, etc. so that it looks as good as it did originally","examples":["Her job is restoring old paintings.","The house has been lovingly restored to the way it looked in 1900 when it was built.","The train has been restored to full working order.","The interior has recently been extensively restored.","The buildings have now been restored to their former glory.","The film has been digitally restored and remastered."],"opposite":"","synonyms":""},{"def":"to bring a law, tradition, way of working, etc. back into use","examples":["to restore ancient traditions","Some people argue that the death penalty should be restored."],"opposite":"","synonyms":""},{"def":"to give something that was lost or stolen back to somebody","examples":["The police have now restored the painting to its rightful owner."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]