[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/res/restr/restriction__us_1.mp3","phonsUS":"/rɪˈstrɪkʃn/","level":"B2","meanings":[{"def":"a rule or law that limits what you can do or what can happen","examples":["import/speed/travel restrictions","restriction on something to impose/place a restriction on something","The government has agreed to lift restrictions on press freedom.","There are no restrictions on the amount of money you can withdraw.","The EU has set strict limits on pollution levels.","the speed limit","There are no restrictions on the amount of money you can withdraw.","arms control","We have to work within severe constraints of time and money.","The government has imposed export restraints on some products.","The unions are unlikely to accept any sort of wage restraint.","They would resist any limitation of their powers.","Confidentiality restrictions prevent me from giving any names.","He doesn't put any restrictions on me.","The 30 mph speed restriction applies in all built-up areas.","The government has introduced tough new import restrictions.","The press asked for restrictions on reporting the war to be lifted.","The regulations were seen as a restriction on personal freedom.","The removal of petty restrictions has made life easier.","The restriction was relaxed in 2002.","The right of sale is subject to certain restrictions.","They have the potential to enforce restrictions such as no smoking policies.","a Senate bill that seeks to tighten restrictions on coal plant emissions","arbitrary restrictions on medicines","free movement of goods between member countries without any artificial restrictions","plans to create further vehicle restrictions in the city","restrictions that limit access to land and raw materials","the dietary restrictions of Judaism","Speed restrictions are in operation on the M4 due to poor visibility.","The hospital management has imposed a restriction on visiting hours.","They had to live for a month with certain restrictions on their freedom of movement."],"opposite":"","synonyms":"limit"},{"def":"the act of limiting or controlling somebody/something","examples":["sports clothes that prevent any restriction of movement","A diet to lose weight relies on calorie restriction in order to obtain results.","Citizens of the EU can travel without restriction within the EU.","another instance of the restriction of basic civil liberties","the health benefits of calorie restriction"],"opposite":"","synonyms":""},{"def":"a thing that limits the amount of freedom you have","examples":["the restrictions of a prison"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]