[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/ret/retir/retire__us_3.mp3","phonsUS":"/rɪˈtaɪər/","level":"B1","meanings":[{"def":"to leave your job and stop working, especially because you have reached a particular age or because you are ill; to tell somebody they must stop doing their job","examples":["He is retiring next year after 30 years with the company.","The company's official retiring age is 65.","Lots of teachers like me expected to retire on a full pension.","retire from something She was forced to retire early from teaching because of ill health.","She retired from politics after her second term in office.","retire to something My dream is to retire to a villa in France.","retire as something He has no plans to retire as editor of the magazine.","retire somebody She was retired on medical grounds.","As for me, I am quite ready to retire.","He is hoping to retire early on medical grounds.","He recently retired as CEO of the company.","He recently retired as head teacher of their school.","I'm hoping to retire in about five years.","In a few years, I'll be eligible to retire.","Most employees retire at 60.","Mr McNeil is due to retire later this month.","She recently retired from teaching.","She has decided to retire from international tennis.","He officially retired from the day-to-day operations of his company.","She retired from the bank last year.","She simply couldn't afford to retire at sixty.","She's on course to retire quite comfortably by the time she's 55.","a newly retired couple","He was medically retired at the age of 55."],"opposite":"","synonyms":""},{"def":"to stop competing during a game, race, etc., usually because you are injured","examples":["retire (from something) She fell badly, spraining her ankle, and had to retire.","+ adj. He retired hurt in the first five minutes of the game."],"opposite":"","synonyms":""},{"def":"to leave a place, especially to go somewhere quieter or more private","examples":["The jury retired to consider the evidence.","retire to something After dinner he likes to retire to his study."],"opposite":"","synonyms":""},{"def":"to move back from a battle in order to organize your soldiers in a different way","examples":[],"opposite":"","synonyms":""},{"def":"to go to bed","examples":["I retired late that evening.","to retire to bed/for the night"],"opposite":"","synonyms":""},{"def":"to make a player or team have to stop their turn at batting","examples":["He retired twelve batters in a row."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]