[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/ret/retir/retirement__us_1.mp3","phonsUS":"/rɪˈtaɪərmənt/","level":"B2","meanings":[{"def":"the fact of stopping work because you have reached a particular age; the time when you do this","examples":["At 60, he was now approaching retirement.","Susan is going to take early retirement (= retire before the usual age).","retirement age","This year we have seen the retirements of several senior personnel.","a retirement pension","After her retirement from the stage she began to drink.","He has a good retirement income.","He remained in the post until his retirement last year.","Her official retirement date is March 12.","In 1996 health problems forced her retirement.","She announced her impending retirement.","She took voluntary retirement in 2001.","Thanks to his diligence, his retirement portfolio is flourishing.","The age of retirement for all employees is 60.","The company suggested that he should take early retirement.","They have about $14 800 in retirement savings.","They presented him with a watch to mark his retirement.","Your pension plan provides a cash lump sum at retirement.","a gift from the company on his retirement","compulsory retirement at 60","her retirement as sales director","his official retirement in 2012","retirement at age fifty","the benefits of private retirement accounts"],"opposite":"","synonyms":""},{"def":"the period of your life after you have stopped work at a particular age","examples":["He provided for a comfortable retirement by selling the business.","We all wish you a long and happy retirement.","in retirement Up to a third of one's life is now being spent in retirement.","He is going to come out of retirement for this one last concert.","His father was now living in retirement in France.","I intend to spend my retirement playing golf.","I've been thinking about where I might like to spend my retirement years.","It was their final concert before entering retirement.","She has found a new hobby in her retirement.","She's saving for her retirement.","The website helps you plan your retirement.","helping you to plan your retirement","investments to fund their retirement","older adults who relocate to retirement communities","important matters like healthcare and retirement security"],"opposite":"","synonyms":""},{"def":"the act of stopping a particular type of work, especially in sport, politics, etc.; the period of your life after a career in sport, politics, etc.","examples":["He announced his retirement from football.","She came out of retirement to win two gold medals at the championships.","his retirement from first-class cricket","her enforced retirement from the sport"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["retirement home","retirement plan","retirement community","retirement homes","retirement communities","registered retirement savings plan"]}]