[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/ret/retre/retreat__us_1.mp3","phonsUS":"/rɪˈtriːt/","level":"C1","meanings":[{"def":"a movement away from a place or an enemy because of danger or defeat","examples":["Napoleon’s retreat from Moscow","The army was in full retreat (= retreating very quickly).","to sound the retreat (= to give a loud signal for an army to move away)","Eventually the police forced the crowd into retreat.","He took part in the retreat from Paris.","I made a tactful retreat before they started arguing.","The enemy was now in retreat.","We covered his retreat with bursts of gunfire.","We succeeded in cutting off the enemy's line of retreat.","an ignominious retreat to the River Vistula","fresh evidence that trade unionism is on the retreat","Hitler's retreat from Russia"],"opposite":"","synonyms":""},{"def":"an act of trying to escape from a particular situation to one that you think is safer or more pleasant","examples":["Is watching television a retreat from reality?","her retreat into a fantasy world of her own"],"opposite":"","synonyms":""},{"def":"an act of changing a decision because of criticism or because a situation has become too difficult","examples":["The Senator made an embarrassing retreat from his earlier position."],"opposite":"","synonyms":""},{"def":"a quiet, private place that you go to in order to get away from your usual life","examples":["a country retreat","Camp David, the presidential retreat in Maryland","She plans to use it as a winter retreat.","They are staying here at their secret retreat from life in the city.","a summer retreat for the rich","designed as a gentleman's country retreat","the perfect retreat for a romantic honeymoon","She bought the cottage as a weekend retreat."],"opposite":"","synonyms":""},{"def":"a period of time when somebody stops their usual activities and goes to a quiet place for prayer and thought; an organized event when people can do this","examples":["He went into retreat and tried to resolve the conflicts within himself.","He went on a Buddhist retreat.","He went into retreat at his country home to escape the attention of the media.","I went off on one of my annual retreats.","I went on a ten-day silent retreat.","She goes on a spiritual retreat for two weeks every summer.","The family held its first retreat last October.","Zen Mountain offers numerous wilderness retreats."],"opposite":"","synonyms":""},{"def":"to go away or back quickly, especially to avoid something unpleasant","examples":["I decided to beat a hasty retreat."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"beat a (hasty) retreat","def":"to go away or back quickly, especially to avoid something unpleasant","examples":["I decided to beat a hasty retreat."]}],"phrasal":[],"related":["beat a (hasty) retreat","to go, retreat, etc. into your shell"]},{"pos":"verb","level":"C1","meanings":[{"def":"to move away from a place or an enemy because you are in danger or because you have been defeated","examples":["The army was forced to retreat after suffering heavy losses.","We retreated back down the mountain.","They retreated to a safe distance from the fighting.","The army has been ordered to retreat.","They retreated before the Americans."],"opposite":"advance","synonyms":""},{"def":"to move away or back","examples":["He watched her retreating figure.","The flood waters slowly retreated.","Sandy retreated slowly, wary of what the man might do.","I heard her footsteps retreat down the hall."],"opposite":"","synonyms":""},{"def":"to escape to a place that is quieter or safer","examples":["Bored with the conversation, she retreated to her bedroom.","(figurative) He retreated into a world of fantasy.","He retreated hastily back to his car.","He retreated behind the table.","She retreated from the busy office to her own room.","He retreated into his own world."],"opposite":"","synonyms":""},{"def":"to change your mind about something because of criticism or because a situation has become too difficult","examples":["The government had retreated from its pledge to reduce class sizes.","He told them not to retreat in the face of opposition from the public.","He retreated in the face of strong opposition."],"opposite":"","synonyms":""},{"def":"to lose value","examples":["Share prices retreated 45p to 538p."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]