[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/ret/retur/return__us_2.mp3","phonsUS":"/rɪˈtɜːrn/","level":"A1","meanings":[{"def":"to come or go back from one place to another","examples":["I waited a long time for him to return.","returning emigrants/exiles/refugees (= who are coming home after being away)","return to… She's returning to Australia tomorrow after six months in Europe.","He had recently returned to this country after living in Spain.","I had to return to the store to look for my purse.","return from… I returned from work to find the house empty.","People were returning home for the weekend.","I waited a long time for him to return.","What time did you get back last night?","The weather got so bad that we had to turn back.","They were forced to return to the port because of bad weather.","The prime minister recently returned from a summit at Camp David.","We locked the door in case Mary returned unexpectedly.","He finally returned with the drinks.","The patient subsequently returned for surgery.","She was preparing to return to El Salvador.","She quickly returned to the car and sped off.","Our aircraft all returned safely to their bases.","She had recently returned from Paris.","Charlie reluctantly returned to his seat.","I couldn't wait to return from my travels.","I will have to ask that you return directly to your houses.","When did she return home from the trip?","They returned to find the house had been burgled."],"opposite":"","synonyms":"return"},{"def":"to bring, give, put or send something back to somebody/something","examples":["return somebody/something to somebody/something We had to return the hairdryer to the store because it was faulty.","I must return some books to the library.","The court ordered him to return the children to their mother.","Completed questionnaires should be returned to this address.","return something He refused to return our money.","return somebody/something + adj. I returned the letter unopened.","I offered to return his Christmas gift to me.","She never returned the book to me.","See that the documents are returned promptly, please.","He was immediately returned to his jail cell.","Don't forget to return my pen!"],"opposite":"","synonyms":""},{"def":"to come back again","examples":["The following day the pain returned.","There's a chance the cancer will return.","Confidence returned and prices started to rise.","The bad weather has returned with a vengeance.","His headache returned instantly.","Her symptoms returned periodically.","My strength was slowly returning to me.","There are positive signs that peace is returning.","the tears that threatened to return","Her suspicions returned when things started going missing again."],"opposite":"","synonyms":""},{"def":"to start discussing a subject you were discussing earlier, or doing an activity you were doing earlier","examples":["He returns to this topic later in the report.","She looked up briefly then returned to her sewing.","The doctor may allow her to return to work next week.","Suspicions were aroused when he failed to return to work on Monday morning.","Ali returned triumphantly to boxing in 1970.","Lack of cash forced her to return to work.","His conversation returns repeatedly to the same subjects.","Let me return briefly to this question.","She is due to return to school in a fortnight."],"opposite":"","synonyms":""},{"def":"to go back to a previous state","examples":["Train services have returned to normal after the strike.","The land has returned to its natural state.","Many find returning to civilian life difficult."],"opposite":"","synonyms":""},{"def":"to do or give something to somebody because they have done or given the same to you first; to have the same feeling about somebody that they have about you","examples":["to return a smile/gaze/greeting","If you assist people when they ask for help, it is more likely they will return the favour.","She phoned him several times but he was too busy to return her call.","It's time we returned their invitation (= invite them to something as they invited us first).","‘You were both wonderful!’ ‘So were you!’ we said, returning the compliment.","to return a kiss (= to kiss somebody with the same enthusiasm with which they kiss you)","He did not return her love.","to return fire (= to shoot at somebody who is shooting at you)","Kevin gladly returned her hug.","He hadn't bothered to return her messages.","He soon falls in love with Amanda, but she does not return his affection."],"opposite":"","synonyms":""},{"def":"to hit the ball back to your opponent during a game","examples":["to return a service/shot"],"opposite":"","synonyms":""},{"def":"to give a decision about something in court","examples":["The jury returned a verdict of not guilty.","The inquest returned a verdict of accidental death."],"opposite":"","synonyms":""},{"def":"to elect somebody to a political position","examples":["be returned (as something) She was returned as MP for Edgbaston in the last election.","be returned (to something) He was returned to Parliament with an increased majority."],"opposite":"","synonyms":""},{"def":"to give or produce a particular amount of money as a profit or loss","examples":["to return a high rate of interest","Last year the company returned a loss of £157 million."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["day return","return mail","tax return","return match","return ticket","return visit","return address","Rovers Return","return key","return game","return matches","return tickets","return addresses","by return (of post)","(on) sale or return","the point of no return","in return (for something)"]},{"pos":"noun","level":"A1","meanings":[{"def":"the action of arriving in or coming back to a place that you were in before","examples":["return of somebody to… A week had passed since their return to Geneva.","return of somebody from… I was a bit bored after my return from holiday.","return of somebody to…from… On my return to England from Dublin my Mum picked me up at the airport.","She lives in fear of his return.","They offered up a prayer of thanks for her safe return.","on/upon somebody/something's return He was met by his brother on his return from Italy.","I saw the play on its return to Broadway.","Upon the return of the jury the following day, the Judge made a brief summary of the case.","on the return flight/journey/trip/visit","The smell of cooking greeted his return home.","He promised to visit us on his return.","Shevchenko made an emotional return to his former club.","The championships made their long-awaited return to the West Coast.","The date of their return from India is a fortnight from now.","The photos were taken during his nostalgic return to Redwood Creek.","This race announces the successful return of Johnson, who has been out of the international scene for almost two years.","Today, the whole village celebrates Elizabeth's miraculous return.","Will he be saved by the timely return of Simone?","his eventual return to Budapest","the unexpected return of her long-lost niece"],"opposite":"","synonyms":""},{"def":"the action of giving, putting or sending something/somebody back","examples":["return of something/somebody We would appreciate the prompt return of books to the library.","The judge ordered the return of the child to his mother.","The owner offered a £ 20,000 reward for the safe return of the pictures.","Write your return address (= the address that a reply should be sent to) on the back of the envelope.","He continued to seek the return of his property.","She hoped she'd get a return call soon.","The organization facilitates the return of refugees and displaced persons.","Thousands will welcome the return of this national treasure."],"opposite":"","synonyms":""},{"def":"the situation when a feeling or state that has not been experienced for some time starts again","examples":["return of something the return of spring","a return of my doubts","Thousands of refugees have gone back to their homes following the return of peace."],"opposite":"","synonyms":""},{"def":"the action of going back to an activity or a situation that you used to do or be in","examples":["return to something his return to power","They appealed for a return to work (= after a strike).","This film is a welcome return to form for the groundbreaking director.","He made a welcome return to the side after injury.","The performance marked his return to the London stage after many years.","He's making his long-awaited return from injury.","a full return to health","a cult whose members advocated a return to traditional living","This is a welcome return to form for one of the best athletes in the sport.","The victory marked Williams' return to top form.","The new treatment means patients can expect a shorter hospital stay and a faster return to work.","The cooperative anticipates a return to profitability later in the year.","The UN continued to call for a return to civilian rule.","Jones is hoping for an early return to racing after her injury.","He made a successful return to the game after several years of retirement.","He does not rule out a possible return to the concert world.","She made a triumphant return to Broadway earlier this year.","The takeover heralded a return to a strong central administration."],"opposite":"","synonyms":""},{"def":"the amount of profit that you get from something","examples":["a high rate of return on capital","the return on investment","annual/investment returns","farmers seeking to improve returns from their crops","to maximize returns to shareholders","Product areas are being developed to produce maximum returns.","The bank offers a higher rate of return on investments over $10 000.","The capital she invested failed to generate much of a return.","investors seeking better returns in an era of low inflation","future real returns from global equities","an average return of 16%","You should get a good return on this investment.","Venture capitalists currently see few prospects of early returns.","They're looking for new sources of investment return.","They are counting on a big financial return.","These figures represent a return of 8.5% per annum.","Their goal is to improve economic returns from irrigation.","The venture yielded a net return of £15 million.","The plan provides a guaranteed return.","The group has averaged returns of 3.8% a year over the past five years.","The employer guaranteed a certain return on retirement investment.","She expects a 100% return within 18 months.","Gold shares could realize returns of 15% per annum.","We're getting a high rate of return.","The software had to demonstrate a fast return.","increasing returns from educational investment"],"opposite":"","synonyms":""},{"def":"an official report or statement that gives particular information to the government or another body","examples":["census returns","election returns (= the number of votes for each candidate in an election)","US citizens living in Canada must file tax returns under both systems.","These amounts of money were not declared in their annual returns.","The latest statistical returns are not very reliable.","The 2001 census returns showed that there were more unemployed people than was previously thought.","He was accused of trying to falsify election returns."],"opposite":"","synonyms":""},{"def":"a ticket for a journey to a place and back again","examples":["‘Brighton, please.’ ‘Single or return?’","A return is cheaper than two singles.","the return fare to London","When is your return flight?"],"opposite":"","synonyms":""},{"def":"a ticket for the theatre or a sports game that was bought by somebody but is given back to be sold again","examples":[],"opposite":"","synonyms":""},{"def":"the button that you press on a computer when you reach the end of an instruction, or to begin a new line","examples":["To exit this option, press return."],"opposite":"","synonyms":""},{"def":"the action of hitting the ball, etc. back to your opponent","examples":["a powerful return of serve"],"opposite":"","synonyms":""},{"def":"using the next available post; as soon as possible","examples":["Please reply by return of post.","All orders will be sent by return of post/by return mail."],"opposite":"","synonyms":""},{"def":"used to refer to a point at which you start achieving less than the value of the time or money you put into something","examples":["Our efforts were producing diminishing returns.","In general, the more exercise you take, the greater the health benefit; but beyond a certain level you get diminishing returns."],"opposite":"","synonyms":""},{"def":"as a way of thanking somebody or paying them for something they have done","examples":["Can I buy you lunch in return for your help?","She gave them all the help she could, and asked for nothing in return.","If I do this for you, what do I get in return?"],"opposite":"","synonyms":""},{"def":"as a response or reaction to something","examples":["I asked her opinion, but she just asked me a question in return."],"opposite":"","synonyms":""},{"def":"used to wish somebody a happy and pleasant birthday","examples":[],"opposite":"","synonyms":""},{"def":"the time when you must continue with what you have decided to do, because it is not possible to get back to an earlier situation","examples":["We have passed the point of no return."],"opposite":"","synonyms":""},{"def":"supplied with the agreement that any item that is not sold can be sent back without having to be paid for","examples":["The novels are delivered to outlets on a sale or return basis."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"by return (of post)","def":"using the next available post; as soon as possible","examples":["Please reply by return of post.","All orders will be sent by return of post/by return mail."]},{"idiom":"(the law of) diminishing returns","def":"used to refer to a point at which you start achieving less than the value of the time or money you put into something","examples":["Our efforts were producing diminishing returns.","In general, the more exercise you take, the greater the health benefit; but beyond a certain level you get diminishing returns."]},{"idiom":"in return (for something)","def":"as a way of thanking somebody or paying them for something they have done","examples":["Can I buy you lunch in return for your help?","She gave them all the help she could, and asked for nothing in return.","If I do this for you, what do I get in return?","I asked her opinion, but she just asked me a question in return."]},{"idiom":"many happy returns (of the day)","def":"used to wish somebody a happy and pleasant birthday","examples":[]},{"idiom":"the point of no return","def":"the time when you must continue with what you have decided to do, because it is not possible to get back to an earlier situation","examples":["We have passed the point of no return."]},{"idiom":"(on) sale or return","def":"supplied with the agreement that any item that is not sold can be sent back without having to be paid for","examples":["The novels are delivered to outlets on a sale or return basis."]}],"phrasal":[],"related":[]}]