[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rev/revea/reveal__us_5.mp3","phonsUS":"/rɪˈviːl/","level":"B2","meanings":[{"def":"to make something known to somebody","examples":["reveal something to reveal a secret","Her expression revealed nothing.","A series of flashbacks reveal the details of the tragedy.","The identity of the buyer has not been revealed.","The survey reveals some worrying statistics.","reveal something to somebody The doctors did not reveal the truth to him.","reveal (that)… The report reveals that the company made a loss of £20 million last year.","it is revealed that… It was revealed that important evidence had been suppressed.","reveal how, what, etc… Officers could not reveal how he died.","reveal somebody/something to be/have something Salted peanuts were recently revealed to be the nation's favourite snack.","reveal somebody/something as something He has been revealed as a traitor.","There is clear evidence that TV advertising influences what children buy.","It is clear from numerous studies that TV advertising influences what children buy.","Recent research demonstrates that TV advertising influences children’s spending habits.","Many parents think that TV advertising influences their children. This view is supported by the findings of a recent study, which show a clear link between television advertisements and children’s spending habits.","The findings also reveal that most children are unaware of the persuasive purpose of advertising.","There is little evidence that children understand the persuasive intent of advertising.","The results contradict claims that advertising is unrelated to children’s spending habits.","Manufacturers argue that it is difficult to prove that advertising alone influences what children buy.","Salted peanuts were recently revealed as the nation’s favourite snack.","I'm afraid I cannot reveal any more details at the moment.","She refused to reveal the whereabouts of her husband.","She would not reveal her true identity to the police.","One of the oldest people in Britain has revealed her secret: a drop of brandy in her tea.","Wilde is revealed as a man of great intelligence, dignity and wit.","Details of the murder were revealed by the local paper."],"opposite":"","synonyms":""},{"def":"to show something that previously could not be seen","examples":["reveal something He laughed, revealing a line of white teeth.","The door opened to reveal a cosy little room.","X-rays revealed a fracture.","Excavations at these sites have revealed impressive stone structures.","reveal yourself She crouched in the dark, too frightened to reveal herself.","A thorough search failed to reveal the murder weapon.","The door swung open to reveal a tall, gaunt figure."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["gender reveal"]},{"pos":"noun","level":"","meanings":[{"def":"the moment when a previously secret piece of information is made known, such as the winner of a prize, or the solution to a mystery in a film or TV drama","examples":["The big reveal at the end of the movie answers all questions."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]