[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rev/revie/review__us_4.mp3","phonsUS":"/rɪˈvjuː/","level":"A2","meanings":[{"def":"a report in a newspaper or magazine, or on the internet, television or radio, in which somebody gives their opinion of a book, play, film, product, etc.; the act of writing this kind of report","examples":["a book review","She gave the film a glowing review.","mixed/negative/bad reviews","a positive/favourable review","an online review of the restaurant","He submitted his latest novel for review.","Did you see the review in ‘Phase’?","His review appeared in yesterday's paper.","I'm doing a review for the local paper.","The book received mixed reviews.","The show has good audience figures despite poor reviews in the press.","Their new musical opened to glowing reviews.","I always read the film reviews.","the reviews page in the papers","Please leave us a review."],"opposite":"","synonyms":""},{"def":"an act of looking again at something you have studied or written, especially in order to prepare for an exam","examples":["We need to do the review for the test tomorrow.","I should have time for a quick review of my notes before the test.","We'll have time at the end of class for review.","There is a grammar review section at the end of each unit."],"opposite":"","synonyms":""},{"def":"an examination of something, with the intention of changing it if necessary","examples":["The government has embarked on a systematic review of transport policy.","MPS have called for an independent review.","The proposals are available for review online.","under review The terms of the contract are under review.","up for review His parole application is up for review next week.","a review board/panel","a pay/salary review","Greenpeace will seek a judicial review if a full public inquiry is not held.","The matter is still under review.","The rent is due for review.","These rules will soon be up for review.","a review by the court","the government's annual policy review","A formal performance review system was introduced five years ago.","I have my performance review tomorrow.","the government’s review of its education policy"],"opposite":"","synonyms":""},{"def":"an examination of all the relevant information on a subject or on a series of events","examples":["to conduct/undertake a review of customer complaints","to publish a review of recent cancer research","a comprehensive review of current scientific knowledge on the subject","a thorough review of relevant materials","The literature review suggests a number of areas for further study.","The first chapter presents a critical review of the existing nursery education system.","An official review concluded that help was not getting to those most in need."],"opposite":"","synonyms":""},{"def":"a ceremony that involves an official inspection of soldiers, etc. by an important visitor","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["peer review","rave review","judicial review","performance review","London Review of Books","New York Review of Books"]},{"pos":"verb","level":"A2","meanings":[{"def":"to write a report of a book, play, film, product, etc. in which you give your opinion of it","examples":["Please rate and review your purchase on our website.","The play was reviewed in the national newspapers.","The book was favourably reviewed by most critics."],"opposite":"","synonyms":""},{"def":"to look again at something you have studied, especially in order to prepare for an exam","examples":["review something We will be reviewing all the topics covered this semester.","review for something Jonas helped me review for the test.","Next week we're going to be reviewing for the final.","I think it would be a good idea to review the material in chapter 10.","Take a little time to review your notes the evening before."],"opposite":"","synonyms":""},{"def":"to check a piece of work to see if there are any mistakes","examples":["Review your work before you turn it in."],"opposite":"","synonyms":""},{"def":"to carefully examine or consider something again, especially so that you can decide if it is necessary to make changes","examples":["The government will review the situation later in the year.","The company is reviewing its business travel policy.","After reviewing the evidence, the judge dismissed the case.","This case should be reviewed in the light of new evidence.","to review a decision/proposal","Staff performance is reviewed annually.","These ideas will be examined in more detail in Chapter 10.","The job involves gathering and analysing data.","He tried to analyse his feelings.","The government will review the situation later in the year.","We will study the report carefully before making a decision.","This topic will be discussed at greater length in the next chapter.","We are currently reviewing our options.","Progress will be reviewed every three months .","Pull out your budget and critically review each line on it.","Safety procedures are being urgently reviewed after a chemical leak at the factory.","This figure will be reviewed from time to time in the light of inflation.","The decision may need to be reviewed in the light of new evidence."],"opposite":"","synonyms":"examine"},{"def":"to read or study information about something, especially in order to reach an opinion about it","examples":["to review records/documents/data","Let's start by reviewing the evidence.","This paper reviews the literature on the subject.","The next section briefly reviews previous studies.","Students can review the material at their own pace.","You should review the document carefully before signing."],"opposite":"","synonyms":""},{"def":"to think about past events, for example to try to understand why they happened","examples":["to review your failures and triumphs","She had been reviewing the previous week on her way home."],"opposite":"","synonyms":""},{"def":"to make an official inspection of a group of soldiers, etc. in a military ceremony","examples":["The Commander-in-Chief reviewed the troops."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]