[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rev/revol/revolution__us_2.mp3","phonsUS":"/ˌrevəˈluːʃn/","level":"B2","meanings":[{"def":"an attempt, by a large number of people, to change the government of a country, especially by violent action","examples":["a socialist revolution","the outbreak of the French Revolution in 1789","The shooting and killing of thirty people started a revolution.","The country appears to be on the brink of revolution.","Some Marxists still believe that socialism will one day triumph through world revolution.","The activists were charged with fomenting revolution.","Thousands of people were killed in the bloody revolution that toppled the government.","a revolution against communist rule","the failed 1911 revolution","the revolution which overthrew the old regime","The French Revolution brought about great changes in the society and government of France."],"opposite":"","synonyms":""},{"def":"a great change in conditions, ways of working, beliefs, etc. that affects large numbers of people","examples":["a cultural/social/scientific, etc. revolution","the sexual revolution of the 1960s","the digital/technological revolution","They led the electronics revolution but have been left behind by the IT revolution.","revolution in something A revolution in information technology is taking place.","As the 18th century wore on, an agricultural revolution took place.","Doctors have welcomed the fitness revolution.","He achieved a virtual revolution in the way music is recorded.","Marketing has undergone a revolution in recent years.","The coming of television brought about a revolution in people's leisure activities.","The computer revolution has transformed the workplace.","The last decade has seen a revolution in telecommunications.","There has been a quiet revolution in the way writing is taught.","There has been a revolution going on in farming during the last five years."],"opposite":"","synonyms":""},{"def":"a complete circular movement around a point","examples":["The disk rotates at up to 500 revolutions per minute.","revolution around something The revolution of the earth around the sun takes one year.","Jupiter makes a complete revolution around the sun every 12 years.","The earth turns through one complete revolution approximately every twenty-four hours.","One full revolution of the knob will open the hatch."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["agrarian revolution","counter-revolution","American Revolution","Bloodless Revolution","Glorious Revolution","Industrial Revolution","Daughters of the American Revolution","palace revolution","the Agrarian Revolution"]}]