[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rew/rewar/reward__us_1.mp3","phonsUS":"/rɪˈwɔːrd/","level":"B2","meanings":[{"def":"a thing that you are given because you have done something good, worked hard, etc.","examples":["a financial reward","reward for something a reward for good behaviour","reward for doing something You deserve a reward for being so helpful.","Winning the match was just reward for the effort the team had made.","They're playing the game more for the love of sport than for financial reward.","The company is now reaping the rewards of their investments.","Top corporate jobs are not without their rewards.","The appointment was widely seen as a reward for his loyalty.","Hard work usually brings its own rewards.","It was a poor reward for years of devoted service.","The look on her face when I told her was reward enough.","Top athletes enjoy rich rewards.","Victory brought glory as well as more tangible rewards.","We are just starting to reap the rewards of careful long-term planning.","You deserve a reward for all your efforts.","a reward for hard work","rewards for employees who do their jobs well","At last we are getting the reward for our hard work.","The reward for setting off early is seeing dawn break over the mountains.","You should not bribe the child to work through material rewards."],"opposite":"","synonyms":""},{"def":"an amount of money that is offered to somebody for helping the police to find a criminal or for finding something that is lost","examples":["reward for something A £100 reward has been offered for the return of the necklace.","Anyone wanting to claim the reward should contact the city police.","The company has put up a reward of £25 000 for information.","There is a reward for information leading to an arrest."],"opposite":"","synonyms":""},{"def":"the reward for acting in a moral or correct way is the knowledge that you have done so, and you should not expect more than this, for example praise from other people or payment","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"virtue is its own reward","def":"the reward for acting in a moral or correct way is the knowledge that you have done so, and you should not expect more than this, for example praise from other people or payment","examples":[]}],"phrasal":[],"related":[]},{"pos":"verb","level":"B2","meanings":[{"def":"to give something to somebody because they have done something good, worked hard, etc.","examples":["reward somebody for something She was rewarded for her efforts with a cash bonus.","reward somebody for doing something He rewarded us handsomely (= with a lot of money) for helping him.","In some states of India, doctors are richly rewarded for serving in the rural areas.","reward somebody with something She started singing to the baby and was rewarded with a smile.","reward somebody/something Our patience was finally rewarded.","After a steep climb you will be rewarded by magnificent views from the summit.","Good behaviour should always be rewarded.","He was duly rewarded for his outstanding contribution to the arts.","Her efforts were justly rewarded with a British Empire Medal.","The rats are rewarded with food when they press the lever.","We must make sure that effort is properly rewarded.","You will be handsomely rewarded for your loyalty.","highly rewarded occupations"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]