[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rhy/rhyth/rhythm__us_2.mp3","phonsUS":"/ˈrɪðəm/","level":"B2","meanings":[{"def":"a strong regular repeated pattern of sounds or movements","examples":["to dance to the rhythm of the music","I listened to the steady rhythm of her breathing.","music with a fast/slow/steady rhythm","I love these jazz rhythms.","abnormal heart rhythms","in rhythm He can't seem to play in rhythm.","in rhythm with something The boat rocked up and down in rhythm with the sea.","a dancer with a natural sense of rhythm (= the ability to move in time to a fixed beat)","He was snapping his fingers in rhythm.","Her feet made a steady rhythm as she walked.","Her feet made a steady rhythm on the pavement.","Her pencil tapped out a staccato rhythm on the desk top.","I found myself swaying to the rhythm of the music.","I like music with a good rhythm.","There's rhythm in her movements.","Try to disrupt your opponent's rhythm.","Williams is having trouble finding her rhythm on the serve.","the steady rhythm of his heartbeat","Doctors discovered that he had an abnormal heart rhythm.","She has a natural sense of rhythm.","This piece of music has a very fast rhythm.","You can't play drums because you have no sense of rhythm."],"opposite":"","synonyms":""},{"def":"a regular pattern of changes or events","examples":["the rhythm of the seasons","biological/body rhythms","Lack of sleep can upset your daily rhythm.","You'll soon get into a rhythm.","part of the natural rhythm of life","My body rhythms had not yet adapted to the ten-hour time difference.","changes to our daily rhythms","She soon settled into a regular rhythm.","The movie follows the rhythms of a year on the farm.","Cleaning up the house in the morning fell into an easy rhythm."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["delta rhythm","rhythm guitar","rhythm section","rhythm and blues","rhythm method","rhythm guitars","rhythm sections"]}]