[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/ric/rich_/rich__us_1.mp3","phonsUS":"/rɪtʃ/","level":"A1","meanings":[{"def":"having a lot of money or property","examples":["She's one of the richest women in the world.","to get/grow/become rich","Nobody gets rich from writing nowadays.","She longed to be rich and famous.","He was born in a rich and powerful family.","(slang) to be filthy/stinking (= extremely) rich","affluent Western countries","His family is not very well off.","They’re not millionaires, but they’re certainly very comfortable.","It was mean of her only to give £1—she's filthy rich, you know.","Doughty's genius made him fabulously rich but he never changed his style of life.","people who want to get rich quickly","a newly rich businessman","Very few people get rich from writing nowadays.","This discovery never made her rich."],"opposite":"poor","synonyms":"rich"},{"def":"people who have a lot of money or property","examples":["It's a favourite resort for the rich and famous."],"opposite":"the poor","synonyms":""},{"def":"producing a lot of wealth so that many of its people can live at a high standard","examples":["the richest countries/economies/nations","The system still favours the economies of richer nations.","Rich countries can afford to spend more on the environment."],"opposite":"poor","synonyms":""},{"def":"containing or providing a large supply of something","examples":["rich in something Oranges are rich in vitamin C.","The area is rich in wildlife.","Russia is hugely rich in oil and gas.","The animation is amazingly rich in detail.","The country is rich in natural resources.","His novels are a rich source of material for the movie industry.","iron-rich rocks","the exceptionally rich fishing grounds of the North Pacific","(figurative) Several major US companies have set up in the country in order to tap into the rich vein of talent available.","Ours is a world rich with possibilities."],"opposite":"poor","synonyms":""},{"def":"very interesting and full of variety","examples":["the region’s rich history and culture","She leads a rich and varied life.","a culturally rich nation","the rich architectural heritage of India","This story emphasizes the rich African tradition of oral history."],"opposite":"","synonyms":""},{"def":"containing a lot of fat, butter, eggs, etc. and making you feel full quickly","examples":["a rich, creamy sauce","a rich chocolate cake","The chocolate orange fondant was too rich for me."],"opposite":"","synonyms":""},{"def":"containing the substances that make it good for growing plants in","examples":["a rich, well-drained soil","rich farming land"],"opposite":"poor","synonyms":""},{"def":"strong or deep; very beautiful or attractive","examples":["rich dark reds","the rich sound of the organ","The wine gives the dish a wonderfully rich aroma.","The sun-dried tomatoes give the dish a wonderfully rich flavour.","The colour of the flower is a rich deep red.","the rich tones of autumn","Her rich contralto voice filled the concert hall."],"opposite":"","synonyms":""},{"def":"expensive and beautiful","examples":["The rooms were decorated with rich fabrics."],"opposite":"","synonyms":""},{"def":"used to say that a criticism somebody makes is surprising and not reasonable, because they have the same fault","examples":["Me? Lazy? That's rich, coming from you!"],"opposite":"","synonyms":""},{"def":"to get a lot of money, especially suddenly or unexpectedly","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"strike it rich","def":"to get a lot of money, especially suddenly or unexpectedly","examples":[]}],"phrasal":[],"related":["cash-rich","Rich Tea™","rich text format"]}]