[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/ris/risk_/risk__us_1.mp3","phonsUS":"/rɪsk/","level":"B1","meanings":[{"def":"the possibility of something bad happening at some time in the future; a situation that could be dangerous or have a bad result","examples":["The health risks are very low.","risk of something a high risk of failure","a serious/significant risk of something","The study found a slightly increased risk of cancer in this group.","Steps have been taken to reduce the risk of any trouble.","Use filters or boil water to minimize the risk of infection.","risk of doing something Smoking can increase the risk of developing heart disease.","risk (that)… There is still a risk that the whole deal will fall through.","risk to somebody/something The chemicals pose little risk (= are not dangerous) to human health.","a calculated risk (= one that you think is small compared with the possible benefits)","Trying new things can be a gamble, but it's worth the risk.","Patients should be made aware of the risks involved with this treatment.","Make sure you understand the risks and benefits.","Cigarette smoking is a risk factor for this disease.","The benefits outweigh the risks.","You have to weigh risks and benefits.","Any business venture contains an element of risk.","Consider your own risk tolerance. How many chances are you willing to take?","Farmers invest in irrigation to manage risk in drought years.","Miners are a high risk group for certain types of gastric cancer.","Smoking doubles the risk of having a stroke.","Standards of hygiene have fallen with all the attendant risks of disease.","The directors will have to assess our credit risk.","The lawyers are assuming all the financial risk.","The operation carries an element of risk.","The perceived risk is far greater than reality.","There are considerable risks inherent in the policy.","These funds spread the risk among different countries.","Young male drivers are a higher risk category compared to mature ladies and even women of the same age.","a big jump in the risk premium on corporate bonds","a higher risk of stomach cancer","a reduced risk for heart disease","a risk from contaminated water","efforts to persuade the public to reduce risk behaviour","investors' assessments of overall risk levels","its judgment of what constitutes an acceptable risk","the strategies of risk avoidance that people practice in their everyday lives","Thankfully the risk paid off.","The rewards may well justify the risks.","Companies can mitigate the risks of losing valuable data."],"opposite":"","synonyms":""},{"def":"a person or thing that is likely to cause problems or danger at some time in the future","examples":["Those old boxes in the corridor are a fire risk.","a safety/health risk","risk to something/somebody The group was considered to be a risk to national security.","Pollutants in the river pose a real risk to the fish.","Tuberculosis threatens to become a major health risk worldwide.","Sending cash in the post is a bit of a risk.","Gloss paint can burn strongly and pose a fire risk.","solutions to address security risks more effectively","a major risk to livestock","They try to identify every possible risk.","He is no longer considered a security risk in the State of California.","He is not a current suicide risk.","His lawyer argued that he was not a flight risk."],"opposite":"","synonyms":""},{"def":"a person or business that a bank or an insurance company is willing/unwilling to lend money or sell insurance to because they are likely/unlikely to pay back the money, etc.","examples":["With five previous claims, he's now a bad insurance risk.","He's a good insurance risk."],"opposite":"","synonyms":""},{"def":"in danger of something unpleasant or harmful happening","examples":["As with all diseases, certain groups will be more at risk than others.","If we go to war, innocent lives will be put at risk.","at risk of (doing) something Journalists in the zone are at serious risk of being kidnapped.","at risk from (doing) something Adults were also at risk from epidemics.","Children are at greater risk for these diseases.","They do their patriotic duty at great personal risk."],"opposite":"","synonyms":""},{"def":"used to introduce something that may sound stupid or may offend somebody","examples":["At the risk of showing my ignorance, how exactly does the internet work?"],"opposite":"","synonyms":""},{"def":"with the possibility of harming yourself/somebody/something","examples":["He dived in to save the dog at considerable risk to his own life.","He saved the child at considerable risk to himself."],"opposite":"","synonyms":""},{"def":"to do something even though you have been warned about the possible dangers and will have to take responsibility for anything bad that happens","examples":["Persons swimming beyond this point do so at their own risk (= on a notice).","Valuables are left at their owner's risk (= on a notice).","The building is unsafe—enter at your own risk."],"opposite":"","synonyms":""},{"def":"to be or put yourself in a situation in which something bad could happen to you","examples":["People who are overweight run a risk of a heart attack or stroke.","We don't want to run the risk of losing their business.","Investment is all about running risks.","If you don't revise, you run the risk of failing.","They run great political risks by opposing him."],"opposite":"","synonyms":""},{"def":"to do something even though you know that something bad could happen as a result","examples":["That's a risk I'm not prepared to take.","You have no right to take risks with other people's lives.","It was so close, he decided to take a calculated risk.","I take calculated risks but never gamble.","I was taking a big risk in lending her the money.","I'm not prepared to take risks—I want the equipment thoroughly checked.","She knew she had taken an enormous risk in going to see Helen.","Sometimes leaders need to be prepared to take risks.","He knew he was taking a big risk by going skiing."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"at risk","def":"in danger of something unpleasant or harmful happening","examples":["As with all diseases, certain groups will be more at risk than others.","If we go to war, innocent lives will be put at risk.","at risk of (doing) something Journalists in the zone are at serious risk of being kidnapped.","at risk from (doing) something Adults were also at risk from epidemics.","Children are at greater risk for these diseases.","They do their patriotic duty at great personal risk."]},{"idiom":"at the risk of doing something","def":"used to introduce something that may sound stupid or may offend somebody","examples":["At the risk of showing my ignorance, how exactly does the internet work?"]},{"idiom":"at risk to yourself/somebody/something","def":"with the possibility of harming yourself/somebody/something","examples":["He dived in to save the dog at considerable risk to his own life.","He saved the child at considerable risk to himself."]},{"idiom":"do something at your own risk","def":"to do something even though you have been warned about the possible dangers and will have to take responsibility for anything bad that happens","examples":["Persons swimming beyond this point do so at their own risk (= on a notice).","Valuables are left at their owner's risk (= on a notice).","The building is unsafe—enter at your own risk."]},{"idiom":"run a/the risk (of something/of doing something) | run risks","def":"to be or put yourself in a situation in which something bad could happen to you","examples":["People who are overweight run a risk of a heart attack or stroke.","We don't want to run the risk of losing their business.","Investment is all about running risks.","If you don't revise, you run the risk of failing.","They run great political risks by opposing him."]},{"idiom":"take a risk | take risks","def":"to do something even though you know that something bad could happen as a result","examples":["That's a risk I'm not prepared to take.","You have no right to take risks with other people's lives.","It was so close, he decided to take a calculated risk.","I take calculated risks but never gamble.","I was taking a big risk in lending her the money.","I'm not prepared to take risks—I want the equipment thoroughly checked.","She knew she had taken an enormous risk in going to see Helen.","Sometimes leaders need to be prepared to take risks.","He knew he was taking a big risk by going skiing."]}],"phrasal":[],"related":["at-risk","low-risk","high-risk","risk-averse","risk-taking","security risk","risk assessment","risk your neck","risk assessments","risk life and limb"]},{"pos":"verb","level":"B1","meanings":[{"def":"to put something valuable or important in a dangerous situation, in which it could be lost or damaged","examples":["He risked his life to save her.","She was risking her own and her children's health.","risk something on something He risked all his money on a game of cards.","risk something for something They were willing to risk everything for their liberty.","He was prepared to risk everything in order to achieve his ambition.","I wouldn't risk my money on a scheme like this one.","I wouldn't risk my money on this investment."],"opposite":"","synonyms":""},{"def":"to do something that may mean that you get into a situation which is unpleasant or harmful for you","examples":["risk something There was no choice. If they stayed there, they risked death.","risk doing something These families risked losing everything.","risk somebody/something doing something I can't risk anyone telling my parents about it.","I refuse to risk being hurt.","I simply can't risk being seen there.","families who risk losing their homes","They knew they risked being arrested.","I didn't want to risk being late."],"opposite":"","synonyms":""},{"def":"to do something that you know is not really a good idea or may not succeed","examples":["risk something He risked a glance at her furious face.","They risked the wrath of the government (= risked making them angry) by leaking the story.","It was a difficult decision but we decided to risk it.","I knew I would be in trouble if I was found out, but I decided to risk it anyway.","risk doing something We've been advised not to risk travelling in these conditions."],"opposite":"","synonyms":""},{"def":"to risk being killed or injured in order to do something","examples":["She risked life and limb to save her children from the fire.","I am not risking my neck for anyone!","the brave tourist who risks life and limb for adventure","He had no desire to risk his neck for the king and his favourites.","She has been willing to risk life and limb to get a good close-up shot of the nesting birds."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"risk life and limb | risk your neck","def":"to risk being killed or injured in order to do something","examples":["She risked life and limb to save her children from the fire.","I am not risking my neck for anyone!","the brave tourist who risks life and limb for adventure","He had no desire to risk his neck for the king and his favourites.","She has been willing to risk life and limb to get a good close-up shot of the nesting birds."]}],"phrasal":[],"related":[]}]