[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rit/ritua/ritual__us_1.mp3","phonsUS":"/ˈrɪtʃuəl/","level":"C1","meanings":[{"def":"a series of actions that are always performed in the same way, especially as part of a religious ceremony","examples":["religious rituals","She objects to the ritual of organized religion.","Boys undergo a circumcision ritual to usher them into adulthood.","It takes several days to complete the ritual.","Their funerals follow the rituals of the Catholic church.","They practise/​practice certain rituals in connection with rites of passage.","Women's roles in the rituals of many religions have been limited.","rituals performed by druids at Stonehenge on Midsummer's Day","secret rituals in the sacred forest","Don't let celebration of this festival become an empty ritual.","In an elaborate and impressive ritual, Aaron and his sons are instituted to the priesthood.","Many folk dances have their origins in ancient pagan rituals."],"opposite":"","synonyms":""},{"def":"something that is done regularly and always in the same way","examples":["Sunday lunch with the in-laws has become something of a ritual.","A cognac before bed is one of our little nightly rituals.","Bargaining at the markets is now just an empty ritual.","Eating around the table was a family ritual that could not be broken.","He makes an elaborate ritual of washing the car.","Her visits to her aged father have become a ritual.","Jake began the evening ritual of asking about everyone's day.","She had to go through the ritual of kissing the toys before her son would go to sleep.","He took to the sauna ritual with great enthusiasm.","It was all part of the ritual of returning home.","She had been following this daily ritual for several months.","The bargaining isn't even a formality, it is just an empty ritual.","There had always been this little ritual—chocolates after lunch on Sundays."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adjective","level":"","meanings":[{"def":"done as part of a ritual or ceremony","examples":["ritual chanting","the accusation that they practised ritual murder","the ritual practices of ancient religions"],"opposite":"","synonyms":""},{"def":"always done or said in the same way, especially when this is not sincere","examples":["ritual expressions of sympathy"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]