[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/riv/rival/rival__us_1.mp3","phonsUS":"/ˈraɪvl/","level":"B2","meanings":[{"def":"a person, company or thing that competes with another in sport, business, etc.","examples":["The two teams have always been rivals.","Marlowe was Shakespeare's main rival at the beginning of his career.","the company's nearest/closest rival in the business","The two men were bitter rivals throughout their careers.","This latest design has no rivals (= it is easily the best design available).","rival for something She has no rivals for the job.","rival to somebody/something Grand it may be, but this cathedral is no rival to the great cathedral of Amiens.","The Japanese are our biggest economic rivals.","He eliminated his rivals with brutal efficiency.","She is now regarded as the greatest potential rival to Hu.","The business needed to revive profits and compete with new rivals.","The company faces big rivals in Europe and Asia.","The company is well equipped to compete with its international rivals.","They were rivals for her love.","They wind up as romantic rivals for the same woman.","They're old political rivals.","Those two have been friendly rivals since they first met.","In France and England, a new king often had to fight rivals for the succession to the throne.","Their friendship ended when the two men became rivals for the same woman."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["arch-rival"]},{"pos":"adjective","level":"B2","meanings":[{"def":"competing with another person, company, thing, etc.","examples":["a rival bid/claim/offer","fighting between rival groups/factions","He was shot by a member of a rival gang."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to be as good, impressive, etc. as somebody/something else","examples":["You will find scenery to rival anything you can see in the Alps.","Golf cannot rival football for excitement.","Nothing rivals skiing for sheer excitement.","The food of this region is rivalled only by its wines.","a palace which almost rivals Versailles in size","Many mammals use echoes but the only ones to rival bats in sophistication are whales.","The boat has an extensive galley which rivals most domestic kitchens.","The collection is rivalled only by that at the British Museum."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]