[{"pos":"","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/riv/river/river_phoenix_1_us_1.mp3","phonsUS":"/ˌrɪvər ˈfiːnɪks/","level":"","meanings":[{"def":"(1970-93) a US actor who became a cult figure (= a person who is fashionable with a particular group) among young people after he accidentally took too many drugs and died at the age of 23. He played sensitive characters, and his films include Stand By Me (1986), Running on Empty (1988), My Own Private Idaho (1991) and Sneakers (1992).","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/riv/river/river__us_3.mp3","phonsUS":"/ˈrɪvər/","level":"A1","meanings":[{"def":"a natural flow of water that continues in a long line across land to the sea","examples":["Eventually we came to the mouth of the River Thames.","the Hudson River","on the banks of the river (= the ground at the side of a river)","up/down river to travel up/down river (= in the opposite direction to/in the same direction as the way in which the river is flowing)","the mouth of the river (= where it enters the sea)","in the river Can we swim in the river?","on the river There was a boat on the river.","They have a house on the river (= beside it).","An entire community sprouted up along the river (= beside it).","Ahead of them was a long, deserted stretch of river.","a river valley/basin/delta","The bridge crosses the river just above the rapids.","He dived into the river.","How are we going to get across the river?","I had decided to follow the river to my destination.","Let's go down to the river at sunset.","The bridge once spanned the river Serein.","The river had overflowed its banks.","The river has risen with the rains.","The river is navigable by vessels of up to 90 tons.","The river is still high after the recent rain.","The river rises in Bulgaria and flows through Greece to the Aegean.","The river was swollen after the floods.","The river was too wide to swim across comfortably.","The river winds its way through the hills.","The rocks and sandbanks make the river hard to navigate.","There's a bridge across the river.","They sailed down the river.","They were waiting for us on the other side of the river.","They're dredging the river to make it safer for larger boats.","They've bridged the river at four points.","This river dried up long ago.","This river flows into the Gulf of Mexico.","Trout live in this river.","We crossed the river by boat.","We had to swim the river, which is deep and very rapid.","We walked along the river.","We were sailing up the river.","Wildlife groups are protesting against the proposal to dam the river.","a river town in Borneo","as smooth as river rocks","major rivers such as the Congo","plans to divert the river further north","the Ganges and other sacred rivers","the mighty River Nile","when the river level is low","There were a few trees along the river bank.","They live in a houseboat on the river."],"opposite":"","synonyms":""},{"def":"a large amount of liquid that is flowing in a particular direction","examples":["Rivers of molten lava flowed down the mountain."],"opposite":"","synonyms":""},{"def":"to give poor or unfair treatment to somebody you have promised to help","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"sell somebody down the river","def":"to give poor or unfair treatment to somebody you have promised to help","examples":[]}],"phrasal":[],"related":[]}]