[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/roa/road_/road__us_1.mp3","phonsUS":"/rəʊd/","level":"A1","meanings":[{"def":"a hard surface built for vehicles to travel on","examples":["a main/major/minor road","a country/mountain road","Take the first road on the left and then follow the signs.","The house is on a very busy road.","along/up/down the road They live just down the road (= further on the same road).","He was walking along the road when he was attacked.","by road It takes about five hours by road (= driving).","It would be better to transport the goods by rail rather than by road.","It's difficult to cross the road safely around here.","road accidents/safety/users","There have been 34 road deaths this month.","India has worked hard to improve its road network.","The steep and winding little road was covered in mud.","With heavy road traffic, roads deteriorate rapidly.","a 10-mile road race","a notoriously dangerous stretch of road","Follow the road around to the left.","I rode a camel when I was on holiday.","She took the oars and rowed quickly down the river.","All main roads were passable with care.","Angry farmers blocked the road with their tractors.","He was hit by a lorry as he pulled out into the main road.","Huge eucalyptuses lined the road.","I must have driven the back roads for half an hour.","I pulled off the road for a rest.","It takes three hours by road.","Let's leave when the roads are clear.","Our road branches off to the left just past the wood.","Police cordoned off the road and diverted commuter traffic.","Road bumps/​humps have been laid down to limit the speed of cars.","Road tolls can make driving expensive.","Road tolls can make travelling by motorway fairly expensive.","She stepped out into the road without looking.","Take the next road on the right.","The airport's near here but there's no direct road.","The car left the road and slid to a halt.","The crowd eventually cleared the road.","The crowds lined the roads for his triumphal entry.","The house across the road is for sale.","The road ascends steeply from the harbour.","The road crosses the river further up the valley.","The road narrowed and turned into this dirt trail.","The road runs parallel to the river.","The road stretches off into the distance.","The road twists and turns up the hillside.","The track joins the main road just south of the town.","There is still no road access to the island.","There was a dog in the road so we stopped.","There was a lot of traffic on the road this morning.","There's something lying on the road.","They cleared the roads of snow.","They live down the road from us.","They stopped in a forest, leaving the main road.","Traffic clogs the roads.","Turn left onto the coastal road.","We came to a fork in the road.","We took the wrong road and had to turn back.","We'll be able to go faster once we're out on the open road.","Where does this road go?","a bumpy road through the forest","loans for road construction and infrastructure development","on the road to Damascus","poor driving standards and lack of road manners","the building of new roads","the cost of road maintenance","the main road through the centre of town","the old dirt road to the village","the road connecting Irado and Calla Ayda","The road stretched out before them.","the surrounding road system","A major road crosses the region.","A man's body was lying in the road.","Exhausted, he sat down at the side of the road.","Go along the road until you reach an intersection.","It would be better to go by road.","It's a quiet residential road.","My mother lives down the road.","Now the roads are even more congested.","Road works on the Darlington to Durham road are causing delays.","She lives on a very busy road.","The aim is to reduce the number of road accidents.","The children learn about road safety.","The condition of the road surface is poor.","The main north-south road was closed because of flooding.","Their road building program was abandoned because of lack of funds.","There was a cow sitting right in the middle of the road.","There's a shop just up the road.","They followed the coastal road for about 50 miles.","We drove along country roads.","We took a narrow twisting road up into the mountains.","The property is set back from the road.","Many trees are down and roads are impassable."],"opposite":"","synonyms":""},{"def":"used in names of roads, especially in towns","examples":["35 York Road","We live in/on Kingston Road.","a street map of London.","Oxford Street","Mile End Road.","the shoe shop in the High Street","high street shops.","Turn right into Harpes Road.","We live in Pinsley Road."],"opposite":"","synonyms":""},{"def":"the way to achieving something","examples":["on the road to something to be on the road to recovery","This first exhibition has set him on the road to success.","We have discussed privatization, but we would prefer not to go down that particular road.","Bringing up a handicapped child can be a long and hard road.","He walks a road filled with shadow and doubt.","It does appear we are on the right road to success.","It isn't going to be an easy road for him.","Kaufman has opted to travel the middle road.","We would prefer not to go down that particular road.","The government's policy on education is a dead-end road.","They have travelled/​traveled the long, lonely road of exclusion.","We have chosen the road of peace.","to be on the road to recovery/​success","I wished him luck in whatever road he decided to follow.","She set out on the road to stardom too early in life.","The economy is well on the road to recovery.","There are several different roads to achieving career success.","They seem to be on the road to ruin."],"opposite":"","synonyms":""},{"def":"at some time in the future","examples":["There are certain to be more job losses further down the road.","Will this movie still be funny a few years down the road?"],"opposite":"","synonyms":""},{"def":"anyway","examples":[],"opposite":"","synonyms":""},{"def":"(to reach) the point at which something can no longer continue in the same way","examples":["A defeat in the second round marked the end of the line for last year's champion.","The loss of this contract could signal the end of the line for the shipyard.","This latest disagreement could mean the end of the road for the band."],"opposite":"","synonyms":""},{"def":"to start an activity or a journey","examples":["Let's get this show on the road!"],"opposite":"","synonyms":""},{"def":"to start a journey","examples":["The following spring I hit the road."],"opposite":"","synonyms":""},{"def":"to delay dealing with a problem","examples":["This is another attempt to kick the can down the road and leave it to the next generation."],"opposite":"","synonyms":""},{"def":"not in good enough condition to be legally driven on public roads","examples":["My car's off the road at the moment."],"opposite":"","synonyms":""},{"def":"a last alcoholic drink before you leave a party, etc.","examples":[],"opposite":"","synonyms":""},{"def":"travelling, especially for long distances or periods of time","examples":["The band has been on the road for six months.","I’ve been on the road since six this morning.","We'd been on the road since dawn and needed a rest."],"opposite":"","synonyms":""},{"def":"in good condition so that it can be legally driven","examples":["It will cost about £500 to get the car back on the road.","My car is back on the road."],"opposite":"","synonyms":""},{"def":"moving from place to place, and having no permanent home","examples":["Life on the road can be very hard."],"opposite":"","synonyms":""},{"def":"it is not enough to intend to do good things; you must actually do them","examples":[],"opposite":"","synonyms":""},{"def":"the point at which something is tested and you really find out whether it is successful or true","examples":["Here's where the rubber meets the road: will consumers actually buy the product?"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"(further) along/down the road | years down the road","def":"at some time in the future","examples":["There are certain to be more job losses further down the road.","Will this movie still be funny a few years down the road?"]},{"idiom":"any road","def":"anyway","examples":[]},{"idiom":"(reach) the end of the line/road","def":"(to reach) the point at which something can no longer continue in the same way","examples":["A defeat in the second round marked the end of the line for last year's champion.","The loss of this contract could signal the end of the line for the shipyard.","This latest disagreement could mean the end of the road for the band."]},{"idiom":"get the show on the road","def":"to start an activity or a journey","examples":["Let's get this show on the road!"]},{"idiom":"hit the road/trail","def":"to start a journey","examples":["The following spring I hit the road."]},{"idiom":"kick the can (down the road)","def":"to delay dealing with a problem","examples":["This is another attempt to kick the can down the road and leave it to the next generation."]},{"idiom":"off the road","def":"not in good enough condition to be legally driven on public roads","examples":["My car's off the road at the moment."]},{"idiom":"one for the road","def":"a last alcoholic drink before you leave a party, etc.","examples":[]},{"idiom":"on the road","def":"travelling, especially for long distances or periods of time","examples":["The band has been on the road for six months.","I’ve been on the road since six this morning.","We'd been on the road since dawn and needed a rest.","It will cost about £500 to get the car back on the road.","My car is back on the road.","Life on the road can be very hard."]},{"idiom":"the road to hell is paved with good intentions","def":"it is not enough to intend to do good things; you must actually do them","examples":[]},{"idiom":"where the rubber meets the road","def":"the point at which something is tested and you really find out whether it is successful or true","examples":["Here's where the rubber meets the road: will consumers actually buy the product?"]}],"phrasal":[],"related":["A-road","B-road","off-road","road hog","road map","road tax","dirt road","high road","link road","ring road","road bike","road rage","road sign","road test","road-test","road trip","side road","slip road","toll road","access road"]}]