[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rol/role_/role__us_1.mp3","phonsUS":"/rəʊl/","level":"A2","meanings":[{"def":"an actor’s part in a play, film, etc.","examples":["She has landed the lead role (= the most important one) in a new play.","a leading/starring role","the role of somebody He played the role of Sonny in ‘The Godfather’.","She's playing the role of Elizabeth Bennet.","The soup is served with a freshly baked roll.","Everyone must roll the dice, and the player with the highest number starts.","Ethan Hawke does a solid job in a thankless role.","He has the starring role in the movie.","He was very good in the role.","In the series, Smith assumes the role of the go-between.","It took her three years to land her first film role.","Lee began to get big roles in movies.","Most of the original cast are reprising their roles.","She interprets the role as more tragic than I expected.","She sings the title role in Tosca.","The supporting roles are filled by British actors.","This is the plum role in the play.","Walken carefully underplays the role.","a starring female role","one of his stereotypical action hero roles","the chance to sink her teeth into the meaty role of femme fatale Margaret","Playing the role of Hamlet is an immense challenge for the actor.","It is one of the greatest roles she has played."],"opposite":"","synonyms":""},{"def":"the function or position that somebody has or is expected to have in an organization, in society or in a relationship","examples":["the changing role of women","role in something the artist's role in society","role as somebody He is stepping down from his role as chair.","I welcome the opportunity to assume a leadership role within the organization.","In many marriages there has been a complete role reversal (= change of roles) with the man staying at home and the woman going out to work.","It is important that everyone has clearly defined roles and responsibilities.","Every member of staff must have a clear role.","He assumed a conspicuous role at the new arts agency.","He filled several governmental roles.","He has been cast in the role of chief apologist for the government.","He is looking for ways to strengthen his role in the business.","He is trying to carve out a new role for himself.","He may have to settle for a backup role.","He really wants to fulfil his role as godfather properly.","I accepted the executive editor role at the magazine.","I feel I can fit any role this team needs me to.","I've had to take on the role of mother in her absence.","Many staff perform multiple roles.","She embraced her role as ruler of the country.","She has a dual role as principal and French teacher.","She has joined the team in a consultative role.","Supervising elections is a possible role for the UN.","The caregiving role is still overwhelmingly a female one.","The fighting has prevented the UN troops from fulfilling their role as peacekeepers.","The new prime minister promised a greater role for women in government.","Their brother plays a protective role.","They have to be willing to accept their roles as caregivers and not managers.","Traditional gender roles are reversed in their household.","We are waiting to see if he can handle an expanded role.","We need to find a useful role for the volunteers in the campaign.","We will meet with them to determine individual roles.","the views prevalent in society about female roles","She refused to take on the traditional woman's role.","the role of the teacher in the classroom"],"opposite":"","synonyms":""},{"def":"the degree to which somebody/something is involved in a situation or an activity and the effect that they have on it","examples":["A cup of tea often serves an important social role.","a key/leading/central/crucial/vital role","role in doing something The media play a major role in influencing people's opinions.","Small businesses have a significant role to play in keeping the economy buoyant.","role in something UK scientists have taken a lead role in the project.","role of somebody/something in something the role of diet in the prevention of disease","role as something The company has cemented its role as a leader in the industry.","role of somebody/something as something Thomas downplays the role of these letters as historical evidence.","Economic factors played a decisive role in the outcome of the war.","He addressed the role of tradition in design.","Migrant workers played a central role in the state's prosperity.","Politicians acknowledge the key roles that young people play in the country.","Pressure groups played a major role in bringing about the reforms.","The authors emphasized the role of the slave trade in the economic development of the New World.","They decided to expand the role that new technologies play at the hospital.","We need to better understand the role of cold regions in the global climate system.","an area where national rivalries play a powerful role","the economic role of small towns"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["role-play","role model","theta role","thematic role","role-playing game","role models","rôle model","rôle models","role-plays","role-played","role-playing","role-playing games","rôle-playing game","rôle-playing games"]}]