[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rom/roman/romantic__us_1.mp3","phonsUS":"/rəʊˈmæntɪk/","level":"B1","meanings":[{"def":"connected with or about love or a sexual relationship","examples":["a romantic candlelit dinner","a romantic comedy","romantic stories/fiction","I'm not interested in a romantic relationship.","It wasn't even until a hundred or so years ago that the concept of romantic love in marriage gained any real popularity.","Like every actor starting out in the business, he longed to play dashing romantic leads."],"opposite":"","synonyms":""},{"def":"showing feelings of love","examples":["Why don't you ever give me flowers? I wish you'd be more romantic.","You're getting quite romantic in your old age!","I'm hopelessly romantic and dreamy."],"opposite":"","synonyms":""},{"def":"beautiful in a way that makes you think of love or feel strong emotions","examples":["romantic music","romantic mountain scenery","romantic images of deserted beaches","It sounded romantic and exciting to work in the Walled City, but few stuck it more than a few weeks."],"opposite":"","synonyms":""},{"def":"having an attitude to life where imagination and the emotions are especially important; not looking at situations in a realistic way","examples":["a romantic view of life","When I was younger, I had romantic ideas of becoming a writer.","a romantic notion of living off the land"],"opposite":"","synonyms":""},{"def":"used to describe literature, music or art, especially of the nineteenth century, that is about strong feelings, imagination and a return to nature, rather than reason, order and intellectual ideas","examples":["the Romantic movement","Keats is one of the greatest Romantic poets."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"","meanings":[{"def":"a person who is emotional and has a lot of imagination, and who has ideas and hopes that may not be realistic","examples":["a hopeless romantic","He was a romantic at heart and longed for adventure."],"opposite":"","synonyms":""},{"def":"a writer, a musician or an artist who writes, etc. in the style of Romanticism","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]