[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/roo/root_/root__us_1_rr.mp3","phonsUS":"/ruːt/","level":"B2","meanings":[{"def":"the part of a plant that grows under the ground and takes in water and minerals that it sends to the rest of the plant","examples":["deep spreading roots","Tree roots can cause damage to buildings.","by the roots I pulled the plant up by the roots (= including the roots).","root vegetables/crops (= plants whose roots you can eat, such as carrots)","Good soil promotes strong root growth.","Root tips die quickly when exposed to light and air."],"opposite":"","synonyms":""},{"def":"the part of a hair, tooth, nail or tongue that attaches it to the rest of the body","examples":["hair that is blonde at the ends and dark at the roots"],"opposite":"","synonyms":""},{"def":"the main cause of something, such as a problem or difficult situation","examples":["root of something Money, or love of money, is said to be the root of all evil.","We have to get to the root of the problem.","at the root of something What lies at the root of his troubles is a sense of insecurity.","What would you say was the root cause of the problem?","His fears of loneliness lay at the very root of his inability to leave.","I expect money is at the root of the matter.","I've spent months trying to get to the root of the problem.","They consider globalization to be the root of all evil."],"opposite":"","synonyms":""},{"def":"the origin or basis of something","examples":["Flamenco may have its roots in Arabic music.","The festival has ancient and deep roots in English culture.","Her last three albums have seen her return to her bluegrass roots","We wanted to remain true to our creative roots.","The two languages share a common root.","Jazz's roots are firmly planted in African tradition.","The custom has its roots in Wales.","This shameful treatment struck at the very roots of their human dignity.","The unrest has roots in religious differences.","They can trace their roots back to the 16th century."],"opposite":"","synonyms":""},{"def":"the feelings or connections that you have with a place because you have lived there or your family came from there","examples":["I'm proud of my Italian roots.","After 20 years in America, I still feel my roots are in England.","We have made lifelong friendships and put down roots.","My husband wants to go back to his Irish roots.","severed from our cultural roots by industrialization"],"opposite":"","synonyms":""},{"def":"the part of a word that has the main meaning and that its other forms are based on; a word that other words are formed from","examples":["‘Comfort’ is the root of ‘comfortable’, ‘comfortably’, ‘discomfort’ and ‘uncomfortable’."],"opposite":"","synonyms":""},{"def":"a quantity which, when multiplied by itself a particular number of times, produces another quantity","examples":[],"opposite":"","synonyms":""},{"def":"to develop roots","examples":[],"opposite":"","synonyms":""},{"def":"to settle and live in one place","examples":["After ten years travelling the world, she felt it was time to put down roots somewhere.","We haven't been here long enough to put down roots."],"opposite":"","synonyms":""},{"def":"completely and in a way that affects every part of something","examples":["The government set out to destroy the organization root and branch.","root-and-branch reforms"],"opposite":"","synonyms":""},{"def":"to develop roots","examples":["I hope those cuttings will take root."],"opposite":"","synonyms":""},{"def":"to become accepted widely","examples":["Fortunately, militarism failed to take root in Europe as a whole."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"put down roots","def":"to develop roots","examples":["After ten years travelling the world, she felt it was time to put down roots somewhere.","We haven't been here long enough to put down roots."]},{"idiom":"root and branch","def":"completely and in a way that affects every part of something","examples":["The government set out to destroy the organization root and branch.","root-and-branch reforms"]},{"idiom":"take root","def":"to develop roots","examples":["I hope those cuttings will take root.","Fortunately, militarism failed to take root in Europe as a whole."]}],"phrasal":[],"related":["root for","root out","root up","cube root","root beer","root-bound","root canal","square root","root directory","root beers","root canals","root directories","root for somebody","root something","root something/somebody","root and branch"]},{"pos":"verb","level":"","meanings":[{"def":"to grow roots; to cause or encourage a plant to grow roots","examples":[],"opposite":"","synonyms":""},{"def":"to search for something by moving things or turning things over","examples":["root (about/around) for something pigs rooting for food","Who's been rooting around in my desk?","root (through something) (for something) ‘It must be here somewhere,’ she said, rooting through the suitcase.","Cats had been rooting in the garbage bags again."],"opposite":"","synonyms":""},{"def":"to have sex with somebody","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["root for","root out","root up"],"related":[]}]