[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rou/route/route__us_1_rr.mp3","phonsUS":"/ruːt/","level":"A2","meanings":[{"def":"a way that you follow to get from one place to another","examples":["Which is the best route to take?","Motorists are advised to find an alternative route.","a coastal route","route from A to B the quickest route from Florence to Rome","route to something Mark showed me the quickest route to the hospital on foot.","route + adv./prep. a key route through the city centre","The shortest route home is along the shore.","The alley would take them on a more direct route to the Old City.","an escape route","Thousands of people lined the parade route.","People gathered at points along the route to wave and cheer .","Our route lay straight ahead and downhill.","There are plenty of bed and breakfasts along the route.","We had plenty of time so we took the scenic route.","We retraced our route in an attempt to get back on the right path.","You'll have to plan your route carefully.","a circuitous route through the narrow side streets","the most direct route between Bangkok and Chiang Mai","It's the best route into the city from the south.","There's really only one route from the north to the south of the country."],"opposite":"","synonyms":""},{"def":"a fixed way along which a bus, train, etc. regularly travels or goods are regularly sent","examples":["The house is not on a bus route.","shipping/supply routes","a cycle route (= a path that is only for cyclists)","Eventually, the main rail routes will be unable to carry any more trains.","Only one company operates on this route.","The airline currently flies this route twice a day.","The bus driver did not seem to know the route.","We live on the school bus route.","the air route from Berlin to Beijing","Pirates menaced the shipping routes.","These were the ancient trade routes between Europe and Asia."],"opposite":"","synonyms":""},{"def":"a particular way of achieving something","examples":["to go down/take/follow a particular route","Some people decided to go down the route of violent protest.","This is not a route I would choose to take.","route to something the route to success","route to doing something There are a number of routes to qualifying as a social worker.","After this point, the two leaders pursue different routes.","Each person must follow their own route to happiness.","She does not believe that this is the route to a lasting peace.","Some young people see marriage as a kind of escape route.","The biography charts her route to fame from humble beginnings.","There are several tried and tested routes to developing your skills.","Education was the traditional route out of poverty."],"opposite":"","synonyms":""},{"def":"used before the number of a main road in the US","examples":["Route 66"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["en route","Route 66","Route 128","route man","route one","route march","rural route","trade route","route men","paper route","route marches"]},{"pos":"verb","level":"","meanings":[{"def":"to send somebody/something by a particular route","examples":["Satellites route data all over the globe.","The flight to Sydney is routed via Tokyo."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]