[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rou/routi/routine__us_1.mp3","phonsUS":"/ruːˈtiːn/","level":"A1","meanings":[{"def":"the normal order and way in which you regularly do things","examples":["to settle/get/fall into a routine","We are trying to get the baby into a routine for feeding and sleeping.","In school, I quickly fell into the routine.","Make exercise a part of your daily routine.","A pressing work project had disrupted his normal sleep routine.","There's never a bad time to begin a new exercise routine.","We clean and repair the machines as a matter of routine.","Don't cut back on your regular fitness routine.","Everyone has their own morning routine.","It took me a week to settle into a routine.","She fell into a routine of taking the baby to the park after lunch.","The children were confused by the change of routine.","Their schedules and routines are seldom monotonous.","Work out a routine for updating the list regularly.","Her aim was to establish some kind of order and routine in the place."],"opposite":"","synonyms":""},{"def":"a situation in which life is boring because things are always done in the same way","examples":["She needed a break from routine.","He tries to escape the dull routine of his office life."],"opposite":"","synonyms":""},{"def":"a series of movements, jokes, etc. that are part of a performance","examples":["to do/perform a dance routine","We need some new material for our routine."],"opposite":"","synonyms":""},{"def":"a list of instructions that enable a computer to perform a particular task","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adjective","level":"B2","meanings":[{"def":"done or happening as a normal part of a particular job, situation or process","examples":["routine enquiries/questions/tests/screening","Don't worry—these are just routine enquiries.","The fault was discovered during a routine check.","This equipment requires routine maintenance.","The policemen were on a routine patrol.","It was claimed that torture of detainees was routine.","Routine use of antibiotics should be discouraged."],"opposite":"","synonyms":""},{"def":"not unusual or different in any way","examples":["He died of a heart attack during a routine operation."],"opposite":"","synonyms":""},{"def":"ordinary and boring","examples":["a routine job","This type of work rapidly becomes routine.","I have little patience with routine tasks such as washing up.","For some patients, a very routine existence is preferable.","Most of the stories are fairly routine sitcom fare."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]