[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rui/ruin_/ruin__us_1.mp3","phonsUS":"/ˈruːɪn/","level":"B2","meanings":[{"def":"to damage something so badly that it loses all its value, pleasure, etc.","examples":["The bad weather ruined our trip.","That one mistake ruined his chances of getting the job.","My new shoes got ruined in the mud.","The crops were ruined by the late frost.","A knee injury threatened to ruin her Olympic hopes.","She's ruined everything.","Years of drinking had ruined his health.","You've ruined my whole life!"],"opposite":"","synonyms":""},{"def":"to make somebody/something lose all their money, their position, etc.","examples":["If she loses the court case it will ruin her.","The country was ruined by the war.","They accused the government of ruining the economy.","The long legal battle ruined him financially."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["mother’s ruin","go to rack and ruin"]},{"pos":"noun","level":"B2","meanings":[{"def":"the state or process of being destroyed or severely damaged","examples":["A large number of churches fell into ruin after the revolution.","The house had been left to go to ruin.","The terrorist attack had left the city in a state of ruin"],"opposite":"","synonyms":""},{"def":"the parts of a building that remain after it has been destroyed or severely damaged","examples":["The old mill is now little more than a ruin.","We visited the ruins of a Norman castle.","Two bodies were found among the charred ruins of the house.","(figurative) He was determined to build a new life out of the ruins of his career.","the ancient ruins of Jericho","It is perhaps the best preserved monastic ruin in the country."],"opposite":"","synonyms":""},{"def":"the fact of having no money, of having lost your job, position, etc.","examples":["The divorce ultimately led to his ruin.","The bank stepped in to save the company from financial ruin.","The war brought the country to the brink of ruin.","He's on the road to political ruin.","The company faces ruin over the new road plans."],"opposite":"","synonyms":""},{"def":"something that causes a person, company, etc. to lose all their money, job, position, etc.","examples":["Gambling was his ruin.","Drinking has been the ruin of her.","He said that the plan would be the ruin of European agriculture."],"opposite":"","synonyms":""},{"def":"to get into a bad condition","examples":["They let the house go to rack and ruin."],"opposite":"","synonyms":""},{"def":"destroyed or severely damaged","examples":["Years of fighting have left the area in ruins.","The church now lies in ruins.","The scandal left his reputation in ruins.","Their plans for a comeback now lie in ruins."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"go to rack and ruin","def":"to get into a bad condition","examples":["They let the house go to rack and ruin."]},{"idiom":"in ruins","def":"destroyed or severely damaged","examples":["Years of fighting have left the area in ruins.","The church now lies in ruins.","The scandal left his reputation in ruins.","Their plans for a comeback now lie in ruins."]}],"phrasal":[],"related":[]}]