[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rul/rule_/rule__us_1.mp3","phonsUS":"/ruːl/","level":"A1","meanings":[{"def":"a statement of what may, must or must not be done in a particular situation or when playing a game","examples":["She laid down strict rules for her tenants, including prompt payment of rent.","the rules of golf/tennis/football","to follow/obey a rule","to break/violate a rule","to enforce/apply a rule","You can't just change the rules to suit yourself.","against the rules It's against all the rules and regulations.","under… rules These products are banned under international rules.","This explains the rules under which the library operates.","the unwritten rules of adult society (= that everyone understands)","the rules of procedure/conduct (= saying how something must be done)","New rules governing pensions come into effect next year.","Normal competition rules apply.","according to the rules (of something) According to the rules of the game, you have to miss a turn.","He was punished for breaking school rules.","Tackling a player without the ball is against the rules.","I believed I was acting within the rules.","Employees are bound by rules of confidentiality.","He made his children's lives a misery with all his petty rules.","New accounting rules come into force next year.","Several proposed rule changes have been announced.","The packaging does not conform to EU rules.","The aim is to get each member country to adhere to a single set of rules.","The competition rules provide that a cash alternative may be given.","The music was turned off at midnight, in accordance with the rules.","The officials went strictly by the rule book.","The punishment depends on how the umpire interprets the rules.","The referee applied the rules to the letter.","The rules on claiming have been tightened up.","The rules were drawn up to make it fair for everyone.","The sport has strict rules for player safety.","Their action was in breach of Stock Exchange rules.","Under this rule, only full members of the club are entitled to vote.","You should know the rules by now."],"opposite":"","synonyms":""},{"def":"a statement of what is possible according to a particular system, for example the grammar of a language","examples":["the basic rules of grammar","rule for doing something What is the rule for forming plurals?","There are several exceptions to the rule ‘“i” before “e” except after “c”’.","He's a writer who doesn't seem to know the most basic rules of English grammar."],"opposite":"","synonyms":""},{"def":"a statement of what you are advised to do in a particular situation","examples":["The first rule is to make eye contact with your interviewer.","Follow these few simple rules and you won't go far wrong.","rule for doing something There are no hard and fast rules for planning healthy meals."],"opposite":"","synonyms":""},{"def":"a habit; the normal state of things; what is true in most cases","examples":["He makes it a rule never to borrow money.","Cold winters here are the exception rather than the rule (= are rare).","Among her friends, casual dress and a relaxed manner are the rule.","It's one of my rules not to get into debt.","It was an unspoken rule in my family that my mother was always right.","I've made it a rule not to talk to the press.","He occasionally allowed himself to break his own rule.","There are few exceptions to the general rule that bars close at midnight.","The internet has changed the rules of business.","The rules of dating have had to be rewritten, thanks to the movies."],"opposite":"","synonyms":""},{"def":"the government of a country or control of a group of people by a particular person, group or system","examples":["military/civilian/democratic rule","The 1972 Act imposed direct rule from Westminster.","under… rule The country was still under colonial rule.","majority rule (= government by the political party that most people have voted for)","There was a gradual process of returning the country to civilian rule.","The president imposed emergency rule following the riots.","The country remained under direct rule by the occupying powers.","the lawless days of mob rule"],"opposite":"","synonyms":""},{"def":"a measuring instrument with a straight edge","examples":[],"opposite":"","synonyms":""},{"def":"usually but not always","examples":["I go to bed early as a rule.","As a general rule, vegetable oils are better for you than animal fats."],"opposite":"","synonyms":""},{"def":"to change the rules to suit a particular person or situation","examples":["Couldn't they just bend the rules and let us in without a ticket?"],"opposite":"","synonyms":""},{"def":"people say that something is the exception that proves the rule when they are stating something that seems to be different from the normal situation, but they mean that the normal situation remains true in general","examples":["Most electronics companies have not done well this year, but ours is the exception that proves the rule."],"opposite":"","synonyms":""},{"def":"if somebody plays by their own rules or makes other people play by their rules, they set the conditions for doing business or having a relationship","examples":["If he wanted a loan he would have to play by the bank's rules."],"opposite":"","synonyms":""},{"def":"to deal fairly and honestly with people","examples":[],"opposite":"","synonyms":""},{"def":"the condition in which all members of society, including its political leaders, accept the authority of the law","examples":["Democracy and the rule of law are yet to be firmly established in the country."],"opposite":"","synonyms":""},{"def":"a practical method of doing or measuring something, usually based on past experience rather than on exact measurement","examples":["As a rule of thumb, you should cook a chicken for 20 minutes for each pound of weight."],"opposite":"","synonyms":""},{"def":"the standards of behaviour that most people accept or that actually operate in a particular area of life or business","examples":[],"opposite":"","synonyms":""},{"def":"to follow the rules of your job in a very strict way in order to cause delay, as a form of protest against your employer or your working conditions","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"as a (general) rule","def":"usually but not always","examples":["I go to bed early as a rule.","As a general rule, vegetable oils are better for you than animal fats."]},{"idiom":"bend/stretch the rules","def":"to change the rules to suit a particular person or situation","examples":["Couldn't they just bend the rules and let us in without a ticket?"]},{"idiom":"the exception that proves the rule","def":"people say that something is the exception that proves the rule when they are stating something that seems to be different from the normal situation, but they mean that the normal situation remains true in general","examples":["Most electronics companies have not done well this year, but ours is the exception that proves the rule."]},{"idiom":"play by somebody’s (own) rules","def":"if somebody plays by their own rules or makes other people play by their rules, they set the conditions for doing business or having a relationship","examples":["If he wanted a loan he would have to play by the bank's rules."]},{"idiom":"play by the rules","def":"to deal fairly and honestly with people","examples":[]},{"idiom":"the rule of law","def":"the condition in which all members of society, including its political leaders, accept the authority of the law","examples":["Democracy and the rule of law are yet to be firmly established in the country."]},{"idiom":"a rule of thumb","def":"a practical method of doing or measuring something, usually based on past experience rather than on exact measurement","examples":["As a rule of thumb, you should cook a chicken for 20 minutes for each pound of weight."]},{"idiom":"the rules of the game","def":"the standards of behaviour that most people accept or that actually operate in a particular area of life or business","examples":[]},{"idiom":"work to rule","def":"to follow the rules of your job in a very strict way in order to cause delay, as a form of protest against your employer or your working conditions","examples":[]}],"phrasal":[],"related":["gag rule","rule off","rule out","home rule","rule book","self-rule","direct rule","golden rule","ground rule","slide rule","majority rule","rule out of","Rule, Britannia!","work-to-rule","thirty-year rule","rule books","the rule book","rule off | rule something"]},{"pos":"verb","level":"B1","meanings":[{"def":"to control and have authority over a country, a group of people, etc.","examples":["rule (something) At that time, King John ruled England.","The city was ruled by rich and powerful nobles.","The film is set in an imagined future in which machines rule the world.","(figurative) Eighty million years ago, dinosaurs ruled the earth.","Charles I ruled for eleven years.","(figurative) After the revolution, anarchy ruled.","rule over somebody/something She once ruled over a vast empire.","the president's powers to rule by decree","The country was ruled by a brutal dictatorship.","The family ruled London's gangland in the sixties."],"opposite":"","synonyms":""},{"def":"to be the main thing that influences and controls somebody/something","examples":["The pursuit of money ruled his life.","We live in a society where we are ruled by the clock.","Her whole life seemed to be ruled by fear."],"opposite":"","synonyms":""},{"def":"to give an official decision about something","examples":["rule on something The court will rule on the legality of the action.","rule against/in favour of somebody/something The judge ruled against/in favour of the plaintiff.","rule somebody/something + adj. The deal may be ruled illegal.","rule somebody/something to be/have something The deal was ruled to be illegal.","rule that… The court ruled that the women were unfairly dismissed.","it is ruled that… It was ruled that the women had been unfairly dismissed."],"opposite":"","synonyms":""},{"def":"to draw a straight line using something that has a hard straight edge","examples":["Rule a line at the end of every piece of work."],"opposite":"","synonyms":""},{"def":"to keep control over people by making them disagree with and fight each other, therefore not giving them the chance to join together and oppose you","examples":["a policy of divide and rule"],"opposite":"","synonyms":""},{"def":"to act according to what you feel rather than to what you think is sensible","examples":[],"opposite":"","synonyms":""},{"def":"to say that something is completely wrong or not worth considering, especially in a trial","examples":["The charges were thrown out of court.","Well that's my theory ruled out of court."],"opposite":"","synonyms":""},{"def":"to be the most powerful member of a group","examples":["Liverpool ruled the roost in English football for a decade."],"opposite":"","synonyms":""},{"def":"to control a person or a group of people very severely","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"divide and rule","def":"to keep control over people by making them disagree with and fight each other, therefore not giving them the chance to join together and oppose you","examples":["a policy of divide and rule"]},{"idiom":"let your heart rule your head","def":"to act according to what you feel rather than to what you think is sensible","examples":[]},{"idiom":"rule/throw something out of court","def":"to say that something is completely wrong or not worth considering, especially in a trial","examples":["The charges were thrown out of court.","Well that's my theory ruled out of court."]},{"idiom":"rule the roost","def":"to be the most powerful member of a group","examples":["Liverpool ruled the roost in English football for a decade."]},{"idiom":"rule (somebody/something) with a rod of iron","def":"to control a person or a group of people very severely","examples":[]}],"phrasal":["rule off","rule out","rule out of"],"related":[]}]