[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/run/run__/run__us_1.mp3","phonsUS":"/rʌn/","level":"A1","meanings":[{"def":"to move using your legs, going faster than when you walk","examples":["Can you run as fast as Mike?","They turned and ran when they saw us coming.","She came running to meet us.","I had to run to catch the bus.","+ adv./prep. The dogs ran off as soon as we appeared.","He ran home in tears to his mother.","The children spent the morning running around in the park.","She can run really fast.","John can run very fast.","He ran out of the house.","She ran quickly downstairs.","She turned and ran blindly down the street.","Alan was running for a bus when he slipped on some ice.","Billy turned the corner and ran headlong into Mrs Bradley.","They've seen us! Run for your life!","The boy went running off to get the ball."],"opposite":"","synonyms":""},{"def":"to travel a particular distance by running","examples":["Who was the first person to run a mile in under four minutes?","I ran four miles today."],"opposite":"","synonyms":""},{"def":"to run as a sport","examples":["She used to run when she was at college.","I often go running before work.","Try to run round the block a few times every morning."],"opposite":"","synonyms":""},{"def":"to take part in a race","examples":["run in something He will be running in the 100 metres tonight.","There are only five horses running in the first race.","run something to run a marathon","Farah ran a fine race to take the gold medal."],"opposite":"","synonyms":""},{"def":"to make a race take place","examples":["The Derby will be run in spite of the bad weather."],"opposite":"","synonyms":""},{"def":"to hurry from one place to another","examples":["I've spent the whole day running around after the kids."],"opposite":"","synonyms":""},{"def":"to be in charge of a business, campaign, etc.","examples":["to run a hotel/store/language school","He has no idea how to run a business.","Stop trying to run my life (= organize it) for me.","The shareholders want more say in how the company is run.","a badly run company","Both candidates have run a good campaign.","state-run industries","The school is jointly run with the local parish.","He tried to run the restaurant himself, but soon got into financial difficulties.","It is a small, privately run hotel.","The office had never been so well run.","Who is running the event?"],"opposite":"","synonyms":""},{"def":"to make a service, course of study, etc. available to people","examples":["The college runs summer courses for foreign students.","The programme will be jointly run with NASA in the US.","The college runs several English classes for adults.","They ran a series of lectures on the subject.","Volunteer counsellors run a 24-hour helpline."],"opposite":"","synonyms":""},{"def":"to travel on a particular route","examples":["Buses to Oxford run every half hour.","+ adv./prep. All the trains are running late (= are leaving later than planned).","Trains between London and Brighton run throughout the day.","Local buses run regularly to and from the school.","He claimed that 95 per cent of trains run on time.","When does the London Underground stop running at night?"],"opposite":"","synonyms":""},{"def":"to make buses, trains, etc. travel on a particular route","examples":["run something + adv./prep. They run extra trains during the rush hour.","The transport company is concerned about the cost of running more buses."],"opposite":"","synonyms":""},{"def":"to operate or function; to make something do this","examples":["Stan had the chainsaw running.","run on something Our van runs on (= uses) diesel.","run something Could you run the engine for a moment?","The engine was running very smoothly.","Our car only runs on unleaded petrol."],"opposite":"","synonyms":""},{"def":"when a computer program or system runs or somebody runs it, it operates","examples":["You may find that some apps are running slowly.","There are too many programs running on your computer.","You need to have antivirus software running on your PC.","The app runs on all Android devices.","run something You can run the program overnight.","My PC runs Windows 10.","Don't forget to run a final spellcheck.","What applications were you running when the problem occurred?"],"opposite":"","synonyms":""},{"def":"if a recording on a tape runs or somebody runs it, it plays","examples":["He didn't know the tape was still running.","run something Run the tape, please.","run something + adv./prep. Can you run the tape back a few minutes?"],"opposite":"","synonyms":""},{"def":"to own and use a vehicle or machine","examples":["I can't afford to run a car on my salary."],"opposite":"","synonyms":""},{"def":"to drive somebody to a place in a car","examples":["Shall I run you home?","Would you mind running me to the shops?"],"opposite":"","synonyms":""},{"def":"to move, especially quickly, in a particular direction","examples":["The car ran off the road into a ditch.","A shiver ran down my spine.","The sledge ran smoothly over the frozen snow.","The old tramlines are still there but now no trams run on them."],"opposite":"","synonyms":""},{"def":"to move something in a particular direction","examples":["She ran her fingers nervously through her hair.","I ran my eyes over the page."],"opposite":"","synonyms":""},{"def":"to lead or stretch from one place to another; to make something do this","examples":["+ adv./prep. He had a scar running down his left cheek.","The road runs parallel to the river.","The railway line runs right past the house.","run something The bookcase runs the length of the room.","run something + adv./prep. We ran a cable from the lights to the stage."],"opposite":"","synonyms":""},{"def":"to flow","examples":["The tears ran down her cheeks.","Water was running all over the bathroom floor."],"opposite":"","synonyms":""},{"def":"to make liquid flow","examples":["run something (into something) She ran hot water into the bucket.","to run the hot tap (= to turn it so that water flows from it)","run something for somebody I'll run a bath for you.","run somebody something I'll run you a bath."],"opposite":"","synonyms":""},{"def":"to send out a liquid","examples":["Who left the tap running?","Your nose is running (= mucus is flowing from it).","The smoke makes my eyes run."],"opposite":"","synonyms":""},{"def":"to be covered with a liquid","examples":["His face was running with sweat.","The bathroom floor was running with water."],"opposite":"","synonyms":""},{"def":"if the colour runs in a piece of clothing, etc. when it gets wet, the colour comes out of the material and spreads into other pieces of clothing, etc. in the same water","examples":["The colour ran and made all my underwear pink."],"opposite":"","synonyms":""},{"def":"to melt","examples":["The wax began to run."],"opposite":"","synonyms":""},{"def":"to become different in a particular way, especially a bad way","examples":["The river ran dry (= stopped flowing) during the drought.","Supplies are running low.","We understand that feelings are running high on this issue","We've run short of milk.","You've got your rivals running scared."],"opposite":"","synonyms":""},{"def":"to be at or near a particular level","examples":["Inflation was running at 26 per cent."],"opposite":"","synonyms":""},{"def":"to continue for a particular period of time without stopping","examples":["run for something Her last musical ran for six months on Broadway.","run from A to B The course runs from June 25th to August 27th.","This debate will run and run!"],"opposite":"","synonyms":""},{"def":"to operate or be legally acceptable for a particular period of time","examples":["The permit runs for three months.","The lease on my house only has a year left to run."],"opposite":"","synonyms":""},{"def":"to happen or progress at the time or in the way mentioned","examples":["+ adv./prep. Programmes are running a few minutes behind schedule this evening.","Everything is running according to plan.","Her life had always run smoothly before.","The murderer was given three life sentences, to run concurrently."],"opposite":"","synonyms":""},{"def":"to be a candidate in an election for a political position, especially in the US","examples":["Obama ran a second time in 2012.","run for somebody/something Hilary Clinton ran for president in 2016.","He ran unsuccessfully for the Senate in New York.","run in something She is planning to run in the parliamentary election."],"opposite":"","synonyms":""},{"def":"to bring or take something into a country illegally and secretly","examples":["run something + adv./prep. He used to run guns across the border.","She made money by running drugs."],"opposite":"","synonyms":""},{"def":"to have particular words, contents, etc.","examples":["Their argument ran something like this…","+ speech ‘Ten shot dead by gunmen,’ ran the newspaper headline."],"opposite":"","synonyms":""},{"def":"to print and publish an item or a story","examples":["On advice from their lawyers they decided not to run the story."],"opposite":"","synonyms":""},{"def":"to do a test, an experiment, etc.","examples":["run something on something The doctors decided to run some more tests on the blood samples.","run something The two experiments are run in parallel.","The company is running clinical trials of the new drug."],"opposite":"","synonyms":""},{"def":"if tights or stockings run, a long thin hole appears in them","examples":[],"opposite":"","synonyms":""},{"def":"to be pleased to do what somebody wants","examples":["She knew she had only to call and he would come running."],"opposite":"","synonyms":""},{"def":"to run in order to escape from somebody/something","examples":[],"opposite":"","synonyms":""},{"def":"to treat somebody badly and not worry about their feelings","examples":[],"opposite":"","synonyms":""},{"def":"working fully and correctly","examples":["It will be a lot easier when we have the database up and running.","We soon had the sound system up and running."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"come running","def":"to be pleased to do what somebody wants","examples":["She knew she had only to call and he would come running."]},{"idiom":"run for it","def":"to run in order to escape from somebody/something","examples":[]},{"idiom":"run roughshod over somebody","def":"to treat somebody badly and not worry about their feelings","examples":[]},{"idiom":"up and running","def":"working fully and correctly","examples":["It will be a lot easier when we have the database up and running.","We soon had the sound system up and running."]}],"phrasal":["run across","run after","run along","run around with","run at","run away","run away from","run away with","run away with you","run back over","run by","run down","run in","run into","run off","run off with","run on","run out","run out on","run over","run past","run through","run to","run up","run up against","run with"],"related":["run at","run by","run in","run-in","run on","run to","run up","run-up","dry run","end run","fun run","home run","milk run","rat run","run away","run down","run-down","run into"]},{"pos":"noun","level":"A2","meanings":[{"def":"an act of running; a period of time spent running or the distance that somebody runs","examples":["I go for a run every morning.","a five-mile run","The event comprised a 1500m swim, 40km bike ride and 10km run.","Catching sight of her he broke into a run (= started running).","I decided to make a run for it (= to escape by running).","at a run She took the stairs at a run.","The Ethiopian is aiming to produce his second record-breaking run of the week.","The race consists of an eight-mile cross-country run followed by an army assault course."],"opposite":"","synonyms":""},{"def":"a trip by car, plane, boat, etc., especially a short one or one that is made regularly","examples":["They took the car out for a run.","We went for a run in his new car.","(British English) This ferry operates on the Dover-Calais run."],"opposite":"","synonyms":""},{"def":"a period of something good or bad happening; a series of successes or failures","examples":["a run of good/bad luck","Liverpool lost to Leeds, ending an unbeaten run of 18 games.","Manchester United have finally ended their run of victories."],"opposite":"","synonyms":""},{"def":"a series of performances of a play or film","examples":["The show had a record-breaking run in the London theatre.","They play began its run last June.","The show has had its run extended till March.","The play had a long run in the West End."],"opposite":"","synonyms":""},{"def":"the amount of a product that a company decides to make at one time","examples":["The first print run of 6 000 copies sold out."],"opposite":"","synonyms":""},{"def":"a situation when many people sell dollars, etc. and the value of the money falls","examples":[],"opposite":"","synonyms":""},{"def":"a situation when many people suddenly want to take their money out of a bank","examples":[],"opposite":"","synonyms":""},{"def":"a situation when many people suddenly want to buy something","examples":["There's been a run on barbecues with the hot weather."],"opposite":"","synonyms":""},{"def":"the way things usually happen; the way things seem to be happening on a particular occasion","examples":["In the normal run of things the only exercise he gets is climbing in and out of taxis.","(British English) Wise scored in the 15th minute against the run of play (= although the other team had seemed more likely to score)."],"opposite":"","synonyms":""},{"def":"a sloping track used in skiing and some other sports","examples":["a ski/toboggan run"],"opposite":"","synonyms":""},{"def":"a point scored in the game of cricket or baseball","examples":["Our team won by four runs.","He's only made four home runs all season.","Our team is on 90 runs.","They've got another run!"],"opposite":"","synonyms":""},{"def":"an act of trying to get elected to public office","examples":["He made an unsuccessful run for governor in 2008.","Senator Blake's run for the presidency"],"opposite":"","synonyms":""},{"def":"an area with a fence, walls, etc. in which animals or birds are kept as pets or on a farm","examples":["a chicken run"],"opposite":"","synonyms":""},{"def":"a series of notes sung or played quickly up or down the scale","examples":[],"opposite":"","synonyms":""},{"def":"a series of cards held by one player","examples":[],"opposite":"","synonyms":""},{"def":"a long thin hole in tights or stockings where some threads have broken","examples":[],"opposite":"","synonyms":""},{"def":"diarrhoea (= an illness in which waste matter is emptied from the bowels much more frequently than normal, and in liquid form)","examples":[],"opposite":"","synonyms":""},{"def":"the average type of something","examples":["He was very different from the general run of movie stars."],"opposite":"","synonyms":""},{"def":"to make somebody try very hard, using all their skill and effort, in order to beat you in a game or competition","examples":[],"opposite":"","synonyms":""},{"def":"to give somebody/get/have permission to make full use of something","examples":["Her dogs have the run of the house."],"opposite":"","synonyms":""},{"def":"relating to a longer period in the future","examples":["This measure inevitably means higher taxes in the long run."],"opposite":"","synonyms":""},{"def":"relating to the immediate future","examples":["In the short run, unemployment may fall."],"opposite":"","synonyms":""},{"def":"trying to avoid being captured","examples":["He's on the run from the police.","The prisoners have now been on the run for three days."],"opposite":"","synonyms":""},{"def":"continuously active and moving around","examples":["I've been on the run all day and I'm exhausted.","Here are some quick recipes for when you're eating on the run (= in a hurry).","I usually eat breakfast on the run."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the common, general, ordinary, usual run (of something)","def":"the average type of something","examples":["He was very different from the general run of movie stars."]},{"idiom":"give somebody a (good) run for their money","def":"to make somebody try very hard, using all their skill and effort, in order to beat you in a game or competition","examples":[]},{"idiom":"give somebody/get/have the run of something","def":"to give somebody/get/have permission to make full use of something","examples":["Her dogs have the run of the house."]},{"idiom":"in the long run","def":"relating to a longer period in the future","examples":["This measure inevitably means higher taxes in the long run."]},{"idiom":"in the short run","def":"relating to the immediate future","examples":["In the short run, unemployment may fall."]},{"idiom":"on the run","def":"trying to avoid being captured","examples":["He's on the run from the police.","The prisoners have now been on the run for three days.","I've been on the run all day and I'm exhausted.","Here are some quick recipes for when you're eating on the run (= in a hurry).","I usually eat breakfast on the run."]}],"phrasal":[],"related":[]}]