[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/r/rus/rush_/rush__us_1.mp3","phonsUS":"/rʌʃ/","level":"B2","meanings":[{"def":"to move or to do something with great speed, often too fast","examples":["We've got plenty of time; there's no need to rush.","the sound of rushing water","+ adv./prep. Don't rush off, I haven't finished.","I've been rushing around all day trying to get everything done.","The children rushed out of school.","Firefighters rushed to the scene and extinguished the blaze.","When I fell forwards onto the ice, Michael came rushing to my aid, helping me up giving me an encouraging smile.","His wife immediately rushed to his defence (= defended him against attack or criticism).","Beachgoers rushed to the rescue of three boys as they were pulled out to sea in a rip tide.","My college years seemed to rush past.","She rushed back upstairs.","rush to do something People rushed to buy shares in the company.","rush something We had to rush our meal.","She was rushing around madly looking for her bag.","Two men came rushing into the room.","Whenever her little brother was upset, Jane rushed to the rescue.","a train rushing headlong down the track","A surge of joy rushed through her body."],"opposite":"","synonyms":""},{"def":"to transport or send somebody/something somewhere with great speed","examples":["Ambulances rushed the injured to the hospital.","Relief supplies were rushed in.","He was rushed home immediately."],"opposite":"","synonyms":""},{"def":"to do something or to make somebody do something without thinking about it carefully","examples":["We have to be careful not to rush to judgment.","rush into doing something We don't want to rush into having a baby.","rush into something Let us not rush headlong into this crazy project without careful consideration.","rush somebody Don't rush me. I need time to think about it.","rush somebody into something/into doing something I'm not going to be rushed into anything."],"opposite":"","synonyms":""},{"def":"to flow strongly","examples":["The water rushed in through the hole in the ship's hull."],"opposite":"","synonyms":""},{"def":"to try to attack or capture somebody/something suddenly","examples":["A group of prisoners rushed an officer and managed to break out.","Fans rushed the stage after the concert."],"opposite":"","synonyms":""},{"def":"to run into somebody who has the ball","examples":[],"opposite":"","synonyms":""},{"def":"to move forward and gain ground by carrying the ball and not passing it","examples":[],"opposite":"","synonyms":""},{"def":"to give a lot of attention to somebody, especially to a student because you want them to join your fraternity or sorority","examples":["He is being rushed by Sigma Nu."],"opposite":"","synonyms":""},{"def":"to be extremely busy; to have too many things to do","examples":["Weekdays are slow in the restaurant, but at weekends the staff are rushed off their feet."],"opposite":"","synonyms":""},{"def":"people with little experience try to do the difficult or dangerous things that more experienced people would not consider doing","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be rushed/run off your feet","def":"to be extremely busy; to have too many things to do","examples":["Weekdays are slow in the restaurant, but at weekends the staff are rushed off their feet."]},{"idiom":"fools rush in (where angels fear to tread)","def":"people with little experience try to do the difficult or dangerous things that more experienced people would not consider doing","examples":[]}],"phrasal":["rush out","rush through"],"related":["rush out","gold rush","head rush","rush hour","sugar rush","rush through","bull-rush","rush hours","rush something","(be in) a tearing hurry/rush","give somebody/get the bum’s rush","fools rush in (where angels fear to tread)"]},{"pos":"noun","level":"B2","meanings":[{"def":"a sudden strong movement or action","examples":["rush for something Shoppers made a rush for the exits.","in a rush The words came out in a rush.","in the rush to do something She was trampled in the rush to get out.","They listened to the rush of the sea below.","The door blew open, letting in a rush of cold air.","He had a rush of blood to the head (= suddenly lost control of himself) and punched the man.","rush towards something (figurative) The ancient art is all but lost in the city's headlong rush towards industrialisation.","an adrenaline/a sugar rush"],"opposite":"","synonyms":""},{"def":"a situation in which you are in a hurry and need to do things quickly","examples":["What's the rush?","‘I'll let you have the book back tomorrow.’ ‘There's no rush.’","in a rush I can't stop—I'm in a rush.","The note looked like it had been written in a rush.","in a rush to do something I’m not in any rush to get back to work.","The trip to Paris was all a mad rush.","a rush job (= one that has been done quickly)"],"opposite":"","synonyms":""},{"def":"a situation in which people are very busy and there is a lot of activity","examples":["Book now and avoid the last-minute rush.","The evening rush was just starting.","the Christmas rush","We've had a rush on at the office, dealing with the backlog of orders."],"opposite":"","synonyms":""},{"def":"a sudden strong emotion or sign of strong emotion","examples":["a sudden rush of excitement/fear/anger","She experienced a sudden rush of emotion.","He felt a sudden rush of excitement.","When she heard his voice it was with a rush of relief."],"opposite":"","synonyms":""},{"def":"a sudden feeling of extreme pleasure or excitement","examples":["Parachuting will give you the rush of a lifetime.","Users of the drug report experiencing a rush that lasts several minutes."],"opposite":"","synonyms":""},{"def":"a sudden large demand for goods, etc.","examples":["There's been a rush on umbrellas this week."],"opposite":"","synonyms":""},{"def":"a tall plant like grass that grows near water. Its long thin stems can be dried and used for making baskets, the seats of chairs, etc.","examples":["rush matting"],"opposite":"","synonyms":""},{"def":"the first prints of a film before they have been edited","examples":[],"opposite":"","synonyms":""},{"def":"an occasion when a player or players run towards a player on the other team who has the ball","examples":["There was a rush on the quarterback."],"opposite":"","synonyms":""},{"def":"an occasion when a player runs forward with the ball","examples":["Johnson carried the ball an average of 6 yards per rush."],"opposite":"","synonyms":""},{"def":"the time when parties are held for students who want to join a fraternity or sorority","examples":["rush week","a rush party"],"opposite":"","synonyms":""},{"def":"to force somebody/be forced to leave a place quickly","examples":["He was soon given the bum's rush from the club."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"give somebody/get the bum’s rush","def":"to force somebody/be forced to leave a place quickly","examples":["He was soon given the bum's rush from the club."]}],"phrasal":[],"related":[]}]