[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/saf/safet/safety__us_2.mp3","phonsUS":"/ˈseɪfti/","level":"B1","meanings":[{"def":"the state of being safe and protected from danger or harm","examples":["in safety a place where children can play in safety","He was kept in custody for his own safety.","measures to ensure patient safety","His behaviour endangered the safety of the public.","The police are concerned for the safety of the 12-year-old boy who has been missing for three days.","The house has to be rearranged with a view to child safety.","The people want to be able to walk the streets at night in safety.","The refugees finally reached a place of safety.","Walkways allow visitors to enter the caves in perfect safety."],"opposite":"","synonyms":""},{"def":"the state of not being dangerous","examples":["I'm worried about the safety of the treatment.","a local campaign to improve road safety","People worry about food safety (= food that could be harmful to health).","breaches of fire safety regulations","safety standards/measures/precautions","safety concerns/issues","The airline has an excellent safety record.","a safety hazard (= something that is not safe)","a safety officer (= somebody whose job is to ensure safety)","The stairs are fitted with handrails either side for safety.","The seat is bolted in place for added safety.","She called for tougher safety standards for child car seats.","For safety reasons, children should not operate the machine unsupervised.","New safety legislation will be introduced next year.","The building was evacuated for safety reasons.","The car has many safety features, including anti-skid braking.","The plan was rejected by the government nuclear safety watchdog.","The playground was closed down on safety grounds.","The police are conducting a safety awareness programme in local schools."],"opposite":"","synonyms":""},{"def":"a place where you are safe","examples":["They reached safety seconds before the building was engulfed in flames.","to safety I managed to swim to safety.","from the safety of something We watched the lions from the safety of the car.","She finally made it to the safety of her room.","They thought they would never reach safety.","What made her leave the safety of her apartment?"],"opposite":"","synonyms":""},{"def":"a device that stops a gun from being fired or a machine from working by accident","examples":[],"opposite":"","synonyms":""},{"def":"(in American football) a defending player who plays in a position far away from the other team","examples":[],"opposite":"","synonyms":""},{"def":"safety is the most important thing","examples":["When cycling on the roads, remember: safety first."],"opposite":"","synonyms":""},{"def":"being in a group makes you safer and makes you feel more confident","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"safety first","def":"safety is the most important thing","examples":["When cycling on the roads, remember: safety first."]},{"idiom":"there’s safety in numbers","def":"being in a group makes you safer and makes you feel more confident","examples":[]}],"phrasal":[],"related":["free safety","safety belt","safety lamp","safety net","safety pin","safety catch","safety glass","safety island","safety match","safety razor","safety valve","strong safety","safety curtain","safety measure","safety deposit box","Health and Safety Executive","Health and Safety at Work Act","Occupational Safety and Health Act","Occupational Safety and Health Administration"]}]