[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sal/sale_/sale__us_1.mp3","phonsUS":"/seɪl/","level":"A2","meanings":[{"def":"an act or the process of selling something","examples":["regulations governing the sale of alcoholic beverages","The product has been withdrawn from sale.","I haven't made a sale all week.","She gets 10 per cent commission on each sale.","They charge a fee of 3 to 5 per cent of the sale price .","We gave them our sales pitch (= our explanation of why they should buy something).","Thor managed to sail his raft across the Pacific Ocean.","Far out I could see a yacht with a white sail.","She will receive the profits from the sale of her property.","All proceeds from the sale of the book will go to charity.","If we don't close this sale, we're out of business.","The conditions of sale were posted up around the auction room.","The price is low to ensure a quick sale.","The sale of the house fell through when the buyer pulled out.","the massive sale of foreign currency reserves","to maximize the sale proceeds"],"opposite":"","synonyms":""},{"def":"the number of items sold","examples":["They have to boost sales to make a profit.","Retail sales fell in November by 10 per cent.","ticket/car sales","The company has seen record sales over the past year.","sales are up/down Online sales were up by 12 per cent.","the sales figures for May","Direct sales, by mail order, were up by 15%.","High-street sales have fallen for the fifth consecutive month.","Low interest rates pushed sales to a record in 2016.","Lower consumer confidence could hurt PC sales.","North American sales account for 40% of the worldwide market.","Sales failed to reach 10 000 units.","Sales of ice cream are up because of the hot weather.","The advertising campaign generated massive sales.","The car manufacturer was forced to shed jobs following a dramatic sales slump.","The company reported strong sales for June.","The high volume of sales makes the low pricing policy profitable.","Export sales were up by 32% last year."],"opposite":"","synonyms":""},{"def":"the part of a company that deals with selling its products","examples":["a sales and marketing director","in sales She works in sales.","She works in the sales department.","He's a sales manager for a hotel group.","The Weldon Group has a 6 000 strong sales force."],"opposite":"","synonyms":""},{"def":"an occasion when a shop or business sells its products at a lower price than usual","examples":["The sale starts next week.","the January sales","in the sales I bought a coat in the sales.","sale on something a half-price sale on all bed linen","The airline is selling one third of all its seats at the sale price.","I bought it at the winter sales.","I got these shoes in the Bloomingdales sale."],"opposite":"","synonyms":""},{"def":"an occasion when goods are sold, especially an auction","examples":["a contemporary art sale","a major sale of paintings"],"opposite":"","synonyms":""},{"def":"available to be bought, especially from the owner","examples":["I'm sorry, it's not for sale.","They've put their house up for sale.","an increase in the number of stolen vehicles being offered for sale","a ‘for sale’ sign","The land has come up for sale again."],"opposite":"","synonyms":""},{"def":"available to be bought, especially in a shop","examples":["Tickets are on sale from the booking office.","The new model goes on sale next month.","Drugs were on open sale in the club.","The new stamps are now on sale at main post offices."],"opposite":"","synonyms":""},{"def":"being offered at a reduced price","examples":["All video equipment is on sale today and tomorrow."],"opposite":"","synonyms":""},{"def":"supplied with the agreement that any item that is not sold can be sent back without having to be paid for","examples":["The novels are delivered to outlets on a sale or return basis."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"(up) for sale","def":"available to be bought, especially from the owner","examples":["I'm sorry, it's not for sale.","They've put their house up for sale.","an increase in the number of stolen vehicles being offered for sale","a ‘for sale’ sign","The land has come up for sale again."]},{"idiom":"on sale","def":"available to be bought, especially in a shop","examples":["Tickets are on sale from the booking office.","The new model goes on sale next month.","Drugs were on open sale in the club.","The new stamps are now on sale at main post offices.","All video equipment is on sale today and tomorrow."]},{"idiom":"(on) sale or return","def":"supplied with the agreement that any item that is not sold can be sent back without having to be paid for","examples":["The novels are delivered to outlets on a sale or return basis."]}],"phrasal":[],"related":["off-sale","tag sale","bake sale","boot sale","fire sale","seat sale","yard sale","estate sale","flash sale","garage sale","jumble sale","rummage sale","bill of sale","car boot sale","point of sale","sale of work","bring-and-buy sale"]}]