[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sam/sampl/sample__us_1.mp3","phonsUS":"/ˈsæmpl/","level":"B1","meanings":[{"def":"a number of people or things taken from a larger group and used in tests to provide information about the group","examples":["The interviews were given to a random sample of students.","The survey covers a representative sample of schools.","a sample survey","The current study has a larger sample size than earlier studies.","We studied a large population sample.","Our sample comprised 250 catering workers.","The research was based on samples from 29 populations.","a random sample drawn from men aged 35–40","The results are based on a sample of 100 people drawn from different areas and social classes."],"opposite":"","synonyms":""},{"def":"a small amount of a substance taken from a larger amount and tested in order to obtain information about the substance","examples":["a blood/urine/tissue/DNA sample","sample of something Samples of the water contained pesticide.","A small sample of blood must be tested by a doctor.","to collect/obtain/take a sample","We analyzed samples from more than a dozen common tree species.","Her sample contained traces of the banned steroid.","All the athletes had to provide a urine sample.","samples of tissue"],"opposite":"","synonyms":""},{"def":"a small amount or example of something that can be looked at or tried to see what it is like","examples":["‘I'd like to see a sample of your work,’ said the manager.","a free sample of shampoo","Would you like a sample of the fabric to take home?","We looked at sample books to choose the fabric."],"opposite":"","synonyms":""},{"def":"a piece of recorded music or sound that is used in a new piece of music","examples":["‘Candy’ includes a swirling sample from a Walker Brothers song."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"B2","meanings":[{"def":"to try a small amount of a particular food to see what it is like; to experience something for a short time to see what it is like","examples":["I sampled the delights of Greek cooking for the first time.","He put his head out of the window and sampled the morning air.","We simply had to stop and sample some road-side cuisine."],"opposite":"","synonyms":""},{"def":"to test, question, etc., part of something or of a group of people in order to find out what the rest is like","examples":["12 per cent of the children sampled said they prefer cats to dogs.","The survey was done using a group of 100 children randomly sampled from the school population."],"opposite":"","synonyms":""},{"def":"to record part of a piece of music, or a sound, in order to use it in a new piece of music","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]