[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/san/sanct/sanction__us_1.mp3","phonsUS":"/ˈsæŋkʃn/","level":"C1","meanings":[{"def":"an official order that limits trade, contact, etc. with a particular country, in order to make it do something, such as obeying international law","examples":["Trade sanctions were imposed against any country that refused to sign the agreement.","The economic sanctions have been lifted.","Some companies have broken sanctions by supplying arms to the warring states.","The UN called for sanctions against the invading country.","The company is in breach of a sanctions order.","There were calls for the imposition of sanctions."],"opposite":"","synonyms":""},{"def":"official permission or approval for an action or a change","examples":["These changes will require the sanction of the court.","Their ideas received official sanction at the meeting.","No decision can be taken without the sanction of the committee.","The conference gave its official sanction to the change of policy.","The movement was first given official sanction in the 1960s.","No parliamentary sanction is needed for the Treasury to borrow money.","Such a step could not be taken without his sanction."],"opposite":"","synonyms":""},{"def":"a course of action that can be used, if necessary, to make people obey a law or behave in a particular way","examples":["The ultimate sanction will be the closure of the restaurant.","We now have an effective sanction against the killing of whales.","The school will use all available sanctions to maintain discipline.","There were strict sanctions against absenteeism."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to give permission for something to take place","examples":["The government refused to sanction a further cut in interest rates.","He had tacitly sanctioned repression against the opposition parties.","Shareholders are unlikely to sanction the scheme.","The military refused to sanction a transfer of power to a civilian government.","The transaction has to be sanctioned by the court.","Slavery was once socially sanctioned."],"opposite":"","synonyms":""},{"def":"to punish somebody/something; to impose a sanction on something","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]