[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sat/satis/satisfaction__us_1.mp3","phonsUS":"/ˌsætɪsˈfækʃn/","level":"B2","meanings":[{"def":"the good feeling that you have when you have achieved something or when something that you wanted to happen does happen; something that gives you this feeling","examples":["to gain/get/derive satisfaction from something","a look/smile of satisfaction","with satisfaction She looked back on her career with great satisfaction.","He had the satisfaction of seeing his book become a bestseller.","She didn't want to give him the satisfaction of seeing her cry.","The company is trying to improve customer satisfaction.","He was enjoying all the satisfactions of being a parent.","He derived great satisfaction from knowing that his son was happy.","Money can’t buy you happiness.","The sight of her son graduating filled her with pride.","They found contentment in living a simple life.","her search for personal fulfilment","Although we didn't win, we were able to take some satisfaction from our performance.","Both parties expressed their complete satisfaction with the decision.","Clients are asked to rate their overall satisfaction.","He derived great satisfaction from knowing that his son was happy.","He nodded with evident satisfaction.","I find satisfaction in helping people.","I had the satisfaction of proving him wrong.","My current level of job satisfaction is pretty low.","She felt a certain satisfaction in keeping him waiting.","She watched in satisfaction as he opened the present.","The children were a major source of satisfaction."],"opposite":"","synonyms":"satisfaction"},{"def":"the act of fulfilling a need or desire","examples":["the satisfaction of sexual desires","the satisfaction of your ambitions"],"opposite":"","synonyms":""},{"def":"an acceptable way of dealing with a complaint, a debt, an injury, etc.","examples":["I complained to the manager but I didn't get any satisfaction.","They agreed on a payment of £200 in full satisfaction of the debt."],"opposite":"","synonyms":""},{"def":"if you do something to somebody’s satisfaction, they are pleased with it","examples":["The affair was settled to the complete satisfaction of the client.","The matter was resolved to our general satisfaction."],"opposite":"","synonyms":""},{"def":"if you prove something to somebody’s satisfaction, they believe or accept it","examples":["Can you demonstrate to our satisfaction that your story is true?"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"to somebody’s satisfaction","def":"if you do something to somebody’s satisfaction, they are pleased with it","examples":["The affair was settled to the complete satisfaction of the client.","The matter was resolved to our general satisfaction.","Can you demonstrate to our satisfaction that your story is true?"]}],"phrasal":[],"related":["job satisfaction","self-satisfaction"]}]