[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sav/save_/save__us_1.mp3","phonsUS":"/seɪv/","level":"A2","meanings":[{"def":"to keep somebody/something safe from death, harm, loss, etc.","examples":["save somebody/something to save somebody’s life","Doctors were unable to save her.","He's trying to save their marriage.","She needs to win the next two games to save the match.","Workers chose longer hours in order to save jobs.","If you really want to save the planet, sell your car.","(figurative) Thanks for doing that. You saved my life (= helped me a lot).","She started a campaign to save her business.","save somebody/something from something to save a rare species from extinction","His intrepid act saved five men from death.","Money from local businesses helped save the school from closure.","This new technology might just have the power to save the world from ecological disaster.","save somebody/something from doing something She saved a little girl from falling into the water.","He is responsible for saving the lives of the aircrew.","It's a trick that might just save us from total disaster.","She helped save my career.","The furniture was beyond saving.","They saved the paintings from destruction.","We managed to save the animals from being put down.","She tried to get the boy to run away and save himself, not try to help her."],"opposite":"","synonyms":""},{"def":"to keep money instead of spending it, especially in order to buy a particular thing","examples":["I'm not very good at saving.","We scrimp and save to send our children to a private school.","I'm saving up to buy a new car.","save for something I'm saving for a new bike.","For all younger people in the US saving for retirement will be an absolute necessity.","save up We've been saving up to go to Australia.","save up for something I'm trying to save up for my holiday.","save something You should save a little each week.","I've saved almost £100 so far.","save something up He saved up some money and made plans to travel.","save something (up) for something He's been saving his allowance up for a new bike.","I’m saving for a new car.","If we budget carefully we’ll be able to afford the trip.","With the price increases, we are all having to tighten our belts."],"opposite":"","synonyms":"save"},{"def":"to avoid wasting something or using more than necessary","examples":["save something People are looking for ways to save money.","We'll take a cab to save time.","Recycling waste saves energy.","Images are captured in black and white to save hard disk space.","Book early and save £50!","We should try to save water.","save something on something The government is trying to save £1 million on defence.","save somebody something on something If we go this way it will save us two hours on the trip.","save somebody something A professional wedding coordinator can save you time and money.","save on something I save on fares by walking to work.","Factory and farm managers were told to save electricity during peak hours.","We use video conferencing for our meetings, thereby saving thousands in travel expenses.","This new system could save us a lot of money.","They're hoping to save on printing costs."],"opposite":"","synonyms":""},{"def":"to keep something to use or enjoy in the future or for somebody else to use","examples":["save something for something/somebody He's saving his strength for the last part of the race.","We'll eat some now and save some for tomorrow.","Save some food for me.","save something The main event is saved until last.","save somebody something Save me some food.","I won't save you a seat if you're late."],"opposite":"","synonyms":""},{"def":"to make a computer keep data by putting a copy in a location where it will be stored","examples":["We recommend you save regularly by clicking on the update button.","save something Save data frequently.","All your recent searches are automatically saved.","save something to something The data can be saved to disk."],"opposite":"","synonyms":""},{"def":"to collect something because you like it or for a special purpose","examples":["I've been saving theatre programmes for years.","If you save ten tokens you can get a T-shirt."],"opposite":"","synonyms":""},{"def":"to avoid doing something difficult or unpleasant; to make somebody able to avoid doing something difficult or unpleasant","examples":["save somebody from doing something The prize money saved her from having to find a job.","save something She did it herself to save argument.","save somebody something Thanks for sending that letter for me—it saved me a trip.","The new system will save people the trouble of taking recyclable materials to collection points.","save doing something He's grown a beard to save shaving.","save somebody doing something If you phone for an appointment, it'll save you waiting."],"opposite":"","synonyms":""},{"def":"to prevent an opponent’s shot from going in the goal","examples":["to save a penalty","The goalie saved Johnson's long-range shot.","(British English) The goalie saved brilliantly from Johnson's long-range shot."],"opposite":"","synonyms":""},{"def":"to prevent a person's soul from going to hell","examples":["The missionaries believed they were sent to save souls.","A large poster proclaimed, ‘Jesus saves.’"],"opposite":"","synonyms":""},{"def":"to be completely unable to do something","examples":["He can't interview people to save his life."],"opposite":"","synonyms":""},{"def":"to rescue somebody from a very difficult situation","examples":["He's out to save his own political neck."],"opposite":"","synonyms":""},{"def":"used to tell somebody that it is not worth wasting time and effort saying something because it will not change anything","examples":["Save your breath—you'll never persuade her.","It's useless talking to him—you may as well save your breath."],"opposite":"","synonyms":""},{"def":"to prevent failure or defeat, when this seems certain to happen","examples":["Salah's late goal saved the day for Liverpool."],"opposite":"","synonyms":""},{"def":"to avoid or help somebody avoid being embarrassed","examples":["She was fired, but she saved face by telling everyone she'd resigned."],"opposite":"","synonyms":""},{"def":"to try to avoid death, punishment, etc., especially by leaving others in an extremely difficult situation","examples":["To save his own skin, he lied and blamed the accident on his friend."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"not be able to do something to save your life","def":"to be completely unable to do something","examples":["He can't interview people to save his life.","Doctors were unable to save him.","a campaign to save the panda from extinction","They were rescued by a passing cruise ship.","Don’t expect me to bail you out if it all goes wrong.","He was a sinner, redeemed by the grace of God."]},{"idiom":"save somebody’s bacon/neck","def":"to rescue somebody from a very difficult situation","examples":["He's out to save his own political neck."]},{"idiom":"save your breath","def":"used to tell somebody that it is not worth wasting time and effort saying something because it will not change anything","examples":["Save your breath—you'll never persuade her.","It's useless talking to him—you may as well save your breath."]},{"idiom":"save the day/situation","def":"to prevent failure or defeat, when this seems certain to happen","examples":["Salah's late goal saved the day for Liverpool."]},{"idiom":"save (somebody’s) face","def":"to avoid or help somebody avoid being embarrassed","examples":["She was fired, but she saved face by telling everyone she'd resigned."]},{"idiom":"save your (own) skin/hide/neck","def":"to try to avoid death, punishment, etc., especially by leaving others in an extremely difficult situation","examples":["To save his own skin, he lied and blamed the accident on his friend."]}],"phrasal":[],"related":["Kwik Save™","Save the Children","God Save the King/Queen","Eternal Father, Strong to Save","save for","save your breath","save the day/situation","save (somebody’s) face","save somebody’s bacon/neck","save your (own) skin/hide/neck","save, keep, etc. something for a rainy day","not be able to do something to save your life"]},{"pos":"noun","level":"","meanings":[{"def":"an action by the goalkeeper that stops a goal being scored","examples":["He made a spectacular save.","some great saves from both goalkeepers"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"preposition","level":"","meanings":[{"def":"except something","examples":["They knew nothing about her save her name."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"conjunction","level":"","meanings":[{"def":"except","examples":["They found out nothing more save that she had borne a child."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]