[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sav/savin/saving__us_1.mp3","phonsUS":"/ˈseɪvɪŋ/","level":"B2","meanings":[{"def":"an amount of something such as time or money that you do not need to use or spend","examples":["saving of something Buy three and make a saving of 55p.","saving on something With the new boiler you can make big savings on fuel bills.","The company reported cost savings of about $ 29 million during the second quarter.","The new building enjoys energy savings of 25 percent annually.","The service has delivered significant cost savings.","For a family of four this can mean a saving of around $500.","The potential savings are enormous.","This design offers considerable savings in fuel efficiency.","This represents a saving to British business of about £175 million a year.","This was done, with a saving of 40% in staff costs.","We need to find savings of around €30 million.","We need to see where financial savings can be made.","We will pass on this saving to our customers."],"opposite":"","synonyms":""},{"def":"money that you have saved, especially in a bank, etc.","examples":["He put all his savings into buying a boat.","She spent her entire life savings (= all the money she had saved throughout her life) to furnish and equip the house.","Tan financed the film himself from his personal savings.","He's living off his retirement savings.","Savings rates are at historic lows.","I don't have any savings.","I was determined to build up some savings.","My grandfather refused to put his savings in the bank.","She lost her job and had to live on her savings.","The card gives you instant access to your savings.","The couple lost their entire life savings on the venture.","The war had wiped out the family savings.","You get higher interest if you agree to tie up your savings for a long period."],"opposite":"","synonyms":""},{"def":"that prevents the waste of the thing mentioned or stops it from being necessary","examples":["labour-saving devices","space-saving fitted furniture"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["face-saving","life-saving","time-saving","labour-saving","money-saving","saving grace","daylight saving time","labor-saving","saving graces"]}]