[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sca/scale/scale__us_1.mp3","phonsUS":"/skeɪl/","level":"B2","meanings":[{"def":"the size or extent of something, especially when compared with something else","examples":["on a … scale They entertain on a large scale (= they hold expensive parties with a lot of guests).","Here was corruption on a grand scale.","On a global scale, 77 per cent of energy is created from fossil fuels.","Corporations are borrowing on a massive scale.","Western-style consumerism is unsustainable on a global scale.","Manufacturing is done on a small scale.","His work as a portrait painter is small in scale.","to achieve economies of scale in production (= to produce many items so the cost of producing each one is reduced)","scale of something It was impossible to comprehend the full scale of the disaster.","It was not until morning that the sheer scale of the damage could be seen (= how great it was).","The scale of the problem is difficult to measure.","Do they always entertain on such a lavish scale?","Economies of scale enable the larger companies to lower their prices.","It is difficult to comprehend the sheer scale of the suffering caused by the war.","The dolls are now produced on a commercial scale.","They plan to expand the scale and scope of their operations.","We need to determine the scale of the problem.","a misuse of presidential power on an unprecedented scale","pollution on a massive scale","What if a global scale catastrophe happens?"],"opposite":"","synonyms":""},{"def":"a range of levels or numbers used for measuring something","examples":["a five-point pay scale","to evaluate performance on a scale from 1 to 10","The salary scale goes from £12 000 to £20 000.","a scale of charges","Use the following scale to rate each item.","After ten years, she had worked her way to the top of the pay scale.","Please see the attached sheet for our scale of fees.","On a scale of 1 to 10, he scores 7.","Patients were asked to state their level of anxiety on a 10-point rating scale.","On the response sheet, the scale of answers ranged from ‘excellent’ to ‘extremely poor’.","There is an ascending scale of penalties for traffic offences."],"opposite":"","synonyms":""},{"def":"the set of all the different levels of something, from the lowest to the highest","examples":["At the other end of the scale, life is a constant struggle to get enough to eat.","You're higher on the social scale than I am.","Farm workers were always considered to be low down on the social scale.","At what point on the evolutionary scale do birds come?","At the bottom end of the scale, there are people living on under a dollar a day.","He has risen up the social scale from rather humble beginnings."],"opposite":"","synonyms":""},{"def":"a series of marks at regular points on an instrument that is used for measuring","examples":["How much does it read on the scale?","He read the altitude in degrees off the scale."],"opposite":"","synonyms":""},{"def":"an instrument for weighing people or things","examples":["bathroom/kitchen/weighing scales","(figurative) the scales of justice (= represented as the two pans on a balance)"],"opposite":"","synonyms":""},{"def":"the relation between the actual size of something and its size on a map, diagram or model that represents it","examples":["a scale of 1:25 000","a scale model/drawing","Both plans are drawn to the same scale.","to scale Is this diagram to scale? (= are all its parts the same size and shape in relation to each other as they are in the thing represented)","He's made a scale model of the Eiffel Tower.","The map has a scale of one centimetre to the kilometre.","The plan of the building is not drawn to scale."],"opposite":"","synonyms":""},{"def":"a series of musical notes moving upwards or downwards, with fixed intervals between each note, especially a series of eight starting on a particular note","examples":["the scale of C major","to practise scales on the piano"],"opposite":"","synonyms":""},{"def":"any of the thin plates of hard material that cover the skin of many fish and reptiles","examples":["The beast was a dragon, with great purple and green scales."],"opposite":"","synonyms":""},{"def":"a hard white substance that is sometimes left inside water pipes and containers for heating water","examples":[],"opposite":"","synonyms":""},{"def":"a hard substance that forms on teeth, especially when they are not cleaned regularly","examples":[],"opposite":"","synonyms":""},{"def":"to affect the result of something in one way rather than another","examples":["In an interview, smart presentation can tip the scales in your favour.","New evidence tipped the balance against the prosecution."],"opposite":"","synonyms":""},{"def":"to weigh a particular amount","examples":["He tipped the scales at just over 80 kilos."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"tip the balance/scales","def":"to affect the result of something in one way rather than another","examples":["In an interview, smart presentation can tip the scales in your favour.","New evidence tipped the balance against the prosecution."]},{"idiom":"tip the scales at something","def":"to weigh a particular amount","examples":["He tipped the scales at just over 80 kilos."]}],"phrasal":[],"related":["scale up","full-scale","large-scale","scale down","small-scale","sliding scale","Kelvin scale","Richter scale","Beaufort scale","scale something"]},{"pos":"verb","level":"SYMBOL","meanings":[{"def":"to climb to the top of something very high and steep","examples":["the first woman to scale the world's five highest peaks","He somehow managed to scale the sheer outside wall of the tower.","(figurative) He has scaled the heights of his profession."],"opposite":"","synonyms":""},{"def":"to remove the small flat hard pieces of skin from a fish","examples":[],"opposite":"","synonyms":""},{"def":"to remove tartar from the teeth by scraping","examples":["The dentist scaled and polished my teeth."],"opposite":"","synonyms":""},{"def":"to change the size of something","examples":["Text can be scaled from 4 points to 108 points without any loss of quality."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["scale down","scale up"],"related":[]}]