[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sca/scan_/scan__us_1.mp3","phonsUS":"/skæn/","level":"B1","meanings":[{"def":"to look quickly but not very carefully at a document, etc.","examples":["scan something for something I scanned the list quickly for my name.","scan something We quickly scanned the menu.","scan through something (for something) She scanned through the newspaper over breakfast.","scan for something You should teach students to scan for essential information.","I scanned the paper for news.","He scanned through the web pages."],"opposite":"","synonyms":""},{"def":"to look at every part of something carefully, especially because you are looking for a particular thing or person","examples":["scan something for something He scanned the horizon for any sign of land.","She scanned the room for an empty seat.","scan something She scanned his face anxiously.","She scanned the street nervously, looking for the two men."],"opposite":"","synonyms":""},{"def":"to pass light over a picture or document using a scanner in order to copy it and put it in the memory of a computer","examples":["scan something How do I scan a photo and attach it to an email?","digitally scanned photographs","This recognizes text in a scanned image.","scan something into something The pencil image is scanned into a computer."],"opposite":"","synonyms":""},{"def":"to get an image of an object, a part of somebody’s body, etc. on a computer by passing X-rays, ultrasound waves or electromagnetic waves over it in a special machine","examples":["Their brains are scanned so that researchers can monitor the progress of the disease."],"opposite":"","synonyms":""},{"def":"to pass across an area","examples":["Concealed video cameras scan every part of the compound."],"opposite":"","synonyms":""},{"def":"to examine a computer program or document in order to look for a virus","examples":["This software is designed to scan all new files for viruses."],"opposite":"","synonyms":""},{"def":"to have a regular rhythm according to fixed rules","examples":["This line doesn't scan."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["scan in","scan into"],"related":["CAT scan","CT scan","scan in","scan into","scan something into something | scan something in"]},{"pos":"noun","level":"","meanings":[{"def":"a medical test in which a machine produces a picture of the inside of a person’s body, or a baby inside its mother's body, on a computer screen","examples":["to have a brain scan","At twenty weeks she had a scan and the midwife told her the baby looked fine.","A scan revealed a small fracture in the hip area.","The doctors took a scan of his thigh bone.","The brain scan revealed no signs of injury.","A routine scan revealed abnormalities in the foetus."],"opposite":"","synonyms":""},{"def":"the act of looking quickly through something written or printed, usually in order to find something","examples":["a scan of the newspapers","I had a quick scan down the guest list but couldn’t see my name."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]