[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sce/scene/scene__us_1.mp3","phonsUS":"/siːn/","level":"A2","meanings":[{"def":"the place where something happens, especially something unpleasant","examples":["the scene of the accident/crime/crash","The attacker fled the scene.","Italy was the scene of many demonstrations at that time.","on the scene Firefighters arrived on the scene within minutes.","at the scene Sadly the man died at the scene.","A police officer attended the scene.","Have you seen the latest Star Wars movie?","This would be a good place for a picnic.","They’ve chosen a site for the new school.","the hotel reception area","Move the cursor to a blank area on the screen.","From his position at the top of the hill, he could see the harbour.","the point at which the river divides","The company is moving to a new location.","the scene of the accident","The lake is one of the local beauty spots.","An ambulance soon arrived at the scene of the accident.","The criminal often revisits the scene of the crime.","Police say the man died at the scene.","The police were called to the scene.","footprints found near the murder scene","It was the scene of many battles in the past."],"opposite":"","synonyms":"place"},{"def":"an event or a situation that you see, especially one of a particular type","examples":["The team's victory produced scenes of jubilation all over the country.","a scene of devastation/carnage","She witnessed some very distressing scenes.","He surveyed the scene with horror.","I replayed the scene in my mind.","Paramedics tended the wounded in scenes reminiscent of wartime.","She opened the door on an extraordinary scene of disorder.","The battlefield was a scene of utter carnage.","We sat in horror watching the scenes of violence unfold before us.","The star arrived amidst scenes of excitement.","a touching domestic scene"],"opposite":"","synonyms":""},{"def":"a part of a film, play or book in which the action happens in one place or is of one particular type","examples":["sex/fight/action/battle scenes","deleted scenes (= ones that were not included in the final version)","to film/shoot a scene","They shot the opening scene 15 times.","I got very nervous before my big scene (= the one where I have a very important part).","The scene where he arrives at the factory is the turning point in the book.","He appears in the opening scene.","She plays the love scenes brilliantly.","The film has several steamy bedroom scenes.","The little girl stole the scene from all the big stars.","Then the scene shifts to the kitchen.","There is a dramatic fight scene between the two brothers.","We ran through the final scene again.","The film contains some minor sex scenes.","The movie opens with a scene in a New York apartment."],"opposite":"","synonyms":""},{"def":"one of the small sections that a play or an opera is divided into","examples":["Act I, Scene 2 of ‘Macbeth’"],"opposite":"","synonyms":""},{"def":"a particular area of activity or way of life and the people who are part of it","examples":["the art/club/punk scene","on the… scene a newcomer on the music scene","British players were finding it increasingly difficult to compete on the international scene.","Tarantino burst onto the cinema scene in the ’90s.","After years at the top, she just vanished from the scene.","He is heavily involved in the local art scene.","Many of the stars of the nineties have completely vanished from the music scene.","the eruption of Cuban music onto the world scene","A newcomer has appeared on the fashion scene."],"opposite":"","synonyms":""},{"def":"a view that you see","examples":["a delightful rural scene","They went abroad for a change of scene (= to see and experience new surroundings).","We stood and surveyed the scene.","I stared out of the window of the train on the ever-changing scene.","The cottage had a delightful sea view.","It’s a spectacular sight as the flamingos lift into the air.","It was a delightful rural scene.","The tower offers a breathtaking panorama of Prague."],"opposite":"","synonyms":"view"},{"def":"a painting, drawing, or photograph of a place and the things that are happening there","examples":["an exhibition of Parisian street scenes","He painted scenes of country life."],"opposite":"","synonyms":""},{"def":"a loud, angry argument, especially one that happens in public and is embarrassing","examples":["She had made a scene in the middle of the party.","‘Please leave,’ he said. ‘I don't want a scene.’","She had some terrible scenes with her father.","There have been a couple of ugly scenes between him and the manager."],"opposite":"","synonyms":""},{"def":"in the part of a theatre, etc. that the public does not usually see","examples":["The students were able to go behind the scenes to see how programmes are made."],"opposite":"","synonyms":""},{"def":"in a way that people in general are not aware of","examples":["A lot of negotiating has been going on behind the scenes.","behind-the-scenes work"],"opposite":"","synonyms":""},{"def":"not the type of thing that somebody likes or enjoys doing","examples":["Hillwalking is not my scene, so I stayed at home."],"opposite":"","synonyms":""},{"def":"to create a situation in which something can easily happen or develop","examples":["His arrival set the scene for another argument."],"opposite":"","synonyms":""},{"def":"to give somebody the information and details they need in order to understand what comes next","examples":["The first part of the programme was just setting the scene.","The scene is set in the first paragraph with an account of Sally's childhood."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"behind the scenes","def":"in the part of a theatre, etc. that the public does not usually see","examples":["The students were able to go behind the scenes to see how programmes are made.","A lot of negotiating has been going on behind the scenes.","behind-the-scenes work"]},{"idiom":"not somebody’s scene","def":"not the type of thing that somebody likes or enjoys doing","examples":["Hillwalking is not my scene, so I stayed at home."]},{"idiom":"set the scene (for something)","def":"to create a situation in which something can easily happen or develop","examples":["His arrival set the scene for another argument.","The first part of the programme was just setting the scene.","The scene is set in the first paragraph with an account of Sally's childhood."]}],"phrasal":[],"related":["crime scene","scene-shifter","scene-stealer","mise en scène","scene-of-crime","scene-shifting","CSI: Crime Scene Investigation","scene-shifters","scene-stealers","mises en scène"]}]