[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sch/sched/schedule__us_1_rr.mp3","phonsUS":"/ˈskedʒuːl/","level":"A2","meanings":[{"def":"a plan that lists all the work that you have to do and when you must do each thing","examples":["I have a hectic schedule for the next few days.","a busy/gruelling/punishing schedule","We're working to a tight schedule (= we have a lot of things to do in a short time).","He has taken some time out of his busy schedule to talk to us.","They have a very flexible work schedule.","I have no time available in my regular schedule.","on schedule Filming began on schedule (= at the planned time).","The project will be completed on schedule this summer.","ahead of schedule The new bridge has been finished two years ahead of schedule.","behind schedule The tunnel project has already fallen behind schedule.","according to schedule At this stage everything is going according to schedule (= as planned).","We are trying desperately to keep to our schedule.","The countries have yet to set the schedule for the next round of talks.","Allow time in the schedule for sickness.","I'm trying to fit everything into my busy schedule.","She has a very demanding schedule.","We had to work a lot of overtime to meet the strict production schedule.","We're five days off schedule."],"opposite":"","synonyms":""},{"def":"a chart showing the times at which trains, buses and planes leave and arrive","examples":["Connor checked the bus schedules for the day.","disruptions to flight schedules caused by the strike"],"opposite":"","synonyms":""},{"def":"a chart or plan of the classes that a student or teacher has in school each week","examples":["Besides a full school schedule, Kayla's week is jam-packed with other activities.","What's your schedule like next semester?"],"opposite":"","synonyms":""},{"def":"a list of the television and radio programmes that are on a particular channel and the times that they start","examples":["The channel's schedules are filled with old films and repeats.","Channel 4 has published its spring schedules.","The show trebled ratings for the channel's afternoon schedule."],"opposite":"","synonyms":""},{"def":"a written list of things, for example prices, rates or conditions","examples":["tax schedules"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"B2","meanings":[{"def":"to arrange for something to happen at a particular time","examples":["schedule something for something The meeting is scheduled for Friday afternoon.","Local elections were tentatively scheduled for November.","schedule something We scheduled regular status meetings.","One of the scheduled events is a talk on alternative medicine.","He finally arrived, an hour later than scheduled.","We'll be stopping here for longer than scheduled.","schedule somebody/something to do something I'm scheduled to arrive in LA at 5 o'clock.","The talks were originally scheduled to begin in May.","The store is scheduled to open on Friday.","She is not scheduled to meet with any government officials during her trip.","The Grand Prix is scheduled to take place on July 4.","The film is scheduled for release next month.","I'll try to schedule you in next week.","No regular classes were scheduled on Wednesdays."],"opposite":"","synonyms":""},{"def":"to include something in an official list of things","examples":["The substance has been scheduled as a poison."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]