[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sco/scope/scope__us_1.mp3","phonsUS":"/skəʊp/","level":"C1","meanings":[{"def":"the opportunity or ability to do or achieve something","examples":["scope for something There's still plenty of scope for improvement.","Her job offers very little scope for promotion.","scope (for somebody) (to do something) The extra money will give us the scope to improve our facilities.","within somebody's scope First try to do something that is within your scope.","There is limited scope for creativity in my job.","These courses give students more scope for developing their own ideas."],"opposite":"","synonyms":""},{"def":"the range of things that a subject, an organization, an activity, etc. deals with","examples":["The police are broadening the scope of their investigation.","in scope Our powers are limited in scope.","beyond the scope of something This subject lies beyond the scope of our investigation.","outside the scope of something These issues were outside the scope of the article.","This is a novel of epic scope and grand passions.","These disputes fall within the scope of the local courts.","These criteria were used to determine the scope of the curriculum.","The survey is too limited in (its) scope.","The sheer scope of the project was impressive.","The scope of the exhibition is disappointingly narrow.","The geographical scope of product markets has widened since the war."],"opposite":"","synonyms":""},{"def":"an instrument for looking through or watching something with","examples":["microscope","telescope"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Scope"]},{"pos":"verb","level":"","meanings":[{"def":"to look at or examine something carefully and completely","examples":["His eyes scoped the room, trying to spot her in the crowd."],"opposite":"","synonyms":""},{"def":"to examine something carefully before you start work on it so that you know the size of the task","examples":["scope something The information helped us scope the project.","scope something out They had already scoped out project needs and costs."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"","level":"","meanings":[{"def":"a British charity which helps people with a disability, especially those with cerebral palsy (= a condition caused by brain damage before or at birth, which makes people lose control of their movements). It was formed in 1952 as the Spastics Society and given the new name Scope in 1994. It has several schools and other centres in Britain.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]