[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/scr/screa/scream__us_1.mp3","phonsUS":"/skriːm/","level":"B2","meanings":[{"def":"to give a loud, high shout, because you are hurt, frightened, excited, etc.","examples":["He covered her mouth to stop her from screaming.","I wanted to run screaming from the room.","scream in/with something The kids were screaming with excitement.","I screamed in pain.","The man screamed in agony and collapsed.","He heard a few of the children screaming with laughter.","scream out in/with something People ran for the exits, screaming out in terror.","scream out The boy screamed out, as he felt a man's hand grab his arm.","scream yourself + adj. The baby was screaming itself hoarse.","screaming fans","Despair shook him and he screamed silently in the darkness.","I was so bored I wanted to scream.","People were staggering about, screaming with pain.","People were screaming and yelling, passing out, fainting."],"opposite":"","synonyms":""},{"def":"to shout something in a loud, high voice because of fear, anger, etc.","examples":["+ speech ‘Help!’ she screamed.","'Go away!' I screamed at the top of my voice (= as loudly as possible).","scream (out) for something/somebody Someone was screaming for help.","scream at somebody to do something He screamed at me to stop.","scream at somebody Everyone started screaming at each other.","She started screaming and shouting at me.","He screamed hysterically at me.","scream something (out) (at somebody) She screamed abuse at him.","She screamed out abuse at him.","I started pounding on the door screaming my lungs out (= as loud and long as possible).","He screamed his head off (= screamed very loudly and angrily) at me.","scream (out) that… His sister screamed out that he was crazy.","Stop shouting and listen!","‘Run!’ he shouted.","She yelled at the boy to get down from the wall.","She ran over to the window and cried for help.","He screamed at me to stop.","We all cheered as the team came onto the field.","‘Quiet!’ the teacher bellowed.","She never once raised her voice to us.","Marion screamed after them, ‘Stop! Stop!’","She screamed at me to get out of the way."],"opposite":"","synonyms":"shout"},{"def":"to make a loud, high noise; to move fast, making this noise","examples":["Lights flashed and sirens screamed.","+ adv./prep. The powerboat screamed out to sea."],"opposite":"","synonyms":""},{"def":"if you drag somebody kicking and screaming to do something, they only do it with great protests because they don't really want to do it at all","examples":["The president had to be dragged kicking and screaming to the signing ceremony."],"opposite":"","synonyms":""},{"def":"to scream loudly and for a long time, especially in order to protest about something","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"(drag somebody) kicking and screaming","def":"if you drag somebody kicking and screaming to do something, they only do it with great protests because they don't really want to do it at all","examples":["The president had to be dragged kicking and screaming to the signing ceremony."]},{"idiom":"scream blue murder","def":"to scream loudly and for a long time, especially in order to protest about something","examples":[]}],"phrasal":["scream out"],"related":["scream out","scream blue murder","scream bloody murder","scream out (for something)","laugh, scream, etc. your head off"]},{"pos":"noun","level":"B2","meanings":[{"def":"a loud high shout made by somebody who is hurt, frightened, excited, etc.; a loud high noise","examples":["scream of something She let out a scream of pain.","She gave a little high-pitched scream of delight.","They ignored the baby's screams.","He drove off with a scream of tyres.","I thought I heard a scream.","All I could hear were the screams of the wounded.","the screams of adoring fans","a blood-curdling/piercing/loud scream","She reacted to the news with hysterical screams.","The scream came from upstairs.","a scream for help"],"opposite":"","synonyms":""},{"def":"a person or thing that causes you to laugh","examples":["He's a scream."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]