[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sea/seal_/seal__us_1.mp3","phonsUS":"/siːl/","level":"C1","meanings":[{"def":"to close an envelope, etc. by sticking the edges of the opening together","examples":["Make sure you've signed the cheque before sealing the envelope.","a sealed bid (= one that is kept in a sealed envelope and therefore remains secret until all other bids have been received)"],"opposite":"","synonyms":""},{"def":"to close a container tightly or fill a small opening, etc., especially so that air, liquid, etc. cannot get in or out","examples":["seal something (with something) He sealed the bag tightly with sticky tape.","be sealed (up) (with something) The windows and doors had been sealed up with bricks.","The organs are kept in sealed plastic bags.","The containers must be carefully sealed so that no air can get in.","The whole unit is sealed to prevent dust getting in.","The unit is completely sealed.","a hermetically sealed container"],"opposite":"","synonyms":""},{"def":"to make something definite, so that it cannot be changed or argued about","examples":["to seal a contract","They drank a glass of wine to seal their new friendship.","The discovery of new evidence sealed his fate (= nothing could prevent what was going to happen to him).","She sealed victory with a birdie at the final hole."],"opposite":"","synonyms":""},{"def":"to cover the surface of something with a substance in order to protect it","examples":["The floors had been stripped and sealed with varnish."],"opposite":"","synonyms":""},{"def":"to prevent people from passing through a place","examples":["Troops have sealed the borders between the countries."],"opposite":"","synonyms":""},{"def":"used to say that you will not repeat somebody’s secret to other people","examples":[],"opposite":"","synonyms":""},{"def":"definite, because all the legal documents have been signed","examples":["The contracts are already signed and sealed."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"my lips are sealed","def":"used to say that you will not repeat somebody’s secret to other people","examples":[]},{"idiom":"signed and sealed | signed, sealed and delivered","def":"definite, because all the legal documents have been signed","examples":["The contracts are already signed and sealed."]}],"phrasal":["seal in","seal off"],"related":["seal in","seal off","harp seal","elephant seal","Great Seal","Lord Privy Seal","seal something","seal something in something","under seal","set the seal on something"]},{"pos":"noun","level":"C1","meanings":[{"def":"an official design or mark, stamped on a document to show that it is real and carries the authority of a particular person or organization","examples":["The letter bore the president's seal."],"opposite":"","synonyms":""},{"def":"a thing that makes something definite","examples":["The project has been given the government's seal of approval (= official approval).","I looked upon the gift as a seal on our friendship."],"opposite":"","synonyms":""},{"def":"a substance, piece of material, etc. used to fill a small opening so that air, liquid, etc. cannot get in or out","examples":["a jar with a rubber seal in the lid","Only drink bottled water and check the seal isn't broken."],"opposite":"","synonyms":""},{"def":"a piece of wax (= a soft substance produced by bees), soft metal or paper that is placed across the opening of something such as a letter or box and which has to be broken before the letter or box can be opened","examples":["He broke the wax seal and unrolled the paper.","an official-looking letter with a wax seal"],"opposite":"","synonyms":""},{"def":"a piece of metal, a ring, etc. with a design on it, used for stamping a wax or metal seal","examples":[],"opposite":"","synonyms":""},{"def":"a sea animal that eats fish and lives around coasts. There are many types of seal, some of which are hunted for their fur.","examples":["a colony of seals","grey seals basking on the rocks","The annual seal hunt takes place on the pack ice off Greenland.","Environmentalists claim there is no reason to cull seals.","The ad criticized hunters for clubbing baby seals."],"opposite":"","synonyms":""},{"def":"to make something definite or complete","examples":["Her election to the premiership set the seal on a remarkable political career."],"opposite":"","synonyms":""},{"def":"in a sealed envelope that cannot be opened before a particular time","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"set the seal on something","def":"to make something definite or complete","examples":["Her election to the premiership set the seal on a remarkable political career."]},{"idiom":"under seal","def":"in a sealed envelope that cannot be opened before a particular time","examples":[]}],"phrasal":[],"related":[]}]