[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sea/seaso/season__us_2.mp3","phonsUS":"/ˈsiːzn/","level":"A2","meanings":[{"def":"any of the four main periods of the year: spring, summer, autumn and winter","examples":["the changing seasons","Autumn is my favourite season."],"opposite":"","synonyms":""},{"def":"a period of the year in tropical countries when it is either very dry or it rains a lot","examples":["In this climate there are no real changes of temperature, just a wet and a dry season.","Next month is the start of the rainy season."],"opposite":"","synonyms":""},{"def":"a period of time during a year when a particular activity happens or is done","examples":["the cricket/football/hunting/shooting season","He scored his first goal of the season on Saturday.","They achieved their first win of the season.","He will not be offered a new contract at the end of the season.","The team have had a dream start to the season.","The female changes colour during the breeding season.","The growing season for these trees varies depending on species.","We're in the middle of the roughest hurricane season we've seen in quite some time.","The hotels are always full during the peak season (= when most people are on holiday).","(British English) the holiday season","(especially North American English) the tourist season","(North American English) the holiday season (= the time of Thanksgiving, Hanukkah, Christmas and New Year)","(British English) the festive season (= Christmas and New Year)","the summer blockbuster season","She scored her first goal of the season on Saturday.","We opened the season with five straight losses.","This year's flu season has been relatively mild.","They played against the Celtics in the season opener.","The resort gets overcrowded in peak season.","The party conference season gets under way this week.","The Senator has led in the polls for most of the primary season.","The Patriots won their last 12 games in the regular season.","The Denver Broncos' inaugural season was 1960.","Our team won the trophy for the second successive season.","It was the final race of a hard season.","I wished everyone a very happy holiday season.","He played a full season for West Ham.","He is busily preparing for the coming season.","He entered the season with 173 wins.","Decker played nine major league seasons.","He hurt his knee, so he was out the rest of the season.","They finished the season unbeaten."],"opposite":"","synonyms":""},{"def":"a period of time in which a play is shown in one place; a series of plays, films or television programmes","examples":["The play opens for a second season in London next week.","a season of films by Alfred Hitchcock"],"opposite":"","synonyms":""},{"def":"a period of time during one year when a particular style of clothes, hair, etc. is popular and fashionable","examples":["This season's look is soft and romantic.","The fashion magazines are full of the new look for the spring season."],"opposite":"","synonyms":""},{"def":"a set of television or radio programmes that have the same characters or deal with the same subject","examples":["The show begins its second season next week.","I binge-watched an entire season of ‘Mad Men’ (= watched all of the episodes on one occasion) on Sunday.","I can't wait to see the season finale (= last episode in the season).","the season opener (= the first episode in the season)"],"opposite":"","synonyms":""},{"def":"be/become easily available and ready to eat because it is the right time of year for them","examples":["Strawberries are now in season.","Melons are just coming into season."],"opposite":"","synonyms":""},{"def":"be/become ready to have sex and produce young","examples":[],"opposite":"","synonyms":""},{"def":"not easily available because it is not the right time of year for them","examples":["Lobster's out of season right now."],"opposite":"","synonyms":""},{"def":"at the times of year when few people go on holiday","examples":["Hotels are cheaper out of season."],"opposite":"","synonyms":""},{"def":"used during the Christmas period to wish somebody a pleasant holiday","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be in season | come into season","def":"be/become easily available and ready to eat because it is the right time of year for them","examples":["Strawberries are now in season.","Melons are just coming into season."]},{"idiom":"out of season","def":"not easily available because it is not the right time of year for them","examples":["Lobster's out of season right now.","Hotels are cheaper out of season."]},{"idiom":"season’s greetings","def":"used during the Christmas period to wish somebody a pleasant holiday","examples":[]}],"phrasal":[],"related":["Season","high season","low season","off season","off-season","open season","closed season","close season","season finale","season ticket","growing season","marching season","season premiere","silly season"]},{"pos":"verb","level":"","meanings":[{"def":"to add salt, pepper, etc. to food in order to make it taste better","examples":["Season the lamb with garlic.","Add the mushrooms, and season to taste (= add as much salt, pepper, etc. as you think is necessary).","Season the meat well with salt and pepper.","highly seasoned food"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]