[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sea/seat_/seat__us_1.mp3","phonsUS":"/siːt/","level":"A2","meanings":[{"def":"a place where you can sit, for example a chair","examples":["She sat back in her seat.","He put his shopping on the seat behind him.","Please take a seat (= sit down).","Ladies and gentlemen, please take your seats (= sit down).","the front/passenger seat (= in a car)","the back/rear seats","a child seat (= for a child in a car)","a window/an aisle seat (= on a plane or train)","a window/corner seat (= one near a window/in a corner)","a car/toilet seat","We used the branch of an old tree as a seat.","We all filed back to our seats in silence.","May I sit here?","Sit still, will you!","Please sit down.","Come in and sit yourselves down.","She was seated at the head of the table.","She perched herself on the edge of the bed.","Do you have a spare seat in your car?","He gave up his seat on the bus to a pregnant woman.","He leaped out of his seat when he saw the rat.","I got to the concert early to get a good seat.","I had a terrifying journey on the pillion seat of a Honda 750.","I slid into the leather bucket seat and fastened my seat belt.","I took my usual seat at the front of the classroom.","Is this seat taken?","It is very uncomfortable to sit on these seats.","The audience resumed their seats for the second half of the play.","The best seats were occupied by the friends and families of the performers.","There were no empty seats left in the hall.","We had hardly settled into our seats when the first goal was scored.","We had ringside seats for the boxing match.","We had the best seats in the house for the concert.","Would you prefer a window seat or an aisle seat?"],"opposite":"","synonyms":"sit"},{"def":"with the number of seats mentioned","examples":["(British English) a ten-seater minibus","an all-seater stadium (= in which nobody is allowed to stand)"],"opposite":"","synonyms":""},{"def":"the part of a chair, etc. on which you actually sit","examples":["a steel chair with a plastic seat"],"opposite":"","synonyms":""},{"def":"a place where you pay to sit in a plane, train, theatre, etc.","examples":["Call the theatre box office to book your seats.","To reserve a seat, visit our website.","There are no seats left on that flight.","Airlines often give great deals to fill empty seats.","seat for something We had excellent seats for the show, on the third row.","I reserved seats for a performance of ‘King Lear’ at the New Theatre.","an electronic seat-reservation system","Seat reservations are free.","Not all theatres can fill their seats so easily.","Is it possible to book seats for the play?","I managed to get some seats for the ballet."],"opposite":"","synonyms":""},{"def":"an official position as a member of a parliament, council, committee, etc.","examples":["a seat on the city council/in Parliament/in Congress","Republicans currently hold 51 seats in the Senate.","The majority of seats on the board will be held by business representatives.","The party won 32 seats in the recent elections.","Several ministers are in danger of losing their seats.","(British English) to take your seat (= to begin your duties, especially in Parliament)","One vote could make all the difference in the highly marginal seat of Crawley.","He has been selected to fight the seat at the next election.","She is expected to retain her seat at the next election.","He lost his seat in the last election.","She is running for a seat in the New York State Assembly.","She took her seat in Parliament as Britain's youngest MP.","The Democrats captured 18 of the 30 open seats.","The Liberals took seven seats from Labour.","The party held the seat with a 10 000 majority."],"opposite":"","synonyms":""},{"def":"a place where people are involved in a particular activity, especially a city that has a university or the offices of a government","examples":["Washington is the seat of government of the US.","a university town renowned as a seat of learning"],"opposite":"","synonyms":""},{"def":"a large house in the country that belongs to a member of the upper class","examples":["For the first two years of her life she lived at Ickworth, the family seat in Sussex."],"opposite":"","synonyms":""},{"def":"the part of the body on which a person sits","examples":[],"opposite":"","synonyms":""},{"def":"the part of a pair of trousers that covers a person’s seat","examples":[],"opposite":"","synonyms":""},{"def":"to have an advantage over other people or be in control of a situation","examples":["Canada is in the catbird seat as an energy powerhouse."],"opposite":"","synonyms":""},{"def":"to be the person in control of a situation","examples":[],"opposite":"","synonyms":""},{"def":"used to refer to the number of people who attend a show, talk, etc., especially when emphasizing the need or desire to attract a large number","examples":["They're not bothered about attracting the right audience—they just want bums on seats."],"opposite":"","synonyms":""},{"def":"to act without careful thought and without a plan that you have made in advance, hoping that you will be lucky and be successful","examples":[],"opposite":"","synonyms":""},{"def":"very excited and giving your full attention to something","examples":["The game had the crowd on the edge of their seats.","I was on the edge of my seat waiting to find out what happened next."],"opposite":"","synonyms":""},{"def":"to allow somebody else to play a more active and important role in a particular situation than you do","examples":["Many managers take a back seat and leave recruitment to specialists."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be in the catbird seat","def":"to have an advantage over other people or be in control of a situation","examples":["Canada is in the catbird seat as an energy powerhouse."]},{"idiom":"be in the driving seat","def":"to be the person in control of a situation","examples":[]},{"idiom":"bums on seats","def":"used to refer to the number of people who attend a show, talk, etc., especially when emphasizing the need or desire to attract a large number","examples":["They're not bothered about attracting the right audience—they just want bums on seats."]},{"idiom":"(fly) by the seat of your pants","def":"to act without careful thought and without a plan that you have made in advance, hoping that you will be lucky and be successful","examples":[]},{"idiom":"on the edge of your seat","def":"very excited and giving your full attention to something","examples":["The game had the crowd on the edge of their seats.","I was on the edge of my seat waiting to find out what happened next."]},{"idiom":"take a back seat","def":"to allow somebody else to play a more active and important role in a particular situation than you do","examples":["Many managers take a back seat and leave recruitment to specialists."]}],"phrasal":[],"related":["box seat","car seat","back seat","love seat","safe seat","seat belt","seat sale","bucket seat","child seat","window seat","booster seat","country seat","ejector seat","hot seat","passenger seat","back-seat driver"]},{"pos":"verb","level":"B2","meanings":[{"def":"to give somebody a place to sit; to sit down in a place","examples":["Please wait to be seated (= in a restaurant, etc.).","Please be seated (= sit down).","He seated himself behind the desk.","She was wondering where to seat her guests.","I found myself seated next to her.","May I sit here?","Sit still, will you!","Please sit down.","Come in and sit yourselves down.","She was seated at the head of the table.","She perched herself on the edge of the bed.","Please remain seated until your name is called.","Ramirez was seated at a table near the window.","The old woman was seated in a chair.","She seated herself on the sofa."],"opposite":"","synonyms":"sit"},{"def":"to have enough seats for a particular number of people","examples":["The aircraft seats 200 passengers.","The auditorium can seat an audience of 5 000.","The car seats six comfortably."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]