[{"pos":"determiner, ordinal number","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sec/secon/second__us_3.mp3","phonsUS":"/ˈsekənd/","level":"A1","meanings":[{"def":"happening or coming next after the first in a series of similar things or people; 2nd","examples":["This is the second time it's happened.","Italy scored a second goal just after half-time.","the second of June/June 2nd","He was the second to arrive.","We have one child and are expecting our second in July."],"opposite":"","synonyms":""},{"def":"next in order of importance, size, quality, etc. to one other person or thing","examples":["Osaka is Japan's second-largest city.","Birmingham, the UK’s second city","Basketball is second only to soccer in global popularity.","As a dancer, he is second to none (= nobody is a better dancer than he is)."],"opposite":"","synonyms":""},{"def":"another; in addition to one that you already own or use","examples":["They have a second home in Tuscany.","teachers of English as a second language (= to people who already speak one or more other languages)"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adverb","level":"A2","meanings":[{"def":"after one other person or thing in order or importance","examples":["She came second in the marathon.","One of the smaller parties came a close second (= nearly won).","The women's team came in fourth and the men finished second.","I agreed to speak second.","He is a writer first and a scientist second.","I came second (to) last (= the one before the last one) in the race.","We're not here to run second. We want to win races.","The club lies second in the Premiership."],"opposite":"","synonyms":""},{"def":"used to introduce the second of a list of points you want to make in a speech or piece of writing","examples":["She did it first because she wanted to, and second because I asked her to.","This study has the following aims: first, to investigate how international students in the UK use humour; second, to examine how jokes can help to establish social relationships; and third, to explore the role that humour plays in helping overseas students adjust to life in the UK.","Let us begin by identifying some of the popular joke genres in the UK.","Next, let us turn to/Next, let us consider the question of gender differences in the use of humour.","Finally/Lastly, let us briefly examine the role of humour in defining a nation’s culture.","This diagram illustrates the process of paper-making./This diagram shows how paper is made.","First/First of all, logs are delivered to a paper mill, where the bark is removed and the wood is cut into small chips.","Next/Second, the wood chips are pulped, either using chemicals or in a pulping machine.","Pulping breaks down the internal structure of the wood and enables/allows the natural oils to be removed.","Once/After the wood has been pulped, the pulp is bleached in order to remove impurities. /…is bleached so that impurities can be removed.","The next stage is to feed the pulp into the paper machine, where it is mixed with water and then poured onto a wire conveyor belt.","As the pulp travels along the conveyor belt, the water drains away. This causes the solid material to sink to the bottom, forming a layer of paper.","At this point the new paper is still wet, so it is passed between large heated rollers, which press out the remaining water and simultaneously dry the paper/…dry the paper at the same time.","The final stage is to wind the paper onto large rolls./Finally, the paper is wound onto large rolls."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"A1","meanings":[{"def":"a unit for measuring time. There are 60 seconds in one minute.","examples":["in… seconds She can run 100 metres in just over 11 seconds.","for… seconds For several seconds he did not reply.","every… seconds The light flashes every five seconds.","per second The water flows at about 1.5 metres per second.","The end of the game is only a matter of seconds away.","Every few seconds, she would turn towards the door.","The scene lasts six seconds.","He scored with less than 60 seconds on the clock (= less than 60 seconds after the game started).","I was counting the seconds until the bell.","If he'd reacted a fraction of a second later, he would surely have died.","It took a couple of seconds to realize what was going on.","She had wasted a few precious seconds.","She wanted to spend every second with him.","The room seemed to grow hotter with each passing second.","The seconds ticked by."],"opposite":"","synonyms":""},{"def":"a very short time","examples":["in a second I'll be with you in a second.","in/within seconds They had finished within seconds.","He scored again in the dying seconds (= the last few seconds) of the game.","He got out with seconds to spare.","Wait a second—this letter's been sent to me by mistake.","This will only take a second.","I hesitated for a second before speaking.","For a second I thought you were my mother.","For a heart-stopping second he thought he had lost his keys."],"opposite":"","synonyms":""},{"def":"a unit for measuring angles. There are 60 seconds in one minute.","examples":["1° 6′ 10″ (= one degree, six minutes and ten seconds)"],"opposite":"","synonyms":""},{"def":"a second amount of the same food that you have just eaten","examples":["Seconds, anybody?"],"opposite":"","synonyms":""},{"def":"an item that is sold at a lower price than usual because it is not perfect","examples":[],"opposite":"","synonyms":""},{"def":"one of six or seven positions of the gears in a vehicle","examples":["to change down from third to second","in second When it's icy, move off in second."],"opposite":"","synonyms":""},{"def":"a level of university degree at British universities. An upper second is a good degree and a lower second is average.","examples":["He got a good second in history."],"opposite":"","synonyms":""},{"def":"a person whose role is to help and support somebody else, for example in a boxing match or in a formal duel in the past","examples":[],"opposite":"","synonyms":""},{"def":"used to ask somebody to wait for a short time","examples":["‘Is Mr Burns available?’ ‘Just a second, please, I'll check.’"],"opposite":"","synonyms":""},{"def":"to wait for a short time","examples":["Can you wait a second while I make a call?","Hey! Wait a minute! I'll come with you!"],"opposite":"","synonyms":""},{"def":"used when you have just noticed or remembered something, or had a sudden idea","examples":["Wait a minute—this isn't the right key."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"just a minute/moment/second","def":"used to ask somebody to wait for a short time","examples":["‘Is Mr Burns available?’ ‘Just a second, please, I'll check.’"]},{"idiom":"wait a minute/moment/second","def":"to wait for a short time","examples":["Can you wait a second while I make a call?","Hey! Wait a minute! I'll come with you!","Wait a minute—this isn't the right key."]}],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to state officially at a meeting that you support another person’s idea, suggestion, etc. so that it can be discussed and/or voted on","examples":["Any proposal must be seconded by two other members of the committee.","(informal) ‘Thank God that's finished.’ ‘I'll second that! (= I agree)’","Davis seconded the motion, which was carried unanimously."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sec/secon/second__us_2.mp3","phonsUS":"/sɪˈkɑːnd/","level":"","meanings":[{"def":"to send an employee to another department, office, etc. in order to do a different job for a short period of time","examples":["be seconded (from something) (to something) Each year two teachers are seconded to industry for six months."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]