[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sec/secre/secret__us_1.mp3","phonsUS":"/ˈsiːkrət/","level":"A2","meanings":[{"def":"known about by only a few people; kept hidden from others","examples":["secret information/meetings/talks","They belong to an age-old secret society.","secret from somebody He tried to keep it secret from his family.","Details of the proposals remain secret.","a secret passage leading to the beach","The two candidates were chosen by a secret ballot (= in which nobody knows how you voted) of MPs.","He's a natural salesman, whose secret weapon is the sheer confidence and optimism that he exudes.","The group is on a highly secret mission.","Secret police documents were leaked to the press.","The scandal was kept secret from the French public for 18 years.","What could be so secret what it had to stay hidden?","The ceasefire was agreed following secret talks between the two leaders.","revealing the text of the hitherto secret treaty","They managed to keep the party more or less secret from Christine."],"opposite":"","synonyms":""},{"def":"used to describe actions and behaviour that you do not tell other people about","examples":["He's a secret drinker.","I didn't know you were a secret football fan.","her secret fears","Perhaps he has secret hopes that she'll go back to him."],"opposite":"","synonyms":""},{"def":"liking to have secrets that other people do not know about; showing this","examples":["They were so secret about everything.","Jessica caught a secret smile flitting between the two of them."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["top secret","secret agent","secret police","Secret Santa","trade secret","official secret","secret service","Secret Intelligence Service","the secret","secret agents","Secret Santas","secret services","in secret","a guilty secret","be an open secret"]},{"pos":"noun","level":"A2","meanings":[{"def":"something that is known about by only a few people and not told to others","examples":["Can you keep a secret?","She will not reveal his secret.","The location of the ship is a closely guarded secret.","This bar is one of central London's best/worst kept secrets.","Shall we let him in on (= tell him) the secret?","He made no secret of his ambition (= he didn't try to hide it).","It's no secret that the past few years have been challenging for the industry.","dark secrets from his past","The dirty little secret of gaming is how much time you spend not having fun.","Let me tell you a secret.","How did the secret get out?","I have no secrets from you.","Their relationship remained a secret.","That evening she had revealed many of her innermost secrets.","He refuses to make any secret of his political allegiances.","There was some secret about the source of his wealth.","Uncle Charlie hides a dark secret.","a charming museum that is one of the city's best-kept secrets"],"opposite":"","synonyms":""},{"def":"the best or only way to achieve something; the way a particular person achieves something","examples":["She still looks so young. What's her secret?","secret of something Careful planning is the secret of success.","secret to doing something These animals may hold the secret to combating the virus.","secret to something The secret to happiness is love.","What is the secret to their success?","She revealed the secret behind her extraordinary success.","the secrets of staying healthy"],"opposite":"","synonyms":""},{"def":"a thing that is not yet fully understood or that is difficult to understand","examples":["the secrets of the universe","He spent much of his childhood here, learning the secrets of the woods."],"opposite":"","synonyms":""},{"def":"if something is an open secret, many people know about it, although it is supposed to be a secret","examples":[],"opposite":"","synonyms":""},{"def":"a secret that somebody feels ashamed about","examples":[],"opposite":"","synonyms":""},{"def":"without other people knowing about it","examples":["The meeting was held in secret.","She admired him, in secret of course.","The film stars were married in secret to avoid publicity."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be an open secret","def":"if something is an open secret, many people know about it, although it is supposed to be a secret","examples":[]},{"idiom":"a guilty secret","def":"a secret that somebody feels ashamed about","examples":[]},{"idiom":"in secret","def":"without other people knowing about it","examples":["The meeting was held in secret.","She admired him, in secret of course.","The film stars were married in secret to avoid publicity."]}],"phrasal":[],"related":[]}]