[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sec/secti/section__us_2.mp3","phonsUS":"/ˈsekʃn/","level":"A1","meanings":[{"def":"any of the parts into which something is divided","examples":["section of something That section of the road is still closed.","the tail section of the plane","The library has a large biology section.","Large sections of the forest have been destroyed by acid rain.","You'll find the book in the music section."],"opposite":"","synonyms":""},{"def":"a separate part of a structure from which the whole can be put together","examples":["The shed comes in sections that you assemble yourself."],"opposite":"","synonyms":""},{"def":"a separate part of a document, book, etc.","examples":["These issues will be discussed more fully in the next section.","the sports section of the newspaper","The report has a section on accidents at work.","The book is divided into four sections.","It is difficult to navigate from one section of the site to another.","Feel free to add your own ideas in the comments section.","the previous/following/final section","Section by section, this essay examines and explores the key terms.","I skipped the section on garden design.","The book is divided into chapters, sections, and sub-sections.","The new edition of the dictionary adds a section on phrasal verbs.","The case was the first prosecution under Section 3A of the Road Traffic Act 1988.","Section 3 applies to clauses which restrict liability."],"opposite":"","synonyms":""},{"def":"a separate group within a larger group of people","examples":["section of something an issue that will affect large sections of the population","the brass section of an orchestra","an area populated largely by the poorer sections of society","The way he's been treated by certain sections of the media is despicable.","We've had meetings with all sections of the community."],"opposite":"","synonyms":""},{"def":"a department in an organization, institution, etc.","examples":["He's the director of the finance section.","the section of the company dealing with customer services","He works in the embassy's political section.","Which section of the company are you working in?","The completed forms are passed to the personnel section for verification."],"opposite":"","synonyms":""},{"def":"a district of a town, city or county","examples":["the Dorchester section of Boston","one of the city’s most affluent sections"],"opposite":"","synonyms":""},{"def":"a measure of land, equal to one square mile","examples":[],"opposite":"","synonyms":""},{"def":"a drawing or diagram of something as it would look if it were cut from top to bottom or from one side to the other","examples":["section through something The illustration shows a section through a leaf.","in section The architect drew the house in section."],"opposite":"","synonyms":""},{"def":"the act of cutting or separating something in an operation","examples":["The surgeon performed a section (= made a cut) on the vein."],"opposite":"","synonyms":""},{"def":"a very thin flat piece cut from body tissue to be looked at under a microscope","examples":["to examine a section from the kidney"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["C-section","section off","conic section","cross section","Section Eight","caesarean section","cesarean section","golden section","rhythm section","caesarian section","cesarian section","percussion section","section something"]},{"pos":"verb","level":"","meanings":[{"def":"to divide body tissue by cutting","examples":[],"opposite":"","synonyms":""},{"def":"to cut animal or plant tissue into thin slices in order to look at it under a microscope","examples":[],"opposite":"","synonyms":""},{"def":"to officially order a mentally ill person to go and receive treatment in a psychiatric hospital, using a law that can force them to stay there until they are successfully treated","examples":["be sectioned A few hours before he committed suicide he had been sectioned under the Mental Health Act."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["section off"],"related":[]}]