[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sec/secur/secure__us_2.mp3","phonsUS":"/sɪˈkjʊr/","level":"B2","meanings":[{"def":"to obtain or achieve something, especially when this means using a lot of effort","examples":["secure something to secure a contract/deal/funding","The team managed to secure a place in the finals.","The team were unable to secure a victory.","She secured 2 000 votes.","The delegation has secured the promise of a ceasefire.","A production company secured the film rights to the biography.","They are contract workers unable to secure a full-time position.","Retailers will need to pay a higher price in order to secure supplies.","secure something for somebody/something/yourself He secured a place for himself at law school.","secure somebody/something/yourself something He secured himself a place at law school.","The party won 399 seats, thereby securing a majority in the Assembly.","They failed to secure the release of the prisoners.","This could improve your chances of securing employment.","Victory was not going to be easily secured.","He's just secured a $5 million contract."],"opposite":"","synonyms":""},{"def":"to attach or fasten something so that it does not move","examples":["secure something to something She secured the rope firmly to the back of the car.","secure something He secured the boat with a rope.","The tables on board were secured firmly to the floor.","The crates had not been firmly secured to the truck.","The rail was secured with bolts.","Wrap a bandage around the arm and secure it with tape or a pin."],"opposite":"","synonyms":""},{"def":"to protect something so that it is safe and difficult to attack or damage","examples":["secure something against something to secure a property against intruders","secure something from something Have you properly secured your computer from viral attack?","(figurative) a savings plan that will secure your child’s future","secure something We must all do everything we can to secure our borders.","The windows were secured with locks and bars.","No home can be completely secured against intruders.","The government has deployed 35 000 troops in an effort to secure the border."],"opposite":"","synonyms":""},{"def":"to legally agree to give somebody property or goods that are worth the same amount as the money that you have borrowed from them, if you are unable to pay the money back","examples":["a loan secured on the house"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["secure training centre","Secure Training Centre","secure training centres"]},{"pos":"adjective","level":"B2","meanings":[{"def":"likely to continue or be successful for a long time","examples":["a secure job/income","It's not a very secure way to make a living.","The future of the company looks secure."],"opposite":"insecure","synonyms":""},{"def":"where somebody/something cannot be harmed; that cannot be affected or harmed by something","examples":["It's important to keep your documents secure.","Civilians are being evacuated to a secure location.","Parents are primarily concerned with leaving their children in a safe, secure environment.","secure against/from something Information must be stored so that it is secure from accidental deletion.","Police have warned the public to keep valuables secure.","The roof was secure against the coming winter rains."],"opposite":"","synonyms":""},{"def":"feeling happy and confident about yourself or a particular situation","examples":["At last they were able to feel secure about the future.","She finished the match, secure in the knowledge that she was through to the next round.","She felt safe and secure in his arms.","I would like to be financially secure by age 55."],"opposite":"insecure","synonyms":""},{"def":"guarded and/or made stronger so that it is difficult for people to enter or leave","examples":["Check that all windows and doors have been made as secure as possible.","a secure unit for child offenders","The building is secure against intruders."],"opposite":"insecure","synonyms":""},{"def":"not likely to move, fall down, etc.","examples":["The aerial doesn't look very secure to me.","It was difficult to maintain a secure foothold on the ice.","(figurative) Our relationship was now on a more secure footing."],"opposite":"insecure","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]