[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sec/secur/security__us_2.mp3","phonsUS":"/sɪˈkjʊrəti/","level":"B1","meanings":[{"def":"the activities involved in protecting a country, building or person against attack, danger, etc.","examples":["national/homeland security (= the defence of a country)","airport security officers","security against something The bars are to provide security against break-ins.","They carried out security checks at the airport.","Passwords are a very important security measure.","The visit took place amidst tight security (= the use of many police officers).","the security forces/services (= the police, army, etc.)","a high/maximum security prison (= for dangerous criminals)","a security alert/threat/situation","a security adviser/expert","The criminals were caught (= filmed) on a security video.","to tighten/improve/enhance security","The team abandoned its tour due to security concerns.","The two countries agreed to work together to strengthen border security.","We will protect our national security.","For security reasons, passengers are requested not to leave any luggage unattended.","Screw windows to the frame for maximum security.","The leaking of state secrets has compromised national security.","He lost his security clearance because he failed a lie-detector test.","The demonstrations were brutally broken up by the security forces.","Soldiers stand at security checkpoints."],"opposite":"","synonyms":""},{"def":"a place at an airport where you go after your passport has been checked so that officials can find out if you are carrying illegal drugs or weapons","examples":["My bag was emptied and searched when I went through security.","It took ages to clear security and reach the departure lounge.","Airport security might decide you're unfit to fly."],"opposite":"","synonyms":""},{"def":"the department of a large company or organization that deals with the protection of its buildings, equipment and staff","examples":["Security was/were called to the incident."],"opposite":"","synonyms":""},{"def":"protection against something bad that might happen in the future","examples":["financial security","Which type of investment offers the greatest security?","This system provides basic security for employees."],"opposite":"","synonyms":""},{"def":"the state of feeling happy and safe from danger or worry","examples":["the security of a loving family life","She'd allowed herself to be lulled into a false sense of security (= a feeling that she was safe when in fact she was in danger).","He gave her the emotional security she needed.","They have the security of a good home."],"opposite":"","synonyms":""},{"def":"a valuable item, such as a house, that you agree to give to somebody if you are unable to pay back the money that you have borrowed from them","examples":["as security for something His home and business are being held as security for the loan.","She pledged her jewellery as security for a £50 000 loan.","His father agreed to stand security for his son's house-purchase loan.","The bank will make a loan against the security of the lender's house."],"opposite":"","synonyms":""},{"def":"documents proving that somebody is the owner of shares, etc. in a particular company","examples":["government securities","a securities lawyer with Tinson and Zelkins","the faltering securities market","Wall Street securities firms"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["food security","high-security","job security","security hole","security risk","homeland security","security blanket","security deposit","security forces","security guard","Security Service","social security","old age security","information security","Security Council","Social Security number","minimum security prison","National Security Council","Canadian Security Intelligence Service","Department of Homeland Security"]}]