[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/see/see__/see__us_1.mp3","phonsUS":"/siː/","level":"A1","meanings":[{"def":"to become aware of somebody/something by using your eyes","examples":["see somebody/something She looked for him but couldn't see him in the crowd.","I looked out of the window but saw nothing.","The opera was the place to see and be seen (= by other important or fashionable people).","I would like to see some proof of this statement.","The divers reported seeing a lot of sharks.","He recalls seeing his father sitting at the kitchen table.","I've never seen anything like this!","see (that)… He could see (that) she had been crying.","see what, how, etc… Did you see what happened?","If you watch carefully, you’ll see how it is done.","see somebody/something + adj. I hate to see you unhappy.","see somebody/something doing something She was seen running away from the scene of the crime.","see somebody/something do something I saw you put the key in your pocket.","somebody/something is seen to do something He was seen to enter the building about the time the crime was committed.","(figurative) The government not only has to do something, it must be seen to be doing something (= people must be aware that it is doing something).","see + adv./prep. The walls were too high to see over.","The pirate was a renowned terror of the eastern seas.","It's a secret—make sure nobody sees!","She was eager to seize any opportunity that was offered.","She looked for him but couldn’t see him in the crowd.","He could see (that) she had been crying.","I’ve just spotted a mistake on the front cover.","She caught sight of a car in the distance.","He caught a glimpse of himself in the mirror.","He’d glimpsed her through the window as he passed.","A dolphin? Oh, let me see!","I can't wait to see his face!","I could see the boat clearly now.","We could just see the hotel in the distance.","The star is bright enough to see with the naked eye.","I know it's hard to believe but I saw it with my own eyes.","He was surprised to see Lucy standing there.","I looked up, only to see Tommy chatting to someone.","I'd love to see her win the gold medal.","It's nice to see the children playing together.","He didn't live to see his grandchildren."],"opposite":"","synonyms":"see"},{"def":"to have or use the power of sight","examples":["She will never see again (= she has become blind).","On a clear day you can see for miles from here.","see to do something It was getting dark and I couldn't see to read.","I could hardly see because of the smoke."],"opposite":"","synonyms":""},{"def":"to watch a game, television programme, performance, etc.","examples":["see something Did you see that programme on Brazil last night?","In the evening we went to see a movie.","Fifty thousand people saw the match.","I finally got to see them in concert.","I really want to see this film now.","This performance was very beautiful, like nothing I had ever seen before.","I remember seeing that movie when I was a kid.","see something on something It's not the sort of thing you see on TV that often.","This film really deserves to be seen on a big screen.","If you look carefully you can just see our house from here.","She looked at me and smiled.","to watch television","Watch what I do, then you try.","In the evening we went to see a movie.","People came from all over the world to view her work.","The patients were observed over a period of several months."],"opposite":"","synonyms":"look"},{"def":"to look at something in order to find information; to go to somebody in order to ask for help or information","examples":["see something/somebody See page 158.","If you missed the session, see a member of staff for advice.","See Table 2 for details.","See also paragraphs 6.5 to 6.9 above.","see + adv./prep. See above/below for a breakdown of the costs.","See over (= the next page) for details."],"opposite":"","synonyms":""},{"def":"to be near and recognize somebody; to meet somebody by chance","examples":["Guess who I saw at the party last night!","Aren't you pleased to see me?","It's so good to see you!"],"opposite":"","synonyms":""},{"def":"to visit somebody/something","examples":["Come and see us again soon.","Around 200  000 visitors each year come to see the summer palace.","Veronica came to see him in prison.","He said he'd been to see his sister."],"opposite":"","synonyms":""},{"def":"to have a meeting with somebody","examples":["see somebody about something You ought to see a doctor about that cough.","What is it you want to see me about?","see somebody I can only see you for five minutes.","When was the last time you saw a dentist?","She's gone to see the mechanic about getting her car repaired.","Logan came around to see me about a job.","I'm here to see Lisa Daniels.","He came over to see me after my surgery."],"opposite":"","synonyms":""},{"def":"to spend time with somebody","examples":["Are you seeing anyone (= having a romantic relationship with anyone)?","They've been seeing a lot of each other (= spending a lot of time together) recently.","We haven't seen much of Liz lately.","He has changed since his family last saw him."],"opposite":"","synonyms":""},{"def":"to understand something","examples":["‘It opens like this.’ ‘Oh, I see.’","see something He didn't see the joke.","I don't think she saw the point of the story.","He changed the way we see the world around us.","to see a/the need for something","I see no need to involve the law.","I can see both sides of the argument.","They saw nothing wrong with having three cars.","Make Lydia see reason (= be sensible), will you?","see (that)… Can’t you see (that) he’s taking advantage of you?","I don't see that it matters what Josh thinks.","see what, why, etc… ‘It's broken.’ ‘Oh yes, I see what you mean.’","‘Can we go swimming?’ ‘I don't see why not (= yes, you can).’","They will be able to see what really happened there.","I don’t understand the instructions.","Doctors still don’t understand much about the disease.","‘It opens like this.’ ‘Oh, I see.’","Oh yes, I see what you mean.","She didn’t get the joke.","I don’t get you.","Sorry—I don’t quite follow.","The plot is almost impossible to follow.","They failed to grasp the importance of his words.","The concept of infinity is almost impossible for the human mind to comprehend.","I can see why you were so angry about it.","I don't see why she should get more money than the others.","I fail to see how this idea will help anyone.","It is difficult to see how to get around this problem.","He doesn't see how important this is.","I don't quite see what he's getting at.","I don't think she saw the point of the story."],"opposite":"","synonyms":"understand"},{"def":"to have an opinion of something","examples":["I see things differently now.","Try to see things from her point of view.","The way I see it, you have three main problems.","As far as I can see (= in my opinion), you've done nothing wrong.","Lack of money is the main problem, as I see it (= in my opinion).","She is in love with him but Darren sees their relationship in a different light (= has a different opinion)."],"opposite":"","synonyms":"regard"},{"def":"to consider something as a future possibility; to imagine somebody/something as something","examples":["see somebody/something/yourself doing something I can't see her changing her mind.","I can't really see myself working in a lab all day.","see somebody/something/yourself as something His colleagues see him as a future director.","She was quiet and withdrawn and never saw herself as a dancer.","The house was just as she had imagined it.","We couldn’t think where you’d gone.","Just think—this time tomorrow we’ll be lying on a beach.","I can’t see her changing her mind.","His colleagues see him as a future director.","I don’t envisage working with him again.","They envision an equal society, free from poverty and disease."],"opposite":"","synonyms":"imagine"},{"def":"to find out something by looking, asking or waiting","examples":["‘Has the mail come yet?’ ‘I'll just go and see.’","‘Is he going to get better?’ ‘I don't know, we'll just have to wait and see.’","We'll have a great time, you'll see.","see what, how, etc… Go and see what the kids are doing, will you?","We'll have to see how it goes.","It will be interesting to see what happens.","see (that)… I see (that) interest rates are going up again.","it is seen that… It can be seen that certain groups are more at risk than others.","He came over to see what was going on.","I want to see how they'll react.","She turned to see who it was.","I'm glad to see that you're keeping well.","You can see at a glance if all is well."],"opposite":"","synonyms":""},{"def":"to find out or decide something by thinking or considering","examples":["‘Will you be able to help us?’ ‘I don't know, I'll have to see.’","‘Can I go to the party?’ ‘We'll see (= I'll decide later).’","see what, whether, etc… I'll see what I can do to help."],"opposite":"","synonyms":""},{"def":"to make sure that you do something or that something is done","examples":["See that all the doors are locked before you leave.","Could you see that the kids are in bed by 8 o'clock?"],"opposite":"","synonyms":""},{"def":"to experience or suffer something","examples":["He has seen a great deal in his long life.","I hope I never live to see the day when computers finally replace books.","It didn't surprise her—she had seen it all before.","He saw first-hand the impact of colonialism.","We expect to see an increase of 50–60%."],"opposite":"","synonyms":""},{"def":"to be the time when an event happens","examples":["Next year sees the centenary of Saint-Saëns' death.","The twentieth century saw dramatic changes in most areas of life."],"opposite":"","synonyms":""},{"def":"to be the place where an event happens","examples":["This stadium has seen many thrilling football games."],"opposite":"","synonyms":""},{"def":"to go with somebody to help or protect them","examples":["I saw the old lady across (= helped her cross) the road.","May I see you home (= go with you as far as your house)?","My secretary will see you out (= show you the way out of the building)."],"opposite":"","synonyms":""},{"def":"that can be seen clearly; in a way that can be seen clearly","examples":[],"opposite":"","synonyms":""},{"def":"used when you are thinking or trying to remember something","examples":["Now let me see—how old is she now?"],"opposite":"","synonyms":""},{"def":"to realize that there is going to be a problem before it happens","examples":["We should have seen it coming. There was no way he could keep going under all that pressure."],"opposite":"","synonyms":""},{"def":"to realize that somebody/something is not as good, pleasant, etc. as they/it seem","examples":[],"opposite":"","synonyms":""},{"def":"to find out or look at something yourself in order to be sure that what somebody is saying is true","examples":["If you don't believe me, go and see for yourself!"],"opposite":"","synonyms":""},{"def":"because of the fact that…","examples":["Seeing that he's been off sick all week he's unlikely to come."],"opposite":"","synonyms":""},{"def":"goodbye","examples":["I'd better be going now. See you!"],"opposite":"","synonyms":""},{"def":"used when you are explaining something","examples":["You see, the thing is, we won't be finished before Friday."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"for all (the world) to see","def":"that can be seen clearly; in a way that can be seen clearly","examples":[]},{"idiom":"let me see/let’s see","def":"used when you are thinking or trying to remember something","examples":["Now let me see—how old is she now?"]},{"idiom":"see something coming","def":"to realize that there is going to be a problem before it happens","examples":["We should have seen it coming. There was no way he could keep going under all that pressure."]},{"idiom":"see somebody/something for what they are/it is","def":"to realize that somebody/something is not as good, pleasant, etc. as they/it seem","examples":[]},{"idiom":"see for yourself","def":"to find out or look at something yourself in order to be sure that what somebody is saying is true","examples":["If you don't believe me, go and see for yourself!"]},{"idiom":"seeing that…","def":"because of the fact that…","examples":["Seeing that he's been off sick all week he's unlikely to come."]},{"idiom":"see you (around/later/soon) | (I’ll) be seeing you","def":"goodbye","examples":["I'd better be going now. See you!"]},{"idiom":"you see","def":"used when you are explaining something","examples":["You see, the thing is, we won't be finished before Friday."]}],"phrasal":["see about","see in","see off","see out","see over","see through","see to","see to it that"],"related":["see in","see to","look-see","see-saw","see off","see out","see over","see about","see through","see-through","Holy See","see to it that","see to something","see the writing on the wall","what you see is what you get","see about something","see somebody"]},{"pos":"noun","level":"","meanings":[{"def":"the district or office of a bishop or an archbishop","examples":["the Holy See (= the office of the Pope)"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]