[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/see/seek_/seek__us_1.mp3","phonsUS":"/siːk/","level":"B2","meanings":[{"def":"to look for something/somebody","examples":["seek something/somebody Drivers are advised to seek alternative routes.","Police are not seeking anyone else in connection with the deaths.","seek for something/somebody (British English) They sought in vain for somewhere to shelter.","Police are seeking witnesses to the accident.","We're seeking for alternative materials which might bring the cost down."],"opposite":"","synonyms":""},{"def":"to ask somebody for something; to try to obtain or achieve something","examples":["seek something I think it's time we sought legal advice.","They sought refuge in the mountain villages.","She fled the country and is now seeking asylum in Sweden.","The pilot sought permission to land.","EU citizens have the right to seek employment in any member state.","He has not sought medical treatment for his condition.","She was determined to seek revenge.","seek something from somebody She managed to calm him down and seek help from a neighbour.","We need to seek approval from the local council.","seek for something/somebody (British English) They came seeking for the truth.","He intends to seek custody of the children.","We are currently seeking new ways of expanding our membership.","I think you should seek guidance from your lawyer on this matter.","I advise you to seek assistance from the police.","to seek funding for a project","He was desperately seeking a way to see her again.","Employers are seeking further clarification of the proposals.","It is best to seek a compromise rather than a perfect solution.","Lawyers are seeking an out-of-court settlement.","The police are seeking independent confirmation of certain details of the story.","They are now seeking endorsement for their ideas.","To receive the benefit, you have to be actively seeking work.","They sought comfort in each other."],"opposite":"","synonyms":""},{"def":"to try to do something","examples":["He sought to establish himself as a writer.","They quickly sought to distance themselves from the protesters.","They initially sought to blame others for the disaster.","He encouraged governments to adopt a more forceful approach in seeking to improve the environment.","The research project will seek to find an answer to this question.","The state has actively sought to develop tourism."],"opposite":"","synonyms":""},{"def":"looking for or trying to get the thing mentioned; the activity of doing this","examples":["attention-seeking behaviour","Voluntary work can provide a framework for job-seeking."],"opposite":"","synonyms":""},{"def":"to try to find a way to become rich, especially by going to another place","examples":["Many emigrated to Australia to seek their fortune."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"seek your fortune","def":"to try to find a way to become rich, especially by going to another place","examples":["Many emigrated to Australia to seek their fortune."]}],"phrasal":["seek out"],"related":["seek out","seek time","hide-and-seek","seek times","hide-and-go-seek","seek somebody/something out","seek your fortune"]}]