[{"pos":"linking verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/see/seem_/seem__us_1.mp3","phonsUS":"/siːm/","level":"A2","meanings":[{"def":"to give the impression of being or doing something","examples":["+ adj. You seem happy.","Do whatever seems best to you.","This may seem obvious to you.","It seems clear that there has been a mistake.","It seems likely that they will lose the election.","Strange as it may seem, exactly the same thing happened to me.","+ noun He seems a nice man.","seem to be something She seems to be a smart woman.","You seem to be nervous.","People aren’t always what they seem to be.","seem like something It seemed like a good idea at the time.","seem as though… It always seemed as though they would get married.","‘He'll be there, then?’ ‘So it seems (= people say so).’","it seems to somebody (that)… It seems to me that teachers have to work pretty hard.","It must have seemed to him that he was safe.","it seems that… It seems that they know what they're doing.","seem to do/have something They seem to know what they're doing."],"opposite":"","synonyms":""},{"def":"used to make what you say about your thoughts, feelings or actions less strong","examples":["I seem to have left my book at home.","I can't seem to (= I've tried, but I can't) get started today."],"opposite":"","synonyms":""},{"def":"used to suggest that something is true when you are not certain or when you want to be polite","examples":["seem (that)… It would seem that we all agree.","This last point, it seems to me, is particularly important.","+ adj. It seems only reasonable to ask students to buy a dictionary.","It is vital that more is done to prevent the illegal trade in wild animals.","(Compare: We have to do more to stop people trading wild animals illegally.)","It is clear that more needs to be done to protect biodiversity.","(Compare: We clearly need to do more to protect biodiversity.)","It is unfortunate that the practice of keeping monkeys as pets still continues.","(Compare: It’s absolutely terrible that people still keep monkeys as pets.)","It is difficult for many people to understand the reasons why certain individuals choose to hunt animals for sport.","(Compare: I can’t understand why anyone would want to kill animals for fun.)","Unfortunately, it would seem that not enough is being done to support tiger conservation.","(Compare: Governments aren’t doing enough to help tiger conservation.)","There is no doubt that the greatest threat to polar bears comes from global warming.","(Compare: I believe that the greatest threat…)","In my opinion, everyone should have some understanding of science.","Everyone should, in my opinion, have some understanding of science.","It seems to me that many people in this country have a poor understanding of science.","This is, in my view, the result of a failure of the scientific community to get its message across.","Another reason why so many people have such a poor understanding of science is, I believe, the lack of adequate funding for science in schools.","Smith argues that science is separate from culture. My own view is that science belongs with literature, art, philosophy and religion as an integral part of our culture.","In this writer’s opinion, the more the public know about science, the less they will fear and distrust it.","Most cybercrime involves traditional crimes, such as theft and fraud, being committed in new ways. Phishing is perhaps/possibly/probably the best-known example of this.","It seems/appears that the more personal data which organizations collect, the more opportunity there is for this data to be lost or stolen.","It seems clear that introducing national ID cards would do little to prevent identity theft.","It could be argued that the introduction of national ID cards might actually make identity theft easier.","It is possible that/It may be that the only way to protect ourselves against DNA identity theft is to avoid the creation of national DNA databases."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["be, seem, etc. herself","be, seem, etc. himself"]}]