[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sei/seize/seize__us_1.mp3","phonsUS":"/siːz/","level":"C1","meanings":[{"def":"to take somebody/something in your hand suddenly and using force","examples":["seize something from somebody She tried to seize the gun from him.","seize somebody/something He seized her by the arm.","She seized hold of my hand.","He seized the book from her hand.","The wrestlers try to seize hold of each other."],"opposite":"","synonyms":""},{"def":"to take control of a place or situation, often suddenly and violently","examples":["They seized the airport in a surprise attack.","The army has seized control of the country.","He seized power in a military coup."],"opposite":"","synonyms":""},{"def":"to arrest or capture somebody","examples":["The men were seized as they left the building.","Terrorists have seized five hostages.","He was immediately seized and thrown into prison.","A Briton has been seized by border guards and jailed for eight years."],"opposite":"","synonyms":""},{"def":"to take illegal or stolen goods away from somebody","examples":["A large quantity of drugs was seized during the raid.","We have the legal right to seize his property."],"opposite":"","synonyms":""},{"def":"to be quick to make use of a chance, an opportunity, etc.","examples":["The party seized the initiative with both hands (= quickly and with enthusiasm).","She promptly seized the opportunity his absence gave her.","The pirate was a renowned terror of the eastern seas.","It's a secret—make sure nobody sees!","She was eager to seize any opportunity that was offered."],"opposite":"","synonyms":""},{"def":"to affect somebody suddenly and deeply","examples":["Panic seized her.","He was seized by curiosity."],"opposite":"","synonyms":""},{"def":"if a machine seizes, it no longer works because the parts are stuck and cannot move","examples":[],"opposite":"","synonyms":""},{"def":"if a part of your body seizes, you are unable to move it easily and it is often painful","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["seize on","seize up","seize upon"],"related":["seize on","seize up","seize upon","seize on/upon","seize on something","seize upon something","take, claim, seize, etc. the moral high ground"]}]