[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sel/selec/selection__us_2.mp3","phonsUS":"/sɪˈlekʃn/","level":"B2","meanings":[{"def":"the process of choosing somebody/something from a group of people or things, usually according to a system","examples":["She took a long time to make her selection.","The final team selection will be made tomorrow.","the random selection of numbers","selection criteria","the selection process","Artists are chosen by a selection committee.","Jury selection in the cases is due to begin next week.","her selection for the England squad","his unexpected selection as party leader","Natural selection is a key element of Darwin's theory of evolution.","Selection is based on standards of quality.","She hopes to win selection for the Olympic 800 metres team.","his selection as candidate for the Green Party","the careful selection of building materials","You have to go through a tough selection process."],"opposite":"","synonyms":""},{"def":"a number of people or things that have been chosen from a larger group","examples":["selection of something A selection of readers' comments is published below.","selection from something The orchestra played selections from Hollywood musicals.","She’s the obvious choice for the job.","Which one’s your favourite?","Tastes and preferences vary from individual to individual.","A selection of reader’s comments are published below.","She was his pick for best actress.","The catalogue includes a selection of his poetry.","We interviewed a random selection of teenagers.","a selection of hits from well-known musicals"],"opposite":"","synonyms":"choice"},{"def":"a collection of things from which something can be chosen","examples":["selection of something The showroom has a wide selection of kitchens.","The wine selection isn't bad.","Their website features a large selection of photographs.","We offer a broad selection of products.","You'll find a good selection of paints at this store."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["natural selection","self-selection","selection committee"]}]