[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sel/selec/select__us_1.mp3","phonsUS":"/sɪˈlekt/","level":"B2","meanings":[{"def":"to choose somebody/something from a group of people or things, usually according to a system","examples":["select somebody/something for something He hasn't been selected for the team.","All our hotels have been carefully selected for the excellent value they provide.","select somebody/something as something She was selected as the parliamentary candidate for Bath.","select somebody/something a randomly selected sample of 23 schools","selected poems of T.S. Eliot","This model is available at selected stores only.","She selected an apple from the fruit bowl.","It is important to select a software package that suits your requirements.","select somebody/something to do something Six theatre companies have been selected to take part in this year's festival.","select what, which, etc. Select what you want from the options available.","select from something They could select from a range of choices depending on their interests and skills.","You choose—I can’t decide.","He was selected for the team.","a randomly selected sample of 23 schools","She picked the best cake for herself.","We’re still trying to decide on a venue.","After graduating she opted for a career in music.","After a lot of thought, I opted against buying a motorbike.","I think I’ll go for the fruit salad.","You can select goods from our catalogue.","Students select modules according to their interests.","The program automatically selects and stores the most frequently used data.","The winning entry will be selected at random by computer.","They were selected as finalists for this year's awards.","They were selected on the basis of size.","This anthology is well selected and presented.","Although this was a very highly selected study group, the results were in agreement with our findings."],"opposite":"","synonyms":"choose"},{"def":"to mark something on a computer screen; to choose something, especially from a menu","examples":["Select the text you want to format by holding down the left button on your mouse.","Select ‘New Mail’ from the ‘Send’ menu."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["select committee","select committees"]},{"pos":"adjective","level":"","meanings":[{"def":"carefully chosen as the best out of a larger group of people or things","examples":["a select wine list","Only a select few (= a small number of people) have been invited to the wedding.","It was a very fashionable event with a select audience."],"opposite":"","synonyms":""},{"def":"used by people who have a lot of money or a high social position","examples":["They live in a very select area.","a select club"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]