[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sen/send_/send__us_1.mp3","phonsUS":"/send/","level":"A1","meanings":[{"def":"to make something go or be taken to a place, especially by post, email, radio, etc.","examples":["send something She sent a letter of support.","Let me just send this email.","(British English) to send something by post","(North American English) to send something by mail","I sent the package by airmail.","Users were unable to send or receive emails for two days.","send something to somebody/something Have you sent a Christmas card to your mother yet?","A radio signal was sent to the spacecraft.","send somebody something Have you sent your mother a Christmas card yet?","I'll send you a text message.","Can you send me a link to the website?","He sent me a copy of his new book.","send something back The laptop was faulty so I sent it back to the manufacturers.","Not one cent of their profits goes to charity.","The delicious scent of freshly baked bread floated to his window.","I sent her a thank you letter."],"opposite":"","synonyms":""},{"def":"to tell somebody something by sending them a message","examples":["send something My parents send their love.","send something to somebody Henry sent his regards to you.","(figurative) What sort of message is that sending to young people?","send somebody something He sent me word to come.","send something (that)… She sent word (that) she could not come.","send to do something (formal) She sent to say that she was coming home."],"opposite":"","synonyms":""},{"def":"to tell somebody to go somewhere or to do something; to arrange for somebody to go somewhere","examples":["send somebody Ed couldn't make it so they sent me instead.","send somebody + adv./prep. She sent the kids to bed early.","The judge sent her to prison for two years.","He was sent away to boarding school at the age of eight.","The government has agreed to send 3 000 troops to the region.","We are being sent on a training course next month.","Children were sent home from school because it was just too hot.","send somebody to do something I've sent Tom to buy some milk."],"opposite":"","synonyms":""},{"def":"to make something/somebody move quickly or suddenly","examples":["send something/somebody doing something Every step he took sent the pain shooting up his leg.","The punch sent him flying.","send something/somebody + adv./prep. The report sent share prices down a further 8p."],"opposite":"","synonyms":""},{"def":"to make somebody behave or react in a particular way","examples":["send somebody to something Her music always sends me to sleep.","send somebody into something Her account of the visit sent us into fits of laughter.","send somebody + adj. All the publicity nearly sent him crazy."],"opposite":"","synonyms":""},{"def":"to tell somebody clearly or rudely to go away","examples":["She tried to interfere but I sent her packing."],"opposite":"","synonyms":""},{"def":"used to say that you should accept an unpleasant situation or event because you cannot change it","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"send somebody packing","def":"to tell somebody clearly or rudely to go away","examples":["She tried to interfere but I sent her packing."]},{"idiom":"these things are sent to try us","def":"used to say that you should accept an unpleasant situation or event because you cannot change it","examples":[]}],"phrasal":["send away","send down","send for","send forth","send in","send off","send on","send out","send out for","send up"],"related":["SEND","send for","send in","send off","send-off","send on","send out","send up","send-up","send away","send down","send forth","send out for","send-offs","send-ups","send off (for something)","send for somebody","send for something","send somebody forth","send somebody"]}]