[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sen/sensi/sensitivity__us_1.mp3","phonsUS":"/ˌsensəˈtɪvəti/","level":"C1","meanings":[{"def":"the ability to understand other people’s feelings","examples":["sensitivity to the needs of children","She pointed out with tact and sensitivity exactly where he had gone wrong.","Many doctors lack sensitivity when dealing with their patients.","Sensitivity training for teachers is always useful.","She broke the news to us with great sensitivity.","She is not known for her sensitivity in dealing with complaints.","The course teaches sensitivity to body language."],"opposite":"","synonyms":""},{"def":"the ability to understand art, music and literature and to express yourself through them","examples":["She played with great sensitivity.","He shows imaginative sensitivity in his review."],"opposite":"","synonyms":""},{"def":"the fact of being easily offended or upset by something","examples":["He's a mixture of anger and sensitivity.","She was blind to the feelings and sensitivities of other people."],"opposite":"","synonyms":""},{"def":"the fact of needing to be treated very carefully because it may offend or upset people","examples":["Confidentiality is important because of the sensitivity of the information.","The producers were aware of the sensitivity of the subject.","This is a matter of great sensitivity."],"opposite":"","synonyms":""},{"def":"the fact of reacting quickly or more than usual to something","examples":["food sensitivity","allergies and sensitivities","Some children develop a sensitivity to cow's milk.","The eyes of some fish have a greater sensitivity to light than ours do."],"opposite":"","synonyms":""},{"def":"the ability to measure very small changes","examples":["the sensitivity of the test","a tool that has been criticized for its low sensitivity","Migrating birds show extreme sensitivity to air currents."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]