[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sen/sense/sense__us_1.mp3","phonsUS":"/sens/","level":"A2","meanings":[{"def":"an understanding about something; an ability to judge something","examples":["One of the most important things in a partner is a sense of humour (= the ability to find things funny or make people laugh).","He has a very good sense of direction (= finds the way to a place easily).","(figurative) She has lost all sense of direction in her life (= the idea of what she should do in her life).","Always try to keep a sense of proportion (= of the relative importance of different things).","a sense of rhythm/timing","a sense of fun/adventure","Readers gain a real sense of what life was like in the camp.","Alex doesn't have any dress sense (= does not know which clothes look attractive).","He seems to have lost his sense of reality.","I have absolutely no fashion sense.","She had a great sense of style.","a natural sense of justice"],"opposite":"","synonyms":""},{"def":"good understanding and judgement; knowledge of what is sensible or practical behaviour","examples":["You should have the sense to take advice when it is offered.","There's no sense in (= it is not sensible) worrying about it now.","Can't you talk sense (= say something sensible)?","There's a lot of sense in what Mary says.","She gave me some very sensible advice.","It wasn’t very sensible to go out on your own so late at night.","a soap for sensitive skin","This movie may upset a sensitive child.","He at least had the sense to call the police.","Some people have more money than sense.","How could you even think of doing such a thing? Have some sense!","I wish my daughter would learn some sense.","If you had an ounce of sense, you'd never have agreed to help him.","There's a lot of sense in what he's saying.","There's no sense in going home before the concert.","He was respected for his humour and his good sense.","I developed a certain road sense during my years as a cyclist."],"opposite":"","synonyms":""},{"def":"the meaning that a word or phrase has; a way of understanding something","examples":["That word has three senses.","in … sense The word ‘love’ is used in different senses by different people.","Globalization in the broadest sense is nothing new.","The word ‘perspective’ is being used here in a technical sense.","He was a true friend, in every sense of the word (= in every possible way).","In a sense (= in one way) it doesn't matter any more.","In some senses (= in one or more ways) the criticisms were justified.","(formal) In no sense can the issue be said to be resolved.","in the sense of something I am using ‘cold’ in the sense of ‘unfriendly’.","in the sense that… I don't mean that the press ought to be free in the sense that no one ought to pay for it.","There is a sense in which we are all to blame for the tragedy.","This is a tragedy in the fullest sense of the word.","These teachings do not constitute a religion in the conventional sense.","The novel is about education in its widest sense.","In a very real sense, post-war repression was the continuation of the war.","In a certain sense, justice was done.","I don't have any friends in the usual sense of the word.","I am not writing poetry in the traditional sense.","He and I were no longer friends in any meaningful sense."],"opposite":"","synonyms":""},{"def":"one of the five powers (sight, hearing, smell, taste and touch) that your body uses to get information about the world around you","examples":["the five senses","sense of something Dogs have a keen sense (= strong sense) of smell.","the sense organs (= eyes, ears, nose, etc.)","I could hardly believe the evidence of my own senses (= what I could see, hear, etc.).","The mixture of sights, smells and sounds around her made her senses reel.","Art should appeal to the senses rather than the intellect.","He has a sixth sense when it comes to fashion.","Raccoons have a highly developed sense of touch.","She lost her sense of hearing early in life.","When she came to, her senses told her she was lying on a beach."],"opposite":"","synonyms":""},{"def":"a feeling about something important","examples":["sense of something His career was guided by a strong sense of duty.","There is now a sense of urgency to fix the problem.","I have found a sense of purpose in the work I do here.","Most people in the country have a strong sense of national identity.","My parents instilled a strong sense of responsibility in me.","Clubs try to create a sense of community.","Helmets can give cyclists a false sense of security.","He felt an overwhelming sense of loss.","sense (that)… I had the sense that he was worried about something.","I got the sense that she wasn't very pleased to see us.","He felt a deep sense of relief after the phone call.","I experienced a new sense of freedom.","Many felt a renewed sense of purpose in the nation's war effort.","Patti had a nagging sense of foreboding.","The conviction may bring a sense of closure.","We felt a profound sense of alienation from Western culture.","a palpable sense of danger","a vague sense of unease","Doesn't she have any sense of guilt about what she did?"],"opposite":"","synonyms":""},{"def":"a normal state of mind; the ability to think clearly","examples":["If she threatens to leave, it should bring him to his senses.","He waited for Dora to come to her senses and return.","No one in their right senses would give him the job!","(old-fashioned) Are you out of your senses? You'll be killed!"],"opposite":"","synonyms":""},{"def":"to try and persuade somebody to stop behaving in a stupid way, sometimes using rough or violent methods","examples":["Try and talk some sense into her before she makes the wrong decision.","Where would I be without you to knock some sense into my head?"],"opposite":"","synonyms":""},{"def":"to have a meaning that you can easily understand","examples":["This sentence doesn't make sense."],"opposite":"","synonyms":""},{"def":"to be a sensible thing to do","examples":["It makes sense to buy the most up-to-date version.","There are strict medicals for pilots, which makes good sense.","Family-friendly policies make good business sense.","It makes little sense to discuss this now."],"opposite":"","synonyms":""},{"def":"to be easy to understand or explain","examples":["John wasn't making much sense on the phone.","Who would send me all these flowers? It makes no sense.","It all made perfect sense to me."],"opposite":"","synonyms":""},{"def":"to understand something that is difficult or has no clear meaning","examples":["I can’t make sense of that painting."],"opposite":"","synonyms":""},{"def":"to start to be sensible or reasonable","examples":["I tried to make him see sense, but he just wouldn't listen."],"opposite":"","synonyms":""},{"def":"a feeling or understanding that an event is important or special","examples":["Candles on the table gave the evening a sense of occasion."],"opposite":"","synonyms":""},{"def":"to start behaving in a crazy way","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"knock/talk some sense into somebody","def":"to try and persuade somebody to stop behaving in a stupid way, sometimes using rough or violent methods","examples":["Try and talk some sense into her before she makes the wrong decision.","Where would I be without you to knock some sense into my head?"]},{"idiom":"make sense","def":"to have a meaning that you can easily understand","examples":["This sentence doesn't make sense.","It makes sense to buy the most up-to-date version.","There are strict medicals for pilots, which makes good sense.","Family-friendly policies make good business sense.","It makes little sense to discuss this now.","John wasn't making much sense on the phone.","Who would send me all these flowers? It makes no sense.","It all made perfect sense to me."]},{"idiom":"make sense of something","def":"to understand something that is difficult or has no clear meaning","examples":["I can’t make sense of that painting."]},{"idiom":"see sense","def":"to start to be sensible or reasonable","examples":["I tried to make him see sense, but he just wouldn't listen."]},{"idiom":"a sense of occasion","def":"a feeling or understanding that an event is important or special","examples":["Candles on the table gave the evening a sense of occasion."]},{"idiom":"take leave of your senses","def":"to start behaving in a crazy way","examples":[]}],"phrasal":[],"related":["good sense","road sense","sixth sense","common sense","Sense and Sensibility","good sense of humour","a sense of occasion","know somebody in the biblical sense","knock/talk some sense into somebody"]},{"pos":"verb","level":"B2","meanings":[{"def":"to become aware of something even though you cannot see it, hear it, etc.","examples":["sense something Sensing danger, they started to run.","I sensed a note of tension in his voice.","I could sense the presence of someone near me.","He sensed an opportunity to score a propaganda victory.","sense (that)… Lisa sensed that he did not believe her.","Thomas, she sensed, could convince anyone of anything.","sense somebody/something doing something He sensed someone moving around behind him.","sense somebody/something do something He sensed something move in the bushes.","sense how, what, etc… She could sense how nervous he was.","She sensed the terrible pain he was feeling.","He clearly sensed that some points could be scored.","I immediately sensed something was wrong.","I sensed quite strongly that she was angry with me.","She apparently sensed defeat was inevitable.","Maybe she could just sense what I needed."],"opposite":"","synonyms":""},{"def":"to discover and record something","examples":["equipment that senses the presence of toxic gases"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]