[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sen/sensi/sensitive__us_4.mp3","phonsUS":"/ˈsensətɪv/","level":"B2","meanings":[{"def":"aware of and able to understand other people and their feelings","examples":["a sensitive and caring man","sensitive to something She is very sensitive to other people's feelings.","Schools must be sensitive to the needs of students from different backgrounds.","Horses are very sensitive to their riders' moods.","I think they handled the situation in a sensitive way.","This type of situation requires a sensitive approach by doctors."],"opposite":"insensitive","synonyms":""},{"def":"reacting quickly or more than usual to something","examples":["sensitive areas of the body","sensitive to something My teeth are very sensitive to cold food.","Young children are particularly sensitive to the harmful effects of pesticides.","The eyes of some fish are acutely sensitive to light.","I have become increasingly sensitive to the sun.","These drugs can make skin extremely sensitive to sunlight.","Coral reefs are very sensitive to changes in seawater temperature.","She gave me some very sensible advice.","It wasn’t very sensible to go out on your own so late at night.","a soap for sensitive skin","This movie may upset a sensitive child."],"opposite":"insensitive","synonyms":""},{"def":"able to understand art, music and literature and to express yourself through them","examples":["an actor’s sensitive reading of the poem","a sensitive portrait"],"opposite":"","synonyms":""},{"def":"easily offended or upset","examples":["You're far too sensitive.","sensitive about something He's very sensitive about his weight.","sensitive to something She's very sensitive to criticism.","He's depicted as an insecure and sensitive soul.","Teenagers are often very sensitive about their appearance."],"opposite":"insensitive","synonyms":""},{"def":"that you have to treat with great care because it may offend people or make them angry or embarrassed","examples":["sensitive information/data","highly sensitive documents","Healthcare is a politically sensitive issue.","That's a sensitive area.","a sensitive subject/topic/matter","Nuclear power remains a very sensitive issue in the Netherlands.","It is not known how the Russians obtained such potentially sensitive information.","The information was deemed too sensitive to be broadcast.","an extremely sensitive question","culturally sensitive policies","It might be better to avoid such a sensitive topic.","She is currently involved in highly sensitive negotiations."],"opposite":"","synonyms":""},{"def":"able to measure very small changes","examples":["a sensitive instrument","The eyes can be a sensitive indicator of health.","(figurative) The Stock Exchange is very sensitive to political change.","The bat's hearing is remarkably sensitive.","The equipment is highly sensitive.","The probe is sensitive enough to detect the presence of a single microbe.","sensitive to the slightest movement"],"opposite":"insensitive","synonyms":""}],"idioms":[],"phrasal":[],"related":["case-sensitive","touch-sensitive","hit/touch/strike a (raw/sensitive) nerve"]}]