[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sen/sente/sentence__us_2.mp3","phonsUS":"/ˈsentəns/","level":"A1","meanings":[{"def":"a set of words expressing a statement, a question or an order, usually containing a subject and a verb. In written English sentences begin with a capital letter and end with a full stop/period (.), a question mark (?) or an exclamation mark (!).","examples":["Does the sentence contain an adverb?","I was too stunned to finish my sentence.","There are mistakes in grammar, sentence structure and punctuation.","Let's take that paragraph apart sentence by sentence.","Complete the following sentence: ‘I love dictionaries because…’.","Cooke was so nervous he could barely string a sentence together.","He can barely form a grammatical sentence.","He tells her not to end her sentences with prepositions.","I kept reading the same sentence over and over again.","Peter finished Jane's sentence for her.","The argument can be distilled into a single sentence.","Troy uttered one last sentence.","Try to keep your sentences short.","the opening sentence of the novel"],"opposite":"","synonyms":""},{"def":"the punishment given by a court","examples":["a jail/prison sentence","a custodial sentence","a harsh/stiff/heavy/lengthy sentence","a light/lenient sentence","The court will impose an appropriate sentence.","The judge passed sentence (= said what the punishment would be).","The prisoner has served (= completed) his sentence and will be released tomorrow.","sentence of something a maximum/minimum sentence of five years","a mandatory sentence of life imprisonment","The charges carry a sentence of up to ten years.","She could face a sentence of between seven and ten years in jail.","sentence for something He received an 18-year sentence for attempted murder.","under sentence (of something) to be under sentence of death","He spent a week in custody awaiting sentence.","He turned state's evidence in return for a reduced sentence.","She could face a long prison sentence.","The US Supreme Court recently upheld both of these sentences.","The judge imposed the mandatory sentence for murder.","The offence carries a maximum sentence of two years in prison.","an eight-year sentence for burglary","ex-felons who have completed their sentences"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["life sentence","cleft sentence","death sentence","sentence adverb","community sentence","run-on sentence","suspended sentence","sentence adverbs"]},{"pos":"verb","level":"B2","meanings":[{"def":"to say officially in court that somebody is to receive a particular punishment","examples":["sentence somebody to something He sentenced the defendant to life in prison.","to be sentenced to death/life imprisonment","He was convicted and sentenced to a four-year jail term.","sentence somebody to do something The judge sentenced him to hang.","The court sentenced him to serve nine months for the assault.","She was sentenced to do 30 hours of community service.","sentence somebody for something The same judge had previously sentenced him for burglary.","sentence somebody to something for something A court sentenced them to nine-year jail terms for fraud and tax evasion.","sentence somebody It was argued that judges should have discretion in sentencing first-time offenders.","The judge sentenced her to life imprisonment.","They had been sentenced for murder."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]