[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sep/separ/separate__us_1.mp3","phonsUS":"/ˈseprət/","level":"A2","meanings":[{"def":"forming a unit by itself; not joined to something else","examples":["They have begun to sleep in separate rooms.","separate from somebody/something Raw meat must be kept separate from cooked meat.","The school is housed in two separate buildings.","Write a list of names on a separate piece of paper."],"opposite":"","synonyms":""},{"def":"different; not connected","examples":["a separate incident/issue","The companies now exist as two separate entities.","separate from something I try to keep my private life separate from my work.","This is a completely separate matter.","It happened on three separate occasions.","Their ultimate political goal is the creation of a separate state.","For the past three years they have been leading totally separate lives.","The two groups are essentially separate and independent.","to merge the two previously separate businesses","species from widely separate parts of the world"],"opposite":"","synonyms":""},{"def":"to end a relationship with somebody","examples":["When the business was sold they went their separate ways.","They decided to go their separate ways after being together for five years.","When we finished school, we all went our separate ways."],"opposite":"","synonyms":""},{"def":"to go in a different direction from somebody you have been travelling with","examples":[],"opposite":"","synonyms":""},{"def":"in a separate envelope","examples":["The information you requested is being forwarded to you under separate cover."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"go your separate ways","def":"to end a relationship with somebody","examples":["When the business was sold they went their separate ways.","They decided to go their separate ways after being together for five years.","When we finished school, we all went our separate ways."]},{"idiom":"under separate cover","def":"in a separate envelope","examples":["The information you requested is being forwarded to you under separate cover."]}],"phrasal":[],"related":["separate out","separate school","separate but equal","separate schools","separate out (from something) | separate something","under separate cover","separate/sort out the men from the boys","sort out/separate the wheat from the chaff","sort out/separate the sheep from the goats"]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sep/separ/separate__us_2.mp3","phonsUS":"/ˈsepəreɪt/","level":"B1","meanings":[{"def":"to divide into different parts or groups; to divide things into different parts or groups","examples":["Stir the sauce constantly so that it does not separate.","separate something Separate the eggs (= separate the yolk from the white).","A civil war separated the two sides.","separate A from B It is impossible to separate belief from emotion.","separate A and B the law separating church and state","separate something into something Make a list of points and separate them into ‘desirable’ and ‘essential’.","Mechanically separated meat made from cattle and sheep has now been banned.","One cannot easily separate moral, social and political issues.","These two branches of the science have now become clearly separated.","an island resort totally separated from the mainland","I separated the documents into two piles."],"opposite":"","synonyms":""},{"def":"to move apart; to make people or things move apart","examples":["South America and Africa separated 200 million years ago.","They are actually twins separated at birth.","separate from something South America separated from Africa 200 million years ago.","separate into something We separated into several different search parties.","separate somebody/something Police tried to separate the two men who were fighting.","The war separated many families.","separate A from B Those suffering from infectious diseases were separated from the other patients.","separate A and B Women and men are separated in Orthodox synagogues.","separate somebody/something into something The children were separated into two groups.","It was impossible to separate the rival fans.","The boys are separated from the girls.","Two men separated from the others and walked towards me.","Enslaved parents were forcibly separated from their children."],"opposite":"","synonyms":""},{"def":"to be between two people, areas, countries, etc. so that they are not touching or connected","examples":["separate somebody/something A thousand kilometres separates the two cities.","It is not uncommon for families to be separated by great distances.","separate A from/and B A high wall separated our back yard from the playing field.","At this point a barbed wire fence separates the United States and Mexico."],"opposite":"","synonyms":""},{"def":"to stop living together as a couple with your husband, wife or partner","examples":["They separated last year.","separate from somebody He separated from his wife after 20 years of marriage."],"opposite":"","synonyms":""},{"def":"to make somebody/something different in some way from somebody/something else","examples":["Politics is the only thing that separates us (= that we disagree about).","Her lack of religious faith separated her from the rest of her family.","The judges found it impossible to separate the two contestants (= they gave them equal scores).","Only four points separate the top three teams."],"opposite":"","synonyms":""},{"def":"to show or prove who is brave, skilful, etc. and who is not","examples":[],"opposite":"","synonyms":""},{"def":"to recognize the difference between people who are good at something, intelligent, etc. and those who are not","examples":[],"opposite":"","synonyms":""},{"def":"to recognize the difference between useful or valuable people or things and those that are not useful or have no value","examples":["We sifted through the application forms to separate the wheat from the chaff."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"separate/sort out the men from the boys","def":"to show or prove who is brave, skilful, etc. and who is not","examples":[]},{"idiom":"sort out/separate the sheep from the goats","def":"to recognize the difference between people who are good at something, intelligent, etc. and those who are not","examples":[]},{"idiom":"sort out/separate the wheat from the chaff","def":"to recognize the difference between useful or valuable people or things and those that are not useful or have no value","examples":["We sifted through the application forms to separate the wheat from the chaff."]}],"phrasal":["separate out"],"related":[]}]