[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/seq/seque/sequence__us_2.mp3","phonsUS":"/ˈsiːkwəns/","level":"B2","meanings":[{"def":"a set of events, actions, numbers, etc. which have a particular order and which lead to a particular result","examples":["He described the sequence of events leading up to the robbery.","The computer generates a random sequence of numbers.","Her latest book contains a sequence of poems about paintings.","Repeat the entire sequence at least three times.","The article describes the chronological sequence of events.","a basic blues chord sequence","a remarkable winning sequence of games","It is now possible to chart the DNA sequences of any living thing."],"opposite":"","synonyms":""},{"def":"the order that events, actions, etc. happen in or should happen in","examples":["in a … sequence The tasks had to be performed in a particular sequence.","The interviewer should ask questions in a logical sequence.","in sequence Number the pages in sequence.","out of sequence These pages are out of sequence.","Put these numbers into the correct sequence.","I had to punch in a fixed sequence of codes.","The book is more satisfying if you read each chapter in sequence.","This article is out of sequence and belongs on page 57."],"opposite":"","synonyms":""},{"def":"a part of a film that deals with one subject or topic or consists of one scene","examples":["the dream sequence in the middle of the movie","The fight sequences were choreographed by Xin-Xin Xiong.","the opening credit sequence","The heroine dies in the closing sequence of the film.","The movie begins with an extended car-chase sequence.","There were some very impressive underwater sequences."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["sequence of tenses","Fibonacci sequence"]},{"pos":"verb","level":"","meanings":[{"def":"to arrange things into a sequence","examples":[],"opposite":"","synonyms":""},{"def":"to identify the order in which a set of genes or parts of molecules are arranged","examples":["The human genome has now been sequenced."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]