[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/ser/serio/serious__us_1.mp3","phonsUS":"/ˈsɪriəs/","level":"A2","meanings":[{"def":"bad or dangerous","examples":["a serious illness/offence/crime","a serious problem/issue","to cause serious injury/damage/harm","They pose a serious threat to security.","The consequences could be serious.","A few years ago, the company was in serious trouble.","Their economies continue to face serious challenges.","She is in serious financial trouble.","She is now in a serious condition in Belfast Hospital.","serious for somebody/something This situation could be very serious for her.","By this time the riots were getting serious.","The crime is considered serious enough to warrant a jail term.","These are terribly serious allegations.","He admitted to having made a serious error of judgement.","He died after suffering from a serious illness.","The storm caused serious damage to farm buildings.","The country is now facing a serious political crisis.","The children were considered to be at serious risk of harm.","Your chances of having a serious accident at work can be quite high."],"opposite":"","synonyms":""},{"def":"thinking about things in a careful and sensible way; not silly","examples":["Be serious for a moment; this is important.","I'm afraid I'm not a very serious person.","He’s not really a very serious person.","Be serious for a moment; this is important.","He looked very grave as he entered the room.","The earnest young doctor answered all our questions.","Her expression grew solemn.","I made a solemn promise that I would return.","He became serious all of a sudden.","She was looking at him with a serious expression on her face.","Suddenly the conversation turned serious."],"opposite":"","synonyms":"serious"},{"def":"sincere about something; not joking or meant as a joke","examples":["Believe me, I'm deadly (= extremely) serious.","Don't laugh, it's a serious suggestion.","serious about doing something Is she serious about wanting to sell the house?","He knew it was time to get serious about losing weight.","serious about somebody/something He's really serious about Penny and wants to get engaged.","She doesn’t have a serious boyfriend.","(informal) You can't be serious! (= you must be joking)","You think I did it? Be serious! (= what you suggest is ridiculous)","Are you serious about resigning?","Joe is deadly serious in his beliefs.","Please try to stay serious!"],"opposite":"","synonyms":""},{"def":"needing to be thought about carefully; not only for pleasure","examples":["a serious article","a serious newspaper","an appreciation of serious music","serious drama/fiction","Why do you waste your time reading that? It's hardly a serious newspaper, is it?","This book is the first serious study of the subject.","The speech was interesting, if a little serious for such a young audience.","It's time for a serious debate about the issue."],"opposite":"","synonyms":""},{"def":"that must be treated as important","examples":["a serious matter","serious questions/concerns/doubts","serious allegations/charges","It's time to give serious consideration to this matter.","Please give it some serious thought before you make a decision.","The subject has received little serious attention.","We need to get down to the serious business of working out costs.","The team is a serious contender for the title this year."],"opposite":"","synonyms":""},{"def":"used to emphasize that there is a large amount of something","examples":["You can earn serious money doing that.","I'm ready to do some serious eating (= I am very hungry)."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Serious Fraud Office","Serious Organised Crime Agency"]}]