[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/ser/serie/series__us_2.mp3","phonsUS":"/ˈsɪriːz/","level":"A2","meanings":[{"def":"a set of television or radio programmes or podcasts that deal with the same subject or that have the same characters","examples":["The first episode of the new series is on Saturday.","Her stories have been made into a TV series.","She has a small part in a drama series for radio.","the hit comedy series ‘The Big Bang Theory’","a special two-part series on the economy","The BBC has already commissioned a second series.","We watched the final part of a series on Australian wildlife."],"opposite":"","synonyms":""},{"def":"several events or things of a similar kind that happen one after the other","examples":["series of something The incident sparked off a series of events that nobody had foreseen.","This case raises a whole series of important questions.","The two sides held a series of meetings in the summer.","The movie consisted of a series of flashbacks.","in a series of something This is the latest in a series of articles on the nature of modern society.","He is in hospital for a whole series of tests.","The quartet will be performing in a series of lunchtime concerts.","He had committed a series of minor criminal offences.","The shooting was the latest in a series of violent attacks in the city.","You will need to have a series of vaccinations before you visit the area.","the final book in the series","She wrote a whole series of novels between 1985 and 2005."],"opposite":"","synonyms":""},{"def":"a set of sports games played between the same two teams","examples":["the World Series (= in baseball)","England have lost the Test series (= of cricket matches) against India.","India must win to level the series.","They took the first two games in the series.","The Bronx Bombers won two of three in a weekend series with the Red Sox."],"opposite":"","synonyms":""},{"def":"an electrical circuit in which the current passes through all the parts in the correct order","examples":["batteries connected in series","a series circuit"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Fibonacci series","World Series™","arithmetic series","geometric series"]}]