[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/ser/servi/service__us_3.mp3","phonsUS":"/ˈsɜːrvɪs/","level":"A2","meanings":[{"def":"a system that provides something that the public needs, organized by the government or a private company","examples":["the ambulance/bus/postal service","The government aims to improve public services, especially education.","Essential services (= the supply of water, gas, electricity) will be maintained.","Councillors have called for better provision of services for young people.","The charity provides a vital service to the local community.","Find out what services are available in your area.","paramedics who provide a vital service to the public","The new system will enable people to access the service more easily."],"opposite":"","synonyms":""},{"def":"an organization or a company that provides something for the public or does something for the government","examples":["the prison service","the BBC World Service","the Foreign Service"],"opposite":"","synonyms":""},{"def":"a business whose work involves doing something for customers but not producing goods; the work that such a business does","examples":["financial services","the development of new goods and services","Smith's Catering Services (= a company) offers the best value.","We guarantee (an) excellent service.","We aim to provide a high-quality service.","They offer an after-care service.","Training the staff required to deliver the service remains a challenge.","We are working hard to improve the services that we provide.","The number of people using the service has fallen.","I am not willing to pay for a service I am not receiving.","We offer clients a broad range of services.","the service sector (= the part of the economy involved in this type of business)","a service industry","The company provides products and services to customers in 145 countries.","We offer a full management service for our international clients.","The centre delivers online support services.","We need to expand this valuable service to other cities.","We offer a comprehensive service to home buyers.","We offer excellent after-sales service on all our goods.","an online dating service","wireless internet services","The California-based computer services company announced their quarterly results yesterday.","I typed my password into my instant messaging service.","The studio launches its own digital music download service next month.","Demand for bodyguard services is increasing."],"opposite":"","synonyms":""},{"def":"the serving of customers in hotels, restaurants, and shops","examples":["The food was good but the service was very slow.","I complained about the poor service.","10% will be added to your bill for service."],"opposite":"","synonyms":""},{"def":"the work that somebody does for an organization, etc., especially when it continues for a long time or is admired very much","examples":["service with something She has just celebrated 25 years' service with the company.","service to something He has retired after 30 years of dedicated service to the local community.","She was presented with a long-service award after 40 years with the firm.","The employees have good conditions of service.","After retiring, she became involved in voluntary service in the local community."],"opposite":"","synonyms":""},{"def":"the army, the navy and the air force; the work done by people in them","examples":["Most of the boys went straight into the services.","He saw service in North Africa.","After service in the US Army, he began his legal career.","the country's military intelligence services","a service family"],"opposite":"","synonyms":""},{"def":"the use that you can get from a vehicle or machine; the state of being used","examples":["That computer gave us very good service.","in service This bus is not in service.","out of service The ship will be taken out of service within two years.","The ship has been taken out of service for extensive cleaning.","The aircraft entered service with the Swedish Air Force in 1997."],"opposite":"","synonyms":""},{"def":"an examination of a vehicle or machine followed by any work that is necessary to keep it operating well","examples":["a service engineer","(British English) I had taken the car in for a service.","(North American English) I had taken the car in for service."],"opposite":"","synonyms":""},{"def":"the particular skills or help that a person is able to offer","examples":["You need the services of a good lawyer.","service as somebody/something He offered his services as a driver.","I offered my services as a babysitter for the evening.","He was given an award for his services to the disabled.","to seek the services of an attorney","a plastic surgeon advertising his services on the internet"],"opposite":"","synonyms":""},{"def":"a religious ceremony","examples":["a funeral/memorial service","A memorial service will be held at St James's Church on Sunday.","More than 100 people attended the service.","to go to morning/evening service","He always attends morning service.","a memorial service for people killed in the attack","A special service of praise and thanksgiving was held in the cathedral."],"opposite":"","synonyms":""},{"def":"a bus, train, etc. that goes regularly to a particular place at a particular time","examples":["the cancellation of the 10.15 service to Glasgow","Bus companies are planning to lay on extra services.","The company offers direct, fast and frequent services between large towns and cities.","There is a limited service on these bus routes.","We will be operating a reduced service while engineering work takes place.","changes to scheduled services","services from Bangkok to Chiang Mai","A free bus service to and from the venue is available."],"opposite":"","synonyms":""},{"def":"a place next to a motorway where you can stop for petrol, a meal, the toilets, etc.","examples":["motorway services","It's five miles to the next services."],"opposite":"","synonyms":""},{"def":"an act of hitting the ball in order to start playing; the way that you hit it","examples":["It's your service (= your turn to start playing).","Her service has improved."],"opposite":"","synonyms":""},{"def":"a complete set of plates, dishes, etc. that match each other","examples":["a tea service (= cups, saucers, a teapot and plates, for serving tea)"],"opposite":"","synonyms":""},{"def":"the state or position of being a servant","examples":["to be in/go into service (= to be/become a servant)","a job in domestic service"],"opposite":"","synonyms":""},{"def":"the formal giving of an official document, etc. to somebody","examples":["the service of a demand for payment"],"opposite":"","synonyms":""},{"def":"completely available for somebody to use or to help somebody","examples":["Healthcare must be at the service of all who need it.","(formal or humorous) If you need anything, I am at your service.","The cabin staff are at your service throughout the flight."],"opposite":"","synonyms":""},{"def":"to be useful or helpful","examples":["Can I be of service to anyone?"],"opposite":"","synonyms":""},{"def":"to do something that is helpful/not helpful to somebody","examples":["She was doing herself no service by remaining silent.","You have done us a great service."],"opposite":"","synonyms":""},{"def":"to use somebody/something for a purpose that they were not trained or intended for because there is nobody or nothing else available","examples":["Every type of boat was pressed into service to rescue passengers from the sinking ferry."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"at the service of somebody/something | at somebody’s service","def":"completely available for somebody to use or to help somebody","examples":["Healthcare must be at the service of all who need it.","(formal or humorous) If you need anything, I am at your service.","The cabin staff are at your service throughout the flight."]},{"idiom":"be of service (to somebody)","def":"to be useful or helpful","examples":["Can I be of service to anyone?"]},{"idiom":"do somebody a/no service","def":"to do something that is helpful/not helpful to somebody","examples":["She was doing herself no service by remaining silent.","You have done us a great service."]},{"idiom":"press somebody/something into service","def":"to use somebody/something for a purpose that they were not trained or intended for because there is nobody or nothing else available","examples":["Every type of boat was pressed into service to rescue passengers from the sinking ferry."]}],"phrasal":[],"related":["ex-service","in-service","lip service","fire service","room service","self-service","service area","service club","service plaza","service road","wire service","active service","community service","customer service","dinner service","Foreign Service","health service","military service"]},{"pos":"verb","level":"","meanings":[{"def":"to examine a vehicle or machine and repair it if necessary so that it continues to work correctly","examples":["have something serviced We need to have the car serviced.","be serviced Make sure your boiler is serviced regularly.","The car was fully serviced last month.","The mechanic who services our car has set up his own business."],"opposite":"","synonyms":""},{"def":"to provide people with something they need, such as shops, or a transport system","examples":["be serviced by something/somebody Botley is well serviced by a regular bus route into Oxford.","service something/somebody This department services the international sales force (= provides services for it)."],"opposite":"","synonyms":""},{"def":"to pay interest on money that has been borrowed","examples":["The company can no longer service its debts."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]