[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/ser/serve/serve__us_1.mp3","phonsUS":"/sɜːrv/","level":"A2","meanings":[{"def":"to give somebody food or drink, for example at a restaurant or during a meal","examples":["serve (something) Breakfast is served between 7 and 10 a.m.","When do you stop serving hot food?","Pour the sauce over the pasta and serve immediately.","Shall I serve?","serve something with something Serve the lamb with new potatoes and green beans.","serve something to somebody They served a wonderful meal to more than fifty delegates.","serve somebody with something The delegates were served with a wonderful meal.","serve somebody something She served us a delicious lunch.","serve something + adj. The quiche can be served hot or cold.","Cover and chill the salad until ready to serve.","Serve chilled.","Serve with rice or potatoes."],"opposite":"","synonyms":""},{"def":"to be enough for somebody/something","examples":["This dish will serve four hungry people."],"opposite":"","synonyms":""},{"def":"to help a customer or sell them something in a shop","examples":["Are you being served?","The bar staff spend more time chatting to friends than serving customers.","She was serving behind the counter."],"opposite":"","synonyms":""},{"def":"to be useful to somebody in achieving or satisfying something","examples":["These experiments serve no useful purpose.","Most of their economic policies serve the interests of big business.","How can we best serve the needs of future generations?","Art serves an important function in our society.","His linguistic ability served him well in his chosen profession.","This old car has served me very well.","The story would be better served by slowing down a little."],"opposite":"","synonyms":""},{"def":"to provide an area or a group of people with a product or service","examples":["serve somebody/something The centre will serve the whole community.","serve somebody/something with something The town is well served with buses and major road links."],"opposite":"","synonyms":""},{"def":"to work or perform duties for a person, an organization, a country, etc.; to spend a period of time in a particular job","examples":["serve as something He served as a captain in the army.","She was elected to serve as secretary of the local party.","to serve as president/director/chairman","serve under/with somebody He served under Tony Blair in the 1990s.","serve + adv./prep. She served in the medical corps.","His father served with distinction in the First World War.","serve somebody/something He proudly served his country during the war.","I wanted to work somewhere where I could serve the community.","She has already served two terms as mayor.","He served a one-year apprenticeship.","He served the family faithfully for many years (= as a servant).","Have you ever served on a jury?","I currently serve on the Board of Directors.","He served on active duty in the US Marine Corps.","He served with distinction in the First World War.","She served in the US military for six years.","I shall continue to serve as a trustee.","She has served in an advisory capacity for a number of groups."],"opposite":"","synonyms":""},{"def":"to be suitable for a particular use, especially when nothing else is available","examples":["The sofa will serve as a bed for a night or two.","The Declaration served primarily as a propaganda piece.","The texts ultimately serve as springboards for the artists' imagination.","The first chapter serves as a useful introduction to the subject."],"opposite":"","synonyms":""},{"def":"to have a particular effect or result","examples":["serve as something The judge said the punishment would serve as a warning to others.","The highly visible ruins serve as a reminder of the building's history.","There are several women in the field who have served as role models.","serve to do something The attack was unsuccessful and served only to alert the enemy.","This only served to complicate the situation further."],"opposite":"","synonyms":""},{"def":"to spend a period of time in prison","examples":["prisoners serving life sentences","She is serving two years for theft.","He has served time (= been to prison) before."],"opposite":"","synonyms":""},{"def":"to give or send somebody an official document, especially one that orders them to appear in court","examples":["serve something (on somebody) to serve a writ/summons on somebody","serve somebody with something to serve somebody with a writ/summons"],"opposite":"","synonyms":""},{"def":"to start playing by throwing the ball into the air and hitting it","examples":["Who's serving?","serve something She served an ace."],"opposite":"","synonyms":""},{"def":"to perform two roles or functions at the same time","examples":["This device can pull double duty as a decent laptop and an adequate tablet.","She deserves credit for serving double duty as a host and performer."],"opposite":"","synonyms":""},{"def":"people will be dealt with, seen, etc. strictly in the order in which they arrive","examples":["Tickets are available on a first come, first served basis."],"opposite":"","synonyms":""},{"def":"if I remember correctly","examples":[],"opposite":"","synonyms":""},{"def":"used to say that something that has happened to somebody is their own fault and they deserve it","examples":["Left you, did she? It serves you right for being so selfish."],"opposite":"","synonyms":""},{"def":"to be useful for a particular purpose or period of time","examples":[],"opposite":"","synonyms":""},{"def":"to support two different parties, principles, etc. at the same time","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"do/pull/serve double duty (as something)","def":"to perform two roles or functions at the same time","examples":["This device can pull double duty as a decent laptop and an adequate tablet.","She deserves credit for serving double duty as a host and performer."]},{"idiom":"first come, first served","def":"people will be dealt with, seen, etc. strictly in the order in which they arrive","examples":["Tickets are available on a first come, first served basis."]},{"idiom":"if (my) memory serves me well, correctly, etc.","def":"if I remember correctly","examples":[]},{"idiom":"it serves somebody right (for doing something)","def":"used to say that something that has happened to somebody is their own fault and they deserve it","examples":["Left you, did she? It serves you right for being so selfish."]},{"idiom":"serve your/its turn","def":"to be useful for a particular purpose or period of time","examples":[]},{"idiom":"serve two masters","def":"to support two different parties, principles, etc. at the same time","examples":[]}],"phrasal":["serve out","serve up"],"related":["serve up","serve out","break of serve","serve something","serve two masters","serve double duty (as something)"]},{"pos":"noun","level":"","meanings":[{"def":"the action of serving the ball to your opponent","examples":["He has not lost his serve (= lost a game in which it was his turn to serve) in three matches."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]