[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/ses/sessi/session__us_3.mp3","phonsUS":"/ˈseʃn/","level":"B2","meanings":[{"def":"a period of time that is spent doing a particular activity","examples":["a training/practice session","a therapy/counselling/group session","a morning/afternoon session","a recording/jam session","The course is made up of 12 two-hour sessions.","Two soccer fans plunged to their deaths after a heavy drinking session.","The club held football coaching sessions for children in the area.","Participants will have the opportunity to attend sessions on a wide variety of topics.","The literacy programme includes sessions on encouraging children to read.","Both sessions are scheduled for 10 o'clock.","Each session lasted approximately 15 minutes.","I had a one-to-one session with one of the instructors at the gym.","The case worker will talk to refugees at drop-in sessions and by appointment.","The college runs training sessions every afternoon.","The conference will end with a question and answer session.","The training involves twice-weekly practice sessions.","Your presentation will be part of the morning session.","She has a weekly session at the health club on Saturdays.","The 3 p.m. showing of the film will be followed by a question-and-answer session with the director."],"opposite":"","synonyms":""},{"def":"a formal meeting or series of meetings of a court, a parliament, etc.; a period of time when such meetings are held","examples":["a session of the UN General Assembly","The president addressed a joint session of Congress (= both the Senate and the House of Representatives).","a plenary session of the European Parliament","a special session of the US Supreme Court","In the last legislative session, the two parties came close to agreement.","in session The court is now in session.","The committee met in closed session (= with nobody else present).","an emergency session of Congress","the current parliamentary session","We still have a number of weeks before the current legislative session ends.","a stormy session of the European Parliament","The session adopted a resolution on disarmament.","The Governor called a special session of the Legislature.","The Council met in executive session for the purpose of selecting a new general secretary."],"opposite":"","synonyms":""},{"def":"a school or university year","examples":[],"opposite":"","synonyms":""},{"def":"an occasion when people meet to play music, especially Irish music, in a pub","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["jam session","bull session","session musician","Court of Session","session musicians"]}]