[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/set/set__/set__us_1.mp3","phonsUS":"/set/","level":"B1","meanings":[{"def":"to prepare or arrange something so that it is ready for use or in position","examples":["set something Have you set the alarm clock?","set something + adv.prep. She set the camera on automatic.","I set my watch by (= make it show the same time as) the TV.","Set the alarm for 7 o'clock."],"opposite":"","synonyms":""},{"def":"to arrange knives, forks, etc. on a table for a meal","examples":["set a/the table Can you help me set the table?","set a/the table for somebody/something Could you set the table for dinner?","The table was set for six guests."],"opposite":"","synonyms":""},{"def":"to fix something so that others copy it or try to achieve it","examples":["This could set a new fashion.","They set high standards of customer service.","I am unwilling to set a precedent.","She set a new world record for the high jump.","I rely on you to set a good example.","The opening scene sets the tone for the rest of the movie."],"opposite":"","synonyms":""},{"def":"to give somebody a piece of work to do or a task or target to achieve","examples":["set something Who will be setting (= writing the questions for) the French exam?","The government has set a growth target of 6%.","set something for something What books have been set (= are to be studied) for the English course?","set something for somebody/yourself She's set a difficult task for herself.","He likes to set challenging goals for himself.","set somebody/yourself something She's set herself a difficult task.","set somebody/yourself to do something I've set myself to finish the job by the end of the month."],"opposite":"","synonyms":""},{"def":"to arrange or fix something; to decide on something","examples":["They haven't set a date for their wedding yet.","The government has set strict limits on public spending this year.","We can't just let the global corporations set the agenda (= decide what is important) every time.","Set a time limit for your studying each night.","Individual countries don't really set the price of oil."],"opposite":"","synonyms":""},{"def":"to place the action of a play, novel or film in a particular place, time, etc.","examples":["be set + adv./prep. The novel is set in London in the 1960s.","The movie is set in Los Angeles in the year 2019.","This powerful drama is set against the backdrop of the Civil War."],"opposite":"","synonyms":""},{"def":"to be located in a particular place","examples":["be set + adv./prep. The house is set in fifty acres of parkland."],"opposite":"","synonyms":""},{"def":"to put something/somebody in a particular place or position","examples":["She set a tray down on the table.","They ate everything that was set in front of them.","When she fell he picked her up and set her on her feet again."],"opposite":"","synonyms":""},{"def":"to cause somebody/something to be in a particular state; to start something happening","examples":["set somebody/something + adv./prep. Her manner immediately set everyone at their ease.","He pulled the lever and set the machine in motion.","The new leader has set the party on the road to success.","Demonstrators set two cars on fire.","Demonstrators set fire to two cars.","set somebody/something + adj. The hijackers set the hostages free.","set somebody/something doing something Her remarks set me thinking."],"opposite":"","synonyms":""},{"def":"to go down below the horizon","examples":["We sat and watched the sun setting."],"opposite":"rise","synonyms":""},{"def":"to put a precious stone into a piece of jewellery","examples":["set A in B She had the sapphire set in a gold ring.","set B with A Her bracelet was set with emeralds."],"opposite":"","synonyms":""},{"def":"to become solid or hard","examples":["Leave the concrete to set for a few hours.","+ adj. The glue had set hard."],"opposite":"","synonyms":""},{"def":"to fix your face into a determined expression","examples":["Her jaw was set in a determined manner."],"opposite":"","synonyms":""},{"def":"to arrange somebody’s hair while it is wet so that it dries in a particular style","examples":["She had her hair washed and set."],"opposite":"","synonyms":""},{"def":"to put a broken bone into a fixed position and hold it there, so that it will join together again and get better; to get better in this way","examples":["The surgeon set her broken arm."],"opposite":"","synonyms":""},{"def":"to use a machine or computer to arrange writing and images on pages in order to prepare a book, newspaper, etc. for printing","examples":[],"opposite":"","synonyms":""},{"def":"to write music to go with words","examples":["Schubert set many poems to music."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["set about","set about doing","set against","set apart","set aside","set back","set down","set forth","set in","set into","set off","set on","set out","set to","set up","set upon"],"related":["set in","set on","set to","set-to","set up","set-up","age-set","box set","data set","deep-set","set back","set book","set down","set into","set off","set out","set shot"]},{"pos":"noun","level":"B1","meanings":[{"def":"a group of similar things that belong together in some way","examples":["a set of six chairs","a complete set of her novels","a set of false teeth","These companies operate under a strict set of rules.","This is an unusual set of circumstances.","I have a different set of values to them.","Now they faced a whole new set of problems.","You can borrow my keys—I have a spare set.","She won a silver medal in the long jump to complete her set.","The plate is part of a set.","There are ten pictures in the set.","a necklace with a matching set of earrings","I got myself a new set of saucepans and other kitchen equipment.","These two species share a common set of characteristics.","We have a finite set of options."],"opposite":"","synonyms":""},{"def":"a group of objects used together, for example for playing a game","examples":["a chess set","a model train set"],"opposite":"","synonyms":""},{"def":"a group of people who have similar interests and spend a lot of time together socially","examples":["the smart set (= rich, fashionable people)","Dublin’s literary set","It's known as a playground for Scotland's rich hunting and fishing set."],"opposite":"","synonyms":""},{"def":"a piece of equipment for receiving television or radio signals","examples":["a television/TV set"],"opposite":"","synonyms":""},{"def":"the scenery used for a play, film, etc.","examples":["We need volunteers to help build and paint the set.","The locations and set designs were fabulous."],"opposite":"","synonyms":""},{"def":"a place where a play is performed or part of a film is filmed","examples":["The cast must all be on (the) set by 7 in the morning.","All the cast are on the set throughout.","Off set, the two actors became close friends.","The crew had a lot of fun on set."],"opposite":"","synonyms":""},{"def":"one section of a match in games such as tennis or volleyball","examples":["She won in straight sets (= without losing a set).","She had two break points to level the set.","He's 3–1 up in the third set.","The final went to five sets."],"opposite":"","synonyms":""},{"def":"a group of things regarded as a unit because they all have particular qualities in common","examples":["the set of all square numbers less than 50"],"opposite":"","synonyms":""},{"def":"a series of songs or pieces of music that a musician or group performs at a concert","examples":["a stunning solo set of ten songs"],"opposite":"","synonyms":""},{"def":"a group of school students with a similar ability in a particular subject","examples":["She's in the top set for French."],"opposite":"","synonyms":""},{"def":"the way in which somebody’s face or body is fixed in a particular expression, especially one showing a feeling of being determined","examples":["She admired the firm set of his jaw."],"opposite":"","synonyms":""},{"def":"an act of arranging hair in a particular style while it is wet","examples":["A shampoo and set costs £15."],"opposite":"","synonyms":""},{"def":"the state of becoming solid or hard","examples":["To be sure of a good set when making the jam, use preserving sugar with added pectin."],"opposite":"","synonyms":""},{"def":"a hole in the ground where a badger lives","examples":[],"opposite":"","synonyms":""},{"def":"a young plant, shoot etc. for planting","examples":["onion sets"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adjective","level":"","meanings":[{"def":"in a particular position","examples":["a house set in 40 acres of parkland","He had close-set eyes.","The holiday homes are set in pleasant grounds.","Their house was set back from the road."],"opposite":"","synonyms":""},{"def":"planned or fixed","examples":["Each person was given set jobs to do.","The school funds a set number of free places.","Mornings in our house always follow a set pattern.","New vehicles must comply with set safety standards."],"opposite":"","synonyms":""},{"def":"not likely to change","examples":["set ideas/opinions/views on how to teach","As people get older, they get set in their ways.","He had very set ideas of what he wanted."],"opposite":"","synonyms":""},{"def":"having a fixed price and a limited choice of dishes","examples":["a set dinner/lunch/meal","Shall we have the set menu?"],"opposite":"","synonyms":""},{"def":"likely to do something; ready for something or to do something","examples":["set for something The team looks set for victory.","set to do something Interest rates look set to rise again.","Be set to leave by 10 o'clock.","Get set… Go!","By 2050, one in six people on the planet will be aged 65 or over.","The number of people globally aged 65 and over is expected/likely to more than double by 2050.","Experts have predicted/forecast that the over-65s will make up 17 per cent of the global population by 2050.","World population is set to reach 9.8 billion by 2050.","Net migration into Britain over the last decade was higher than expected.","Overall population growth in Britain has been in line with predictions."],"opposite":"","synonyms":""},{"def":"fixed; not natural","examples":["a set smile","His face took on a set expression."],"opposite":"","synonyms":""},{"def":"to be strongly opposed to something","examples":["Why are you so dead set against the idea?","Her father is dead set against the marriage."],"opposite":"","synonyms":""},{"def":"to want to do or have something very much; to be determined to do something","examples":["She’s set on a career in medicine.","He’s set on getting a new car","The council is now set on expanding the sports centre.","The government is now set on increasing taxes."],"opposite":"","synonyms":""},{"def":"used to tell runners in a race to get ready and then to start","examples":[],"opposite":"","synonyms":""},{"def":"what you say to tell people to start a race","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be (dead) set against something/against doing something","def":"to be strongly opposed to something","examples":["Why are you so dead set against the idea?","Her father is dead set against the marriage."]},{"idiom":"be set on something/on doing something","def":"to want to do or have something very much; to be determined to do something","examples":["She’s set on a career in medicine.","He’s set on getting a new car","The council is now set on expanding the sports centre.","The government is now set on increasing taxes."]},{"idiom":"on your marks, get set, go!","def":"used to tell runners in a race to get ready and then to start","examples":[]},{"idiom":"(get) ready, (get) set, go","def":"what you say to tell people to start a race","examples":[]}],"phrasal":[],"related":[]}]