[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/set/settl/settle__us_2.mp3","phonsUS":"/ˈsetl/","level":"B2","meanings":[{"def":"to put an end to an argument or a disagreement","examples":["settle something to settle a dispute/a matter/an issue","to settle a case/lawsuit/claim","to settle an argument/a disagreement","It's time you settled your differences with your father.","I want this thing settled.","There is pressure on the unions to settle.","The company has agreed to settle out of court (= come to an agreement without going to court).","Many cases are settled through negotiation.","settle with somebody (for something) The corporation later settled with the singer for $1.5 million.","Hopes of settling the conflict peacefully are fading.","Talks will be held in an attempt to settle the dispute.","This argument must be settled once and for all.","The matter has not yet been finally settled.","I'm delighted that all this has been settled amicably.","This is a matter that can only be settled by a family court.","After six months the company finally settled with the unions."],"opposite":"","synonyms":""},{"def":"to decide or arrange something finally","examples":["settle something It's all settled—we're leaving on the nine o'clock plane.","Good, that's settled, then.","Bob will be there? That settles it. I'm not coming.","He had to settle his affairs (= arrange all his personal business) in Paris before he could return home.","it is settled that… It's been settled that we leave on the nine o'clock plane.","All the loose ends should be settled within 48 hours."],"opposite":"","synonyms":""},{"def":"to make a place your permanent home","examples":["She settled in Vienna after her father's death.","She is an American who settled here a couple of years ago.","The couple afterwards settled near Bournemouth.","He has now settled permanently in London.","He married and settled in a seaside cottage.","His parents eventually settled in Paris."],"opposite":"","synonyms":""},{"def":"to make your permanent home in a country or an area as colonists","examples":["settle something This region was settled by the Dutch in the nineteenth century.","a fertile area that was densely settled in early times","settle + adv./prep. They settled on undeveloped land along the Mississippi.","It was the worst drought since the British settled in Australia in 1788.","Very few Maori were living in the area when the first Europeans settled there."],"opposite":"","synonyms":""},{"def":"to make yourself or somebody else comfortable in a new position","examples":["settle (back) (+ adv./prep.) Ellie settled back in her seat.","They prepared to settle in for the night (= make themselves comfortable for an evening at home).","settle somebody/yourself (+ adv./prep.) He settled himself comfortably in his usual chair.","I settled her on the sofa and put a blanket over her."],"opposite":"","synonyms":""},{"def":"to put something carefully in a position so that it does not move","examples":["She settled the blanket around her knees."],"opposite":"","synonyms":""},{"def":"to become or make somebody/something become calm or relaxed","examples":["The baby wouldn't settle.","settle somebody/something I took a pill to help settle my nerves.","This should settle your stomach.","He was anxious and couldn't settle.","Unable to settle, she trailed around the house all day.","She kept fussing around, refusing to let him settle."],"opposite":"","synonyms":""},{"def":"to fall from above and come to rest on something; to stay for some time on something","examples":["Dust had settled on everything.","Two birds settled on the fence.","I don't think the snow will settle (= remain on the ground without melting).","His gaze settled on her face.","Slowly dusk began to settle."],"opposite":"","synonyms":""},{"def":"to sink slowly down; to make something do this","examples":["The contents of the package may have settled in transit.","Don't drink it yet. Let the grounds settle."],"opposite":"","synonyms":""},{"def":"to pay the money that you owe","examples":["settle something Please settle your bill before leaving the hotel.","The insurance company is refusing to settle her claim.","They used the last of the money to settle their debts.","settle (up) (with somebody) Let me settle with you for the meal.","I'll pay now—we can settle up later."],"opposite":"","synonyms":""},{"def":"to wait for a situation to become clear or certain","examples":["He waited for the dust to settle after the election before making any new decisions."],"opposite":"","synonyms":""},{"def":"to hurt or punish somebody who has harmed or cheated you in the past","examples":["‘Who would do such a thing?’ ‘Maybe someone with an old score to settle.’","An embittered Charlotte is determined to settle accounts with Elizabeth."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"let the dust settle | wait for the dust to settle","def":"to wait for a situation to become clear or certain","examples":["He waited for the dust to settle after the election before making any new decisions."]},{"idiom":"settle a score/accounts (with somebody) | settle an old score","def":"to hurt or punish somebody who has harmed or cheated you in the past","examples":["‘Who would do such a thing?’ ‘Maybe someone with an old score to settle.’","An embittered Charlotte is determined to settle accounts with Elizabeth."]}],"phrasal":["settle down","settle for","settle in","settle into","settle on","settle to"],"related":["settle in","settle on","settle to","settle down","settle for","settle into","settle on something","settle for something","settle in | settle into something","settle something on somebody","settle (down) to something","settle down | settle somebody","settle an old score","let the dust settle","wait for the dust to settle","settle a score/accounts (with somebody)"]},{"pos":"noun","level":"","meanings":[{"def":"an old-fashioned piece of furniture with a long wooden seat and a high back and arms, often also with a box for storing things under the seat","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]