[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/set/setti/setting__us_1.mp3","phonsUS":"/ˈsetɪŋ/","level":"B1","meanings":[{"def":"an environment where something is located; the place at which something happens","examples":["a rural/an ideal/a beautiful/an idyllic setting","setting for something It was the perfect setting for a wonderful Christmas.","in a setting The exhibition shows how bees can live happily in an urban setting.","This is the first time the method has been tested in a clinical setting.","Infections acquired in health-care settings are of increasing concern.","People tend to behave differently in different social settings.","An unhappy home environment can affect children’s behaviour.","a pleasant working environment","The island provided an idyllic setting for the concert.","The huts blend in perfectly with their surroundings.","The mountains in the background were capped with snow.","The hospital is an unlikely setting for an art auction.","The site creates a dramatic setting for the new building.","a hotel in a beautiful mountain setting","a lovely setting for a picnic","elderly people living in a domestic setting","wild animals in their natural setting","A pub was an unliklely setting for a royal reception.","Such problems are best worked out within a family setting.","The island provided an idyllic setting for the concert."],"opposite":"","synonyms":"environment"},{"def":"the place and time at which the action of a play, novel, etc. takes place","examples":["short stories with a contemporary setting","New York City is the setting of his new novel.","setting for something London has been used as the setting for many films.","The Scottish Highlands provide the settings for many of his stories.","The writer fails to place the events in their wider political setting.","the rural setting of Petrarch's sonnets"],"opposite":"","synonyms":""},{"def":"a position at which the controls on a machine can be set, to set the speed, height, temperature, etc.","examples":["There are three speed settings: high, medium, and low.","at a setting The performance of the engine was tested at different settings.","The oven should be at a high setting.","on a setting He keeps the car's speakers on a low volume setting.","In very hot weather it may be necessary to adjust the temperature setting on your fridge."],"opposite":"","synonyms":""},{"def":"the place on a computer or other electronic device where you can choose the way that it works or looks; the particular choices that you make","examples":["To change the size of the font, go to Settings.","It's easy to change the settings on your device.","All tests were run at default settings."],"opposite":"","synonyms":""},{"def":"music written to go with a poem, etc.","examples":["Schubert’s setting of a poem by Goethe"],"opposite":"","synonyms":""},{"def":"a piece of metal in which a precious stone is fixed to form a piece of jewellery","examples":["a ruby in a heavy gold setting"],"opposite":"","synonyms":""},{"def":"a complete set of equipment for eating with (knife, fork, spoon, glass, etc.) for one person, arranged on a table","examples":["a place setting"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["jet-setting","place setting"]}]