[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/set/settl/settlement__us_1.mp3","phonsUS":"/ˈsetlmənt/","level":"C1","meanings":[{"def":"an official agreement that ends an argument between two people or groups","examples":["to negotiate a peace settlement","The management and unions have reached a settlement over new working conditions.","an out-of-court settlement (= money that is paid to somebody or an agreement that is made to stop somebody going to court)","The union has negotiated a temporary settlement.","There are still hopes for a negotiated settlement."],"opposite":"","synonyms":""},{"def":"the action of reaching an agreement","examples":["the settlement of a dispute"],"opposite":"","synonyms":""},{"def":"the conditions, or a document stating the conditions, on which money or property is given to somebody","examples":["a divorce/marriage/property settlement","Nurses refused to accept a pay settlement less than the rate of inflation.","The company had to pay multi-million-dollar settlements to victims.","They made a financial settlement with the family in order to prevent a civil lawsuit.","They signed away their legal rights for a large cash settlement.","They won a settlement of $10.6 million.","a beneficiary under the settlement","a proposed $100-million global settlement of a class action suit"],"opposite":"","synonyms":""},{"def":"the action of paying back money that you owe","examples":["the settlement of a debt","Settlement is made monthly by direct debit.","in settlement of something She had to pay over $5 000 in settlement of her debts."],"opposite":"","synonyms":""},{"def":"a place where people have come to live and make their homes, especially where few or no people lived before","examples":["signs of an Iron Age settlement","a mining settlement","The Romans established a settlement on the south shore.","the earliest urban human settlement in the world"],"opposite":"","synonyms":""},{"def":"the process of people making their homes in a place","examples":["the settlement of the American West","early settlement patterns in South America"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["settlement house","informal settlement","Act of Settlement","settlement houses"]}]