[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sev/sever/severe__us_1.mp3","phonsUS":"/sɪˈvɪr/","level":"B2","meanings":[{"def":"extremely bad or serious","examples":["His injuries are severe.","severe pain/depression/asthma","a severe illness/disease","severe weather/storms","a severe winter (= one during which the weather conditions are extremely bad)","The fire has caused severe damage to the building.","The victim suffered severe brain damage.","a severe shortage of qualified staff","The party suffered severe losses during the last election.","severe learning difficulties","a severe case of woodworm","Strikes are causing severe disruption to all train services.","If the pain becomes severe, you may wish to contact a doctor.","women affected by mild to moderately severe symptoms","an exceptionally severe frost","A severe storm blew the ship off course.","a severe handicap"],"opposite":"","synonyms":""},{"def":"punishing somebody in an extreme way when they break a particular set of rules","examples":["a severe punishment/sentence/penalty","severe on/with somebody The courts are becoming more severe on young offenders.","Her parents were never so severe with her older brother.","Anyone found using drugs will receive severe punishment.","He received a severe reprimand for his behaviour.","These women have to endure poor living conditions, low pay and severe discipline."],"opposite":"","synonyms":""},{"def":"not kind or showing sympathy; not smiling or showing approval","examples":["a severe expression","She fixed them with a very severe look.","She was a severe woman who seldom smiled."],"opposite":"","synonyms":""},{"def":"extremely difficult and requiring a lot of skill or ability","examples":["The marathon is a severe test of stamina."],"opposite":"","synonyms":""},{"def":"extremely plain and without any decoration","examples":["Modern furniture is a little too severe for my taste.","Her hair was short and severe.","She was wearing a severe dark grey jacket."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]