[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sex/sex__/sex__us_1.mp3","phonsUS":"/seks/","level":"B1","meanings":[{"def":"the state of being male or female","examples":["How can you tell what sex a fish is?","sex of somebody/something a process that enables couples to know the sex of their baby","We determined the sex of the birds from their DNA.","Please indicate your sex and date of birth below.","Levels of infection vary dramatically according to age and sex.","discrimination on grounds of race or sex","sex discrimination (= the act of treating men and women differently in an unfair way)","Testosterone is the male sex hormone.","In some areas the male : female sex ratio has reached 130 : 100.","Trying to prove that sex differences in behaviour are innate is controversial.","discrimination on grounds of sex","The word ‘man’ can refer to all humans, irrespective of sex.","Their gender identity does not match their biological sex at birth.","I wanted to change my sex.","issues of sex equality in the office","The theory predicts sex differences in the brain."],"opposite":"","synonyms":""},{"def":"either of the two groups that people, animals, and plants are divided into according to their function of producing young","examples":["a member of the opposite sex","people of the same sex","single-sex schools","differences between the sexes","Exam results for both sexes have continued to improve.","Gibson was the first African American of either sex to play at Wimbledon.","the battle of the sexes (= the competitive relationship that exists between men and women)"],"opposite":"","synonyms":""},{"def":"physical activity between two people in which they touch each other’s sexual organs, and which may include sexual intercourse","examples":["sex with somebody He had sex with someone he met in a bar.","gay sex","the sex act","a footballer involved in a sex scandal","victims of sex abuse","sex education in schools","a controversial film containing explicit sex scenes","a sex shop (= one selling magazines, objects, etc. that are connected with sex)","These drugs may affect your sex drive (= your interest in sex and the ability to have it).","Amid such poverty, the sex trade has flourished.","The slogan for the hippie generation of the 1960s was sex, drugs and rock and roll.","sex between consenting adults","sex with her husband","They teach that sex outside of marriage is wrong.","I have had several sex partners over the years.","safer sex practices","Sex sells, the advertisers believe.","Movies containing scenes of explicit sex are banned.","He was convicted of having unlawful sex with an underage girl.","to crack down on international sex trafficking","He was arrested for sex crimes.","The film featured graphic scenes of sex and violence.","It's important to abstain from sex until treatment is completed."],"opposite":"","synonyms":""},{"def":"having the amount of sexual activity or desire mentioned","examples":["a highly-sexed person"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["sex up","safe sex","same-sex","sex life","sex appeal","sex change","sex maniac","sex object","sex symbol","sex typing","sex worker","sex offender","fair sex","sex chromosome","fairer sex","Sex Pistols","Sex and the City","Sex Discrimination Act","sex lives"]},{"pos":"verb","level":"","meanings":[{"def":"to examine an animal in order to find out whether it is male or female","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["sex up"],"related":[]}]