[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sha/shado/shadow__us_1.mp3","phonsUS":"/ˈʃædəʊ/","level":"B2","meanings":[{"def":"the dark shape that somebody/something’s form makes on a surface, for example on the ground, when they are between the light and the surface","examples":["The children were having fun, chasing each other's shadows.","As the curtains moved in the breeze, the shadows on the floor seemed to dance.","The ship's sail cast a shadow on the water.","The shadows lengthened as the sun went down.","The man's face is hidden in a deep shadow cast by his umbrella.","They saw the shadow of a man pass by.","(figurative) He didn't want to cast a shadow on (= spoil) their happiness.","Let’s sit in the shade for a while.","As the sun went down we cast long shadows on the lawn.","Her face was in deep shadow.","A dark shadow loomed over her.","Deep shadows lay across the small clearing where they sat.","The candles on the table threw huge flickering shadows against the wall.","The shadows of the clouds passed over us.","Use a desk light to produce a strong shadow.","As he stood still I traced the outline of his shadow on the wall."],"opposite":"","synonyms":""},{"def":"darkness in a place or on something, especially so that you cannot easily see who or what is there","examples":["in the shadows I thought I saw a figure standing in the shadows.","in shadow His face was deep in shadow, turned away from her.","A man in black emerged from the shadows.","It had grown dark, and the shadows could be hiding anything.","It's a spooky story about the monsters that lurk in the shadows.","She shrank back into the shadows as the footsteps approached.","‘I'm right here,’ I said, stepping out of the shadows.","Let’s sit in the shade for a while.","As the sun went down we cast long shadows on the lawn.","Her face was in deep shadow.","I could just make out a figure in the shadows.","She shrank back into the shadows as the footsteps approached.","Suddenly a huge figure loomed up out of the shadows.","The house lay in dark shadow.","The storm clouds threw the mountain peaks into dense shadow.","She lay on the bed in a pool of shadow."],"opposite":"","synonyms":""},{"def":"a very small amount of something","examples":["A shadow of a smile touched his mouth.","She knew beyond a shadow of a doubt (= with no doubt at all) that he was lying."],"opposite":"","synonyms":""},{"def":"the strong (often bad) influence of somebody/something","examples":["The new leader wants to escape from the shadow of his predecessor.","Bergman casts a long shadow over world cinema.","under the shadow of somebody/something These people have been living for years under the shadow of fear."],"opposite":"","synonyms":""},{"def":"dark areas under somebody’s eyes, because they are tired, etc.","examples":["She looked pale, with deep shadows under her eyes."],"opposite":"","synonyms":""},{"def":"a person or an animal that follows somebody else all the time","examples":[],"opposite":"","synonyms":""},{"def":"a thing that is not real or possible to obtain","examples":["You can't spend all your life chasing shadows."],"opposite":"","synonyms":""},{"def":"to be very easily frightened; to be very nervous","examples":[],"opposite":"","synonyms":""},{"def":"to not have the strength, influence, etc. that you used to have","examples":["When his career ended, he became a shadow of his former self."],"opposite":"","synonyms":""},{"def":"very close to","examples":["The new market is in the shadow of the City Hall."],"opposite":"","synonyms":""},{"def":"when you say that somebody is in/under the shadow of another person, you mean that they do not receive as much attention as that person","examples":["A younger son often lives in the shadow of his elder brother."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be frightened/nervous/scared of your own shadow","def":"to be very easily frightened; to be very nervous","examples":[]},{"idiom":"be a shadow/ghost of your former self","def":"to not have the strength, influence, etc. that you used to have","examples":["When his career ended, he became a shadow of his former self."]},{"idiom":"in/under the shadow of","def":"very close to","examples":["The new market is in the shadow of the City Hall.","A younger son often lives in the shadow of his elder brother."]}],"phrasal":[],"related":["shadow-box","shadow-boxing","5 o'clock shadow","five o’clock shadow","Shadow Cabinet","shadow-boxes","shadow-boxed","five o'clock shadow","be a shadow/ghost of your former self","be frightened/nervous/scared of your own shadow"]},{"pos":"verb","level":"","meanings":[{"def":"to follow and watch somebody closely and often secretly","examples":["He was shadowed for a week by the secret police."],"opposite":"","synonyms":""},{"def":"to be with somebody who is doing a particular job, so that you can learn about it","examples":["It is often helpful for teachers to shadow managers in industry."],"opposite":"","synonyms":""},{"def":"to cover something with a shadow","examples":["A wide-brimmed hat shadowed her face.","The bay was shadowed by magnificent cliffs."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adjective","level":"","meanings":[{"def":"used to refer to senior politicians of the main opposition party who would become government ministers if their party won the next election","examples":["the shadow Chancellor","the shadow Cabinet"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]