[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sha/shade/shade__us_1.mp3","phonsUS":"/ʃeɪd/","level":"B2","meanings":[{"def":"an area that is dark and cool under or behind something, for example a tree or building, because the sun’s light does not get to it","examples":["shade of something The shade of the pine tree provided some protection from the sun.","in the shade The temperature can reach 40°C in the shade.","in the shade of something We sat down in the shade of the wall.","in shade These plants grow well in sun or shade.","under the shade of something Two cows were sleeping under the shade of some trees.","The trees provide shade for the animals in the summer.","Let’s sit in the shade for a while.","As the sun went down we cast long shadows on the lawn.","Her face was in deep shadow.","I searched for a patch of shade to rest in.","Let's move into the shade.","The huge trees offered shade from the sun.","They were sitting under the shade of an umbrella.","the need to ensure adequate shade for coffee plants"],"opposite":"","synonyms":""},{"def":"a thing that you use to prevent light from coming through or to make it less bright","examples":["I bought a new shade for the lamp.","an eyeshade"],"opposite":"","synonyms":""},{"def":"material that covers a window, often consisting of a roll of cloth that is fixed at the top of the window and can be pulled up and down","examples":[],"opposite":"","synonyms":""},{"def":"a particular form of a colour, that is, how dark or light it is","examples":["shade of something a dark/light/pale/bright shade of blue","a subtle/delicate shade of grey","His face turned an even deeper shade of red.","Cool pastel shades are just right for summer.","He threw out his old suits, all in various shades of brown.","The ocean glistened in shades of blue and emerald.","This wool is available in 18 stunning shades.","Towels in warm shades can soften the room.","a room painted in startling shades of pink and orange","our new range of shades for lips and eyes","Her eyes were a delicate shade of green.","Use different shades of the same colour, rather than lots of different colours."],"opposite":"","synonyms":"colour"},{"def":"the dark areas in a picture, especially the use of these to produce variety","examples":["The painting needs more light and shade."],"opposite":"","synonyms":""},{"def":"a different kind or level of opinion, feeling, etc.","examples":["politicians of all shades of opinion","The word has many shades of meaning.","reformers of all political shades"],"opposite":"","synonyms":""},{"def":"a little; slightly","examples":["He was feeling a shade disappointed.","Her skirt was a shade too short."],"opposite":"","synonyms":""},{"def":"sunglasses (= a pair of glasses with dark glass in them that you wear to protect your eyes from bright light from the sun)","examples":[],"opposite":"","synonyms":""},{"def":"the spirit of a dead person; a ghost","examples":[],"opposite":"","synonyms":""},{"def":"to be much better or more impressive than somebody/something","examples":["I tried hard but her work put mine in the shade."],"opposite":"","synonyms":""},{"def":"used when you are referring to things that remind you of a particular person, thing or time","examples":["short skirts and long boots—shades of the 1960s"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"put somebody/something in the shade","def":"to be much better or more impressive than somebody/something","examples":["I tried hard but her work put mine in the shade."]},{"idiom":"shades of somebody/something","def":"used when you are referring to things that remind you of a particular person, thing or time","examples":["short skirts and long boots—shades of the 1960s"]}],"phrasal":[],"related":["shade into","shade tree","window shade","shade trees","shade into something"]},{"pos":"verb","level":"","meanings":[{"def":"to prevent direct light from reaching something","examples":["shade somebody/something The courtyard was shaded by high trees.","shade somebody/something from/against something She shaded her eyes against the sun.","This plant prefers a lightly shaded position.","We were completely shaded from the sun by the poplar trees."],"opposite":"","synonyms":""},{"def":"to provide a screen for a lamp, light, etc. to make it less bright","examples":["a shaded lamp"],"opposite":"","synonyms":""},{"def":"to make a part of a drawing, etc. darker, for example with an area of colour or with pencil lines","examples":["shade something What do the shaded areas on the map represent?","shade something in I'm going to shade this part in."],"opposite":"","synonyms":""},{"def":"to win a contest by scoring only a very small number of points, goals, etc. more than your opponent","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["shade into"],"related":[]}]