[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sha/shake/shake__us_1.mp3","phonsUS":"/ʃeɪk/","level":"A2","meanings":[{"def":"to move or make somebody/something move with short quick movements from side to side or up and down","examples":["The whole house shakes when a train goes past.","shake somebody/something Shake the bottle well before use.","The explosion shook windows miles from the site.","shake somebody/something by something He shook her violently by the shoulders.","shake somebody/something + adj. He knelt and gently shook her awake.","She shook her hair loose.","The ground began to shake.","He shook the blankets vigorously to get rid of the dust.","Shake the pan gently to settle the contents.","She must have shaken the baby quite violently to inflict such severe injuries."],"opposite":"","synonyms":""},{"def":"to move something in a particular direction by shaking","examples":["She bent down to shake a pebble out of her shoe.","His father used to come home and shake the dust off his work clothes.","He stood up, shaking sand everywhere."],"opposite":"","synonyms":""},{"def":"to take somebody’s hand and move it up and down as a way of saying hello or to show that you agree about something","examples":["shake hands Do people in Italy shake hands when they meet?","shake hands with somebody She refused to shake hands with him.","shake somebody’s hand He stepped forward and shook my hand.","shake somebody by the hand Our host shook each of us warmly by the hand.","shake hands on something They shook hands on the deal (= to show that they had reached an agreement).","shake on something They shook on the deal (= shook hands to show the deal was agreed).","Let's shake on it.","The captains shook hands before the game commenced.","If I met him I'd shake him by the hand and congratulate him."],"opposite":"","synonyms":""},{"def":"to turn your head from side to side as a way of saying ‘no’ or to show that you are sad, feel doubt, etc.","examples":["‘Drink?’ he offered. She shook her head.","The old man watched them walk off into the night, shaking his head sadly.","She shook her head in disbelief.","He shook his head at the thought."],"opposite":"","synonyms":""},{"def":"to show that you are angry with somebody; to threaten somebody by shaking your fist (= closed hand)","examples":["The man shook his fist at the court after he was sentenced."],"opposite":"","synonyms":""},{"def":"to make short quick movements that you cannot control, for example because you are cold or afraid","examples":["Her hands had started to shake.","shake with something He was shaking with fear.","He saw his mother turn away, her shoulders shaking with laughter.","His whole body shook with rage.","I was shaking like a leaf.","He was almost shaking with the intensity of what he was saying.","He was crying and shaking all over.","I found myself shaking uncontrollably with cold.","I just couldn't stop shaking.","I was numb with dread. I was literally shaking.","Roxy was practically shaking with anger.","Natalie fairly shook with laughter.","She got up, her legs shaking as well as her hands."],"opposite":"","synonyms":""},{"def":"to sound unsteady, usually because you are nervous, upset or angry","examples":["‘Who are you?’ he asked, his voice shaking.","Her voice shook with emotion."],"opposite":"","synonyms":""},{"def":"to shock or upset somebody very much","examples":["shake somebody He was badly shaken by the news of her death.","shake somebody up The accident really shook her up.","Shaken up by the early goal against them, the team began to fight back."],"opposite":"","synonyms":""},{"def":"to make a belief or an idea less certain","examples":["The incident had shaken her faith in him.","This announcement is bound to shake the confidence of the industry."],"opposite":"","synonyms":""},{"def":"to get rid of something","examples":["shake something off I can't seem to shake off this cold.","She has finally managed to shake off her old wrist injury.","shake something He couldn't shake the feeling that there was something wrong.","She never seemed to completely shake off the dumb blonde image."],"opposite":"","synonyms":""},{"def":"to cause people to question their basic beliefs about something","examples":["This issue has shaken the foundations of French politics.","an event which rocked the foundations of British politics","The scandal rocked the legal establishment to its foundations."],"opposite":"","synonyms":""},{"def":"to be very frightened or nervous","examples":[],"opposite":"","synonyms":""},{"def":"used to tell somebody to start to do something or to hurry","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"shake/rock the foundations of something | shake/rock something to its foundations","def":"to cause people to question their basic beliefs about something","examples":["This issue has shaken the foundations of French politics.","an event which rocked the foundations of British politics","The scandal rocked the legal establishment to its foundations."]},{"idiom":"shake in your boots/shoes","def":"to be very frightened or nervous","examples":[]},{"idiom":"shake a leg","def":"used to tell somebody to start to do something or to hurry","examples":[]}],"phrasal":["shake down","shake off","shake out","shake up"],"related":["shake up","shake-up","shake off","shake out","shake-out","shake down","protein shake","shake-ups","shake-outs","shake somebody","shake something","shake somebody/something","shake a leg","shake in your boots/shoes"]},{"pos":"noun","level":"B1","meanings":[{"def":"an act of shaking somebody/something","examples":["She gave him a shake to wake him.","Give the bottle a good shake before opening.","shake of something He dismissed the idea with a firm shake of his head (= turning it from side to side to mean ‘no’).","He gave himself a mental shake and got down to work.","a rueful shake of the head"],"opposite":"","synonyms":""},{"def":"a physical condition in which you cannot stop your body from shaking because of fear, illness, or because you have drunk too much alcohol","examples":["I always get the shakes before exams."],"opposite":"","synonyms":""},{"def":"a drink made of milk, and sometimes ice cream, with the added taste of fruit or chocolate, which is mixed or shaken until it is full of bubbles","examples":["a strawberry shake"],"opposite":"","synonyms":""},{"def":"to be not very good, efficient, suitable, etc.","examples":[],"opposite":"","synonyms":""},{"def":"(to give somebody/get) fair treatment that gives you the same chance as somebody else","examples":["Are minority students getting a fair shake at college?","We need a government that cares about equity and a fair go for all."],"opposite":"","synonyms":""},{"def":"very soon","examples":["We’ll be there in a couple of shakes."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be no great shakes","def":"to be not very good, efficient, suitable, etc.","examples":[]},{"idiom":"(give somebody/get) a fair shake","def":"(to give somebody/get) fair treatment that gives you the same chance as somebody else","examples":["Are minority students getting a fair shake at college?","We need a government that cares about equity and a fair go for all."]},{"idiom":"in two shakes | in a couple of shakes","def":"very soon","examples":["We’ll be there in a couple of shakes."]}],"phrasal":[],"related":[]}]