[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sha/shame/shame__us_1.mp3","phonsUS":"/ʃeɪm/","level":"B2","meanings":[{"def":"used to say that something is a cause for feeling sad or disappointed","examples":["She's retiring because of ill health, which is a great shame.","What happened was a real shame.","shame (that)… It's a shame that she wasn't here to see it.","Shame they didn't think of that earlier.","It’s a shame (that) you didn’t say something sooner.","What a shame they couldn't come.","shame about somebody/something It's a shame about Tim, isn't it?","shame about somebody/something doing something It's a terrible shame about Stuart losing his job, isn't it?","shame to do something It's a shame to see her wasting her talent like this.","shame for somebody/something to do something It'd be a shame for us to give up now.","It would be a crying shame (= a great shame) not to take them up on the offer.","It seems such a shame to throw perfectly good food away.","Shame they couldn't make it.","It is a national shame that our prisons serve as mental institutions.","It would be a shame for all the work that has been done to be wasted."],"opposite":"","synonyms":""},{"def":"the feelings of being sad, embarrassed or guilty that you have when you know that something you have done is wrong or stupid","examples":["with shame His face burned with shame.","They should blush with shame.","in shame She hung her head in shame.","shame of something The king preferred death to the shame of defeat.","shame of doing something It took me a while to get over the shame of not doing something to help him.","shame of somebody/something doing something He could not live with the shame of other people knowing the truth.","shame at something I felt a twinge of shame at the thought.","shame at doing something She admitted her shame at having a parent in prison.","shame for doing something He was filled with shame for giving in to his anger.","shame for something She expressed her shame for her role in the whole unfortunate business.","I would die of shame if she ever found out.","To my shame (= I feel shame that) I refused to listen to her side of the story.","Do you feel no shame for what you've done?","He had cried noisily and without shame at the news of Esther's death.","Her pregnancy was no cause for shame.","She felt a flush of shame at what she'd done.","She wept from the shame of having let everyone down.","This is the secret shame I have carried around for decades."],"opposite":"","synonyms":""},{"def":"the ability to feel shame at something you have done","examples":["Have you no shame?","without shame That child is completely without shame!","She has no sense of shame."],"opposite":"","synonyms":""},{"def":"the loss of respect that is caused when you do something wrong or stupid","examples":["There is no shame in wanting to be successful.","(formal) She felt that her failure would bring shame on her family.","He risked public shame and possible imprisonment."],"opposite":"","synonyms":""},{"def":"to be much better than somebody/something","examples":["Their presentation put ours to shame.","Her energy and enthusiasm puts the rest of us to shame (= makes us feel embarrassed and guilty that we are not the same)."],"opposite":"","synonyms":""},{"def":"used to say that somebody should feel ashamed for something they have said or done","examples":["Shame on you for doubting me!"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"put somebody/something to shame","def":"to be much better than somebody/something","examples":["Their presentation put ours to shame.","Her energy and enthusiasm puts the rest of us to shame (= makes us feel embarrassed and guilty that we are not the same)."]},{"idiom":"shame on you, him, etc.","def":"used to say that somebody should feel ashamed for something they have said or done","examples":["Shame on you for doubting me!"]}],"phrasal":[],"related":["flight shame","shame into doing","shame somebody into doing something","name and shame","be a crying shame"]},{"pos":"verb","level":"","meanings":[{"def":"to make somebody feel ashamed","examples":["His generosity shamed them all.","The people who did this all deserve to be publicly shamed."],"opposite":"","synonyms":""},{"def":"to make somebody feel that they have lost honour or respect","examples":["You have shamed your family."],"opposite":"","synonyms":""},{"def":"to publish the names of people or organizations who have done something wrong or illegal","examples":["The companies that pollute our rivers should be named and shamed."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"name and shame","def":"to publish the names of people or organizations who have done something wrong or illegal","examples":["The companies that pollute our rivers should be named and shamed."]}],"phrasal":["shame into doing"],"related":[]},{"pos":"exclamation","level":"","meanings":[{"def":"used to express sympathy, or to show that you like somebody/something","examples":["Shame, she's so cute!"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]