[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sha/share/share__us_1.mp3","phonsUS":"/ʃer/","level":"A1","meanings":[{"def":"to have, use or experience something at the same time as somebody else","examples":["There isn't an empty table. Would you mind sharing?","share something to share a room/bed","Parents said there was insufficient room for the two schools to share space.","It's been 23 years since these four men shared a stage.","share something with somebody Sue shares a house with three other students.","Bob told Jess he wanted to share his life with her."],"opposite":"","synonyms":""},{"def":"to have part of something while another person or other people also have part","examples":["share something All members of the band equally share the band's profits.","share something with somebody He shared the pie with her.","The Hungarian king shared power with the Austrian emperor to form the Austro-Hungarian Empire.","share in something Each partner is entitled to share in the profits of the business."],"opposite":"","synonyms":""},{"def":"to divide something between two or more people","examples":["share something among/between somebody We shared the pizza between the four of us.","share something out among/between somebody Rita shared her money out among her six grandchildren.","share something out Profits are shared out yearly.","How do you share out three cakes among four people?","We shared the money equally between the three of us."],"opposite":"","synonyms":""},{"def":"to give some of what you have to somebody else; to let somebody use something that is yours","examples":["John had no brothers or sisters and wasn't used to sharing.","share something The conference is a good place to share information and exchange ideas.","share something with somebody This online resource will give farmers a new way to share knowledge with each other.","Eli shared his chocolate with the other kids.","experienced teachers willing to share their expertise with others","an environment where information is freely shared"],"opposite":"","synonyms":""},{"def":"to have the same feelings, ideas, experiences, etc. as somebody else","examples":["share something to share a concern/an opinion","shared values","They shared a common interest in botany.","a view that is widely shared","They share a love of cinema.","His son doesn't share his passion for athletics.","share something with somebody We share many beliefs with followers of other religions.","People often share their political views with their parents.","share in something I didn't really share in her love of animals.","Personal experience of childbirth gives a dimension of knowledge that others cannot fully share.","These ideas are widely shared in the community.","She wished he would let her share his pain.","He shared in our enthusiasm for rowing."],"opposite":"","synonyms":""},{"def":"to tell other people about your ideas, experiences, and feelings","examples":["share something to share thoughts/ideas/feelings/memories","I did not find it easy to share my problems.","The two friends shared everything—they had no secrets.","Please share this on Facebook and Twitter so we can get the word out.","I want to share the stories of several people I met.","Think of this as an opportunity to share your experiences.","The group listens while one person shares (= tells other people about their experiences, feelings, etc.).","share something with somebody Would you like to share your experience with the rest of the group?"],"opposite":"","synonyms":""},{"def":"to be equally involved in something or responsible for something","examples":["share something Both drivers shared the blame for the accident.","share something with somebody Don't try to do everything yourself: you will need to share the load with your partner.","be shared between A and B Responsibility is shared between parents and teachers.","share in something I try to get the kids to share in the housework."],"opposite":"","synonyms":""},{"def":"used to say that everyone should share things equally and in a fair way","examples":[],"opposite":"","synonyms":""},{"def":"if you talk to somebody about your problems and worries, instead of keeping them to yourself, they seem less serious","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"share and share alike","def":"used to say that everyone should share things equally and in a fair way","examples":[]},{"idiom":"a trouble shared is a trouble halved","def":"if you talk to somebody about your problems and worries, instead of keeping them to yourself, they seem less serious","examples":[]}],"phrasal":[],"related":["-share","job-share","share-out","share index","market share","share option","ordinary share","share-outs","share options","a slice/share of the cake","a piece/slice/share of the pie","share and share alike","the lion’s share (of something)","a share/slice of the cake","a slice/piece/share of the pie"]},{"pos":"combining form","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/_/_sh/_shar/_share_1_us_2.mp3","level":"","meanings":[{"def":"(in nouns) an arrangement to divide something between two or more people, groups, etc.","examples":["a job-share (= a job that is done by two people who each work for part of the week)","(British English) a nanny share (= an arrangement for somebody to work for two families)"],"opposite":"","synonyms":""},{"def":"(in verbs) using an arrangement in which two or more people or groups use or have the same thing","examples":["(especially British English) We encourage people to carshare to reduce congestion on the roads.","(North American English) to rideshare"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"B1","meanings":[{"def":"one part of something that is divided between two or more people","examples":["share of something Next year we hope to have a greater share of the market.","The charity was supposed to have been given a share of the profits.","The party won its biggest share of the vote since 1992.","The new TV channel has continued to increase its share of advertising revenue.","The three hospitals will each receive an equal share of the money raised.","Why should he be entitled to a larger share of the royalties?","How much was your share of the winnings?","share in something I have a 50 per cent share in the business.","If you die before your husband, your share in the property may go directly to your children.","(British English) I'm looking for a flat share (= a flat that is shared by two or more people who are not related).","She may be entitled to a share of his future earnings.","The region receives a higher share of tax revenue than it raises.","The wife owns an 80% share of their second home.","I'm hoping for a share in the profits.","She won a share of the spoils at the last competition.","The government devotes a disproportionate share of the budget to military expenditure."],"opposite":"","synonyms":""},{"def":"the part that somebody has in a particular activity that involves several people","examples":["We all did our share.","share of something Everyone must accept their share of the blame.","Churchill bore a huge share of the responsibility for this failure.","We must all do our share of the work."],"opposite":"","synonyms":""},{"def":"an amount of something that is thought to be normal or acceptable for one person or thing","examples":["He always eats more than his share.","share of something I've had my share of luck in the past.","I've done my share of worrying for one day!","The industry has had its share of problems this year.","a branch of literature which has yet to receive its full share of attention","It is right to pay your full share of tax.","She has seen her share of suffering.","He had done his share of partying in college.","Everyone wants to claim their share of fame and fortune."],"opposite":"","synonyms":""},{"def":"the action of sending on a message on social media for other people to see","examples":["The campaign has already received 180 000 shares on Twitter."],"opposite":"","synonyms":""},{"def":"any of the units of equal value into which a company is divided that are sold to raise money. People who own shares receive part of the company’s profits.","examples":["to have/hold/own shares","to buy/sell/trade shares","The company purchased 5.5m shares of the stock this week.","The company's shares fell 4.37 per cent.","Earnings per share are growing.","share in something They acquired shares in the company earlier this year.","shares in British Telecom","a fall in share prices","70% of our share capital is in the hands of international investors.","a share certificate","The airline's shares closed (= finished trading for the day) up 8p at 171p.","American shares rose 2.7% the next day.","The company's shares slumped 11%.","Will this affect the value of my shares?","Hong Kong share prices plunged.","I have a few shares in the gas company.","I have some money in stocks and shares.","The company has issued four classes of shares.","The shares were trading at $1.10.","allegations of illegal share dealings"],"opposite":"","synonyms":""},{"def":"the broad curved blade (= metal cutting edge) of a plough","examples":[],"opposite":"","synonyms":""},{"def":"(more than) an amount of something that is considered to be reasonable or acceptable","examples":["He has more than his fair share of problems.","I've had my fair share of success in the past."],"opposite":"","synonyms":""},{"def":"the largest or best part of something when it is divided","examples":[],"opposite":"","synonyms":""},{"def":"a share of the available money or benefits that you believe you have a right to","examples":["Scotland is demanding a larger share of the national cake."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"(more than) your fair share of something","def":"(more than) an amount of something that is considered to be reasonable or acceptable","examples":["He has more than his fair share of problems.","I've had my fair share of success in the past."]},{"idiom":"the lion’s share (of something)","def":"the largest or best part of something when it is divided","examples":[]},{"idiom":"a share/slice of the cake","def":"a share of the available money or benefits that you believe you have a right to","examples":["Scotland is demanding a larger share of the national cake."]}],"phrasal":[],"related":[]}]