[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/she/shed_/shed__us_1.mp3","phonsUS":"/ʃed/","level":"C1","meanings":[{"def":"to get rid of something that is no longer wanted","examples":["The factory is shedding a large number of jobs.","a quick way to shed unwanted pounds (= extra weight or fat on your body)","Museums have been trying hard to shed their stuffy image.","She was determined to shed some weight and get fit.","The firm is trying to shed its old-fashioned image.","Her mother had shed ten years since her marriage to Douglas."],"opposite":"","synonyms":""},{"def":"to take off a piece of clothing","examples":["We shed our jackets.","Luke shed his clothes onto the floor."],"opposite":"","synonyms":""},{"def":"to lose or drop what it is carrying","examples":["The traffic jam was caused by a lorry shedding its load."],"opposite":"","synonyms":""},{"def":"if an animal sheds its skin, or a plant sheds leaves, it loses them naturally","examples":["How often does a snake shed its skin?","trees that shed their leaves in autumn"],"opposite":"","synonyms":""},{"def":"to send light over something; to let light fall somewhere","examples":["The candles shed a soft glow on her face."],"opposite":"","synonyms":""},{"def":"to cry","examples":["She shed no tears when she heard he was dead."],"opposite":"","synonyms":""},{"def":"to kill or injure people, especially in a war","examples":["How much blood will be shed before the fighting ends?"],"opposite":"","synonyms":""},{"def":"to have the quality of causing water or liquid to run off and not sink in","examples":["A duck's feathers shed water immediately."],"opposite":"","synonyms":""},{"def":"to make a problem, etc. easier to understand","examples":["Recent research has shed new light on the causes of the disease."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"cast/shed/throw light on something","def":"to make a problem, etc. easier to understand","examples":["Recent research has shed new light on the causes of the disease."]}],"phrasal":[],"related":["potting shed","cast/shed/throw light on something"]},{"pos":"noun","level":"","meanings":[{"def":"a small simple building, usually built of wood or metal, used for keeping things in","examples":["a bicycle shed","(British English) a garden shed","a tool shed"],"opposite":"","synonyms":""},{"def":"a large industrial building, used for working in or keeping equipment","examples":["an engine shed"],"opposite":"","synonyms":""},{"def":"a building with open sides where the wool is cut off sheep (= they are sheared) or where cows are milked","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]