[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/she/shelt/shelter__us_3.mp3","phonsUS":"/ˈʃeltər/","level":"B2","meanings":[{"def":"the fact of having a place to live or stay, considered as a basic human need","examples":["Human beings need food, clothing and shelter.","without shelter In developing countries, more than 640 million are without shelter.","The nuns won't refuse you shelter.","They were anxious to find shelter for the night."],"opposite":"","synonyms":""},{"def":"protection from rain, danger, or attack","examples":["shelter from something to take shelter from the storm","People were desperately seeking shelter from the gunfire.","The sand dunes provided shelter from the wind.","shelter of something The fox was running for the shelter of the trees.","She was standing in the shelter of the doorway.","The great elm trees gave shelter from the wind.","We had to leave the shelter of the trees.","He took shelter from the rain under a bridge."],"opposite":"","synonyms":""},{"def":"a structure built to give protection, especially from the weather or from attack","examples":["They built a rough shelter from old pieces of wood.","He helped construct temporary shelters in 10 villages before the rains came.","an air-raid shelter","a bomb shelter","Pupils have been sent home and schools have been turned into emergency shelters.","shelter for somebody/something a shelter for cattle"],"opposite":"","synonyms":""},{"def":"a building, usually owned by a charity, that provides a place to stay for people without a home, or protection for people or animals who have been badly treated","examples":["a night shelter for the homeless","an animal shelter","She works as a volunteer at a homeless shelter.","You'll be safer in the shelter."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Shelter","bus shelter","tax shelter","Anderson shelter","shelter in place"]},{"pos":"verb","level":"B2","meanings":[{"def":"to give somebody/something a place where they are protected from the weather or from danger; to protect somebody/something","examples":["shelter somebody/something from somebody/something Trees shelter the house from the wind.","shelter somebody/something helping the poor and sheltering the homeless","The American government has accused them of sheltering terrorists.","Perhaps I sheltered my daughter too much (= protected her too much from unpleasant or difficult experiences)."],"opposite":"","synonyms":""},{"def":"to stay in a place that protects you from the weather or from danger","examples":["A bomb fell on the building, killing those who were sheltering inside.","shelter from something We sheltered from the rain in a doorway.","Spectators sheltered under umbrellas as the rain got heavier.","As the storm approached, they tried to find somewhere to shelter."],"opposite":"","synonyms":""},{"def":"to stay indoors during an emergency in order to protect yourself and others","examples":["Residents of the city have been ordered to shelter in place for at least the next three weeks."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"shelter in place","def":"to stay indoors during an emergency in order to protect yourself and others","examples":["Residents of the city have been ordered to shelter in place for at least the next three weeks."]}],"phrasal":[],"related":[]},{"pos":"","level":"","meanings":[{"def":"a British charity established in 1966 to help people who have nowhere to live, either by finding homes for them or by providing places in cities where they can sleep at night. It also acts as a pressure group to try to influence the government to do more to help people without homes.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]