[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/shi/shift/shift__us_1.mp3","phonsUS":"/ʃɪft/","level":"B1","meanings":[{"def":"a period of time worked by a group of workers who start work as another group finishes","examples":["to work a shift","I've just finished an eight-hour shift.","in shifts working in shifts","on a shift to be on the day/night shift at the factory","shift workers/work","He works the night shift.","I agreed to work double shifts for a few weeks.","I didn't realize that I'd have to work shifts.","I'm doing the early shift this week.","It was 8 a.m. and the nurses were changing shifts.","My husband changed his shifts from afternoons to nights.","The clinic is staffed by ten doctors who work in shifts.","The shift change took place at 10 p.m.","They'd altered his shift pattern twice in the past fortnight."],"opposite":"","synonyms":""},{"def":"the workers who work a particular shift","examples":["The night shift has/have just come off duty.","The drama began at 5.15 am as the day shift was going on duty.","Most of the night shift had already left.","As I left the next shift was settling in for the day."],"opposite":"","synonyms":""},{"def":"a change in opinion, mood, policy, etc.","examples":["The minister's recent announcement represents a major policy shift.","a sudden shift to the right in British politics","shift in something Does the government's condemnation of the regime signal a shift in policy?","a dramatic shift in public opinion","The moment marked a significant shift in attitudes to the war.","Over the last ten years there has been a fundamental shift in the way we do business.","shift of something a shift of emphasis","With the shift of power in the Senate, the bill's fate is in doubt.","shift towards something A gradual shift towards renewable energy would mean reduced carbon emissions.","shift from something to something In developed countries there has been a shift from manufacturing to services.","There was a gradual shift in the population away from the countryside to the towns.","I detected a subtle shift towards our point of view.","The industry has undergone a fundamental shift in recent years.","The moment marked a significant shift in attitudes to the war.","There has been a major shift in the public's taste.","These climate shifts occurred over less than a decade.","These proposals represent a dramatic shift in policy.","a shift towards part-time farming","the shift away from direct taxation"],"opposite":"","synonyms":""},{"def":"the system on a computer keyboard or typewriter that allows capital letters or a different set of characters to be typed; the key that operates this system","examples":[],"opposite":"","synonyms":""},{"def":"a woman’s simple straight dress","examples":[],"opposite":"","synonyms":""},{"def":"a simple straight piece of clothing worn by women in the past as underwear","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["night shift","sound shift","split shift","stick shift","swing shift","Doppler shift","graveyard shift","paradigm shift","shift for yourself","shift your ground"]},{"pos":"verb","level":"B2","meanings":[{"def":"to move, or move something, from one position or place to another","examples":["Lydia shifted uncomfortably in her chair.","I shifted uneasily under his gaze.","shift from somebody/something to somebody/something The action of the novel shifts from Paris to London.","shift to somebody/something The main hub of America's dairy industry is shifting to New Mexico and Idaho.","shift something Could you help me shift some furniture?","Julie shifted her position slightly and smiled.","shift something from somebody/something to somebody/something He shifted his gaze from the child to her.","She shifted her weight from one foot to the other.","shift something to something More Japanese manufacturers are shifting production to China.","Government grants are being shifted away from the capital to the regions.","In recent years, manufacturing has shifted out of the US.","Like many plays, this one shifts back and forth in time and place."],"opposite":"","synonyms":""},{"def":"to move quickly","examples":[],"opposite":"","synonyms":""},{"def":"to change from one state, position, etc. to another","examples":["Public attitudes towards marriage have shifted over the past 50 years.","constantly shifting alliances","The press's attention shifted elsewhere, at least temporarily.","The public's attitude had shifted dramatically.","shift (away) from somebody/something to/towards somebody/something The balance of power shifted away from workers towards employers.","shift (away) from somebody/something I felt the advantage had suddenly shifted away from us.","shift to/towards/toward somebody/something Her sympathies gradually shifted to the side of the protesters."],"opposite":"","synonyms":""},{"def":"to change your opinion of or attitude towards something, or change the way that you do something","examples":["shift something We need to shift the focus of this debate.","shift something (from…) (to/towards/toward…) The new policy shifted the emphasis away from fighting inflation.","They are trying to shift public attitudes about the nature of old age.","These changes will shift the balance in higher education more towards science subjects."],"opposite":"","synonyms":""},{"def":"to make somebody else responsible for something you should do or something bad that you have done","examples":["He tried to shift the blame for his mistakes onto his colleagues.","We cannot simply shift the responsibility onto someone else.","They tried to shift the blame onto the government."],"opposite":"","synonyms":""},{"def":"to remove something such as a dirty mark","examples":["a detergent that shifts even the most stubborn stains"],"opposite":"","synonyms":""},{"def":"to sell goods, especially goods that are difficult to sell","examples":["They cut prices drastically to try and shift stock."],"opposite":"","synonyms":""},{"def":"to change the gears when you are driving a vehicle","examples":["to shift into second gear"],"opposite":"","synonyms":""},{"def":"to change your opinion about a subject, especially during a discussion","examples":["Each time he seemed to be losing the argument, he just shifted his ground."],"opposite":"","synonyms":""},{"def":"used to describe a situation that changes so often that it is difficult to understand or deal with it","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"shift your ground","def":"to change your opinion about a subject, especially during a discussion","examples":["Each time he seemed to be losing the argument, he just shifted his ground."]},{"idiom":"(the) shifting sands (of something)","def":"used to describe a situation that changes so often that it is difficult to understand or deal with it","examples":[]}],"phrasal":["shift for yourself"],"related":[]}]