[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sho/shock/shock__us_1.mp3","phonsUS":"/ʃɑːk/","level":"B2","meanings":[{"def":"a strong feeling of surprise as a result of something happening, especially something unpleasant; the event that causes this feeling","examples":["I got a terrible shock the other day.","When I added up the cost it gave me quite a shock.","The news of my promotion came as a shock.","The price came as something of a shock.","in shock She stared at him in shock for a moment.","He's still in a state of shock.","(informal) If you think the job will be easy, you're in for a shock.","shock of something The party has hardly recovered from the shock of its defeat in May.","shock of doing something She still hadn't got over the shock of seeing him again.","shock for somebody/something This must be quite a shock for you all.","shock to somebody/something Her sudden death was a huge shock to the many people who knew her.","Losing in the first round was a shock to the system (= it was more of a shock because it was not expected).","The team suffered a shock defeat in the first round.","Neighbours expressed shock at the news.","He spoke of his shock at the attitude of the two men.","Her shock at finding Elizabeth there was obvious.","It was a shock to find an ambulance outside his house.","It was a bit of a shock for audiences to see him in such a different role.","Imagine my shock when I saw them kissing!","She felt shock that he would be capable of such an act.","She looked around in shock.","I got the shock of my life when she told me she was pregnant.","I nearly died of shock when your mother appeared.","Drivers could be in for a nasty shock when they see the cost of renewing their insurance policies.","Once the initial shock had worn off, I got to like my new hairstyle.","She realized with a sudden shock that she was being followed.","The scene was clearly added for shock value."],"opposite":"","synonyms":""},{"def":"a serious medical condition, usually the result of injury in which a person has lost a lot of blood and they are extremely weak","examples":["Many passengers were treated for shock.","She was taken to hospital suffering from shock.","in shock Others seemed in shock, waiting to be told what to do next.","He isn’t seriously injured but he is in a state of shock.","He had gone into shock and was shaking violently."],"opposite":"","synonyms":""},{"def":"a violent shaking movement that is caused by an explosion, earthquake, etc.","examples":["The shock of the explosion could be felt six miles away.","The bumper absorbs shock on impact."],"opposite":"","synonyms":""},{"def":"a sudden flow of electricity through a part of the body, causing pain and sometimes death","examples":["Don't touch that wire or you'll get a shock.","He gave himself a mild shock while changing a light bulb."],"opposite":"","synonyms":""},{"def":"a thick mass of hair on a person’s head","examples":["She's a large plump woman with a shock of red hair."],"opposite":"","synonyms":""},{"def":"used when you pretend to be shocked by something that is not really very serious or surprising","examples":["The article reports on a celebrity who—shock horror—has gained weight!"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"shock horror","def":"used when you pretend to be shocked by something that is not really very serious or surprising","examples":["The article reports on a celebrity who—shock horror—has gained weight!"]}],"phrasal":[],"related":["shell shock","shock jock","shock wave","culture shock","shock-headed","shock-horror","shock tactics","shock therapy","shock troops","sticker shock","electric shock","shock absorber","toxic shock syndrome","shock jocks","shock waves","shock-haired","shock absorbers","shock treatment"]},{"pos":"verb","level":"B2","meanings":[{"def":"to surprise and upset somebody","examples":["shock somebody President Kennedy's assassination in Dallas on November 22, 1963, shocked the world.","The news had shocked her deeply.","It shocks you when something like that happens.","His death shocked the community.","shock somebody that… It shocked her that he would do such a thing.","shock somebody to do something It shocked me to think that some people would be prepared to commit acts like these.","We were all shocked at the news of his death.","The brutality of the crime has appalled the public.","The whole country was horrified by the killings.","The level of violence in the movie really disgusted me.","The public is becoming sickened by these images of violence and death.","I was repelled by the smell of drink on his breath."],"opposite":"","synonyms":"shock"},{"def":"to make somebody feel offended or full of horror","examples":["These movies deliberately set out to shock.","shock somebody She enjoys shocking people by saying outrageous things.","He had old-fashioned ideas and was easily shocked.","Do you think its possible to shock an audience anymore?"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]