[{"pos":"modal verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sho/shoul/should__us_4_rr.mp3","phonsUS":"/ʃəd/","level":"A1","meanings":[{"def":"used to show what is right, appropriate, etc., especially when criticizing somebody’s actions","examples":["You shouldn't drink and drive.","He should have been more careful.","A present for me? You shouldn't have! (= used to thank somebody politely)"],"opposite":"","synonyms":""},{"def":"used for giving or asking for advice","examples":["You should stop worrying about it.","Should I call him and apologize?","I should wait a little longer, if I were you.","(ironic) ‘She doesn't think she'll get a job.’ ‘She should worry, with all her qualifications (= she does not need to worry).’","You should take the baby to the doctor’s.","I ought to give up smoking.","Should we call the doctor?","We’d better hurry or we’ll miss the train.","She should have asked for some help.","You ought to have been more careful.","You shouldn’t drive so fast.","I’m sorry, I shouldn’t have lost my temper."],"opposite":"","synonyms":""},{"def":"used to say that you expect something is true or will happen","examples":["We should arrive before dark.","I should have finished the book by Friday.","The roads should be less crowded today."],"opposite":"","synonyms":""},{"def":"used to say that something that was expected has not happened","examples":["It should be snowing now, according to the weather forecast.","The bus should have arrived ten minutes ago."],"opposite":"","synonyms":""},{"def":"used as the past form of shall when reporting what somebody has said","examples":["He asked me what time he should come. (= His words were: ‘What time shall I come?’)","(British English, formal) I said (that) I should be glad to help."],"opposite":"","synonyms":""},{"def":"used after that when something is suggested or arranged","examples":["She recommended that I should take some time off.","In order that training should be effective it must be planned systematically."],"opposite":"","synonyms":""},{"def":"used with I and we to give opinions that you are not certain about","examples":["I should imagine it will take about three hours.","‘Is this enough food for everyone?’ ‘I should think so.’","‘Will it matter?’ ‘I shouldn't think so.’"],"opposite":"","synonyms":""},{"def":"used for expressing strong agreement","examples":["‘I know it's expensive but it will last for years.’ ‘I should hope so too!’","‘Nobody will oppose it.’ ‘I should think not!’"],"opposite":"","synonyms":""},{"def":"used to refuse something or to show that you are annoyed at a request; used to express surprise about an event or a situation","examples":["Why should I help him? He's never done anything for me.","How should I know where you've left your bag?","I got on the bus and who should be sitting in front of me but Tony!"],"opposite":"","synonyms":""},{"def":"used to tell somebody that something would surprise them or make them laugh if they saw or experienced it","examples":["You should have seen her face when she found out!","I said I’d (I would) be late.","He’d (he would) have liked to have been an actor.","I’d (I would) really prefer tea.","We should really go and visit them soon.","You should have seen it!","He can speak three languages.","She will try and visit tomorrow.","You must find a job.","You ought to stop smoking.","I used to smoke but I gave up two years ago.","Can I invite Mary?","Should I have invited Mary?"],"opposite":"","synonyms":""},{"def":"used after that after many adjectives that describe feelings","examples":["I'm anxious that we should allow plenty of time.","I find it astonishing that he should be so rude to you."],"opposite":"","synonyms":""},{"def":"used with I and we in polite requests","examples":["I should like to call my lawyer.","We should be grateful for your help."],"opposite":"","synonyms":""},{"def":"used after I or we instead of would for describing what you would do if something else happened first","examples":["If I were asked to work on Sundays, I should resign."],"opposite":"","synonyms":""},{"def":"used to refer to a possible event or situation","examples":["If you should change your mind, do let me know.","In case you should need any help, here's my number.","Should anyone call (= if anyone calls), please tell them I'm busy."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["so I should hope","I should hope so/not","you, etc. should be so lucky"]}]