[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sho/showe/shower__us_1.mp3","phonsUS":"/ˈʃaʊər/","level":"A1","meanings":[{"def":"a piece of equipment producing a flow of water that you stand under to wash yourself; the small room or part of a room that contains a shower","examples":["in the shower He's in the shower.","I've just got out of the shower.","an en-suite shower room","a shower cubicle/curtain","an electric shower","a hotel room with bath and shower","She was getting into the shower when the doorbell rang.","After the game, the boys hit the showers.","He could hear the shower running in the bathroom.","The plans include changing facilities and shower blocks."],"opposite":"","synonyms":""},{"def":"the act of washing yourself with a shower","examples":["a hot/cold shower","(especially British English) to have a shower","(especially North American English) to take a shower","shower gel"],"opposite":"","synonyms":""},{"def":"a short period of rain or snow","examples":["scattered/heavy showers","April showers","We were caught in a heavy shower.","There's a chance of showers this afternoon.","rain/snow showers","wintry showers (= of snow)","shower of something a shower of rain/hail/hailstones"],"opposite":"","synonyms":""},{"def":"a large number of things that arrive or fall together","examples":["a meteor shower","a shower of leaves","a shower of sparks from the fire","a shower of kisses","He pushed the couch so that it banged against the wall and released a shower of dust.","The white seeds drifted down in a slow shower against the blue sky."],"opposite":"","synonyms":""},{"def":"a party at which you give presents to a woman who is getting married or having a baby","examples":["a bridal/baby shower","I got a shower invitation from Katie.","A bridal shower is usually organized by the bridesmaids."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["baby shower","power shower"]},{"pos":"verb","level":"","meanings":[{"def":"to wash yourself under a shower","examples":["She showered and dressed and went downstairs.","He had already showered by the time they got home."],"opposite":"","synonyms":""},{"def":"to fall onto somebody/something, especially in a lot of small pieces","examples":["Volcanic ash showered down on the town after the eruption."],"opposite":"","synonyms":""},{"def":"to drop a lot of small things onto somebody","examples":["The bride and groom were showered with rice as they left the church.","The roof collapsed, showering us with dust and debris."],"opposite":"","synonyms":""},{"def":"to give somebody a lot of something","examples":["shower somebody with something He showered her with gifts.","shower something on somebody He showered gifts on her."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]