[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sig/sign_/sign__us_1.mp3","phonsUS":"/saɪn/","level":"A2","meanings":[{"def":"an event, an action, a fact, etc. that shows that something exists, is happening or may happen in the future","examples":["Looking back, I should have seen the signs.","a clear/visible sign","an encouraging sign","a positive sign","The fact that he didn't say ‘no’ immediately is a good sign.","If I had noticed the warning signs, none of this would have happened.","Early signs point to business improving.","sign of somebody/something This move will be seen as a sign of weakness.","Bankers say they can definitely detect signs of a recovery.","Headaches may be a sign of stress.","There is no sign of John anywhere.","Soldiers swarmed the city looking for any sign of her.","There was no sign of life in the house (= there seemed to be nobody there).","Her work is showing some signs of improvement.","I hope this incident isn't a sign of things to come.","Get this test if you have signs and symptoms of diabetes.","He is reading the signs all wrong.","at a sign of something Call the police at the first sign of trouble.","sign of doing something The gloomy weather shows no sign of improving.","sign of somebody/something doing something There is little sign of this happening in the immediate future.","sign (that)… If an interview is too easy, it's a sure sign that you haven't got the job.","There were no outward signs that anything was wrong.","Headaches may be a sign of stress.","They gave no indication as to how the work should be done.","Symptoms include a sore throat.","The rise in inflation was just one symptom of the poor state of the economy.","The dove is a universal symbol of peace.","the economic indicators","Chest pains can be a warning signal of heart problems.","All the outward signs of growth in the market are there.","All the signs pointed to it being more than just a coincidence.","Are appliances you buy safe? We point out the danger signs.","He spoke up without the slightest sign of nervousness.","His face betrayed no sign of emotion.","By now the fish was showing signs of distress.","I detected the subtle signs of disapproval.","He displayed the classic signs of post-traumatic stress disorder.","Look carefully for signs of damp.","The first signs of spring appeared.","Strong dislikes of foods are early signs of pregnancy.","the telltale signs of drug abuse","The lack of interest in the media is a telling sign of the industry's health.","The murder had all the signs of a crime of passion.","We detected signs that they were less than enthusiastic about the holiday."],"opposite":"","synonyms":"sign"},{"def":"a piece of paper, wood or metal that has writing or a picture on it that gives you information, instructions, a warning, etc.","examples":["to put up/post a sign","to carry/hold a sign","a street/stop sign","a shop/pub sign","a traffic sign","The sign read ‘No Fishing’.","The sign on the wall said ‘Now wash your hands’.","There was a 'Closed' sign in the window.","Follow the signs for the city centre.","Some of the marchers were holding up signs and placards.","He might as well have been wearing a sign saying ‘I am a tourist’.","Follow the road and you'll see signs for the turn-off.","He yelled at us for ignoring the stop sign.","Someone had put up a ‘For Sale’ sign.","The sign pointed down a narrow road.","This sign indicates that cycling is allowed.","signs warning against trespass"],"opposite":"","synonyms":""},{"def":"a movement or sound that you make to tell somebody something","examples":["He gave a thumbs-up sign (= to show approval/agreement).","sign from somebody She was waiting for some kind of sign from him.","At a sign from her, the band would start to play.","as a sign of something He gave a slight bow as a sign of respect.","sign to do something She shook her head in a desperate sign to tell the child to remain silent.","sign for somebody to do something She nodded as a sign for us to sit down.","Three blasts on the whistle was the sign for visitors to leave.","to make the sign of the cross (= an act of moving one hand in the shape of a cross, done by Christians to show respect for God or by a priest to bless somebody/something)","She made a peace sign while having her picture taken.","The people regarded the earthquake as a sign from God.","They had to communicate through signs and grunts.","the sign for ‘woman’ in sign language"],"opposite":"","synonyms":""},{"def":"a mark used to represent something, especially in mathematics","examples":["a plus/minus sign (= +/−)","a dollar/pound sign (= $/£)","sign for something the sign for ‘square root’","I used the Chinese sign for ‘father’ instead of ‘uncle’.","The wizard drew some strange signs in the air with his wand.","What does this sign mean?","a T-shirt with a peace sign on it"],"opposite":"","synonyms":""},{"def":"a star sign (= one of the twelve signs of the zodiac)","examples":["What sign are you?","Mars rules the zodiac sign of Aries.","people born under the sign of Gemini","the twelve astrological signs"],"opposite":"","synonyms":""},{"def":"something that you feel shows what things are like now, especially how bad they are","examples":["The increasing number of people owning guns is an alarming sign of the times."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a sign of the times","def":"something that you feel shows what things are like now, especially how bad they are","examples":["The increasing number of people owning guns is an alarming sign of the times."]}],"phrasal":[],"related":["V-sign","co-sign","sign for","sign in","sign off","sign-off","sign on","sign out","sign up","call sign","lawn sign","road sign","sign away","sign over","star sign","dollar sign","equals sign","pound sign"]},{"pos":"verb","level":"A2","meanings":[{"def":"to write your name on a document, letter, etc. to show that you have written it, that you agree with what it says, or that it is real","examples":["Sign here, please.","sign something to sign an agreement/a deal/a contract","to sign a document/statement/declaration/form","to sign a petition/a bill/ an order","to sign a cheque","Sign your name here, please.","You haven't signed the letter.","The treaty was signed on 24 March.","The player was signing autographs for a group of fans.","I'm going to his office now to sign the papers.","The bill was signed into law by the president yesterday.","sign yourself + noun He signed himself ‘Jimmy’.","They were sacked for refusing to sign the new contracts.","The legislation has been signed by the president.","One copy of this letter should be duly signed and returned to us.","This is the contract you will be required to sign.","a first edition of the book, personally signed by the author"],"opposite":"","synonyms":""},{"def":"to arrange for somebody, for example a sports player or musician, to sign a contract agreeing to work for your company; to sign a contract agreeing to work for a company","examples":["sign somebody United have just signed a new goalie.","to sign a player","sign for something He signed for United yesterday.","sign with something The band signed with Virgin Records.","sign (somebody) to something She was the first musician signed to the new record label."],"opposite":"","synonyms":""},{"def":"to make a request or tell somebody to do something by using a sign, especially a hand movement","examples":["sign to somebody (to do something) The hotel manager signed to the porter to pick up my case.","sign for somebody to do something The police officer signed for us to stop.","sign that… The police officer signed that we were to stop.","signsomebody to do something He signed his troops to move out."],"opposite":"","synonyms":""},{"def":"to use sign language to communicate with somebody","examples":["She learnt to sign to help her deaf child.","sign something An increasing number of plays are now being signed."],"opposite":"","synonyms":""},{"def":"definite, because all the legal documents have been signed","examples":[],"opposite":"","synonyms":""},{"def":"to sign a document to show that you have agreed to buy something or do something","examples":["Just sign on the dotted line and the car is yours."],"opposite":"","synonyms":""},{"def":"to make a promise never to drink alcohol","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"signed and sealed | signed, sealed and delivered","def":"definite, because all the legal documents have been signed","examples":[]},{"idiom":"sign on the dotted line","def":"to sign a document to show that you have agreed to buy something or do something","examples":["Just sign on the dotted line and the car is yours."]},{"idiom":"sign/take the pledge","def":"to make a promise never to drink alcohol","examples":[]}],"phrasal":["sign away","sign for","sign in","sign off","sign off on","sign on","sign out","sign over","sign up","sign up to"],"related":[]}]