[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sig/signi/significant__us_1.mp3","phonsUS":"/sɪɡˈnɪfɪkənt/","level":"B2","meanings":[{"def":"large or important enough to have an effect or to be noticed","examples":["There are no significant differences between the two groups of students.","Your work has shown a significant improvement.","a significant increase/decrease/reduction/loss","a significant amount/number/part/portion","significant change/progress","The results of the experiment are not statistically significant.","These views are held by a significant proportion of the population.","The 1992 reform made very significant contributions to the development of many rural areas.","The drug has had no significant effect on stopping the spread of the disease.","Asthma has a significant impact on the life and well-being of children affected by this disease.","The offender was assessed as posing a significant risk to others.","it is significant that… It is significant that girls generally do better in examinations than boys.","What makes this discovery significant is that it goes against our theory.","There was a significant correlation between students' efficacy levels and students' interest levels in the three tasks.","The size of the garden was a significant factor in her decision to buy the house.","He played a significant role in helping his team to victory."],"opposite":"","synonyms":""},{"def":"having a particular meaning","examples":["The fact that her remarks were leaked to the media in advance is highly significant.","it is significant that… It is significant that he changed his will only days before his death.","This year's event is particularly significant as it takes place on the centenary of his birth.","significant to/for somebody rituals which are deeply significant to Christians","November 16th will always be an especially significant day for us, thanks to the birth of our second grandchild."],"opposite":"","synonyms":""},{"def":"having a special or secret meaning that is not understood by everyone","examples":["a significant look/smile"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["significant other","significant figure","significant others","significant figures"]}]