[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sig/signa/signal__us_4.mp3","phonsUS":"/ˈsɪɡnəl/","level":"B1","meanings":[{"def":"a movement or sound that you make to give somebody information, instructions, a warning, etc.","examples":["a danger/warning/distress signal","at a signal At an agreed signal they left the room.","signal to somebody She made an impatient signal to him, but he ignored her.","signal to do something He thought he had heard the referee's signal to proceed.","signal for somebody to do something The siren was a signal for everyone to leave the building.","signal (that)… We spotted the scout's signal that four enemy soldiers were coming towards us.","signal from somebody Wait for the signal from the leader of your group.","When I give the signal, run!","(North American English) All I get is a busy signal when I dial his number (= his phone is being used).","hand signals (= movements that cyclists make with their hands to tell other people that they are going to stop, turn, etc.)","At a pre-arranged signal, everyone started cheering.","He had arranged a signal for the band to begin.","She made a signal for the car to stop.","The insect's yellow spots act as a warning signal to its predators.","The brain interprets the signals from the retina as light.","The nerves carry these signals to the brain."],"opposite":"","synonyms":""},{"def":"a piece of equipment that uses different coloured lights to tell drivers to go slower, stop, etc., used especially on railways and roads","examples":["The traffic signals were on red.","a stop signal","Delays are occurring as a result of signal failure on the northbound line."],"opposite":"","synonyms":""},{"def":"a series of electrical waves that carry sounds, pictures or messages, for example to a radio, television or mobile phone","examples":["radio signals","TV signals","a digital signal","a high-frequency signal","a radar signal","to emit a signal","to detect/pick up signals","I couldn't get a signal on my phone.","The signal is received by three different antennas at slightly different times.","The satellite is used for transmitting signals around the world.","signal from something The signal from the transmitter seems to have been boosted.","It is possible to jam GPS signals in battle.","The digital signal travels down wires to the server.","The signal is scrambled into code before it is sent.","This equipment can detect very low frequency signals.","a faint signal from the satellite"],"opposite":"","synonyms":""},{"def":"an event, an action, a fact, etc. that shows that something exists or is likely to happen","examples":["signal (that)… The rise in inflation is a clear signal that the government's policies are not working.","The court has given a strong signal that it disagrees with the government's position.","signal of something Chest pains can be a warning signal of heart problems.","Reducing prison sentences would send the wrong signals to criminals.","Headaches may be a sign of stress.","They gave no indication as to how the work should be done.","Symptoms include a sore throat.","The rise in inflation was just one symptom of the poor state of the economy.","The dove is a universal symbol of peace.","the economic indicators","Chest pains can be a warning signal of heart problems.","Interviewers quickly learn to pick up non-verbal signals.","The remark was interpreted as a signal that their government was ready to return to the peace talks.","Try to read the signals coming from the patient.","the signals that can indicate danger"],"opposite":"","synonyms":"sign"}],"idioms":[],"phrasal":[],"related":["signal box","time signal","turn signal","smoke signal","signal-to-noise ratio","signal boxes","signal-to-noise ratios"]},{"pos":"verb","level":"B1","meanings":[{"def":"to make a movement or sound to give somebody a message, an order, etc.","examples":["Don't fire until I signal.","signal to somebody She signalled to the man, who immediately came over to her.","signal for something A woman was leaning out a top-floor window, signaling for help.","signal to somebody for something He signalled to the waiter for the bill.","signal to/for somebody to do something He signalled to us to join him.","The patrolman signalled for her to stop.","signal somebody to do something She signalled him to follow.","signal something The referee signalled a foul.","signal (that)… She signalled (that) it was time to leave.","signal which, what, etc… You must signal which way you are going to turn.","I saw her signal frantically to us.","Many animals use their tails to signal.","When I'm ready I'll signal with a flashlight."],"opposite":"","synonyms":""},{"def":"to show that your vehicle is going to change direction, by using lights or your arm","examples":["Did you signal before you turned right?","signal something to signal left/right","signal (that)… I signalled that I was going to turn left."],"opposite":"","synonyms":""},{"def":"to be a sign that something exists or is likely to happen","examples":["This announcement signalled a clear change of policy.","The scandal surely signals the end of his political career.","These events appeared to signal the end of an era.","These changes clearly signal the end of the welfare state as we know it.","A fall in demand does not necessarily signal the death of the industry."],"opposite":"","synonyms":""},{"def":"to do something to make your feelings or opinions known","examples":["signal something He signalled his discontent by refusing to vote.","signal (that)… She has signalled (that) she is willing to stand as a candidate."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adjective","level":"","meanings":[{"def":"important, clear and definite","examples":["a signal honour","a signal failure of leadership"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]