[{"pos":"adverb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sim/simpl/simply__us_1.mp3","phonsUS":"/ˈsɪmpli/","level":"B1","meanings":[{"def":"used to emphasize how easy or basic something is","examples":["To order, simply click here.","This is not to suggest we simply ignore the problem.","She says that the company was simply trying to protect its business.","Simply add hot water and stir.","The runway is simply a strip of grass.","Fame is often simply a matter of being in the right place at the right time.","You can enjoy all the water sports, or simply lie on the beach.","We are simply saying research is good.","Most internet users simply want information."],"opposite":"","synonyms":""},{"def":"in a way that is easy to understand","examples":["The book explains grammar simply and clearly.","Anyway, to put it simply, we still owe them £2 000.","Simply put, electronic music is anything made using technology.","Put simply, cells contain an inbuilt mechanism which determines their lifespan.","Simply stated, the time for major reform is now.","It is in many ways a simple story, simply told."],"opposite":"","synonyms":""},{"def":"in a way that is natural and plain","examples":["The rooms are simply furnished.","They live simply (= they do not spend much money)."],"opposite":"","synonyms":""},{"def":"used to emphasize a statement","examples":["You simply must see the play.","You simply have to come with us.","He simply refused to believe it.","The view is simply wonderful!","That is simply not true!","This information is simply wrong.","Her behaviour is simply unacceptable.","I haven't seen her for simply ages."],"opposite":"","synonyms":""},{"def":"used to introduce a summary or an explanation of something that you have just said or done","examples":["I don't want to be rude, it's simply that we have to be careful who we give this information to.","He was loud, vulgar and arrogant—quite simply the rudest man I've ever met!"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]