[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sim/simpl/simple__us_1.mp3","phonsUS":"/ˈsɪmpl/","level":"A2","meanings":[{"def":"not complicated; easy to understand or do","examples":["a simple solution/explanation/question/task/example","simple for somebody/something You will soon see that what once seemed impossible is now simple for you.","something is simple to do This machine is very simple to use.","something is simple for somebody to do The game is supposed to be simple for anyone to play.","it is simple to do something It's too simple to blame the lack of manufacturing jobs on the last government.","Give the necessary information but keep it simple.","it is simple for somebody to do something It would be much simpler for me to go there myself and sort things out.","We lost because we played badly. It's as simple as that.","If you enjoy your workout, you'll want to do it. It's that simple.","It all sounds simple enough.","Let me make it simple —this is going to take years to do.","These are bad guys, plain and simple.","The answer is really quite simple.","There must be a simpler way of doing this.","In simple terms, the more saturated fat something contains, the less healthy it is.","a relatively simple process","I found the work fairly simple.","Is all this technology making our lives simpler?","It is a brilliantly simple idea.","The logic of the plan was devastatingly simple.","Their approach is refreshingly simple and direct.","This seemingly simple task ended up taking hours.","a deceptively simple technique","Shopping on the internet can be safe if you follow a few simple rules."],"opposite":"","synonyms":""},{"def":"basic or plain without anything extra or unnecessary","examples":["simple but elegant clothes","We had a simple meal of soup and bread.","The accommodation is simple but spacious.","The simple things in life are often the best.","He was pleased to live the simple life and enjoy nature around him.","simple pleasures, like reading and walking","The engine design is elegantly simple.","contemporary furniture that is simple in design"],"opposite":"fancy","synonyms":""},{"def":"used before a noun to emphasize that it is exactly that and nothing else","examples":["We cannot ignore the simple fact that the country cannot sustain the current level of economic growth.","The simple truth is that we just can't afford it.","It's a simple matter of giving them enough to eat.","It was a matter of simple survival.","It's nothing to worry about—just a simple headache.","I had to do it for the simple reason that (= because) I couldn't trust anyone else.","A simple majority is all that is required.","The simple act of eating raises your metabolism.","The plain fact is that nobody really knows.","The simple truth is that we just can’t afford it.","The stark truth is that there is not enough money left.","She gave me only the bare facts of the case.","The reply was an unequivocal ‘no’.","In some cases his argument is based on simple ignorance.","Nobody wanted to believe the simple truth.","These proposals are no more than simple common sense."],"opposite":"","synonyms":"plain"},{"def":"consisting of only a few parts; not complicated in structure","examples":["simple forms of life, for example amoebas","a simple machine","(grammar) a simple sentence (= one with only one verb)","a simple model of a business market"],"opposite":"","synonyms":""},{"def":"ordinary; not special","examples":["I'm a simple country girl.","The poem describes simple young soldiers in the Civil War."],"opposite":"","synonyms":""},{"def":"not very intelligent; not mentally normal","examples":["He's not mad—just a little simple."],"opposite":"","synonyms":""},{"def":"used to describe the present or past tense of a verb that is formed without using an auxiliary verb, as in She loves him (= the simple present tense) or He arrived late (= the simple past tense)","examples":[],"opposite":"","synonyms":""},{"def":"used after the noun that it refers to in order to emphasize that there is nothing but the thing you have just mentioned involved in something","examples":["It's laziness, pure and simple.","The man wants revenge, pure and simple."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"pure and simple","def":"used after the noun that it refers to in order to emphasize that there is nothing but the thing you have just mentioned involved in something","examples":["It's laziness, pure and simple.","The man wants revenge, pure and simple."]}],"phrasal":[],"related":["simple-minded","Simple Simon","simple fracture","simple interest","simple fractures","Really Simple Syndication","pure and simple","as happy, simple, sweet, etc. as can be"]}]