[{"pos":"preposition","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sin/since/since__us_1.mp3","phonsUS":"/sɪns/","level":"A2","meanings":[{"def":"from a time in the past until a later past time, or until now","examples":["She's been off work since Tuesday.","We've lived here since 2006.","I haven't eaten since breakfast.","He's been working in a bank since leaving school.","Since the party she had only spoken to him once.","‘They've split up.’ ‘Since when?’","That was years ago. I've changed jobs since then."],"opposite":"","synonyms":""},{"def":"used when you are showing that you are angry about something","examples":["Since when did he ever listen to me?"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["since/from the year one","ever since (…)","since/from the year dot","the best thing since sliced bread"]},{"pos":"conjunction","level":"A2","meanings":[{"def":"from an event in the past until a later past event, or until now","examples":["Cath hasn't phoned since she went to Berlin.","It was the first time I'd had visitors since I'd moved to London.","It's twenty years since I've seen her.","How long is it since we last went to the theatre?","She had been worrying ever since the letter arrived."],"opposite":"","synonyms":""},{"def":"because; as","examples":["We thought that, since we were in the area, we'd stop by and see them."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adverb","level":"B1","meanings":[{"def":"from a time in the past until a later past time, or until now","examples":["She went for a run on Monday and has not been seen since.","She moved to Pakistan in 1997 and has been living in Lahore ever since.","He left home two weeks ago and we haven't heard from him since.","The health of the British people was better at the end of the Second World War than at any time before or since.","The original building has long since (= long before now) been demolished."],"opposite":"","synonyms":""},{"def":"at a time after a particular time in the past","examples":["The song topped the charts in 1957 and has since become a rock and roll classic.","We were divorced two years ago and she has since remarried."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]