[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sit/site_/site__us_1.mp3","phonsUS":"/saɪt/","level":"A2","meanings":[{"def":"a place where a building, town, etc. was, is or will be located","examples":["the site of a sixteenth-century abbey","The government has announced the proposed site for the airport.","A site has been chosen for the new school.","on a site Nothing can be built on this site.","on site All the materials are on site so that work can start immediately.","at a site The factory will be built at a site to the north of the city.","The inspector may need to make a site visit.","This would be a good place for a picnic.","They’ve chosen a site for the new school.","the hotel reception area","Move the cursor to a blank area on the screen.","From his position at the top of the hill, he could see the harbour.","the point at which the river divides","The company is moving to a new location.","the scene of the accident","The lake is one of the local beauty spots.","A local company has recently acquired the site.","Hard hats must be worn on site.","The council has earmarked the site for possible redevelopment.","The hotel is in a prime site overlooking the sea.","The school stands on the site of an ancient settlement.","The site is being cleared for development.","The site is designated for housing.","The site is presently occupied by offices."],"opposite":"","synonyms":"place"},{"def":"a place where something has happened","examples":["the site of the battle","an archaeological site","The president is to visit the crash site later today.","an extremely sensitive site of national importance","at the site of something People laid flowers at the site of the accident."],"opposite":"","synonyms":""},{"def":"a place that is used for a particular activity","examples":["a caravan site","Gozo has some of the best dive sites in the Mediterranean.","a waste-disposal site on the edge of town","the test site for the atom bomb","They say it's an ancient burial site."],"opposite":"","synonyms":""},{"def":"a place connected to the internet, where a company or an organization, or an individual person, puts information","examples":["online dating sites","Here are some links to other useful sites.","For more information, visit the festival's official site.","You have to register to gain access to the site.","on a site She regularly posts music reviews on an online music site.","She would never forget the sight of Machu Picchu appearing out of the mist.","Follow this link to reach the official site.","The French government had plans to site a third major airport for Paris at Chaulnes.","A site map lists and links to all pages on your website.","At this site you'll find all the latest news and gossip.","Harvard Law has a very useful and informative site.","He saw the photo on a right-wing hate site.","I have bookmarked your site for future reading.","I'm searching for sites on aromatherapy.","Search engines rank sites through a variety of methods.","The government tries to block foreign sites deemed subversive.","The official site is updated on a regular basis.","a music download site","a site devoted to health issues","major news sites"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["fan site","bomb site","mirror site","building site","comparison site","construction site","World Heritage Site","site of special scientific interest","camping site"]},{"pos":"verb","level":"","meanings":[{"def":"to build or place something in a particular position","examples":["be sited + adv./prep. The castle is magnificently sited high up on a cliff.","The fence is strategically sited to prevent anyone getting onto the beach.","The hotel is beautifully sited by a lake in a steep valley.","There was a meeting to discuss the siting of the new school.","She would never forget the sight of Machu Picchu appearing out of the mist.","Follow this link to reach the official site.","The French government had plans to site a third major airport for Paris at Chaulnes."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]