[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/siz/size_/size__us_1.mp3","phonsUS":"/saɪz/","level":"A2","meanings":[{"def":"how large or small a person or thing is","examples":["population/sample/group/class size","body/genome size","She has almost doubled the size of her investments.","a decrease in the size of the population","an area the size of (= the same size as) Wales","computer chips about the size of a grain of rice","discussions about increasing the size of the army","The company is reducing the size of its workforce.","the small/large size of the sample","the average size of the British family","the relative size of each socio-economic group","He was about the same size as me.","Dogs come in all shapes and sizes.","The facilities are excellent for a town that size.","The kitchen is a good size (= not small).","in size It's similar in size to a tomato.","These insects range in size from 2 to 5cm.","The firms vary greatly in size.","Towns grew in size throughout Elizabeth I's reign.","The typical clutch size is 3 eggs.","a file size of approximately 1.38 megabytes","Methods of assessment will depend on the size of the company.","Despite its diminutive size, the car is quite comfortable.","He eats a lot in proportion to his body size.","Her knee swelled to twice its normal size.","Houses increase in size as you travel further from the city.","I changed the font size on the document.","In surfing, size matters: big waves are beautiful.","Only a limited number of the fish will grow to reach adult size.","The city has doubled in size in the last twenty years.","The dog's diminutive size is attractive to many people.","The fish grow to a maximum size of 50 cm.","The ladder is a handy size for using in the house.","The larger the serving size, the more you're likely to eat.","The relative size of the middle class has been steadily shrinking.","The ring is shown actual size in the illustration.","The size of her audience varied.","classes of manageable size","They are intending to expand the size of the farm by buying new land."],"opposite":"","synonyms":""},{"def":"the large amount or extent of something","examples":["You should have seen the size of their house!","We were shocked at the size of his debts.","The sheer size of the potential market excites investors.","They complained about the size of their gas bill.","The sheer size of these dinosaurs was their main defence.","Given the size of the task, he won't have time to do anything else.","From the size of the crowds outside, it was a very good movie."],"opposite":"","synonyms":""},{"def":"one of a number of standard measurements in which clothes, shoes and other goods are made and sold","examples":["The jacket was the wrong size.","It's not my size.","in somebody's size They didn't have the jacket in my size.","The hats are made in three sizes: small, medium and large.","Do you have these shoes in (a) size 5?","She takes (a) size 5 in shoes.","What size do you take?","She's a size 12 in clothes.","I need a bigger/smaller size.","for size Try this one for size (= to see if it is the correct size).","The glass can be cut to size (= cut to the exact measurements) for you.","Brushes come in various sizes.","Children's sizes don't fit her any more.","Does this dress come in a bigger size?","I couldn't find the blouse in my size.","I had to guess at the size of the batteries.","New radiators come in metric sizes.","The 5-litre size comes in a metal tin.","The company is now going to make these products in larger sizes.","XL fits chest sizes 44 to 50."],"opposite":"","synonyms":""},{"def":"having the size mentioned","examples":["a medium-sized house","Cut it into bite-size pieces."],"opposite":"","synonyms":""},{"def":"a sticky substance that is used for making material stiff or for preparing walls for wallpaper","examples":[],"opposite":"","synonyms":""},{"def":"to show somebody that they are not as important as they think they are","examples":[],"opposite":"","synonyms":""},{"def":"that’s how the situation seems to be","examples":["‘So they won't pay up?’ ‘That's about the size of it.’"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"cut somebody down to size","def":"to show somebody that they are not as important as they think they are","examples":[]},{"idiom":"that’s about the size of it","def":"that’s how the situation seems to be","examples":["‘So they won't pay up?’ ‘That's about the size of it.’"]}],"phrasal":[],"related":["size up","full-size","king-size","life-size","plus size","plus-size","size zero","legal-size","letter-size","queen-size","one-size-fits-all","bite-size","man-size","pint-size","medium-size","pocket-size","size zeros","size somebody/something"]},{"pos":"verb","level":"","meanings":[{"def":"to mark the size of something; to give a size to something","examples":["be sized (in something) The screws are sized in millimetres."],"opposite":"","synonyms":""},{"def":"to change the size of something","examples":["be sized The fonts can be sized according to what effect you want."],"opposite":"","synonyms":""},{"def":"to cover something with a sticky substance called size","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["size up"],"related":[]}]