[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/ske/sketc/sketch__us_1.mp3","phonsUS":"/sketʃ/","level":"C1","meanings":[{"def":"a simple picture that is drawn quickly and does not have many details","examples":["The artist is making sketches for his next painting.","She drew a sketch map of the area to show us the way.","The children were drawing pictures of their pets.","a collection of paintings by American artists","a pencil/​charcoal drawing","Vermeer’s ‘Portrait of the artist in his studio’","a self-portrait (= a painting that you do of yourself)","a Renoir print","I usually do a few very rough sketches before I start on a painting.","He did some rough sketches of the costumes.","Police released a composite sketch of the suspect.","The family house appears in several of her sketches.","The judge will ban sketch artists from the courtroom.","a series of sketches by John Constable","the artist's original sketch","He drew me a quick sketch.","I usually do a few very rough sketches before I start on a painting."],"opposite":"","synonyms":"picture"},{"def":"a short funny scene on television, in the theatre, etc.","examples":["The drama group did a sketch about a couple buying a new car.","The show sometimes feels like a university revue sketch.","a comic sketch about a talking cat","a one-hour TV sketch show","My favourite sketch is the one about the dead parrot."],"opposite":"","synonyms":""},{"def":"a short report or story that gives only basic details about something","examples":["a biographical sketch of the prime minister","He gave us character sketches of all his eccentric relations.","The talk began with a thumbnail sketch of the political situation at that time.","In 1842 he wrote out a short sketch of his theory."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["sketch in","thumbnail sketch","dead parrot sketch","sketch pad","composite sketch","sketch something"]},{"pos":"verb","level":"","meanings":[{"def":"to make a quick drawing of somebody/something","examples":["He quickly sketched the view from the window.","He enjoyed sketching, writing poetry and playing music."],"opposite":"","synonyms":""},{"def":"to give a general description of something, giving only the basic facts","examples":["She sketched out her plan for tackling the problem."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["sketch in"],"related":[]}]