[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sla/slam_/slam__us_1.mp3","phonsUS":"/slæm/","level":"C1","meanings":[{"def":"to shut, or to make something shut, with a lot of force, making a loud noise","examples":["I heard the door slam behind him.","+ adj. A window slammed shut in the wind.","slam something He stormed out of the house, slamming the door as he left.","slam something + adj. She slammed the lid shut.","+ adv./prep. She slammed out of the room (= went out and slammed the door behind her)."],"opposite":"","synonyms":""},{"def":"to put, push or throw something into a particular place or position with a lot of force","examples":["She slammed down the phone angrily.","He slammed on the brakes (= stopped the car very suddenly).","He repeatedly slammed the man's head against the wall.","He slammed home the penalty for goal number two."],"opposite":"","synonyms":""},{"def":"to crash into something with a lot of force; to make somebody/something crash into something with a lot of force","examples":["+ adv./prep. The car skidded and slammed into a tree.","(figurative) Kath's heart slammed against her ribs.","slam somebody/something + adv./prep. The force of the explosion slammed me against the wall.","I was terrified that the plane would crash.","The car skidded and slammed into a tree.","The car and the van collided head-on in thick fog.","Ram-raiders smashed a stolen car through the shop window."],"opposite":"","synonyms":"crash"},{"def":"to criticize somebody/something very strongly","examples":["The government has been slammed for failing to take firm action against drinking and driving."],"opposite":"","synonyms":""},{"def":"to shut a door hard when somebody is trying to come in","examples":[],"opposite":"","synonyms":""},{"def":"to refuse to talk to somebody or meet them, in a rude way","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"shut/slam the door in somebody’s face","def":"to shut a door hard when somebody is trying to come in","examples":[]}],"phrasal":[],"related":["body slam","slam dunk","slam-dunk","grand slam","Grand Slam™","Grand Slam","slam dunks","slam-dunks","slam-dunked","slam-dunking","grand slam home run","shut/slam the door in somebody’s face"]},{"pos":"noun","level":"","meanings":[{"def":"an act of slamming something; the noise of something being slammed","examples":["She gave the door a good hard slam.","The front door closed with a slam."],"opposite":"","synonyms":""},{"def":"a competition in which people perform their poems to an audience, which chooses a winner","examples":["A poetry slam with cash prizes will be among the social events."],"opposite":"","synonyms":""},{"def":"a set of very important competitions in a particular sport in the same year in tennis, golf or rugby; one of the individual competitions that make up a Grand Slam","examples":["She won her first slam with a dominant final."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]