[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sli/slide/slide__us_1.mp3","phonsUS":"/slaɪd/","level":"B2","meanings":[{"def":"to move easily over a smooth or wet surface; to make something move in this way","examples":["As I turned left on a bend, my car started to slide.","+ adv./prep. We slid down the grassy slope.","A plane slid off the runway in Denver on Sunday.","The drawers slide in and out easily.","slide something + adv./prep. She slid her hand along the rail.","You can slide the front seats forward if necessary.","slide + adj The automatic doors slid open.","slide something + adj. Quietly, she slid the drawer shut.","Tears slid slowly down his pale cheek.","The melting snow began to slide from the sloping roofs.","a vehicle that will slide smoothly across snow"],"opposite":"","synonyms":""},{"def":"to move quickly and quietly, for example in order not to be noticed; to make something move in this way","examples":["+ adv./prep. He slid into bed.","She slid out while no one was looking.","slide something + adv./prep. The man slid the money quickly into his pocket.","He slid a shy look at Claire.","The moon slid silently behind a cloud.","Her eyes slid away from his own in embarrassment."],"opposite":"","synonyms":""},{"def":"to become gradually lower or of less value","examples":["Shares slid to a 10-year low."],"opposite":"","synonyms":""},{"def":"to move gradually into a worse situation","examples":["The industry has slid into decline.","They were sliding towards bankruptcy.","He got depressed and began to let things slide (= failed to give things the attention they needed).","The Hong Kong economy was sliding into recession.","The economy is sliding rapidly downhill."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["slide rule","slide show","water slide","slide projector","slide rules","slide shows","slide projectors"]},{"pos":"noun","level":"B2","meanings":[{"def":"one page of an electronic presentation, that may contain text and images, that is usually viewed on a computer screen or projected onto a larger screen","examples":["Here's a slide showing target markets.","I'm still working on the slides for my presentation.","in/on a slide Limit the amount of text on each slide.","The numbers mentioned in the slide are based on theoretical scenarios.","a slide presentation"],"opposite":"","synonyms":""},{"def":"a long, smooth movement on ice or a smooth surface","examples":["Her car went into a slide.","a front wheel slide"],"opposite":"","synonyms":""},{"def":"a change to a lower or worse condition","examples":["a downward slide in the price of oil","the team’s slide down the table","talks to prevent a slide into civil war","The economy is on the slide (= getting worse).","a stock market slide","The country is continuing the slide into chaos and violence.","her slow slide into drug addiction","the market's recent slide towards panic","the start of a slippery slide down to family breakdown","to stop the slide in the dollar"],"opposite":"","synonyms":""},{"def":"a structure with a steep slope that children use for sliding down","examples":["to go down the slide","He wouldn't go down the slide by himself.","There were lots on children on the slide."],"opposite":"","synonyms":""},{"def":"a sudden fall of a large amount of rock or earth down a hill","examples":["I was afraid of starting a slide of loose stones."],"opposite":"","synonyms":""},{"def":"a small piece of film held in a frame that can be shown on a screen when you shine a light through it","examples":["a talk with colour slides"],"opposite":"","synonyms":""},{"def":"a small piece of glass that something is placed on so that it can be looked at under a microscope","examples":[],"opposite":"","synonyms":""},{"def":"a part of a musical instrument or other device that slides backwards and forwards","examples":[],"opposite":"","synonyms":""},{"def":"a small attractive piece of metal or plastic used by women for holding their hair in place","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]