[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/slo/slope/slope__us_1.mp3","phonsUS":"/sləʊp/","level":"B2","meanings":[{"def":"a surface or piece of land that slopes (= is higher at one end than the other)","examples":["on a slope The town is built on a slope.","Down the slope and beyond the road lay the Pacific Ocean.","He made his way up the slope from the station to the bus stop.","a grassy slope","We clambered up the steep, rocky slope.","a slope leading down to the river","a west-facing slope overlooking the river"],"opposite":"","synonyms":""},{"def":"an area of land that is part of a mountain or hill","examples":["slope of something the eastern slopes of the Andes","ski slopes","on a slope We camped on an open mountain slope.","He spends all winter on the slopes (= skiing).","There were more skiers further up the slope.","There was now molten lava several hundred metres down the slope.","Rocks and boulders rolled down the slopes of the crater.","The lower slopes rise quite gently.","There was snow on the higher slopes of the mountain.","The vineyards on the south-facing slopes get more sunshine."],"opposite":"","synonyms":""},{"def":"the amount by which something slopes","examples":["a steep slope","a gentle slope","slope of something a slope of 45 degrees","Because of the slope of the roof, the snow cannot accumulate.","the angle of slope","The football pitch has a slope of about one metre.","The unemployment-income curve on the graph has a negative slope.","Most of the city’s land has a slope of 30 degrees or more.","The land rises in a gentle slope from the sea to the foot of the mountains."],"opposite":"","synonyms":""},{"def":"a course of action that is difficult to stop once it has begun, and can lead to serious problems or disaster","examples":["She realized he was on the slippery slope towards a life of crime."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the/a slippery slope","def":"a course of action that is difficult to stop once it has begun, and can lead to serious problems or disaster","examples":["She realized he was on the slippery slope towards a life of crime."]}],"phrasal":[],"related":["dry slope","slope off","bunny slope","nursery slope","continental slope","dry ski slope","the/a slippery slope"]},{"pos":"verb","level":"B2","meanings":[{"def":"to be at an angle so that it is higher at one end than the other","examples":["a sloping roof","sloping shoulders","The bedroom floors all sloped.","+ adv./prep. The garden slopes away towards the river.","The path sloped gently down.","It is a lake with steeply sloping sides.","The ground slopes away steeply at the back of the house.","The garage is rectangular with a sloping roof."],"opposite":"","synonyms":""},{"def":"to be at an angle rather than going straight up or straight across","examples":["It was a very old house with sloping walls.","+ adv./prep. His handwriting slopes backwards."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["slope off"],"related":[]}]