[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/slo/slot_/slot__us_1.mp3","phonsUS":"/slɑːt/","level":"C1","meanings":[{"def":"a long, narrow opening, into which you put or fit something","examples":["to put some coins in the slot","He slid a coin into the slot of the jukebox.","The electricity was on a slot meter."],"opposite":"","synonyms":""},{"def":"a position, a time or an opportunity for somebody/something, for example in a list, a programme of events or a series of broadcasts","examples":["He has a regular slot on the late-night programme.","Their album has occupied the Number One slot for the past six weeks.","the airport’s take-off and landing slots","They have a prime time slot on national radio.","We need something to fill a thirty-minute slot in the late evening."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["slot in","mail slot","slot machine","slot machines","slot somebody/something","fall/slot into place","slot/fall into place"]},{"pos":"verb","level":"","meanings":[{"def":"to put something into a space that is available or designed for it; to fit into such a space","examples":["slot something + adv./prep. The bed comes in sections that can be quickly slotted together.","+ adv./prep. The dishwasher slots neatly between the cupboards.","These tubes slot together like this.","He slotted the magazines neatly into the rack.","The panels slot together to make a box.","(figurative) He has slotted back into the role of being a second-in-command."],"opposite":"","synonyms":""},{"def":"if something complicated or difficult to understand slots or falls into place, it becomes organized or clear in your mind","examples":["Then I found his dairy and it all began to slot into place."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"slot/fall into place","def":"if something complicated or difficult to understand slots or falls into place, it becomes organized or clear in your mind","examples":["Then I found his dairy and it all began to slot into place."]}],"phrasal":["slot in"],"related":[]}]