[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/soc/socie/society__us_3.mp3","phonsUS":"/səˈsaɪəti/","level":"A2","meanings":[{"def":"people in general, living together in communities","examples":["She believes that the arts benefit society as a whole.","Racism exists at all levels of society.","These children have grown up to be useful and productive members of society.","Every section of society must have access to education.","in society They carried out research into the roles of men and women in today’s society.","A person's job is one of the factors that determines their place in society.","He felt isolated from the rest of society.","Health standards have risen in society at large.","Officers were drawn largely from the top echelons of society.","One of the pillars of society must be that everyone has access to the legal system.","Prisoners often have problems fitting into society on their release.","She devoted herself to helping the outcasts of society.","The civil war tore apart the fabric of society.","The clinic deals with a wide cross-section of society.","The research examines minorities and their relation to society as a whole.","We help offenders to become productive members of society.","Years of high unemployment have left society deeply divided."],"opposite":"","synonyms":""},{"def":"a particular community of people who share the same customs, laws, etc.","examples":["modern industrial societies","demand created by a consumer society","Can Britain ever be a classless society?","They were discussing the problems of Western society.","in a society We live in a society that is obsessed with how people look.","These rights are necessary in a democratic society.","Our disposable society must be encouraged to recycle.","Such language would not be used in polite society.","US society is becoming more unequal.","We live in a society dominated by men.","the celebration of a culturally diverse society","the class structure of British society","the consumerist values of the affluent society","the division of labour in an advanced capitalist society","the path to becoming a secular society","Singapore has a delicately balanced multicultural society."],"opposite":"","synonyms":""},{"def":"a group of people who join together for a particular purpose","examples":["a member of the drama society","the American Society of Newspaper Editors","I joined the local Genealogy Society.","He is a member of numerous professional societies.","She belongs to the historical society.","She was active in the Society for Women's Suffrage.","the Society of Motor Manufacturers and Traders","He made few friends and joined few clubs or societies.","Local law societies were unreceptive to the idea.","She joined the Cranbrook Players, the local amateur dramatic society.","The campaign was launched by the National Deaf Children's Society.","the Royal Society for the Protection of Birds"],"opposite":"","synonyms":""},{"def":"the group of people in a country who are fashionable, rich and powerful","examples":["Their daughter married into high society.","a society wedding","She moved in high society and had many literary friends.","She was a poor Irish girl who married into New York society."],"opposite":"","synonyms":""},{"def":"the state of being with other people","examples":["He was a solitary man who avoided the society of others."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["honor society","building society","friendly society","Law Society","Great Society","Royal Society","Fabian Society","Hemlock Society","Linnean Society","Flat Earth Society","John Birch Society","permissive society","Society of Friends","Church Mission Society","Queen's English Society","Electoral Reform Society","Fellow of the Royal Society","National Audubon Society","Royal Geographical Society","Royal Horticultural Society"]}]