[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sou/sourc/source__us_1.mp3","phonsUS":"/sɔːrs/","level":"A2","meanings":[{"def":"a place, person or thing that you get something from","examples":["renewable energy sources","These fish are widely used as a food source.","source of something Your local library will be a useful source of information.","What is their main source of income?","Tourism is a major source of revenue for the area.","The tiny window was the only source of light.","from a source Funding came from a wide variety of sources.","Do you have any foreign sources of income?","Do you know the source of this rumour/​rumor?","The government hopes to tap new sources of employment in the area of health.","The only source of light was the fire.","The town obtains all its energy from renewable sources.","These crustaceans provide a valuable food source for some fish.","We need to look for alternative sources of energy.","We tried to locate the source of the sound.","a cheap source of labour","a fertile source of ideas","a lucrative source of income","a reliable source of advice","a rich source of vitamins","a source of energy/​food/​light","an independent source of funding","to develop new sources of revenue","We need to obtain more energy from renewable sources.","The press room was a valuable source of information for journalists."],"opposite":"","synonyms":""},{"def":"a person, book or document that provides information, especially for study, a piece of written work or news","examples":["He refused to name his sources.","Government sources indicated yesterday that cuts may have to be made.","Intelligence sources say they now believe he is dead.","from a source This information comes from a very reliable source.","according to a source According to industry sources, these prices are likely to rise.","Proper attribution of source material is extremely important.","Government sources indicated that a compromise might be reached.","Intelligence sources report a build-up of troops just inside the border.","One source said: ‘We are angry at the way we have been treated.’","Researchers try to quote primary sources wherever possible.","Sources close to the player claim he won't be entering this year's championship.","The evidence is corroborated by multiple sources.","The police refused to reveal the source of their information.","his refusal to reveal the identity of a confidential source","The census constitutes the principal source of official statistics."],"opposite":"","synonyms":""},{"def":"a person or thing that causes or provides something","examples":["The Irish landscape has long been a source of inspiration to artists.","Sporting success is a great source of national pride.","a potential source of conflict","a constant source of irritation"],"opposite":"","synonyms":""},{"def":"the place where a river or stream starts","examples":["the source of the Nile"],"opposite":"","synonyms":""},{"def":"at the place or the point that something comes from or begins","examples":["Is your salary taxed at source (= by your employer)?","It is better to deal with such problems at source.","Under the PAYE system, employees' income is taxed at source."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"at source","def":"at the place or the point that something comes from or begins","examples":["Is your salary taxed at source (= by your employer)?","It is better to deal with such problems at source.","Under the PAYE system, employees' income is taxed at source."]}],"phrasal":[],"related":["open-source","source code","primary source","secondary source","source program","source codes","source programs"]},{"pos":"verb","level":"","meanings":[{"def":"to get something from a particular place","examples":["We source all the meat sold in our stores from British farms.","All our vegetables are locally sourced."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]