[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/spa/space/space__us_1.mp3","phonsUS":"/speɪs/","level":"A1","meanings":[{"def":"the area outside the earth’s atmosphere where all the other planets and stars are","examples":["in space Valentina Tereshkova was the first woman in space.","the possibility of visitors from outer space","space exploration/travel","a space flight/mission","the US space program","She talked about the incredible experience of being in space, looking down on the Earth.","the film's famous tagline 'In space no one can hear you scream'","We oppose the expensive and dangerous idea of putting weapons in space.","That was the year China sent its first astronaut into space.","The idea of painting rooftops white is to cool the planet's surface by reflecting sunlight back into space.","these wonderful pictures from the edge of space","Scientists are looking into the mysteries of deep space.","The orbital velocity of earth through space is about 19 miles per second.","He wrote about the early years of human space exploration.","technology that made space travel possible","They intend to begin manned space missions next year.","In 15 years, he predicts, space tourism will be a multibillion-dollar business.","After the disaster, manned space flights were suspended for over two years.","The company plays a major role in the European space programme."],"opposite":"","synonyms":""},{"def":"an area or a place that is empty","examples":["an empty space","a large/small/narrow/wide space","a space two metres by three metres","He reversed out of the parking space.","in/into a space We were crowded together in a confined space.","They cram hundreds of animals into a tiny space.","space between A and B Put it in the space between the table and the wall.","space for something I'll clear a space for your books.","The sculpture occupies a space in the centre of the campus.","Avoid spraying the product in a confined space.","There's an empty space where the painting used to hang.","He parked in a space reserved for the disabled.","Save me a space on the sofa!","They arranged the furniture to leave a big open space in the centre of the room.","The building was designed to fill a space left empty after World War II bombing.","I was looking for a free parking space.","This chisel is useful for getting into awkward spaces.","We'd better clear a space for the new computer.","the crawl space under my house","We keep a lot of stuff in the loft space.","the narrow space between the sofa and the wall","the space between the bookshelves","Leave a space between your car and the next."],"opposite":"","synonyms":""},{"def":"an amount of an area or of a place that is empty or that is available for use","examples":["We have 50  000 square metres of floor space.","Different brands compete for shelf space.","Houses were built close together with almost no empty space between them.","We must make good use of the available space.","That desk takes up too much space.","Traffic tends to expand to fill the space available.","There is very little storage space in the department.","Arrive early because space is limited.","space for something This creates space for a bigger table.","Can we make space for one more person?","disk/memory space (= on a computer or device)","I'm running short of disk space.","The app displays faster and takes less memory space.","Clean up your disk to stop unused files from taking up space on your computer.","You don't have enough free space on your device for the download.","The exhibition takes up most of the available space in the gallery.","Nearly half the display space is devoted to electronics.","Supermarkets have started allocating more space to organic products.","The new flat has ample living space.","You want to avoid your home office encroaching into your living space.","The house has a lot of roof space which is useful for storage.","The potted plants take up too much space.","They created space for lorries to turn at the end.","We'll create more space for the kids to play.","The bed folds up in the day to save space.","Save shelf space by clever use of storage containers.","I saved you some space on the sofa.","Remember to leave space for coats and shoes.","They moved the sofa to make space for the piano.","a large amount of space","Is there enough space for a table in here?","There's plenty of space in the new offices.","To create more space in your home, get rid of all that clutter.","You'll need a room with sufficient space for you to move around in."],"opposite":"","synonyms":""},{"def":"a place, especially a room or a building, that can be used for a particular purpose","examples":["The venue is a great space for music.","various gallery and exhibition spaces","to rent/lease (a) space","He was sharing office space with a lawyer.","The business began to occupy more space.","As well as office and retail space, the three-storey building includes exhibit and event spaces.","The company grew and had to rent more office space.","They decided to rent gallery space in Rockport, Mass.","The store also rents space to a pharmacy and optician.","A game developer leases space in the office building.","Residents on the first two floors share space with support services and a conference room."],"opposite":"","synonyms":""},{"def":"the quality of being large and empty, allowing you to move freely","examples":["The room has been furnished and decorated to give a feeling of space.","We're enjoying the space here after living in a small flat.","Those of us who call Alice Springs home love the space and the quality of life here.","Light, bright colours help give a feeling of space.","The open plan creates a sense of space.","Softer lighting and wall mirrors will give an impression of space.","There's a marvellous sense of space in this domed hall.","There is a tremendous impression of space both inside and outside the school.","I love high ceilings because I love space."],"opposite":"","synonyms":""},{"def":"a large area of land that has no buildings on it","examples":["the wide open spaces of the Canadian prairies","protection for our parks and other green spaces","It's a city with fine buildings and plenty of open space.","Green space is important in the urban environment.","agricultural land","building lots","a parking lot","The kids were playing on waste ground near the school.","the site of an ancient burial ground","The city has plenty of open space.","the wide open spaces of the Canadian prairies","She bought a small plot of land to build a house.","a vegetable plot","The inner residential areas don't have many green spaces.","He liked the wide open spaces of the Australian countryside.","The animals enjoy wide open spaces and eat natural foods.","The land will be kept as open space for future generations.","They want to return the land to active farming, rather than keep it as lawn or open space.","A house may sell better if it is close to green space.","The business park will incorporate green spaces and open areas.","The job of the soldiers at this outpost is to patrol a space of land stretching almost as far as the eye can see.","There are views over the vast space of Salisbury Plain.","the vast spaces of the Australian outback"],"opposite":"","synonyms":"land"},{"def":"a period of time","examples":["Leave a space of two weeks between appointments.","in the space of something Forty-four people died in the space of five days.","They had achieved a lot in a short space of time.","The job holder will be on probation for the space of six months.","He fell asleep in the space of a few minutes.","They have achieved a great deal in a short space of time.","The recording includes a 5-second space between tracks.","She returned to top-class tennis after a space of two years."],"opposite":"","synonyms":""},{"def":"the part of a line, page or document that is empty","examples":["Don't waste space by leaving a wide margin.","There was not enough space to print all the letters we received.","Leave a space after the comma.","Fill in the blank spaces in the table.","She left a large space empty at the bottom of the page.","The magazine is struggling to fill all its advertising space.","The page layout included plenty of white space."],"opposite":"","synonyms":""},{"def":"the freedom and the time to think or do what you want to","examples":["She was upset and needed space.","You have to give teenagers plenty of space.","The writer lacked the time and space to develop his idea fully.","She moved out of the house because she wanted her own personal space."],"opposite":"","synonyms":""},{"def":"the whole area in which all things exist and move","examples":["It is quite possible that space and time are finite.","the fabric of space and time"],"opposite":"","synonyms":""},{"def":"an area of business in which a person or an organization operates","examples":["His investments have focused on the healthcare space.","Right now, the team is primarily at work on products within the mobile space."],"opposite":"","synonyms":""},{"def":"to be feeling happy, sad, worried, etc. about something; to be in a good, bad, unhappy, etc. state","examples":["I'm happy now. I'm in a good place.","Me and Ed are in a good space right now.","The economy is in a better place than it was a year ago.","He was in a bad place, mentally and emotionally.","She was in a dark place after her mother's death."],"opposite":"","synonyms":""},{"def":"to look straight in front of you without looking at a particular thing, usually because you are thinking about something","examples":["He sat staring into space, like a man in a trance.","She sat there motionless, staring into space."],"opposite":"","synonyms":""},{"def":"a person who is not useful or good at anything","examples":["You are a pathetic waste of space!"],"opposite":"","synonyms":""},{"def":"used in orders, to tell somebody to wait for more news about something to be announced","examples":["I can't tell you any more right now, but watch this space."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be in a good, bad, dark, etc. place","def":"to be feeling happy, sad, worried, etc. about something; to be in a good, bad, unhappy, etc. state","examples":["I'm happy now. I'm in a good place.","Me and Ed are in a good space right now.","The economy is in a better place than it was a year ago.","He was in a bad place, mentally and emotionally.","She was in a dark place after her mother's death."]},{"idiom":"look/stare/gaze into space","def":"to look straight in front of you without looking at a particular thing, usually because you are thinking about something","examples":["He sat staring into space, like a man in a trance.","She sat there motionless, staring into space."]},{"idiom":"a waste of space","def":"a person who is not useful or good at anything","examples":["You are a pathetic waste of space!"]},{"idiom":"watch this space","def":"used in orders, to tell somebody to wait for more news about something to be announced","examples":["I can't tell you any more right now, but watch this space."]}],"phrasal":[],"related":["space-age","space bar","space out","outer space","safe space","space cadet","space probe","space-time","space warp","space capsule","space heater","space shuttle","space station","breathing space","personal space","space race","2001: A Space Odyssey","European Space Agency"]},{"pos":"verb","level":"","meanings":[{"def":"to arrange things so that they have regular spaces between them","examples":["evenly spaced plants","a row of closely spaced dots","Space the posts about a metre apart.","Make sure the posts are spaced evenly apart.","Telephone boxes are spaced at regular intervals along the motorway.","The nails should be spaced at regular intervals."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["space out"],"related":[]}]