[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/spa/span_/span__us_1.mp3","phonsUS":"/spæn/","level":"C1","meanings":[{"def":"to last all through a period of time or to cover the whole of it","examples":["His acting career spanned 55 years.","Family photos spanning five generations were stolen."],"opposite":"","synonyms":""},{"def":"to include a large area or a lot of things","examples":["The operation, which spanned nine countries, resulted in 200 arrests.","His experience spanned not merely politics, but also business and journalism."],"opposite":"","synonyms":""},{"def":"to stretch right across something, from one side to the other","examples":["a series of bridges spanning the river","The roof was spanned by curved ribs of steel."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["time span","spic and span","spick and span"]},{"pos":"noun","level":"C1","meanings":[{"def":"the length of time that something lasts or is able to continue","examples":["I worked with him over a span of six years.","The project must be completed within a specific time span.","Small children have a short attention span.","a study of the entire span of Arab history","The book covers the entire span of Arab history.","The speech continued well beyond its allotted span.","to prolong life beyond its natural span","I worked with him several times over a span of six years."],"opposite":"","synonyms":""},{"def":"a range or variety of something","examples":["Managers have a wide span of control.","These forests cover a broad span of latitudes.","Managers have a wide span of responsibilities.","a broad span of interests"],"opposite":"","synonyms":""},{"def":"the part of a bridge or an arch between one support and another","examples":["The bridge crosses the river in a single span."],"opposite":"","synonyms":""},{"def":"the measurement of something from one side to the other","examples":["The kite has a span of 1.5 metres.","The bridge has 10 arches, each of a 30-foot span.","The bridge has a clear span of 120 feet."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adjective","level":"","meanings":[{"def":"neat and clean","examples":["Their house is always spick and span."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"spick and span","def":"neat and clean","examples":["Their house is always spick and span."]}],"phrasal":[],"related":[]}]