[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/spa/spare/spare__us_1.mp3","phonsUS":"/sper/","level":"B2","meanings":[{"def":"available to do what you want with rather than work","examples":["He's studying music in his spare time.","I haven't had a spare moment this morning."],"opposite":"","synonyms":""},{"def":"that is not being used or is not needed at the present time","examples":["We've got a spare bedroom, if you'd like to stay.","I'm afraid I haven't got any spare cash.","Are there any tickets going spare (= are there any available, not being used by somebody else)?"],"opposite":"","synonyms":""},{"def":"kept in case you need to replace the one you usually use; extra","examples":["a spare key/tyre","Take some spare clothes in case you get wet."],"opposite":"","synonyms":""},{"def":"thin, and usually quite tall","examples":[],"opposite":"","synonyms":""},{"def":"to become very angry or upset","examples":["Your mum would go spare if she knew!","I’ll go spare if I don’t get out of the house soon!"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"go spare","def":"to become very angry or upset","examples":["Your mum would go spare if she knew!","I’ll go spare if I don’t get out of the house soon!"]}],"phrasal":[],"related":["spare rib","spare part","spare tyre","spare parts","spare ribs","spare tyres","spare tire","spare tires","to spare","spare somebody’s blushes","spare somebody’s feelings"]},{"pos":"verb","level":"C1","meanings":[{"def":"to make something such as time or money available to somebody or for something, especially when it requires an effort for you to do this","examples":["spare something/somebody I'd love to have a break, but I can't spare the time just now.","spare something/somebody to do something Could you spare one of your staff to help us out?","spare something/somebody for somebody/something We can only spare one room for you.","You should spare a thought for (= think about) the person who cleans up after you.","He was late, but he spared a glance for the pretty girl at the desk.","spare somebody something Surely you can spare me a few minutes?","Can you spare a second to give me a hand?","Can you spare some money for the homeless?","She hardly spared him a second glance."],"opposite":"","synonyms":""},{"def":"to save somebody/yourself from having to go through an unpleasant experience","examples":["spare somebody/yourself something He wanted to spare his mother any anxiety.","Please spare me (= do not tell me) the gruesome details.","You could have spared yourself an unnecessary trip by phoning in advance.","spare somebody/yourself from something She was spared from the ordeal of appearing in court."],"opposite":"","synonyms":""},{"def":"to allow somebody/something to escape harm, damage or death, especially when others do not escape it","examples":["spare somebody/something They killed the men but spared the children.","She begged them to spare her life.","During the bombing only one house was spared (= was not hit by a bomb).","The storm largely spared Houston and surrounding districts.","spare somebody/something from something The children were spared from the virus.","spare somebody/something sth Hong Kong was spared a direct hit, but the storm still brought heavy rains and powerful winds."],"opposite":"","synonyms":""},{"def":"to do everything possible to achieve something or to do something well without trying to limit the time or money involved","examples":["He spared no effort to make her happy again.","No expense was spared in furnishing the new office."],"opposite":"","synonyms":""},{"def":"to work as hard as possible","examples":[],"opposite":"","synonyms":""},{"def":"to save somebody from an embarrassing situation","examples":["A last minute goal spared their blushes."],"opposite":"","synonyms":""},{"def":"to be careful not to do or say anything that might upset somebody","examples":["I kept off the subject of divorce so as to spare her feelings."],"opposite":"","synonyms":""},{"def":"if you have time, money, etc. to spare, you have more than you need","examples":["I've got absolutely no money to spare this month.","We arrived at the airport with five minutes to spare.","We should get there with half an hour to spare.","Have you any money to spare?"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"spare somebody’s blushes","def":"to save somebody from an embarrassing situation","examples":["A last minute goal spared their blushes."]},{"idiom":"spare somebody’s feelings","def":"to be careful not to do or say anything that might upset somebody","examples":["I kept off the subject of divorce so as to spare her feelings."]},{"idiom":"to spare","def":"if you have time, money, etc. to spare, you have more than you need","examples":["I've got absolutely no money to spare this month.","We arrived at the airport with five minutes to spare.","We should get there with half an hour to spare.","Have you any money to spare?"]}],"phrasal":[],"related":[]},{"pos":"noun","level":"","meanings":[{"def":"an extra thing that you keep in case you need to replace the one you usually use (used especially about a tyre of a car)","examples":["to get the spare out of the boot/trunk","I've lost my key and I haven't got a spare."],"opposite":"","synonyms":""},{"def":"spare parts (= new parts that you buy to replace old or broken parts of a car, machine, etc.)","examples":["It can be difficult to get spares for some older makes of car."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]