[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/spa/spark/spark__us_1.mp3","phonsUS":"/spɑːrk/","level":"C1","meanings":[{"def":"to cause something to start or develop, especially suddenly","examples":["spark something The proposal would spark a storm of protest around the country.","Winds brought down power lines, sparking a fire.","The organizers are hoping to spark some interest in young people.","spark something off The riots were sparked off by the arrest of a local leader."],"opposite":"","synonyms":""},{"def":"to produce small flashes of fire or electricity","examples":["a sparking, crackling fire","(figurative) The game suddenly sparked to life."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["spark up"],"related":["spark up","spark plug","Spark","spark plugs","spark up something","a bright spark"]},{"pos":"noun","level":"","meanings":[{"def":"a very small burning piece of material that is produced by something that is burning or by hitting two hard substances together","examples":["A shower of sparks flew up the chimney.","A spark from the machinery had set fire to some material.","Flying sparks set fire to the dry grass.","His iron-tipped stick struck sparks from the pavement.","The firework showered sparks all over the lawn.","The grinding wheel sent a shower of sparks across the workbench."],"opposite":"","synonyms":""},{"def":"a small flash of light produced by an electric current","examples":["sparks from a faulty light switch","A spark ignites the fuel in a car engine."],"opposite":"","synonyms":""},{"def":"a small amount of a particular quality or feeling","examples":["a spark of hope","The woman’s eyes still had a spark of life in them.","She didn't have a spark of talent in her.","He had kindled a spark of interest within her."],"opposite":"","synonyms":""},{"def":"a special quality of energy, intelligence or enthusiasm that makes somebody very clever, funny, etc.","examples":["As a writer he seemed to lack creative spark.","She was a real star. She had a certain spark—that something extra.","The players have shown that they still possess the spark to make a fight of it.","She had lost none of the spark that had made her such an endearing young bride.","His performances lack creative spark.","Her performance added a little spark to the movie."],"opposite":"","synonyms":""},{"def":"an action or event that causes something important to develop, especially trouble or violence","examples":["These were the sparks of revolution."],"opposite":"","synonyms":""},{"def":"feelings of anger or excitement between people","examples":["Sparks flew at the meeting (= there was a lot of argument).","She was suddenly aware of the romantic spark between them.","His remarks drew sparks from her.","She felt a little spark of anger.","Her eyes shot sparks of contempt."],"opposite":"","synonyms":""},{"def":"a lively and intelligent person, especially somebody young","examples":["Some bright spark (= stupid person) left the tap running all night."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a bright spark","def":"a lively and intelligent person, especially somebody young","examples":["Some bright spark (= stupid person) left the tap running all night."]}],"phrasal":[],"related":[]}]