[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/spe/speak/speaker__us_1.mp3","phonsUS":"/ˈspiːkər/","level":"A2","meanings":[{"def":"a person who gives a talk or makes a speech","examples":["He was a guest speaker at the conference.","a keynote speaker at the Republican convention","She was a brilliant public speaker.","The Society has an interesting talk by a visiting speaker every month.","Previous speakers include two former US Secretaries of State.","He was much in demand as a visiting speaker.","The conference featured a number of distinguished speakers from the world of business and industry.","speaker on something She is a frequent speaker on human and civil rights.","He makes his living as a motivational speaker.","She's a good public speaker.","the commencement speaker at my graduation","Marina Warner was the keynote speaker at the conference."],"opposite":"","synonyms":""},{"def":"a person who speaks a particular language","examples":["English speakers","Spanish/Arabic/Chinese speakers","speaker of something a fluent speaker of German","I looked around to see who the speaker was.","a fluent Arabic speaker","The ideal candidate will be an effective communicator.","Don't tell anyone, because some people are terrible gossips.","He’s a very persuasive talker.","She’s a (great) talker (= she talks a lot).","He's a fluent Arabic speaker.","speakers of English"],"opposite":"","synonyms":"speaker"},{"def":"a person who is or was speaking","examples":["I looked around to see who the speaker was.","A speaker conveys information through tone and body language.","Communication is an active process that involves both the speaker and the listener."],"opposite":"","synonyms":""},{"def":"the part of a radio, computer or piece of musical equipment that the sound comes out of","examples":["The car had a powerful sound system with four speakers.","The computer has built-in stereo speakers.","a new set of speakers","sound effects coming from the rear speakers"],"opposite":"","synonyms":""},{"def":"the title of the person whose job is to control the discussions in a parliament","examples":["the Speaker of the House of Commons/Representatives"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["smart speaker","native speaker","Lord Speaker"]}]