[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/spe/specu/speculation__us_1.mp3","phonsUS":"/ˌspekjuˈleɪʃn/","level":"B2","meanings":[{"def":"the act of forming opinions about what has happened or what might happen without knowing all the facts","examples":["His private life is the subject of much speculation.","speculation that… There was widespread speculation that she was going to resign.","speculation about something Today's announcement ends months of speculation about the company's future.","speculation over something The president’s absence led to speculation over his health.","She dismissed the newspaper reports as pure speculation.","Our speculations proved right.","He was dropped from the team amid speculation that he was sick.","Much speculation surrounds his role in the crisis.","Speculation is mounting that a new tax will be introduced.","Speculation was rife as to who would be chosen as a successor.","Speculation was rife as to whom the prince might marry.","There has been a lot of speculation linking the defender with a move to Chelsea.","There has been increasing speculation over the company's future.","There was wild speculation among the students as to the reason for cancelling the lecture.","This is just speculation on my part.","This issue has attracted a great deal of speculation among economists.","Whether or not he will get the job is mere speculation.","With a lack of credible answers, speculation is running rampant.","amateur speculation based on questionable assumptions","Speculation was rife that he was having an affair.","The visit fuelled speculation about a major arms deal between the two countries.","There has been intense media speculation over the past few days."],"opposite":"","synonyms":""},{"def":"the activity of buying and selling goods or shares in a company in the hope of making a profit, but with the risk of losing money","examples":["speculation in oil","speculation against the euro","speculation on the stock market"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]