[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/spe/speci/special__us_1.mp3","phonsUS":"/ˈspeʃl/","level":"A1","meanings":[{"def":"not ordinary or usual; different from what is normal","examples":["The school will only allow this in special circumstances.","An application has been filed for special leave to appeal in the High Court.","Some of the officials have special privileges.","There is something special about this place.","This type of wood needs special treatment.","In special circumstances candidates without these qualifications may be considered.","Journalists were given no special privileges."],"opposite":"","synonyms":""},{"def":"more important than others; deserving or getting more attention than usual","examples":["What are your special interests?","Our special guest on next week’s show will be…","a special occasion","a special 20th anniversary edition of the movie","It's a film that holds a special place in my heart.","What makes him special as a director is his obvious intelligence.","She makes me feel special.","She's a very special friend.","Don't lose it—it's special.","He wanted someone special in his life.","The oil industry was treated as a special case."],"opposite":"","synonyms":""},{"def":"organized or intended for a particular purpose","examples":["British special forces were employed on stealth operations.","a special event/report/team","There are almost no special features on this DVD.","These teachers need special training.","Dr Pearce is the special adviser on environmental issues.","a United Nations special envoy","The merger was approved at a special meeting of shareholders."],"opposite":"","synonyms":""},{"def":"used by or intended for one particular person or group of people","examples":["She has a special way of smiling.","He enlivens his lectures with his own special brand of humour.","He sent a special message to the men.","He was usually to be found in the cafe at his own special table by the window.","It's the author's special way of paying homage to an earlier poet.","The President ended with a special message for the people of Texas.","The directors have their own special pension fund.","The choreographer created a special style of dance for each character.","The speaker paid special tribute to the founder of the organization.","The director received a special ovation from the actors."],"opposite":"","synonyms":""},{"def":"better or more than usual","examples":["As an only child she got special attention.","Special thanks are due to the many volunteers who helped organize fund-raising events.","People who grow things have a special relationship with the land.","Please take special care of it.","Police advised residents to take special precautions because of the increase in burglaries."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["special agent","special needs","special offer","Special Branch","special constable","special delivery","special edition","special education","special effects","special licence","special operation","special pleading","special school","special prosecutor","Test Match Special","special interest group","site of special scientific interest","special schools"]},{"pos":"noun","level":"","meanings":[{"def":"something that is not usually available but is provided for a particular purpose or on one occasion","examples":["an election-night special on television","The menu changes regularly and there are daily specials to choose from.","Eric Sykes returned with this one-off special for ITV.","The restaurant has an extensive menu and daily specials.","There are lots of TV Christmas specials for children this year.","the Dick Van Dyke Show reunion special"],"opposite":"","synonyms":""},{"def":"a price for a particular product in a shop or restaurant that is lower than usual","examples":["There's a special on coffee this week."],"opposite":"","synonyms":""},{"def":"on sale at a lower price for a short period of time","examples":["The chocolates were on special at my local store.","You can often find them on special."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"on special","def":"on sale at a lower price for a short period of time","examples":["The chocolates were on special at my local store.","You can often find them on special."]}],"phrasal":[],"related":[]}]