[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/spe/speed/speed__us_1.mp3","phonsUS":"/spiːd/","level":"A2","meanings":[{"def":"the rate at which somebody/something moves or travels","examples":["at … speed at high/low/full/top speed","The five-door version has a maximum speed of 130 mph.","a fast/slow speed","London traffic moves at an average speed of 11 mph.","speed of something travelling at the speed of light/sound","a speed of 50 mph/80 kph","The missile reaches speeds of 5  800 kilometres per hour.","The train began to pick up speed (= go faster).","at breakneck speed (= fast in a way that is dangerous)","an attempt to break the land speed record","It is best not to spray when wind speeds are greater than 5 miles per hour.","The car was gathering speed.","He reduced speed and turned sharp left.","There are speed restrictions on this road.","Increasing your walking speed will help to exercise your heart.","Concorde crossed the Atlantic at twice the speed of sound.","He drove us to the hospital at breakneck speed.","He set a new land speed record in this car.","He was running at full speed when a tendon snapped in his leg.","He was traveling at a high rate of speed.","Hedgehogs, though small, can move with surprising speed.","Motorists are asked to reduce their speed in wet conditions.","Radio waves travel at the speed of light.","The boat can be brought to a stop from full speed ahead within her own length.","The boat maintained a steady speed while the sea was calm.","The car reaches a speed of 60 miles per hour within five seconds.","The glacier moves at an average speed of about six feet per day.","The ships have a maximum speed of 18 knots.","The train pulled out of the station, slowly gathering speed.","a significant increase in speed","at lightning speed","jets flying at supersonic speed","measures to curb the speed of cars travelling through the village","He came down the hill at breakneck speed.","She reduced speed before turning the corner.","We travelled at an average speed of about 80 kph."],"opposite":"","synonyms":""},{"def":"the rate at which something happens or is done","examples":["the processing speed of the computer","at a speed This course is designed so that students can progress at their own speed.","speed of something We aim to increase the speed of delivery (= how quickly goods are sent).","broadband that runs at speeds in excess of 40 megabits per second","the increase in processor speeds for home computers","We offer subscribers a download speed of 8 MB.","The machinery is regulated to a safe running speed.","The new houses have been built with astonishing speed.","The classes are designed to let students progress at their own speed."],"opposite":"","synonyms":""},{"def":"the quality of being quick or rapid","examples":["The Kenyan runner put on a sudden burst of speed over the last 50 metres.","She was overtaken by the speed of events (= things happened more quickly than she expected).","at speed (formal) A car flashed past them at speed (= fast).","If a footballer lacks speed, he has no chance at the top level.","The accident was due to excessive speed.","Speed is his greatest asset as a tennis player.","90% of car accidents involve excess speed.","The Greek runner produced an electrifying burst of speed over the last 50 metres.","The car was moving at speed when the accident happened."],"opposite":"","synonyms":""},{"def":"a measurement of how sensitive film for cameras, etc. is to light","examples":[],"opposite":"","synonyms":""},{"def":"the time taken by a camera shutter to open and close","examples":[],"opposite":"","synonyms":""},{"def":"a gear on a bicycle, in a car, etc.","examples":["a four-speed gearbox","a ten-speed mountain bike"],"opposite":"","synonyms":""},{"def":"an illegal amphetamine drug that is taken to give feelings of excitement and energy","examples":[],"opposite":"","synonyms":""},{"def":"with as much speed or energy as possible","examples":["We as a company are moving full speed ahead."],"opposite":"","synonyms":""},{"def":"you will finish doing something sooner if you do not try to do it too quickly because you will make fewer mistakes","examples":[],"opposite":"","synonyms":""},{"def":"a sudden increase in your speed or rate of progress; the ability to suddenly increase your speed","examples":["He put on an impressive turn of speed in the last lap.","The kangaroo has a fast turn of speed.","For a small car it has a good turn of speed."],"opposite":"","synonyms":""},{"def":"performing at an expected rate or level","examples":["the cost of bringing the chosen schools up to speed"],"opposite":"","synonyms":""},{"def":"having the most recent and accurate information or knowledge","examples":["Are you up to speed yet on the latest developments?"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"full speed/steam ahead","def":"with as much speed or energy as possible","examples":["We as a company are moving full speed ahead."]},{"idiom":"more haste, less speed","def":"you will finish doing something sooner if you do not try to do it too quickly because you will make fewer mistakes","examples":[]},{"idiom":"a turn of speed","def":"a sudden increase in your speed or rate of progress; the ability to suddenly increase your speed","examples":["He put on an impressive turn of speed in the last lap.","The kangaroo has a fast turn of speed.","For a small car it has a good turn of speed."]},{"idiom":"up to speed (on something)","def":"performing at an expected rate or level","examples":["the cost of bringing the chosen schools up to speed","Are you up to speed yet on the latest developments?"]}],"phrasal":[],"related":["speed up","clock speed","high-speed","speed dial","speed-dial","speed hump","speed limit","speed-read","speed trap","warp speed","ground speed","shutter speed","speed breaker","speed camera","speed dating","speed-reading","speed skating"]},{"pos":"verb","level":"B2","meanings":[{"def":"to move along quickly","examples":["They sped off to get help.","The car sped along the road towards the village.","He sped away on his bike.","the sound of a motorcycle speeding down the street","We turned and watched a train speeding by.","He couldn't hear the car that was speeding towards him.","I sped back to her house as fast as I could, but she had already gone."],"opposite":"","synonyms":""},{"def":"to take somebody/something somewhere very quickly, especially in a vehicle","examples":["The cab speeded them into the centre of the city."],"opposite":"","synonyms":""},{"def":"to make something happen more quickly","examples":["The drugs will speed her recovery.","More is needed to speed the development of a safe and effective vaccine."],"opposite":"","synonyms":""},{"def":"to drive faster than the speed that is legally allowed","examples":["The police caught him speeding.","Accident investigators said evidence appeared to suggest that he was not speeding.","Most drivers speed, at least occasionally.","Speeding motorists are a danger to others."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["speed up"],"related":[]}]