[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/spe/speec/speech__us_1.mp3","phonsUS":"/spiːtʃ/","level":"A2","meanings":[{"def":"a formal talk that a person gives to an audience","examples":["Several people made speeches at the wedding.","She gave a rousing speech to the crowd.","speech on something to deliver a speech on human rights","speech about something He inspired everyone with a moving speech about tolerance and respect.","in a speech In his acceptance speech, the actor thanked his family.","Several people made speeches at the wedding.","a lecture on the Roman army","a course/​series of lectures","a televised presidential address","She gave an interesting talk on her visit to China.","to preach a sermon","George Washington's inaugural speech","He made a speech about workers of the world uniting.","In a speech given last month, she hinted she would run for office.","She delivered the keynote speech (= main general speech) at the conference.","He wrote her party conference speech.","His 20-minute speech was interrupted several times by booing.","Her comments came ahead of a speech she will deliver on Thursday to business leaders.","She concluded her speech by thanking the audience.","He gave an impassioned speech broadcast nationwide.","We heard a speech by the author.","This is very unexpected—I haven't prepared a speech.","The guest speaker is ill so I have to do the opening speech.","He read his speech from a prompter.","the farewell speech given by George Washington","He made the comments in a nationally televised speech.","During his victory speech the President paid tribute to his defeated opponent.","In his concession speech, he urged his supporters to try to work with Republicans.","The Prime Minister addressed the nation in a televised speech.","He delivered his final speech to Congress.","He delivered the commencement speech at Notre Dame University.","His speech was broadcast on national radio.","In her speech to the House of Commons, she outlined her vision of Britain in the 21st century.","President Bush delivered his 2004 State of the Union speech.","She gave a speech on the economy.","She made a stirring campaign speech on improving the lot of the unemployed.","The President will deliver a major foreign-policy speech to the United Nations.","The candidates gave their standard stump speeches (= political campaign speeches).","The prizewinner gave an emotional acceptance speech.","a Senate floor speech","her maiden speech (= her first) in the House of Commons","the Chancellor's Budget speech","the Prime Minister's speech-writers","She's been asked to give the after-dinner speech.","You will need to prepare an acceptance speech.","a political speech writer"],"opposite":"","synonyms":"speech"},{"def":"the language used when speaking; the fact of speaking rather than writing","examples":["in speech This expression is used mainly in speech, not in writing.","a defence of free speech (= the right to say openly what you think)","speech sounds","the use of language in everyday speech","The kids pepper their speech with a lot of slang and terms from social media.","the difficulties of transcribing conversational speech","Computer-generated speech has become significantly more intelligible and naturalistic.","The poems are delivered in a style between speech and song.","Improvements in speech recognition have produced digital assistants that can respond to spoken commands.","A blind user can 'read' a newspaper using a Braille display or speech synthesizer.","Her singing style is close to the natural rhythms of everyday speech.","the speech rhythms of the Polish language","He learned to successfully mimic American speech patterns.","birds that mimic the intonations of human speech","They were able to communicate without speech.","In English, a letter does not always represent the same speech sound.","Speech codes have been instituted by some universities (= to stop language that is sexist, racist, etc.).","The country continues to suppress free speech and censor the internet.","When the government restricts speech, this may be a violation of the First Amendment.","racist hate speech"],"opposite":"","synonyms":""},{"def":"the ability to speak","examples":["I seemed to have lost the power of speech.","a speech impediment","The child was referred to a speech therapist.","He temporarily lost the power of speech after the accident.","It's a story about a kid who loses his powers of sight, hearing and speech.","a child who has problems with speech and language","a speech and language therapist","Because of his difficulties with speech, people thought he had learning disabilities and treated him accordingly.","the development of speech in humans","Symptoms may include visual and speech impairment.","She goes to a special school for the speech and hearing impaired.","Most people have speech, but significantly fewer have writing."],"opposite":"","synonyms":""},{"def":"the way in which a particular person speaks","examples":["Her speech was slurred—she was clearly drunk.","Clear speech with crisp consonant sounds is very important.","She could tell by his slurred speech that he had been drinking.","She was slurring her speech.","I find his speech very hard to understand.","I don't like it when people correct my speech.","His speech was incoherent, responding to questions that had not been asked.","In halting speech, she began to tell her story.","She has a very idiosyncratic style of speech."],"opposite":"","synonyms":""},{"def":"a group of lines that an actor speaks in a play in the theatre","examples":["She has the longest speech in the play."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["hate speech","speech act","speech day","direct speech","speech bubble","speech marks","speech-writer","caretaker speech","indirect speech","part of speech","reported speech","speech community","speech synthesis","speech therapist","speech therapy","text-to-speech","figure of speech","speech recognition","freedom of speech","King’s Speech"]}]