[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/spe/spend/spend__us_1.mp3","phonsUS":"/spend/","level":"A1","meanings":[{"def":"to give money to pay for goods, services, etc.","examples":["spend something I've spent all my money already.","spend something on something She spent £100 on a new dress.","spend something on doing something That money would be better spent on educating children.","spend something doing something The company has spent thousands of pounds updating their computer systems.","I just can't seem to stop spending.","We're spending too much and we need to cut back.","Try to spend your money wisely.","These patrons have money to spend.","Work out how much you can afford to spend.","Consumers are spending less because of fear of unemployment.","the amount of money spent per student","The government spends more on sport than on the arts.","In 1953, consumers spent 20 per cent of their income on food.","The company spent a lot on advertising.","Do you know how much your family spends annually on holidays?","The average household spends £59 per week on transport.","I pay my bills and then I spend the rest on going out and having fun.","The money spent on funding this research would be much better spent on cancer care and prevention.","Why spend billions sending people into space?","The government spent $11 million restoring the building.","He had grown used to spending freely, without worrying about the consequences.","During the boom years, the American public bought and spent like never before.","They spent lavishly on entertaining.","This jacket cost me £150, which I consider money well spent."],"opposite":"","synonyms":""},{"def":"to use time for a particular purpose; to pass time","examples":["spend something + adv./prep. We spent the day at the beach.","I like to spend time with my friends.","Her childhood was spent in Italy.","spend something on something How long did you spend on your homework?","spend something doing something They spent the whole night talking.","I've spent years trying to learn Japanese.","to spend hours/days/months doing something","spend something in doing something Most of her life was spent in caring for others.","We spent the weekend in Paris.","How do you spend your spare time?","He couldn't find a hotel and had to spend the night in the car.","He spent six months in prison for the offence.","She spends more time at work than at home.","She had to spend two nights in hospital.","There is concern about the amount of time our children spend in front of screens.","She spends three hours a day on exercise.","I've spent ages on this so I hope it's all right.","We spent a very pleasant evening at a restaurant.","We usually spend Christmas with my parents.","The family spends every Thursday evening together.","Every hour spent on practice is worth it.","I spent a couple of hours talking to him but it was time well spent because he really helped me.","This is where I want to spend the rest of my life.","They spend winters in the Caribbean.","After nearly 3 decades spent as a teacher, she's ready for a career change.","I spend too much time watching television.","Just spend a few minutes checking your work.","He plans to spend a week touring the south coast.","I spent about 20 minutes reading the wrong manual.","In the summer she spent two weeks doing work experience at a law firm.","You can spend the rest of the day relaxing.","We'll spend the morning working in small groups.","He has spent his life helping other people.","A lot of time has been spent in developing these methods.","Time spent in training staff is never wasted."],"opposite":"","synonyms":""},{"def":"to use energy, effort, etc., especially until it has all been used","examples":["spend something on something She spends too much effort on things that don't matter.","spend something doing something The teacher spends a lot of energy planning a good lesson.","spend itself The storm had finally spent itself.","All his energy is spent on revenge.","I can see you've spent a lot of energy on this.","For a guy who spends so much energy trying to pick up women, Roger's pretty awful at it.","There's not enough effort spent exploring these issues.","Considering he spends so much effort criticizing our ideas, you'd expect him to come up with some alternatives.","I felt that this excitement could not keep on long, that it must soon spend itself.","It seemed at the time that the frantic rush to buy smartphones had finally spent itself."],"opposite":"","synonyms":""},{"def":"to stay with somebody for a night","examples":["My daughter's spending the night with a friend."],"opposite":"","synonyms":""},{"def":"to stay with somebody for a night and have sex with them","examples":[],"opposite":"","synonyms":""},{"def":"people say ‘spend a penny’ to avoid saying ‘use the toilet’","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"spend the night with somebody","def":"to stay with somebody for a night","examples":["My daughter's spending the night with a friend."]},{"idiom":"spend a penny","def":"people say ‘spend a penny’ to avoid saying ‘use the toilet’","examples":[]}],"phrasal":[],"related":["spend the night together","spend a penny","spend the night with somebody"]},{"pos":"noun","level":"","meanings":[{"def":"the amount of money spent for a particular purpose or over a particular length of time","examples":["The average spend at the cafe is £10 a head."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]