[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/spi/spiri/spirit__us_1.mp3","phonsUS":"/ˈspɪrɪt/","level":"B1","meanings":[{"def":"the part of a person that includes their mind, feelings and character rather than their body","examples":["You are underestimating the power of the human spirit to overcome difficulties.","Yoga is meant to unite the body, mind and spirit.","It is a testimony to the triumph of the human spirit.","She exudes a warmth and generosity of spirit.","healing for body, mind and spirit"],"opposite":"","synonyms":""},{"def":"a person’s feelings or state of mind","examples":["to be in high/low spirits","They were all in good spirits as they set out.","You must try and keep your spirits up (= stay cheerful).","a song that never fails to lift my spirits","My spirits sank at the prospect of starting all over again.","We sang songs to keep our spirits up.","She isn't in the best of spirits today.","My mother was in excellent spirits."],"opposite":"","synonyms":""},{"def":"a person of the type mentioned","examples":["a brave spirit","kindred spirits (= people who like the same things as you)","She was a guiding spirit in primary education.","He found kindred spirits in the peace movement."],"opposite":"","synonyms":""},{"def":"courage, energy or determination","examples":["Peter had a good game and showed his true spirit.","They took away his freedom and broke his spirit.","with spirit Although the team lost, they played with tremendous spirit.","He sang with great spirit.","She has plenty of fighting spirit.","They tortured him until he was broken in spirit."],"opposite":"","synonyms":""},{"def":"feelings of support towards a group, team or society","examples":["There's not much community spirit around here.","spirit of something Officials have praised the cooperative spirit of the joint task force."],"opposite":"","synonyms":""},{"def":"the typical or most important quality or mood of something","examples":["spirit of something The exhibition captures the spirit of the age/times.","It seemed to fit in with the spirit of the festival.","His poetry summed up the spirit of the age.","The exhibition captures the spirit of the Swinging Sixties.","That song really captures the spirit of the times.","They brought the spirit of carnival to their concerts.","She embodies the spirit of revolution.","the indomitable American spirit"],"opposite":"","synonyms":""},{"def":"a state of mind or mood; an attitude","examples":["We approached the situation in the wrong spirit.","‘OK, I'll try’. ‘That's the spirit (= the right attitude).’","The party went well because everyone entered into the spirit of things.","I'm trying to get into the spirit of the holiday season.","He's got the right spirit!","I was just getting to the spirit of things when the party suddenly ended.","They have the right spirit!","Both sides have come together in a spirit of goodwill.","They are all working together in a spirit of cooperation.","He felt a kind of lightness in his spirit as the sun came up.","a spirit of adventure"],"opposite":"","synonyms":""},{"def":"the real or intended meaning or purpose of something","examples":["Obey the spirit, not the letter (= the narrow meaning of the words) of the law.","The movie is true to the spirit of the book.","The referee should try to obey the spirit as well as the letter of the law.","an edict that violates the spirit of the Geneva Convention"],"opposite":"","synonyms":""},{"def":"the soul thought of as separate from the body and believed to live on after death; a ghost","examples":["He is dead, but his spirit lives on.","It was believed that people could be possessed by evil spirits.","a message from the spirit world","Owls were believed to be restless spirits who had returned to earth.","She slept with a cross under the pillow to ward off evil spirits.","Many people believe the spirit lives on after death.","My spirit guide cares for me and protects me."],"opposite":"","synonyms":""},{"def":"an imaginary creature with magic powers, for example, a fairy or an elf","examples":[],"opposite":"","synonyms":""},{"def":"a strong alcoholic drink","examples":["I don't drink whisky or brandy or any other spirits.","A standard measure of spirits is 25ml.","a single measure of spirits"],"opposite":"","synonyms":""},{"def":"a special type of alcohol used in industry or medicine","examples":[],"opposite":"","synonyms":""},{"def":"as/when/if you feel like it","examples":["I'll go for a run this evening, if the spirit moves me.","Make a donation to the charity if the spirit moves you."],"opposite":"","synonyms":""},{"def":"a feeling that you are ready to fight very hard for something or to try something difficult","examples":[],"opposite":"","synonyms":""},{"def":"in your thoughts","examples":["I shall be with you in spirit (= thinking about you though not with you physically)."],"opposite":"","synonyms":""},{"def":"to make somebody feel more cheerful or brave","examples":["The sunny weather raised my spirits a little."],"opposite":"","synonyms":""},{"def":"you intend to do good things but you are too lazy, weak or busy to actually do them","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"as/when/if the spirit moves you","def":"as/when/if you feel like it","examples":["I'll go for a run this evening, if the spirit moves me.","Make a donation to the charity if the spirit moves you."]},{"idiom":"fighting spirit","def":"a feeling that you are ready to fight very hard for something or to try something difficult","examples":[]},{"idiom":"in spirit","def":"in your thoughts","examples":["I shall be with you in spirit (= thinking about you though not with you physically)."]},{"idiom":"raise somebody’s spirits","def":"to make somebody feel more cheerful or brave","examples":["The sunny weather raised my spirits a little."]},{"idiom":"the spirit is willing (but the flesh is weak)","def":"you intend to do good things but you are too lazy, weak or busy to actually do them","examples":[]}],"phrasal":[],"related":["Spirit","free spirit","spirit gum","spirit lamp","team spirit","party spirit","public spirit","spirit level","white spirit","methylated spirit","surgical spirit","Holy Spirit","Great Spirit","Spirit of St Louis","spirit lamps","spirit levels","the Holy Spirit"]},{"pos":"verb","level":"","meanings":[{"def":"to take somebody/something away in a quick, secret or mysterious way","examples":["After the concert, the band was spirited away before their fans could get near them."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/spi/spiri/spirit__us_4.mp3","level":"","meanings":[{"def":"the second Mars Rover vehicle which landed on the planet Mars in 2004 and sent pictures of the surface of the planet back to NASA","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]