[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/spl/split/split__us_1.mp3","phonsUS":"/splɪt/","level":"B2","meanings":[{"def":"to divide, or to make something divide, into two or more parts","examples":["split something He was a member of the team that split the atom in 1932.","Split the coconut in half.","split something into something She split the class into groups of four.","Each chapter is split into two parts.","split into something The results split neatly into two groups.","Slate splits easily into thin sheets.","If the nail you use is too big, there's a chance that the wood will split.","Identical twins come from a single fertilized egg that splits in two.","He split the log into several pieces.","On January 1 1993, Czechoslovakia formally split into two independent states.","Plastic splits quite easily.","Which scientist first split the atom?","I was put to work splitting wood for the fire."],"opposite":"","synonyms":""},{"def":"to divide something into two or more parts and share it between different people, activities, etc.","examples":["split something with somebody She split the money she won with her brother.","split something The two men agreed to split the proceeds.","We share a house and split all the bills.","split something between A and B His time is split between the London and Paris offices.","Four of us live here and we split all the bills four ways.","The profit will be split three ways.","The cost has been split equally between three countries.","She splits her time between Madrid and Washington."],"opposite":"","synonyms":""},{"def":"to divide, or to make a group of people divide, into smaller groups that have very different opinions","examples":["split on/over something The committee split over government subsidies.","split something His candidacy split the Republican vote.","split from something The sect split from the Mormon church more than a hundred years ago.","be split on/over something The party is deeply split on this issue.","The poll found the public evenly split on the issue.","The community was split down the middle on this.","The party finally split over the issue of gun control.","Several factions split from the party."],"opposite":"","synonyms":""},{"def":"to tear, or to make something tear, along a straight line","examples":["Her dress had split along the seam.","split something Don't tell me you've split another pair of pants!","split open The cushion split open and sent feathers everywhere.","split something open He split the packet open and poured out a handful of peanuts.","The ripe seed pod splits open and scatters the seeds.","The lid had split down the middle."],"opposite":"","synonyms":""},{"def":"to cut somebody’s skin and make it bleed","examples":["split something open She split her head open on the cupboard door.","She fell downstairs and split her head open.","split something How did you split your lip?"],"opposite":"","synonyms":""},{"def":"to leave somebody and stop having a relationship with them","examples":["split (with somebody) The singer split with his wife last June.","split (from somebody) She intends to split from the band at the end of the tour."],"opposite":"","synonyms":""},{"def":"to leave a place quickly","examples":["Let's split!"],"opposite":"","synonyms":""},{"def":"(when discussing a price, etc.) to agree on an amount that is at an equal distance between the two amounts that have been suggested","examples":["I offered €200 but he wanted €300. In the end, we split the difference and I paid him €250.","(figurative) I wanted to leave early and Ian wanted to leave late, so we split the difference and left at noon."],"opposite":"","synonyms":""},{"def":"to divide something into two equal parts; to divide into two equal parts","examples":["The country was split down the middle over the strike (= half supported it, half did not).","Divide the cake down the middle.","It would seem the community has divided down the middle, with some favouring expansion and some dead set against it."],"opposite":"","synonyms":""},{"def":"to pay too much attention in an argument to differences that are very small and not important","examples":[],"opposite":"","synonyms":""},{"def":"to place an adverb between ‘to’ and the infinitive of a verb, for example to say ‘to strongly deny the report’. Some people consider this to be bad English style.","examples":[],"opposite":"","synonyms":""},{"def":"to laugh a lot at somebody/something","examples":[],"opposite":"","synonyms":""},{"def":"to vote for candidates from more than one party","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"split the difference","def":"(when discussing a price, etc.) to agree on an amount that is at an equal distance between the two amounts that have been suggested","examples":["I offered €200 but he wanted €300. In the end, we split the difference and I paid him €250.","(figurative) I wanted to leave early and Ian wanted to leave late, so we split the difference and left at noon."]},{"idiom":"split/divide (something) down the middle","def":"to divide something into two equal parts; to divide into two equal parts","examples":["The country was split down the middle over the strike (= half supported it, half did not).","Divide the cake down the middle.","It would seem the community has divided down the middle, with some favouring expansion and some dead set against it."]},{"idiom":"split hairs","def":"to pay too much attention in an argument to differences that are very small and not important","examples":[]},{"idiom":"split an infinitive","def":"to place an adverb between ‘to’ and the infinitive of a verb, for example to say ‘to strongly deny the report’. Some people consider this to be bad English style.","examples":[]},{"idiom":"split your sides (laughing/with laughter)","def":"to laugh a lot at somebody/something","examples":[]},{"idiom":"split the ticket","def":"to vote for candidates from more than one party","examples":[]}],"phrasal":["split away","split off","split on","split up"],"related":["split on","split up","split end","split off","split pea","split away","split-level","split shift","banana split","lickety-split","split screen","split-screen","split second","split-second","split ticket","split-ticket","split infinitive","split personality disorder"]},{"pos":"noun","level":"B2","meanings":[{"def":"an argument or disagreement that divides a group of people or makes somebody separate from somebody else","examples":["Ten years after their acrimonious split, the band has reformed.","split in/within something a damaging split within the party leadership","The move threatened to cause a split in the movement.","split with somebody/something the years following his bitter split with his wife","split between A and B There have been reports of a split between the Prime Minister and the Cabinet.","a growing split in the Church over the issue of gay priests","a split between the right and left wings of the party","an ideological split within the party","A damaging split within the party leadership has occurred.","He found it difficult to cope in the years following his bitter split with his wife."],"opposite":"","synonyms":""},{"def":"a long opening made when something tears","examples":["A blockage in the artery caused the split.","split in something There's a big split in the tent."],"opposite":"","synonyms":""},{"def":"a division between two or more things; one of the parts that something is divided into","examples":["He demanded a 50–50 split in the profits.","It's an even split; some love it, some hate it."],"opposite":"","synonyms":""},{"def":"a position in which you stretch your legs flat across the floor in opposite directions with the rest of your body sitting straight up","examples":["a gymnast doing the splits"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]