[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/spo/spons/sponsor__us_1.mp3","phonsUS":"/ˈspɑːnsər/","level":"B2","meanings":[{"def":"to pay the costs of a particular event, programme, etc. as a way of advertising","examples":["Sports events are no longer sponsored by the tobacco industry.","The magazine sponsors an essay competition open to anyone anywhere.","The World Bank has sponsored several conferences on open government and freedom of information.","We would like to thank the local businesses who kindly sponsored prizes for the raffle."],"opposite":"","synonyms":""},{"def":"to agree to give somebody money for a charity if they complete a particular task","examples":["sponsor somebody They got their granny and aunts and other people to sponsor them.","sponsor somebody for something Will you sponsor me for a charity walk I'm doing?","sponsor somebody to do something He appealed for people to sponsor him to cycle from Land's End to John O'Groats.","sponsored + noun a sponsored walk/swim"],"opposite":"","synonyms":""},{"def":"to support somebody by paying for their training or education","examples":["sponsor somebody The corporation is sponsoring several athletes and teams here in the US.","sponsor somebody through something She found a company to sponsor her through college.","The trust only has a limited amount of funds to sponsor students."],"opposite":"","synonyms":""},{"def":"to provide money for a particular activity","examples":["The group has been accused of sponsoring terrorism."],"opposite":"","synonyms":""},{"def":"to arrange for something official to take place","examples":["The US is sponsoring negotiations between the two sides."],"opposite":"","synonyms":""},{"def":"to introduce a proposal for a new law, etc.","examples":["The bill was sponsored by a Labour MP."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"B2","meanings":[{"def":"a person or company that pays for a radio or television programme, or for a concert or sporting event, usually in return for advertising","examples":["The programme is funded by a number of corporate sponsors.","The Barbados Tourism Authority is the main sponsor of the event.","The festival lost a major sponsor last year.","The race organizers are trying to attract sponsors.","the title sponsor of the rowing World Cup"],"opposite":"","synonyms":""},{"def":"a person who agrees to give somebody money for a charity if that person succeeds in completing a particular activity","examples":["Even though the race is still ten weeks away, we are already looking for sponsors.","sponsor for something I'm collecting sponsors for next week's charity run.","I need to find some more sponsors for my charity bike ride."],"opposite":"","synonyms":""},{"def":"a person or company that supports somebody by paying for their training or education","examples":["Each student's tuition was paid by an individual sponsor.","Unless he can find a sponsor he’ll be forced to retire from athletics."],"opposite":"","synonyms":""},{"def":"a person, a group, an organization, etc. that provides money for an activity","examples":["the list of state sponsors of terrorism"],"opposite":"","synonyms":""},{"def":"a person who introduces and supports a proposal for a new law, etc.","examples":["the sponsor of the new immigration bill"],"opposite":"","synonyms":""},{"def":"a person who agrees to be officially responsible for another person","examples":[],"opposite":"","synonyms":""},{"def":"a person who presents a child for Christian baptism or confirmation","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]