[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/spo/sport/sport__us_1.mp3","phonsUS":"/spɔːrt/","level":"A1","meanings":[{"def":"activity that you do for pleasure and that needs physical effort or skill, usually done in a special area and according to fixed rules","examples":["There are excellent facilities for sport and recreation.","I'm not interested in sport.","It's very difficult to make a career in professional sport.","(British English) Do you do any sport?","(North American English) Do you play any sports?","the use of drugs in sport","Australians love sport.","He enjoys sport, reading and travelling.","His only hobby is watching sport on TV.","He's a sporting icon even for people who don't like sport.","Playing competitive sport helped me develop as a person.","There are a lot of job opportunities in the sport and leisure industry.","She has a real passion for sport.","We encourage the children to get involved in sport.","a campaign to promote sports among women","(British English) He does a lot of sport.","Did you do any sport at school?","(North American English) We played sports together when we were kids.","Did you play any sports in high school?","Sports coverage in the local newspaper is good.","government funding for sports programmes for girls and women","The council has allocated an extra £11 million to a new community sports club.","sports betting on the internet","the construction of a new $250-million sports arena","the school sports day","sports shoes"],"opposite":"","synonyms":""},{"def":"a particular form of sport","examples":["What's your favourite sport?","Netball is the number one team sport played by women in England.","I need to take up a sport to get fit.","Why not learn to paint or play a sport?","In the 1960s, the Soviet Union dominated the sport of gymnastics.","In theory, basketball is a non-contact sport.","After a serious knee injury the player was advised to quit the sport.","We started a bodybuilding magazine to promote the sport.","popular field sports such as football","the sport of boxing","Football has been a professional sport for a long time.","Taekwondo became an official Olympic sport at the 2000 Sydney Games.","Many dancers also take part in a competitive sport such as volleyball.","Two of the most popular sports among the boys are basketball and Thai boxing.","Outdoor sports enthusiasts, such as climbers and skiers, often use handheld GPS devices.","In winter we prefer an indoor sport like squash or badminton.","She claimed fox-hunting continues even though the sport has been banned.","the inherent dangers of adventure sports such as mountaineering","Which is the country's most popular spectator sport?","skiing, skating and other winter sports"],"opposite":"","synonyms":""},{"def":"used as a friendly way of addressing somebody, especially a man","examples":["How are you doing, sport?","Good on you, sport!"],"opposite":"","synonyms":""},{"def":"pleasure or fun","examples":["in sport The comments were only made in sport.","to make sport of (= to joke about) somebody/something"],"opposite":"","synonyms":""},{"def":"a plant or an animal that is clearly and definitely different from its usual type","examples":[],"opposite":"","synonyms":""},{"def":"to be unpleasant or unhelpful, especially in a difficult situation or when you have lost a game","examples":[],"opposite":"","synonyms":""},{"def":"to be generous, cheerful and pleasant, especially in a difficult situation or when you have lost a game","examples":["She's a good sport.","Go on, be a sport (= used when asking somebody to help you)."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be a bad sport","def":"to be unpleasant or unhelpful, especially in a difficult situation or when you have lost a game","examples":[]},{"idiom":"be a (good) sport","def":"to be generous, cheerful and pleasant, especially in a difficult situation or when you have lost a game","examples":["She's a good sport.","Go on, be a sport (= used when asking somebody to help you)."]}],"phrasal":[],"related":["e-sport","blood sport","sport coat","contact sport","extreme sport","spectator sport","Daily Sport","non-contact sport","Sunday Sport","sport utility vehicle","Question of Sport","Department for Digital, Culture, Media and Sport","sport car","sport coats","sport shirt","sport jacket","sport jackets"]},{"pos":"verb","level":"","meanings":[{"def":"to have or wear something in a proud way","examples":["to sport a beard","She was sporting a T-shirt with the company's logo on it."],"opposite":"","synonyms":""},{"def":"to play in a happy and lively way","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]