[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/spo/spot_/spot__us_1.mp3","phonsUS":"/spɑːt/","level":"B1","meanings":[{"def":"a small round area that has a different colour or feels different from the surface it is on","examples":["Which has spots, the leopard or the tiger?","The male bird has a red spot on its beak.","(British English) She was wearing a black skirt with white spots.","a white dog with a black patch on its head","patches of dense fog","The letters ‘i’ and ‘j’ have dots over them.","The island is a small green dot on the map.","The horse had a white mark on its head.","Which has spots, a leopard or a tiger?"],"opposite":"","synonyms":"patch"},{"def":"a small mark or lump on a person’s skin, sometimes with a yellow head to it","examples":["The baby's whole body was covered in small red spots.","He had a large spot on his nose.","The aim of acne treatments is to shorten the length of time someone has spots.","(British English) teenagers worried about their spots","The children all had measles, and had broken out in spots.","enlarged pores and spots on the skin"],"opposite":"","synonyms":""},{"def":"a small dirty mark on something","examples":["His jacket was covered with spots of mud.","rust spots","There were grease spots all over the walls.","The kids left dirty marks all over the kitchen floor.","blood stains","Her fingerprints were all over the gun.","She had streaks of grey in her hair.","There isn’t a speck of dust anywhere in the house.","There were grease spots all over the walls."],"opposite":"","synonyms":"mark"},{"def":"a particular area or place","examples":["a quiet/secluded/lonely spot","This is a favourite spot for walkers and climbers.","I won't drive around for 20 minutes looking for a parking spot.","He was exhausted and just wanted to find a spot to sleep.","The bay has become a popular spot for young international travellers.","He showed me the exact spot where he had asked her to marry him.","a tourist spot","She placed the ball on the penalty spot and waited for the whistle.","This would be a good place for a picnic.","They’ve chosen a site for the new school.","the hotel reception area","Move the cursor to a blank area on the screen.","From his position at the top of the hill, he could see the harbour.","the point at which the river divides","The company is moving to a new location.","the scene of the accident","The lake is one of the local beauty spots.","He stood rooted to the spot, unable to move.","It's a beautiful spot to relax and enjoy the peaceful surroundings.","On your map, X marks the spot where the race begins.","She pointed to a spot on the map.","Take the time to find the right spot to pitch your tent.","a favourite spot for picnickers","There are miles of footpaths and plenty of secluded spots.","He pointed to a spot in the western sky.","They picked a good spot for a picnic.","I was sitting in my usual spot."],"opposite":"","synonyms":"place"},{"def":"a small feature or part of somebody/something with a particular quality","examples":["He usually wears a hat to hide his bald spot.","(figurative) She knew her weak spot where Steve was concerned.","(figurative) From her angry reply it was obvious that I had touched a sensitive spot."],"opposite":"","synonyms":""},{"def":"a small amount of something","examples":["He's in a spot of trouble.","Would you like a spot of lunch?","She’s gone out to do a spot of shopping.","We got into a spot of bother with the police."],"opposite":"","synonyms":""},{"def":"a small amount of a liquid","examples":["I felt a few spots of rain.","There was a spot of rain in the afternoon, but otherwise the weather has been perfect."],"opposite":"","synonyms":""},{"def":"a part of a television, radio, club or theatre show that is given to a particular person or type of entertainment","examples":["a guest/solo spot"],"opposite":"","synonyms":""},{"def":"a position in a competition, event or team","examples":["two teams battling for (the) top spot","She has earned a spot on the national team.","Glamorgan claimed the top spot in the League.","The Korean team secured two qualifying spots for the Olympic Games.","That leaves one roster spot, and the team will need a versatile player to fill it.","The album quickly reached the number-one spot in the charts."],"opposite":"","synonyms":""},{"def":"a spotlight (= a light with a single, very bright beam that can be directed at a particular place or person, especially a performer on the stage)","examples":[],"opposite":"","synonyms":""},{"def":"a good or pleasant part of something that is unpleasant or bad in all other ways","examples":["The win last week was the only bright spot in their last ten games.","The birth of my son was the one bright spot in a terrible year."],"opposite":"","synonyms":""},{"def":"not able to move, for example because you are frightened or surprised","examples":["I stood rooted to the spot with terror."],"opposite":"","synonyms":""},{"def":"to like somebody/something","examples":["She's always had a soft spot for you."],"opposite":"","synonyms":""},{"def":"if something hits the spot it does exactly what it should do","examples":[],"opposite":"","synonyms":""},{"def":"in a difficult situation","examples":["She’ll always help you if you’re in a spot.","This could put the banks in a tight spot.","The captain's knee injury leaves the team in a tight corner."],"opposite":"","synonyms":""},{"def":"to be very much better than somebody/something","examples":["She knocks spots off all the other candidates."],"opposite":"","synonyms":""},{"def":"people cannot change their character, especially if they have a bad character","examples":["You didn’t really expect her to be on time, did you? A leopard can’t change its spots."],"opposite":"","synonyms":""},{"def":"immediately","examples":["He answered the question on the spot.","an on-the-spot parking fine"],"opposite":"","synonyms":""},{"def":"at the actual place where something is happening","examples":["An ambulance was on the spot within minutes.","an on-the-spot report"],"opposite":"","synonyms":""},{"def":"in one exact place, without moving in any direction","examples":["Running on the spot is good exercise."],"opposite":"","synonyms":""},{"def":"to make somebody feel uncomfortable or embarrassed by asking them a difficult question","examples":["The interviewer's questions really put him on the spot."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a/the bright spot","def":"a good or pleasant part of something that is unpleasant or bad in all other ways","examples":["The win last week was the only bright spot in their last ten games.","The birth of my son was the one bright spot in a terrible year."]},{"idiom":"glued/riveted/rooted to the spot","def":"not able to move, for example because you are frightened or surprised","examples":["I stood rooted to the spot with terror."]},{"idiom":"have a soft spot for somebody/something","def":"to like somebody/something","examples":["She's always had a soft spot for you."]},{"idiom":"hit the spot","def":"if something hits the spot it does exactly what it should do","examples":[]},{"idiom":"in a (tight) spot/corner","def":"in a difficult situation","examples":["She’ll always help you if you’re in a spot.","This could put the banks in a tight spot.","The captain's knee injury leaves the team in a tight corner."]},{"idiom":"knock spots off somebody/something","def":"to be very much better than somebody/something","examples":["She knocks spots off all the other candidates."]},{"idiom":"a leopard cannot change its spots","def":"people cannot change their character, especially if they have a bad character","examples":["You didn’t really expect her to be on time, did you? A leopard can’t change its spots."]},{"idiom":"on the spot","def":"immediately","examples":["He answered the question on the spot.","an on-the-spot parking fine","An ambulance was on the spot within minutes.","an on-the-spot report","Running on the spot is good exercise."]},{"idiom":"put somebody on the spot","def":"to make somebody feel uncomfortable or embarrassed by asking them a difficult question","examples":["The interviewer's questions really put him on the spot."]}],"phrasal":[],"related":["G spot","spot on","high spot","spot kick","beauty spot","black spot","blind spot","liver spot","spot check","spot-fixing","sweet spot","penalty spot","trouble spot","hot spot"]},{"pos":"verb","level":"B2","meanings":[{"def":"to see or notice a person or thing, especially suddenly or when it is not easy to do so","examples":["spot somebody/something Can you spot the difference between these two pictures?","She's always quick to spot an opportunity.","Teachers, GPs, and other professionals are trained to spot signs of abuse.","He was only seven years old when someone first spotted his talent.","Her modelling career began when she was spotted at the age of 14.","Spotting the disease early can save lives.","I finally spotted my friend in the crowd.","I've just spotted a mistake on the front cover.","spot somebody/something doing something Neighbours spotted smoke coming out of the house.","spot that… No one spotted that the gun was a fake.","spot what, where, etc… I soon spotted what the mistake was.","She looked for him but couldn’t see him in the crowd.","He could see (that) she had been crying.","I’ve just spotted a mistake on the front cover.","She caught sight of a car in the distance.","He caught a glimpse of himself in the mirror.","He’d glimpsed her through the window as he passed.","‘There's a parking space over there.’ ‘Well spotted!’","Can you spot the difference between the two?","Most of these fossils are too small to be easily spotted.","The birds should be easy enough to spot.","The company spotted an opportunity to expand."],"opposite":"","synonyms":"see"},{"def":"to give your opponent or the other team an advantage","examples":["We spotted the opposing team two goals."],"opposite":"","synonyms":""},{"def":"to be covered with small round marks of something","examples":["His shirt was spotted with oil."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be spotted with something","def":"to be covered with small round marks of something","examples":["His shirt was spotted with oil."]}],"phrasal":[],"related":[]},{"pos":"adjective","level":"","meanings":[{"def":"connected with a system of buying and selling things where goods are delivered and paid for immediately after sale","examples":["spot prices"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]