[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/spo/spotl/spotlight__us_1.mp3","phonsUS":"/ˈspɑːtlaɪt/","level":"C1","meanings":[{"def":"a light with a single, very bright beam that can be directed at a particular place or person, especially a performer on the stage","examples":["The room was lit by spotlights.","When the stage is dimmed, spotlights are used to create a tight arc of light.","It was hot under the spotlights.","They shone the spotlight on a woman at the back of the audience."],"opposite":"","synonyms":""},{"def":"the area of light that is made by a spotlight","examples":["in the spotlight She stood alone on stage in the spotlight.","He stepped into the spotlight to the wild applause of the crowd."],"opposite":"","synonyms":""},{"def":"attention from newspapers, television and the public","examples":["in the spotlight Unemployment is once again in the spotlight.","under the spotlight The issue will come under the spotlight when parliament reassembles.","The report has turned the spotlight on the startling rise in street crime.","She was happy to share the spotlight with her sister.","He accused her of hogging the spotlight.","He will want to keep the spotlight on the divisions within the party.","She was suddenly thrust into the political spotlight.","The President has never been one to shun the spotlight.","The affair is now out of the spotlight.","The captain had to share the spotlight with the new young star.","The quality of food in the shops is back in the spotlight.","These revelations threw a spotlight on the shakiness of the economy.","This issue will come under the spotlight at tomorrow's meeting."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to shine a spotlight on somebody/something","examples":["a spotlit stage"],"opposite":"","synonyms":""},{"def":"to give special attention to a problem, situation, etc. so that people notice it","examples":["The programme spotlights financial problems in the health service."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]