[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/spr/sprea/spread__us_1.mp3","phonsUS":"/spred/","level":"B1","meanings":[{"def":"to affect or make something affect, be known by, or be used by more and more people","examples":["The news had spread and was causing great excitement.","+ adv./prep. Use of computers spread rapidly during that period.","Within weeks, his confidence had spread throughout the team.","The disease spreads easily.","The idea spread quickly in the years that followed.","spread something Someone's been spreading rumours about you.","He's using his rap music to spread the message that violence is wrong.","The disease is spread by mosquitoes.","The virus is primarily spread from person to person through coughing and sneezing.","The depression started in the US and spread quickly throughout the world.","His fame had spread far and wide.","The disease can be spread by contact.","I wish he would stop spreading lies about me.","The effects of this policy spread far beyond children now at school."],"opposite":"","synonyms":""},{"def":"to cover, or to make something cover, a larger and larger area","examples":["There is no evidence that the cancer has spread.","+ adv./prep. The fire rapidly spread to adjoining buildings.","Water began to spread across the floor.","A smile spread slowly across her face.","Allow plenty of space for this plant as its roots spread widely.","spread something A strong wind spread the flames.","Using too much water could spread the stain."],"opposite":"","synonyms":""},{"def":"to cause somebody/something to be in a number of different places","examples":["Seeds and pollen are spread by the wind.","We have 10 000 members spread all over the country.","Expertise in this field is very thinly spread across the country.","Friends may be spread geographically. Neighbours, by definition, are nearby."],"opposite":"","synonyms":""},{"def":"to cover a large area","examples":["The valley spread out beneath us."],"opposite":"","synonyms":""},{"def":"to put a layer of a substance onto the surface of something; to be able to be put onto a surface","examples":["spread something They spread manure in both spring and autumn.","spread (A on/over B) to spread butter on pieces of toast","Birds spread the oil over their feathers to keep them warm and dry.","spread (B with A) pieces of toast spread with butter","If the paint is too thick, it will not spread evenly.","He spread jam on the toast.","Spread each slice generously with butter.","If the paint is too thick, it will not spread easily.","She spread butter on a piece of toast.","Spread the cake with cream and then sprinkle flakes of chocolate on top."],"opposite":"","synonyms":""},{"def":"to open something that has been folded so that it covers a larger area than before","examples":["spread something (out) The bird spread its wings.","a bird with its wings spread wide","spread something (out) on/over something They spread a cloth on the table.","Sue spread the map out on the floor.","We spread the rug out on the floor.","He spread the blanket over the straw and went to sleep.","spread something + adj. He had a newspaper spread open on his knee."],"opposite":"","synonyms":""},{"def":"to arrange objects so that they cover a large area and can be seen easily","examples":["spread something out on/over something Papers had been spread out on the desk.","spread something out She spread out photographs of her grandchildren so I could see how they'd grown.","He was studying the various pages of notes spread over the quilt.","He shuffled the cards and spread them in a fan."],"opposite":"","synonyms":""},{"def":"to place the thumb and a finger of one hand on the screen of an electronic device such as a mobile phone or small computer and move them apart to make the image on the screen larger, as though it is closer","examples":["Re-size the text by using the pinch and spread gestures on the screen."],"opposite":"","synonyms":""},{"def":"to move your arms, legs, fingers, etc. far apart from each other","examples":["She spread her arms and the child ran towards her."],"opposite":"","synonyms":""},{"def":"to separate something into parts and divide them between different times or different people","examples":["spread something Why not pay monthly and spread the cost of your car insurance?","spread something (out) (over something) A series of five interviews will be spread over two days.","The course takes forty hours, spread over twenty weeks.","spread something between somebody/something We attempted to spread the workload between the departments.","We tried to spread the workload evenly between the departments."],"opposite":"","synonyms":""},{"def":"to become known by more and more people very quickly","examples":["Rumours of his death spread like wildfire.","The news spread like wildfire."],"opposite":"","synonyms":""},{"def":"to consider a wide range of possibilities or cover a large area, especially to try to find somebody/something","examples":["They have spread their net far and wide in the search for a new team coach."],"opposite":"","synonyms":""},{"def":"to become more independent and confident and try new activities, etc.","examples":["Going to college gave her the chance to spread her wings."],"opposite":"","synonyms":""},{"def":"to tell people about something","examples":["I'm always trying to spread the word about healthy eating."],"opposite":"","synonyms":""},{"def":"to try to do so many different things at the same time that you do not do any of them well","examples":["With four markets to manage, there's a danger that's she's spreading herself too thin."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"spread like wildfire","def":"to become known by more and more people very quickly","examples":["Rumours of his death spread like wildfire.","The news spread like wildfire."]},{"idiom":"spread your net","def":"to consider a wide range of possibilities or cover a large area, especially to try to find somebody/something","examples":["They have spread their net far and wide in the search for a new team coach."]},{"idiom":"spread your wings","def":"to become more independent and confident and try new activities, etc.","examples":["Going to college gave her the chance to spread her wings."]},{"idiom":"spread the word","def":"to tell people about something","examples":["I'm always trying to spread the word about healthy eating."]},{"idiom":"spread yourself too thin","def":"to try to do so many different things at the same time that you do not do any of them well","examples":["With four markets to manage, there's a danger that's she's spreading herself too thin."]}],"phrasal":["spread out","spread yourself out"],"related":["spread bet","spread out","centre spread","community spread","spread betting","middle-age spread","spread yourself out","center spread","middle-aged spread","spread out | spread yourself out","spread your net"]},{"pos":"noun","level":"B2","meanings":[{"def":"an increase in the amount or number of something that there is, or in the area that is affected by something","examples":["measures to halt the spread of the disease","to prevent/stop the spread of something","One disadvantage is the company's lack of geographical spread.","The treaty has proved rather effective at limiting the spread of nuclear weapons.","The aim is to encourage the spread of information about the condition.","Shut doors to delay the spread of fire.","the spread of a city into the surrounding areas","Such unhygienic conditions encourage the spread of disease."],"opposite":"","synonyms":""},{"def":"a range or variety of things or people","examples":["a broad spread of opinions","There was a good spread of scores on the test.","Try to have a broad spread of investments, rather than concentrating on one industry.","The questionnaire revealed a wide spread of opinions on the issues."],"opposite":"","synonyms":""},{"def":"a soft food that you put on bread","examples":["Use a low-fat spread instead of butter.","They offered me some crackers with cheese spread."],"opposite":"","synonyms":""},{"def":"the area that something exists in or happens in","examples":["The company has a good geographical spread of hotels in this country.","The current survey will have a wider geographical spread."],"opposite":"","synonyms":""},{"def":"how wide something is or the area that something covers","examples":["The bird's wings have a spread of nearly a metre."],"opposite":"","synonyms":""},{"def":"an article or advertisement in a newspaper or magazine, especially one that covers two opposite pages","examples":["The story continued with a double-page spread on the inside pages.","Her work featured in a two-page spread in ‘New Woman’ magazine."],"opposite":"","synonyms":""},{"def":"a large meal, especially one that is prepared for a special occasion","examples":["They had laid on a huge spread for the party."],"opposite":"","synonyms":""},{"def":"an area of land or water","examples":["a vast spread of water","They have a huge spread in California (= a large farm or ranch)."],"opposite":"","synonyms":""},{"def":"the difference between two rates or prices","examples":[],"opposite":"","synonyms":""},{"def":"an attractive cover put on top of all the sheets and covers on a bed","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]