[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/squ/squee/squeeze__us_1.mp3","phonsUS":"/skwiːz/","level":"C1","meanings":[{"def":"to press something, especially with your fingers","examples":["to squeeze a tube of toothpaste","to squeeze the trigger of a gun (= to fire it)","He squeezed her hand and smiled at her.","Just take hold of the tube and squeeze.","‘I know,’ she said, squeezing his hand gently.","I squeezed the last bit of toothpaste out of the tube.","By squeezing the bulb you will be pumping air into the jar.","He slowly squeezed the trigger.","She squeezed on the reins and the cart came to a halt."],"opposite":"","synonyms":""},{"def":"to get liquid out of something by pressing or twisting it hard","examples":["squeeze something out of/from something to squeeze the juice from a lemon","(figurative) She felt as if every drop of emotion had been squeezed from her.","Squeeze the juice of half a lemon over each fish.","squeeze something (out) He took off his wet clothes and squeezed the water out.","freshly squeezed orange juice","squeeze something + adj. Soak the cloth in warm water and then squeeze it dry."],"opposite":"","synonyms":""},{"def":"to force somebody/something/yourself into or through a small space","examples":["squeeze somebody/something into, through, etc. something We managed to squeeze six people into the car.","It's a pretty town, squeezed between the mountains and the ocean.","(figurative) We managed to squeeze a lot into a week (= we did a lot of different things).","His legs were squeezed together.","squeeze into, through, etc. something to squeeze into a tight dress","Can we squeeze into that parking space?","to squeeze through a gap in the hedge","They were able to squeeze through a gap in the fence.","squeeze through, in, past, etc. If you move forward a little, I can squeeze past."],"opposite":"","synonyms":""},{"def":"to get something by putting pressure on somebody, threatening them, etc.","examples":["He's squeezing me for £500."],"opposite":"","synonyms":""},{"def":"to strictly limit or reduce the amount of money that somebody/something has or can use","examples":["High interest rates have squeezed the industry hard."],"opposite":"","synonyms":""},{"def":"to get as much money, information, etc. out of somebody as you can","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"squeeze somebody dry","def":"to get as much money, information, etc. out of somebody as you can","examples":[]}],"phrasal":["squeeze from","squeeze in","squeeze out","squeeze out of","squeeze up"],"related":["squeeze box","squeeze in","squeeze out","squeeze up","squeeze from","squeeze out of","suicide squeeze","squeeze boxes","squeeze something from somebody","squeeze somebody/something","squeeze something out of somebody","squeeze somebody dry","squeeze up (against somebody/something) | squeeze somebody","put the squeeze on somebody (to do something)"]},{"pos":"noun","level":"","meanings":[{"def":"an act of pressing something, usually with your hands","examples":["He gave my hand a little squeeze.","Give the tube another squeeze.","He gave her hand a gentle squeeze.","He gave his mother a comforting squeeze as he left."],"opposite":"","synonyms":""},{"def":"a small amount of liquid that is produced by pressing something","examples":["a squeeze of lemon juice"],"opposite":"","synonyms":""},{"def":"a situation where it is almost impossible for a number of people or things to fit into a small or limited space","examples":["It was a tight squeeze but we finally got everything into the case.","Seven people in the car was a bit of a squeeze.","at a squeeze We can get six in the car at a squeeze."],"opposite":"","synonyms":""},{"def":"a reduction in the amount of money, jobs, etc. available; a difficult situation caused by this","examples":["We're really feeling the squeeze since I lost my job.","squeeze on something a squeeze on profits","a credit squeeze","All manufacturers are feeling the squeeze.","Hospitals have been in a squeeze for some time.","a squeeze on spending"],"opposite":"","synonyms":""},{"def":"a boyfriend or girlfriend","examples":["Who's his main squeeze?"],"opposite":"","synonyms":""},{"def":"to put pressure on somebody to act in a particular way; to make a situation difficult for somebody","examples":["You come straight to me if she tries to put the squeeze on you.","Increased competition is really putting the squeeze on North American producers.","The government is trying to put the squeeze on high earners."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"put the squeeze on somebody (to do something)","def":"to put pressure on somebody to act in a particular way; to make a situation difficult for somebody","examples":["You come straight to me if she tries to put the squeeze on you.","Increased competition is really putting the squeeze on North American producers.","The government is trying to put the squeeze on high earners."]}],"phrasal":[],"related":[]}]