[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sta/staff/staff__us_1.mp3","phonsUS":"/stæf/","level":"B1","meanings":[{"def":"all the workers employed in an organization considered as a group","examples":["medical/nursing/teaching/coaching staff","The hospital staff cared for me so well.","There are 12 full-time researchers plus technicians and other support staff.","female staff members","(British English) part-time members of staff","to employ/recruit/hire/train staff","He joined the editorial staff in 2018.","We are suffering from an IT staff shortage.","The company has a good reputation for staff training.","We have a weekly staff meeting.","(especially British English) on the staff a reporter on the staff of ‘The Times’","a staff of ten","I have ten staff working for me","The staff in this shop are very helpful.","a staff of ten","ten staff","The staff in this store is very helpful","the senator and his staff (singular)","senators and their staffs (plural)","Robbie Keane has joined the coaching staff.","Junior medical staff take samples for blood grouping.","The school has 1 300 plus students and just over 100 teaching staff.","A spokesperson said that the bank expects to make 15  000 staff redundant over the next three years.","There was a meeting of senior staff at the Home Office.","The event was organized by staff from several museum departments.","(British English) The bar staff are all young and cool-looking.","(North American English) The bar staff is very professional.","(British English) A member of staff asked us to leave.","Office staff arrived to find there had been a break-in.","Some orchestras have had to cut the number of players and administrative staff.","Highly trained staff have been laid off.","They employ a staff of 40 researchers.","They have difficulty recruiting and retaining staff.","She has the power to hire and fire staff.","Properly training staff is vital to the success of a small business.","Universities were asked to report on research activity among academic staff.","Companies who treat their employees right have lower staff turnover.","Staff morale is very low.","We had lunch in the staff canteen.","He's a staff writer (= employed on a regular salary, not paid by the piece) for The New Yorker.","a staff position at ‘Life’ magazine","She's a staff scientist at the Research Institute.","(North American English) He's a staff attorney for the Federal Trade Commission.","I've heard they're recruiting staff at the moment.","She has been on the staff of the hospital for most of her working life.","Some companies are struggling to retain skilled staff.","Specialist training is necessary for staff carrying out this work.","The company has a staff of fifty.","The hospital is freezing staff appointments as part of its cutbacks.","The staff are working under pressure.","(British English) There are only four full-time members of staff in the company.","There is separate staff accommodation for the housekeeper.","They pay their staff by cheque.","a staff person for a government agency","a staff report by the House Foreign Affairs Committee","staff appointed to the project","the campaign staff of President Bush","the medical staff who treated him during his confinement","I have ten staff working for me.","I tend not to eat in the staff restaurant.","The store is closed for staff development.","Three staff members were suspended after the incident."],"opposite":"","synonyms":""},{"def":"the people who work at a school, college or university, but who do not teach students","examples":["Students, faculty and staff were all men in those days."],"opposite":"","synonyms":""},{"def":"a group of senior army officers who help a commanding officer","examples":["a staff officer"],"opposite":"","synonyms":""},{"def":"a long stick used as a support when walking or climbing, as a weapon, or as a symbol of authority","examples":[],"opposite":"","synonyms":""},{"def":"a set of five lines on which music is written","examples":[],"opposite":"","synonyms":""},{"def":"a basic food, especially bread","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the staff of life","def":"a basic food, especially bread","examples":[]}],"phrasal":[],"related":["half-staff","staff nurse","general staff","ground staff","staff officer","staff writer","chief of staff","staff sergeant","Chief of Naval Staff","Chief of the Air Staff","Joint Chiefs of Staff","Chief of the Defence Staff","staff nurses","staff writers","staff officers","staff sergeants"]},{"pos":"verb","level":"","meanings":[{"def":"to work in an institution, a company, etc.; to provide people to work there","examples":["The advice centre is staffed entirely by volunteers.","The charity provided money to staff and equip two hospitals.","a fully staffed department"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]