[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sta/stage/stage__us_1.mp3","phonsUS":"/steɪdʒ/","level":"A2","meanings":[{"def":"a period or state that something/somebody passes through while developing or making progress","examples":["at… stage I can't make a decision at this stage.","At one stage it looked as though they would win.","The product is at the design stage.","in… stage This technology is still in its early stages.","A new version is in the final stages of testing.","stage in something She's reached a crucial stage in her career.","stage of something The children are at various stages of development.","stage of doing something All babies go through a stage of not wanting to leave their mother.","The completion of the film coincided with the closing stages of the war.","They cut corners at every stage of the process.","The project is now at the halfway stage.","She met him at a crucial stage in her life.","a woman in the late stages of pregnancy","I'm at a stage in my career where I want to build up experience.","Have we reached a stage where the business is too big to be allowed to fail?","The courts are a last resort and I hope matters will be resolved before we reach that stage.","By this stage you really should know what you're doing.","At this stage of the game anything could happen.","The technology is still very much in the developmental stage.","The announcement marks the latest stage in an ongoing investigation.","We may be able to do something about this at a later stage.","The bill is currently going through its final stages before becoming law.","You need to consider all costs from the planning stage right through to final production.","At this stage of the proceedings it's too early to predict the outcome.","Her husband was in the advanced stages of cancer.","This adaptation represented an important stage in human evolution.","He seemed like a throwback to an earlier stage of human evolution.","You should read this article at some stage.","a young entertainer at the formative stages of his career","an important stage in her life","the different life stages of insects and fish","All flies pass through four life stages: egg, larva, pupa and adult.","the latter stages of the race","The tension was high in the closing stages of the debate.","We've entered a crucial stage in the project.","People tend to work hard at this stage of life."],"opposite":"","synonyms":""},{"def":"a separate part that a process, etc. is divided into","examples":["We did the first stage of the trip by train.","in stages The pay increase will be introduced in stages (= not all at once).","All the recipes are broken down into easy stages.","We can take the argument one stage further.","This diagram illustrates the process of paper-making./This diagram shows how paper is made.","First/First of all, logs are delivered to a paper mill, where the bark is removed and the wood is cut into small chips.","Next/Second, the wood chips are pulped, either using chemicals or in a pulping machine.","Pulping breaks down the internal structure of the wood and enables/allows the natural oils to be removed.","Once/After the wood has been pulped, the pulp is bleached in order to remove impurities. /…is bleached so that impurities can be removed.","The next stage is to feed the pulp into the paper machine, where it is mixed with water and then poured onto a wire conveyor belt.","As the pulp travels along the conveyor belt, the water drains away. This causes the solid material to sink to the bottom, forming a layer of paper.","At this point the new paper is still wet, so it is passed between large heated rollers, which press out the remaining water and simultaneously dry the paper/…dry the paper at the same time.","The final stage is to wind the paper onto large rolls./Finally, the paper is wound onto large rolls.","The police are building up a picture of the incident stage by stage.","The water goes through three stages of purification.","Stage one was cleaning the walls and floors and washing the windows.","The final stage of the winemaking cycle takes place in the bottling plant.","We will complete the journey in stages.","We renovated the house in two stages.","a process that by stages led to the Cold War","The process has three distinct stages.","The project is still at the planning stage.","The book guides you through making your own website in easy stages.","take the investigation one stage further","The university was put together by stages.","She is learning a new vocal technique by stages.","Pupils are tested at the end of each stage of the course.","Colombia's win sent them through to the knockout stage of the tournament.","She got through to stage two of the competition.","Are you ready for the next stage?"],"opposite":"","synonyms":""},{"def":"a raised area, usually in a theatre, etc. where actors, dancers, etc. perform","examples":["on stage There were more than 50 people on stage in one scene.","off stage Half the band walked off stage.","onto the stage The audience threw flowers onto the stage.","The main character then takes the stage (= comes onto it).","Rose exits stage left (= to the left hand side of the stage).","She came off stage to great applause.","She walked across the stage to take her seat at the press conference.","There is huge excitement as the band enters the stage.","When he was on stage he became another person.","A fan jumped up onto the stage.","A group of tables were converted into a makeshift stage.","A trumpet sounded off stage.","Rihanna returned to the concert stage last week.","He once shared a stage with Frank Sinatra.","He was too nervous to go on stage.","I was shaking as I took the stage.","The singer stalks around the stage in a tight white jumpsuit.","A bright yellow light shines above the stage.","Images flash up on the vast screen behind the stage.","She left the stage to tumultuous applause.","She was booed off the stage.","The entire cast is on stage in the final scene.","The vocalist stands in a spotlight at centre stage.","He walks to the front of the stage and addresses the audience.","Rudolf is stage right with his back to the audience.","The stage direction reads 'Enter stage left'.","They played the main stage at Glastonbury.","The stage set is the most expensive ever built.","The only stage props are a chair and small table."],"opposite":"","synonyms":""},{"def":"the theatre and the world of acting as a form of entertainment","examples":["The screenplay was originally written for the stage.","on the stage His parents didn't want him to go on the stage (= to be an actor).","She was a popular star of stage and screen (= theatre and cinema/movies).","a stage play/musical/show","She is one of the finest actors ever to grace the stage.","She took to the stage when she was at university.","He became a star as soon as he bounded onto the New York stage.","After making several hit movies she returned to the stage.","This haunting fairy tale has been brought to the stage by Polly Beale.","I love 'Hamlet' and never tire of seeing it on stage or film.","In its journey from stage to screen the story has undergone some changes.","She has written for stage, TV and film.","She made her stage debut at the age of four.","She was known for her powerful stage presence.","There was a huge difference between the real man and his stage persona.","He has been in some films, but is best known as a stage actor.","Stravinsky's last stage work","He wrote the music for his own stage adaptation of A Clockwork Orange.","the stage version of ‘The Lion King’"],"opposite":"","synonyms":""},{"def":"an area of activity where important things happen, especially in politics","examples":["She was forced to the centre of the political stage.","The country is now a major player on the world stage.","Germany is playing a leading role on the international stage."],"opposite":"","synonyms":""},{"def":"a stagecoach (= a large carriage pulled by horses that was used in the past to carry passengers, and often mail, along a regular route)","examples":[],"opposite":"","synonyms":""},{"def":"to make it possible for something to happen; to make something likely to happen","examples":["Family problems in childhood can set the stage for stress in adult life.","The thrilling semi-finals set the stage for what should be a great game."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"set the stage for something","def":"to make it possible for something to happen; to make something likely to happen","examples":["Family problems in childhood can set the stage for stress in adult life.","The thrilling semi-finals set the stage for what should be a great game."]}],"phrasal":[],"related":["end-stage","sound stage","stage door","stage left","stage name","stage right","centre stage","landing stage","report stage","stage fright","stage-manage","stage manager","stage-struck","stage whisper","committee stage","stage direction","English Stage Company","apron stage"]},{"pos":"verb","level":"B2","meanings":[{"def":"to organize and present a play or an event for people to see","examples":["to stage a play/an event/an exhibition","The local theatre group is staging a production of ‘Hamlet’.","Birmingham has bid to stage the next national athletics championships.","They're staging an exhibition in the church hall.","The museum staged a highly controversial show called 'Sensation'.","Dublin's bid to stage the 2012 Olympics was unsuccessful.","Several countries are bidding to stage the tournament.","The festival is being staged across several venues in August.","The university drama club began a tradition of staging Shakespeare outside.","San Francisco Ballet is planning to stage Balanchine's 'Square Dance' this year.","In 2015 he choreographed and staged the US premiere of the opera.","The action scenes are all well staged.","The event was very carefully staged.","an elaborately staged drama","It's the most imaginatively staged play I've ever seen.","The show is a brilliantly staged adaptation of a novel by Mark Staff.","A retrospective of his work was staged at the Venice Biennale.","The opera was staged at the New National Theater.","The concert staged in memory of the tragedy was shown on TV."],"opposite":"","synonyms":""},{"def":"to organize and take part in action that needs careful planning, especially as a public protest","examples":["to stage a protest/demonstration/rally","to stage a sit-in/strike/walkout","Generals staged a coup in 1964, beginning 21 years of military dictatorship.","Farmers staged a peaceful protest outside the ministry.","Activists staged a noisy rally outside the court building.","Hundreds of students stormed the building to stage a sit-in, and were arrested.","A large peace demonstration was staged in the capital.","Protests against GMOs have been staged throughout the world.","They were charged with staging an illegal march.","Twenty thousand textile workers staged a walkout.","Transport unions staged a one-day strike.","Protesters occupied the building and staged a hunger strike.","Militants staged a surprise raid on the base.","Police then staged a massive raid on gay clubs, arresting almost 400 people.","Rebels have staged suicide bombings and other attacks.","Insurgents staged an ambush."],"opposite":"","synonyms":""},{"def":"to make something happen","examples":["The dollar staged a recovery earlier today.","After five years in retirement, he staged a comeback to international tennis."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]