[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sta/stall/stall__us_1.mp3","phonsUS":"/stɔːl/","level":"B2","meanings":[{"def":"a table or small shop with an open front that people sell things from, especially at a market","examples":["He works on a market stall in the Square.","They have a fish stall on the market.","Drinks were being sold from makeshift stalls at the side of the road.","He has a flower stall in the market.","I bought this trout at the market fish stall.","Who's going to man the stall at lunchtime?","a stall selling second-hand books","the man behind the stall","They have a flower stall at the market."],"opposite":"","synonyms":""},{"def":"a section inside a farm building that is large enough for one animal to be kept in","examples":["We had to muck out stalls and groom the horses."],"opposite":"","synonyms":""},{"def":"a small area in a room, surrounded by glass, walls, etc., that contains a shower or toilet","examples":["a bathroom stall"],"opposite":"","synonyms":""},{"def":"the seats that are nearest to the stage in a theatre","examples":["the front row of the stalls"],"opposite":"","synonyms":""},{"def":"the seats at the front of a church where the choir (= singers) and priests sit","examples":[],"opposite":"","synonyms":""},{"def":"a situation in which a vehicle’s engine suddenly stops because it is not getting enough power","examples":[],"opposite":"","synonyms":""},{"def":"a situation in which an aircraft loses speed and goes steeply downwards","examples":["The plane went into a stall."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to stop suddenly because of a lack of power or speed; to make a vehicle or an engine do this","examples":["The car stalled and refused to start again.","I kept stalling.","stall something I stalled the car three times during my driving test."],"opposite":"","synonyms":""},{"def":"to try to avoid doing something or answering a question so that you have more time","examples":["They are still stalling on the deal.","‘What do you mean?’ she asked, stalling for time.","The opposition party was angered by the Prime Minister’s stalling tactics.","He asked them all kinds of pointless questions, stalling for time."],"opposite":"","synonyms":""},{"def":"to make somebody wait so that you have more time to do something","examples":["See if you can stall her while I finish searching her office."],"opposite":"","synonyms":""},{"def":"to stop something from happening until a later date; to stop making progress","examples":["There have been several attempts to revive the stalled peace plan.","Discussions have once again stalled.","Discussions were effectively stalled by the union's refusal to participate.","The peace process is currently stalled.","They could stall the process further by asking for a judicial review."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]