[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sta/stamp/stamp__us_1.mp3","phonsUS":"/stæmp/","level":"A2","meanings":[{"def":"a small piece of paper with a design on it that you buy and stick on an envelope or a package before you post it","examples":["a 67p stamp","Could I have three first-class stamps, please?","He has been collecting stamps since he was eight.","a stamp album","The Post Office has issued a commemorative stamp to mark the event.","Don't forget to put a stamp on.","She stuck a first-class stamp on the letter.","The Post Office has launched some new Christmas stamps.","The stamps were issued in 1863.","a book of ten first-class stamps"],"opposite":"","synonyms":""},{"def":"a tool for printing the date or a design or mark onto a surface","examples":["a date stamp"],"opposite":"","synonyms":""},{"def":"a design or words made by stamping something onto a surface","examples":["The passports, with the visa stamps, were waiting at the embassy.","(figurative) The project has the government's stamp of approval."],"opposite":"","synonyms":""},{"def":"a small piece of paper with a design on it, stuck on a document to show that a particular amount of money has been paid","examples":["a TV licence stamp"],"opposite":"","synonyms":""},{"def":"the mark or sign of a particular quality or person","examples":["All his work bears the stamp of authority.","President Reagan left an indelible stamp on the nation.","She left her stamp on the school.","His work bears the unmistakable stamp of genius.","He has a new chance to put his stamp on policy."],"opposite":"","synonyms":""},{"def":"a kind or class, especially of people","examples":["men of a different stamp"],"opposite":"","synonyms":""},{"def":"an act or sound of stamping the foot","examples":["The stamp of hoofs alerted Isabel."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["stamp on","stamp out","food stamp","stamp duty","postage stamp","rubber stamp","rubber-stamp","Stamp Act","stamp collecting","stamp collector","stamp duties","stamp collectors","stamp on something","stamp something","stamp something on something"]},{"pos":"verb","level":"","meanings":[{"def":"to put your foot down heavily and noisily on the ground","examples":["I tried stamping my feet to keep warm.","Sam stamped his foot in anger.","He stamped the snow off his boots.","The audience were stamping and cheering.","She stamped her foot impatiently."],"opposite":"","synonyms":""},{"def":"to walk with loud heavy steps","examples":["She turned and stamped out of the room.","The children came stamping down the stairs.","We watched our mother stamp away down the drive.","Lizzie turned and stamped noisily out of the room.","He stamped from the room.","He stamped off in disgust."],"opposite":"","synonyms":""},{"def":"to print letters, words, a design, etc. onto something using a special tool","examples":["stamp A (with B) The box was stamped with the maker's name.","Wait here to have your passport stamped.","stamp B on A I'll stamp the company name on your cheque.","The maker's name was stamped in gold on the box.","Approved goods were stamped with a hallmark.","(figurative) This is an album with ‘epic’ stamped all over it."],"opposite":"","synonyms":""},{"def":"to make a feeling show clearly on somebody’s face, in their actions, etc.","examples":["stamp A with B Their faces were stamped with hostility.","stamp B over, across, etc. A The crime had revenge stamped all over it.","Terror was stamped across her face."],"opposite":"","synonyms":""},{"def":"to show that somebody has a particular quality","examples":["Her success has stamped her as one of the country's top riders."],"opposite":"","synonyms":""},{"def":"to stick a stamp on a letter or package","examples":[],"opposite":"","synonyms":""},{"def":"to cut and shape an object from a piece of metal or plastic using a special machine or tool","examples":["The hinges are stamped out of sheets of metal."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["stamp on","stamp out"],"related":[]}]