[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sta/stand/stand__us_1.mp3","phonsUS":"/stænd/","level":"A1","meanings":[{"def":"to be on your feet; to be in a vertical position","examples":["She was too weak to stand.","+ adv./prep. a bird standing on one leg","Don't just stand there—do something!","I was standing only a few feet away.","We all stood around in the corridor waiting.","to stand on your head/hands (= to be upside down, balancing on your head/hands)","+ adj. Stand still while I take your photo.","stand doing something We stood talking for a few minutes.","People stood waiting for a bus in the rain.","After the earthquake, only a few houses were left standing.","He felt so weak he could hardly stand.","The man stood with his arms folded.","She stands with her back to the camera.","We stood side by side.","The painting shows a figure standing on a river bank.","People are shown standing or sitting in various poses.","Please remain standing until the judge takes her seat.","He stood stiffly in the middle of the room.","That's me standing in the middle on the back row.","She came and stood next to me.","You have to stand outside to smoke.","She stood silently staring at the screen.","She stood shyly in the corner, sipping her drink.","people standing in line at the supermarket","Soldiers stood guarding the gates.","They stood facing each other.","As they stood watching, the building began to burn.","He stood awkwardly in the doorway, not sure what to say.","Her parents stood proudly at her side.","I stood there staring at him.","She stood on tiptoe to reach the shelf.","She stood rooted to the spot, too afraid to move or speak.","The roof was so low I could not stand upright.","He stood and looked out to sea.","He was standing on a chair, trying to change a light bulb.","She stood by the window, gazing out.","Stand still when I'm talking to you!","She walks confidently, standing tall.","He stood naked in front of the mirror.","The kids were standing around chatting.","There were several people standing at the counter.","He grew up at 17 Leopold Strasse, where the house still stands.","It was one of the few trees standing after the forest fire.","They fought until only one man was left standing.","These majestic trees have stood for hundreds of years.","The wind damaged some of the crop so that it's no longer standing.","Only a short portion of the fence is still standing.","Most of the castle walls and both the towers still stand."],"opposite":"","synonyms":""},{"def":"to get up onto your feet from another position","examples":["Everyone stood when the president came in.","stand up We stood up in order to get a better view.","I tried to stand up and found myself in agony.","She was too weak to stand.","Stand still when I’m talking to you!","Please don’t get up!","Stand up straight!","Everyone would stand up when the teacher entered the classroom.","Would you all rise, please, to welcome our visiting speaker.","I helped her to get to her feet.","I’ve been on my feet all day.","She stood and walked out of the room.","He stood up to shake my hand.","The crowd stood and cheered.","Stand up so we can see you.","We have to stand up when the headteacher comes into the room.","The man slowly stood and started walking towards us.","When he stands up I see that he's over six feet tall.","Christine suddenly stood up and said, 'I have to go.'","She finished eating, stood and pushed her chair back."],"opposite":"","synonyms":"stand"},{"def":"to put something/somebody in a vertical position somewhere","examples":["Stand the ladder up against the wall.","I stood the little girl on a chair so that she could see."],"opposite":"","synonyms":""},{"def":"used especially in negative sentences and questions to emphasize that you do not like somebody/something","examples":["stand somebody/something I can't stand his brother.","I can't stand the sight of blood.","I can't stand it when you do that.","stand doing something She couldn't stand being kept waiting.","stand to do something She couldn't stand to be kept waiting.","stand somebody/something doing something I can't stand people interrupting all the time.","How do you stand him being here all the time?","I can’t stand his brother.","She couldn’t stand being kept waiting.","He despised himself for being so cowardly.","I can’t bear having cats in the house.","They loathe each other.","They absolutely detest each other.","I can't stand that man!","I can't stand bland food.","One thing she can't stand is whining.","Even with people I really can't stand, I try to be polite.","You need to at least know if you can stand a person before you go travelling with them.","Her friends can stand me, but they don't really love me.","She couldn't stand the thought of being stuck with him all evening.","Get out—I can't stand the sight of you!","Get out—I can't stand to look at you!","How can you stand it here?","The two of them can barely stand each other.","I used to love that album, though I can hardly stand it now.","I just can't stand them talking about work non-stop.","I can't stand it when he looks at me like that.","She can't stand it when people are rude.","I can't stand to listen to this garbage.","I can't stand him looking at me like that."],"opposite":"","synonyms":"hate"},{"def":"used especially with can/could or will to say that somebody/something can survive something or can tolerate something without being hurt or damaged","examples":["stand something His heart won't stand the strain much longer.","Modern plastics can stand very high and very low temperatures.","stand doing something It can stand being dropped from a great height without breaking.","stand somebody doing something Can you stand me touching your hand or is it too sore?","stand to do something I can't stand to see him suffer any more.","He could stand the pain no more.","How could she have stood such treatment for so long?","Unable to stand the suspense, she opened the envelope.","At last, unable to stand it any longer, she screamed at them to shut up.","I'm not sure if the bookcase can stand any more weight.","There is a limit to how much stress the crop will stand.","I don't know how you can stand the heat.","I gave up because I couldn't stand the pressure.","The audience can stand about an hour before it starts to get restless.","The grief of losing a child is more than anyone can stand.","I couldn't stand the thought of never seeing him again.","It was so bad, I couldn't stand to watch.","I can't stand to touch it without flinching.","It smells so bad that no-one can stand to come near it.","She could barely stand to hear his name spoken without crying.","She could barely stand hearing his name spoken without crying.","They were unable to stand their father being treated with such disrespect.","It will stand being heated to high temperatures."],"opposite":"","synonyms":""},{"def":"to be in a particular place","examples":["The castle stands on the site of an ancient battlefield.","An old oak tree once stood here.","Books stood in piles in the corner.","He points up to where a ruined building stands, surrounded by bare trees.","The two buildings stand back-to-back.","The stone manor house stands halfway up a hill.","There was a farm down the lane from where our house stood.","A mature sycamore tree stands at the bottom of the garden.","Here and there, dark trees stand.","The monument stood in the middle of an artificial lake.","A grandfather clock stands in the hall.","There was a gaping hole where the tower once stood.","The hotel stood about 65 metres above sea level on the cliff."],"opposite":"","synonyms":""},{"def":"to be in a particular condition or situation","examples":["+ adj. The house stood empty for a long time.","'You're wrong about the date—it was 2008.’ ‘I stand corrected (= accept that I was wrong).'","You stand accused of a terrible crime.","You never know where you stand with her—one minute she's friendly, the next she'll hardly speak to you.","As things stand, there is little chance of a quick settlement of the dispute.","We stand ready to help if you ever need it.","The machines stand idle because there is no one to operate them.","The property stood vacant for about six years.","His reputation deserves to stand higher than it does.","Make sure you know where you stand before you commit to anything.","I'd rather he was honest with me, then at least I'd know where I stand.","Where do we stand? Are we going to be allowed to continue?","Give me a call tomorrow and let me know how things stand then.","As it stands (= in the current situation), there are two main sides to the debate.","As it currently stands, takeovers by foreign companies need the approval of this committee.","In the real world, as things currently stand, this rarely happens."],"opposite":"","synonyms":""},{"def":"to be a candidate in an election","examples":["stand for something He stood for election in Colchester.","He stood for parliament (= tried to get elected as an MP).","stand as something She stood unsuccessfully as a candidate in the local elections.","Her friends persuaded her to stand.","I have decided not to stand again.","There are more than a dozen candidates standing.","The company will make all its directors stand for re-election next year.","Members of the Civil Service cannot stand for political office.","He stood unsuccessfully for the party leadership.","I'm standing for class president.","He is standing for Oxford East in the election.","She decided to stand as an independent.","He was barred from standing as an MP.","She stood as a Liberal in the June elections.","He stood unsuccessfully as Mayor of New York.","Two candidates will be standing against her."],"opposite":"","synonyms":""},{"def":"to be a particular height","examples":["The tower stands 30 metres high."],"opposite":"","synonyms":""},{"def":"to be at a particular level, amount, height, etc.","examples":["Interest rates stand at 3 per cent.","The world record then stood at 6.59 metres."],"opposite":"","synonyms":""},{"def":"to be in a particular place, especially while waiting to go somewhere","examples":["The train standing at platform 3 is for London, Victoria."],"opposite":"","synonyms":""},{"def":"to remain still, without moving or being moved","examples":["Mix the batter and let it stand for twenty minutes.","standing pools of rainwater"],"opposite":"","synonyms":""},{"def":"if an offer, a decision, etc. made earlier stands, it is still available or relevant or still exists","examples":["My offer still stands.","The world record stood for 20 years."],"opposite":"","synonyms":""},{"def":"to be in a situation where you are likely to do something","examples":["You stand to make a lot from this deal.","Who stands to benefit the most?","to stand to gain/lose something"],"opposite":"","synonyms":""},{"def":"to have a particular attitude or opinion about something or towards somebody","examples":["Where do you stand on private education?"],"opposite":"","synonyms":""},{"def":"to buy a drink or meal for somebody","examples":["stand something He stood drinks all round.","stand somebody something She was kind enough to stand us a meal."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["stand apart from","stand aside","stand back","stand between and","stand by","stand down","stand for","stand in","stand out","stand over","stand up","stand up for","stand up to"],"related":["stand-up","stand by","stand in","stand-in","stand-to","stand up","bus stand","stand for","stand-off","stand out","coat stand","music stand","news stand","stand-alone","stand aside","stand back","stand down"]},{"pos":"noun","level":"B2","meanings":[{"def":"an attitude towards something or an opinion that you make clear to people","examples":["He has avoided taking a firm stand.","stand on something The judge takes a tough stand on corruption.","stand against something I admire their principled stand against the war.","Newspaper reporters are free to take a stand on political issues.","The test questions ask students to take a stand on a given issue and support their position through information learned in the course.","The administration took no stand on the issue during the debate.","The artist asks questions in her work but does not take any clear stand.","He reiterated the stand he took immediately after the attacks of September 11.","I welcome his decision to resign, which totally vindicates my stand on this matter.","The President shows no sign of softening his stand.","I do not believe voters share his hypocritical stand on gay rights.","The country hardened its stand over cross-border ties.","I have reconsidered my stand on wearing fur as a fashion accessory.","We call on the government to clarify its stand."],"opposite":"","synonyms":""},{"def":"a strong effort to defend yourself or your opinion about something","examples":["They are willing to take a stand and defend what they believe in.","stand against something We must make a stand against job losses.","the rebels’ desperate last stand","to make a stand against industries that contribute to river pollution","The art industry is making a stand against companies which reproduce an artist's work without legal permission.","Now is the time to take a stand.","He never made any real stand on the question of regional independence.","I support him in his courageous stand against mass profiling and incarceration.","He was an icon of hope for the poor due to his courageous stand for justice.","People are saying that I took a brave stand, but I just did what I thought was right.","This scientist took a lonely stand against the status quo.","We need to take a tough stand on tax avoidance.","In the film, a group of survivors in a post-apocalyptic world makes a last stand against evil.","A pressure group about to be disbanded after almost half a century of campaigns is to make one last stand."],"opposite":"","synonyms":""},{"def":"a table or structure that goods are sold from, especially in the street or at a market","examples":["a lemonade/hot dog/newspaper stand","She sells fruit from a roadside stand.","The magazine sold out as soon as it hit the stands (= went on sale).","We need someone to man the food stand for a few hours.","My parents had a vegetable and fruit stand in the market.","We passed a stand selling ice cream.","She runs a stand making hot Mexican food in the market.","The magazine will hit the stands in April.","I think this is the best fashion magazine on the stands right now.","We can get a local paper at the newspaper stand.","A crowd lined up outside her newspaper stand.","When I was a kid, I had a lemonade stand.","We can grab something to eat from the stand on the corner.","They were in line for the hot dog stand.","Route 66 is lined with hamburger stands.","There is a tea stand, but no hot food.","Barry was at the food stand buying sodas.","There are a couple of refreshment stands.","Melons are piled high on the fruit stand."],"opposite":"","synonyms":""},{"def":"a table or a vertical structure where things are displayed or advertised, for example at an exhibition","examples":["a display/an exhibition stand","Oxford University Press’s stand at the book fair","I'll be on the stand for two hours.","Our company has a display stand at this year's fair.","The students set up their display stands and were interviewed by a panel of judges.","The large variety of exhibits on the stand was wonderful.","We took it in turns to man the exhibition stand.","You'll find brochures of our new products on the stand.","On the Ford stand, we noticed a new 150 bhp diesel engine.","They were at the convention with a stand promoting British cheese.","We are looking to set up stands at farmers' markets to spread the message of sustainable farming.","I picked my way through the hundreds of stands and exhibits.","Anyone who would like to have a stall or promotional stand at the festival can contact Michelle Clary."],"opposite":"","synonyms":""},{"def":"a piece of equipment or furniture that you use for holding a particular type of thing","examples":["a bicycle/microphone/cake stand"],"opposite":"","synonyms":""},{"def":"a large sloping structure at a stadium with rows where people sit or stand to watch the game","examples":["We had seats in the east stand."],"opposite":"","synonyms":""},{"def":"the place in court where people stand to give evidence","examples":["He took the stand as the first witness."],"opposite":"","synonyms":""},{"def":"the period of time in which two people who are batting (= hitting the ball) play together and score points","examples":["Clinch and Harris shared an opening stand of 69."],"opposite":"","synonyms":""},{"def":"a place where taxis, buses, etc. park while they are waiting for passengers","examples":[],"opposite":"","synonyms":""},{"def":"a group of plants or trees of one kind","examples":["a stand of pines"],"opposite":"","synonyms":""},{"def":"a piece of land that you can buy and use for building a house, etc. on","examples":["A developer bought the land and divided it into stands."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]