[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sta/start/start__us_1.mp3","phonsUS":"/stɑːrt/","level":"A1","meanings":[{"def":"to begin doing or using something","examples":["start (something) I start work at nine.","He's just started a new job.","The kids start school next week.","I only started (= began to read) this book yesterday.","We need to start (= begin using) a new jar of coffee.","It's a long story. Where shall I start?","Can you start (= a new job) on Monday?","start to do something It started to rain.","I was starting to feel tired.","Mistakes were starting to creep in.","start doing something She started laughing.","Suddenly things started happening.","start on something It's time you started on your homework.","start by doing something Let's start by reviewing what we did last week.","If you want to find out more, this website is a good place to start.","Do you mind if I sit here?","Hello, is this seat taken?","May I join you? Can I get you a coffee?","Lovely weather we’re having!/Can you believe this rain/​wind/​cold/​sunshine?","Excuse me, could I ask you a question?","Shall we make a start? I think it's almost three o'clock.","Shall we get started? I'd like to introduce our speaker.","I think everyone's here, so I'd like to welcome you to this conference.","What time does the concert start/​begin?","She started/​began working here three months ago.","The story begins on the island of Corfu.","We’ll need to start at 7.00.","Who do you think started the fire?","The car won’t start.","I didn’t start worrying/​to worry until she was 2 hours late.","It’s starting/​beginning to rain.","It’s starting/​beginning raining.","By early evening he was ready to start work.","She started work in the mill when she was just 14 years old.","When we started this project, we didn't know what to expect.","At that point I just started to hate the man.","The garden is starting to look very bare.","I'm starting to think I should move somewhere else.","She started to wonder whether she was imagining it all.","Her heart suddenly started to race.","He started to get angry.","He started getting angry.","The girl next to me started to talk to me.","The girl next to me started talking to me.","People have started saying that they don't want to use social media any more.","Things were very different when I started working here 17 years ago.","I need to start getting ready.","It's time to start thinking about next year.","Maybe you should start looking for a new job.","When did you start playing the piano?","You'd better start packing if you're to leave early tomorrow morning.","We'll just have to start all over again.","I've finished decorating the bathroom, so now I can start on the bedroom.","He finished all his own food and started on mine.","He has just started at school.","I don't know where to start with all this work.","Start from the beginning and tell me exactly what happened.","I'll have to start again from scratch.","We start by examining the evidence.","Start by preparing the planting area.","If you want to learn about frogs, this book is an excellent place to start."],"opposite":"","synonyms":""},{"def":"to begin happening; to make something begin happening","examples":["Work is due to start this weekend.","What time does the show start?","Have you any idea where the rumour started?","start something Who started the fire?","I'm ready to start the process of writing.","Do you start the day with a good breakfast?","You're always trying to start an argument.","start somebody/something doing something The news started me thinking.","When does the class start?","When does the concert begin?","The discussion started off mildly enough.","Tom will kick off with a few comments.","The festival kicks off on Monday, September 13.","The meeting is scheduled to commence at noon.","The story opens with a murder.","A new term was about to start.","When does the class start?","The new season starts on Monday.","Her career in the civil service started in 1998.","The fire is thought to have started in the kitchen.","After the war started, many people tried to leave.","It's a great opportunity to start a new career.","These producers start their planting season a week or two earlier than normal.","They started a war that wasn't justified.","Before you start the game, you choose a character to play as.","Who started the fight?","It's his fault. He started it.","A campaign was started for his release.","Our goal is to start a conversation with our customers.","Birmingham Royal Ballet start the new season with an intriguing triple bill next week.","We want to start people talking about issues that matter to them in their community.","It was Liz that started me listening to classical music."],"opposite":"","synonyms":"start"},{"def":"when you start a machine or a vehicle or it starts, it begins to operate","examples":["Start the engines!","He started the recording.","I can't get the car started.","The car won't start.","He walked over to his truck, got in and started the engine.","Pushing the ignition button starts the engine.","Dan started the lawn mower again.","Start the tape.","I couldn't get the car to start.","Her voice was drowned out when the car started.","There was a delay because the motor wouldn't start.","The blender won't start unless the lid is closed properly."],"opposite":"","synonyms":""},{"def":"to begin to exist; to make something begin to exist","examples":["The company started in 1894 in Pennsylvania.","start up There are a lot of small businesses starting up in that area.","start something She started a business while she was still at school.","I decided to start a fashion blog.","They want to start a family (= to have children).","start something up He decided to start up his own film festival.","They decided to start a catering business.","She started the company in the 1990s.","She started a yoga class at work.","Maria started a Spanish conversation class in the village hall.","I made several attempts to start my own clothing company.","If you're passionate about a hobby, why not start your own blog?","When we started the band we never expected this.","This was a club started by music fans, for music fans.","They are offering incentives for new businesses to start up in the area.","There are a lot of costs when you're just starting up.","Some people have great ideas but start up without having a clear idea of how viable their businesses are.","He started up his own chain of hotels.","We started up this website as a way for people to make contact with fellow enthusiasts.","What made you decide to start the business up?"],"opposite":"","synonyms":""},{"def":"to begin from a particular place, amount or situation; to begin in a particular way","examples":["+ adv./prep. The trail starts just outside the town.","Hotel prices start at €80 for a double room.","A sentence always starts with a capital letter.","The evening started badly when the speaker failed to turn up.","+ adj. The best professional musicians start young.","The 109-mile bike race starts and finishes at the end of Market Street.","The river starts in northwest Arkansas.","Let's start with this first piece of music.","The walk starts from the carpark on Nimmings Lane.","He could not remember exactly where the taxi ride started.","Your tour starts at the Cathedral.","Players start in the centre of the board and move outwards.","The prints are not expensive, starting at $35.","We start from the premise that every child matters.","We are starting from a difficult position because we have very little information.","I started with the idea that I wanted to write about family.","It often helps to start with a simple question.","The story starts in the mid 1960s in a small English town.","The show starts with a bang and maintains the excitement throughout.","The film starts well, but halfway through the story starts to drag.","The team started strongly but faded in the second half.","It's better to start slowly and learn as you go.","She started relatively late as an artist.","James started small with $5,000 in contracts.","I start simple, with just a geometric shape.","He started full of confidence, but something went wrong."],"opposite":"","synonyms":""},{"def":"to begin, or to begin something such as a career, in a particular way that changed later","examples":["start as something She started as a secretary but ended up running the department.","It started as a hobby and grew from there.","start out/off The company started out with 30 employees.","start out/off as something I started off as a dishwasher making 25 cents an hour.","start something (as something) He started life as a teacher before turning to journalism.","start something doing something She started her career working for the BBC.","I started as a trainee and ended up a supervisor.","It started as a joke, but we soon realized people were taking it seriously.","The World Wide Web started as a way for scientists and academics to share information.","The film started as an experiment to see if I could do something new.","I started out washing cars at the golf club.","It's probably best to start out renting equipment.","We started off with just a few product lines.","He started work as a butcher's boy and now has his own shop.","I started my working life as a studio photographer.","The magazine started life as a comic book in 1952.","The building started life as a prison but was converted to a luxury hotel."],"opposite":"","synonyms":""},{"def":"to begin a journey; to leave","examples":["What time are we starting tomorrow?","She had started out late for the meeting.","They had started out from Saigon the previous day.","I should get there by the afternoon if I start early.","Make sure you've got everything before we start.","They started out at five o'clock in the morning.","What time do we start?"],"opposite":"","synonyms":""},{"def":"to begin to move in a particular direction","examples":["I started after her (= began to follow her) to tell her the news.","He started for the door, but I blocked his way."],"opposite":"","synonyms":""},{"def":"to move suddenly and quickly because you are surprised or afraid","examples":["The sudden noise made her start."],"opposite":"","synonyms":""},{"def":"used to tell somebody not to complain or be critical","examples":["Don't start! I told you I'd be late.","Don't you start! It's hard enough managing the kids, without you complaining too."],"opposite":"","synonyms":""},{"def":"to make something start happening; to make sure that something continues to happen","examples":[],"opposite":"","synonyms":""},{"def":"to start a relationship well/badly","examples":["I seem to have got off on the wrong foot with the new boss."],"opposite":"","synonyms":""},{"def":"to begin doing something","examples":["It's nearly ten o'clock. Let's get started.","It's already late, so I think we should get started."],"opposite":"","synonyms":""},{"def":"to start a relationship well/badly","examples":["I seem to have started off on the wrong foot with the new boss."],"opposite":"","synonyms":""},{"def":"to cause trouble","examples":[],"opposite":"","synonyms":""},{"def":"used when you are giving the first and most important reason for something","examples":["To start with it’s much too expensive…"],"opposite":"","synonyms":""},{"def":"at the beginning","examples":["The club had only six members to start with.","I'll have melon to start with.","She wasn't keen on the idea to start with."],"opposite":"","synonyms":""},{"def":"used to blame somebody for beginning a fight or an argument","examples":["‘Stop fighting, you two!’ ‘He started it!’"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"don’t start | don't you start","def":"used to tell somebody not to complain or be critical","examples":["Don't start! I told you I'd be late.","Don't you start! It's hard enough managing the kids, without you complaining too."]},{"idiom":"get/set/start/keep the ball rolling","def":"to make something start happening; to make sure that something continues to happen","examples":[]},{"idiom":"get/start off on the right/wrong foot (with somebody)","def":"to start a relationship well/badly","examples":["I seem to have got off on the wrong foot with the new boss."]},{"idiom":"get started","def":"to begin doing something","examples":["It's nearly ten o'clock. Let's get started.","It's already late, so I think we should get started."]},{"idiom":"start/get off on the right/wrong foot (with somebody)","def":"to start a relationship well/badly","examples":["I seem to have started off on the wrong foot with the new boss."]},{"idiom":"start something","def":"to cause trouble","examples":[]},{"idiom":"to start with","def":"used when you are giving the first and most important reason for something","examples":["To start with it’s much too expensive…","The club had only six members to start with.","I'll have melon to start with.","She wasn't keen on the idea to start with."]},{"idiom":"you, he, she, etc. started it","def":"used to blame somebody for beginning a fight or an argument","examples":["‘Stop fighting, you two!’ ‘He started it!’"]}],"phrasal":["start back","start off","start on","start on about","start on at","start out","start over","start up"],"related":["START","start-up","start on","start up","start off","start out","false start","head start","jump-start","kick-start","push-start","start back","start over","flying start","running start","start on at"]},{"pos":"noun","level":"A2","meanings":[{"def":"the point at which something begins","examples":["If we don't hurry, we'll miss the start.","They haven't won since the start of the season.","at the start (of something) Things didn't look too hopeful at the start of the year.","from the start We've had problems right from the start.","We've had problems from the very start.","The trip was a disaster from start to finish.","a… start to something a perfect start to the day","After a slow start to his career, things improved.","The campaign is off to a promising start.","a shaky/rocky start","(informal) This could be the start of something big.","They lived here before the start of the war.","Temperatures were cooler at the start of the week.","We make an estimate at the start and revise it later.","How many more weeks until the start of term?","She makes a brief appearance near the start of the film.","Next week sees the start of the trial of four suspects in the bombing.","September marks the start of Berlin's annual art festival.","A rooster crows, symbolically signaling the start of the day.","These environmental changes could herald the start of a new Ice Age.","The start was delayed by bad weather.","After a shaky start, it went on to become a hit show.","The plot gets off to a rather slow start.","Things got off to a bad start when I forgot to bring the lunch.","I forgot his name, which wasn't a good start.","Despite a bright start, Liverpool lost the match.","Despite a promising start, we lost the game.","This is a thoroughly good book from start to finish.","At the very start of the movie we are told that his mother is dead.","From the very start of the campaign he stressed its inclusive nature.","Right from the start I knew this was a bad idea.","She felt at home in her new job right from the start.","Everyone was in a conciliatory mood at the start of the meeting.","He joined the team prior to the start of the season.","The company got off to an impressive start this year.","Higher sales were predicted after a promising start to the year.","An obvious typo on page one makes a bad start to the book.","The team made a great comeback after a disastrous start to the tournament.","The fine winter weather heralded a good start to the year.","The project was doomed from the start."],"opposite":"","synonyms":""},{"def":"the act or process of beginning something","examples":["We need to get an early start in the morning.","start on something I'll paint the ceiling if you make a start on the walls.","She's moving abroad to make a fresh start (= to begin a new life).","I think it's time we made a start.","It's not much, but it's a start (= something useful has been done, although there is a lot more still to do).","Unless I make a start, I'll never write this book.","Let's make a start.","Just pick the most urgent task and make a start on it now.","There's a long way to go, but he's made a very encouraging start.","This will make a start on paying off the mortgage.","The authorities are making a start in dealing with the scourge of illegal drugs.","He wanted to go to England and make a new start for his family.","It's a time for new beginnings, for fresh starts.","An early start is important if you want to avoid the traffic.","I hope we can get a good start to the game and play really well.","New housing starts (= the number of new housing projects) slowed at the end of the year."],"opposite":"","synonyms":""},{"def":"the opportunity that you are given to begin something in a successful way","examples":["Many critics got their start writing for this magazine.","Moving to a different school gave Sally a fresh start.","start in something They worked hard to give their children a good start in life.","The job gave him his start in journalism.","The Amato Theater is a place where opera performers get their start.","The modern fair trade movement got its start in Europe.","The DJ got his start as a teenaged janitor at Capitol Records.","He got his start in the music business in the early 1990s.","How did you get your start in politics?","I feel for young people coming out of college and trying to get a start in the world.","We aim to give every child the best start possible.","This was a way for me to give these guys a good start in the business.","She gave me my start as a performer.","That was my start as a professional athlete.","The children have overcome their difficult start in life.","He didn't have the easiest of starts, but he has done incredibly well."],"opposite":"","synonyms":""},{"def":"the place where a race begins","examples":["The runners lined up at the start.","The runners walked up to the start line."],"opposite":"","synonyms":""},{"def":"an amount of time or distance that somebody has as an advantage over other people at the beginning of a race","examples":["I gave the younger children a start.","start on somebody She went into the second round with a five-minute start on the rest of the cyclists."],"opposite":"","synonyms":""},{"def":"a race or competition that somebody has taken part in","examples":["She has been beaten only once in six starts."],"opposite":"","synonyms":""},{"def":"an act of moving your body quickly and suddenly because you are surprised, afraid, etc.","examples":["You gave me quite a start!","with a start She woke from the dream with a start."],"opposite":"","synonyms":""},{"def":"frequently starting and stopping again; not continuously","examples":["Because of other commitments I can only write my book in fits and starts."],"opposite":"","synonyms":""},{"def":"used to emphasize the first of a list of reasons, opinions, etc.","examples":["I'm not working there—for a start, it's too far to travel."],"opposite":"","synonyms":""},{"def":"from an initial position in which none of the necessary elements are in place","examples":["The space project went from a standing start to the moon in ten years."],"opposite":"","synonyms":""},{"def":"to make a very good start; to begin something well","examples":["She’s got off to a flying start in her new career."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"by/in fits and starts | in stops and starts","def":"frequently starting and stopping again; not continuously","examples":["Because of other commitments I can only write my book in fits and starts."]},{"idiom":"for a start","def":"used to emphasize the first of a list of reasons, opinions, etc.","examples":["I'm not working there—for a start, it's too far to travel."]},{"idiom":"from a standing start","def":"from an initial position in which none of the necessary elements are in place","examples":["The space project went from a standing start to the moon in ten years."]},{"idiom":"get off to a flying start | get off to a flyer","def":"to make a very good start; to begin something well","examples":["She’s got off to a flying start in her new career."]}],"phrasal":[],"related":[]},{"pos":"","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sta/start/start_1_us_1.mp3","level":"","meanings":[{"def":"Strategic Arms Reduction Talks","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]