[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sta/stare/stare__us_1.mp3","phonsUS":"/ster/","level":"B2","meanings":[{"def":"to look at somebody/something for a long time","examples":["I screamed and everyone stared.","stare at somebody/something I stared blankly at the paper in front of me.","stare up/down at somebody/something They stared up at the hole in the ceiling.","He sat staring into space (= looking at nothing).","I was staring into her beautiful blue eyes.","She looked at them with dark staring eyes.","I screamed and everyone stared.","We all gazed at Marco in amazement.","I looked at her and she glared stonily back.","Everyone in the room turned to stare at her.","For a long moment they just stared at each other.","They were staring intently at a computer screen.","He'd wait there all day, staring out the window.","He just stared at her with disbelief.","He stared at me bleakly and said nothing.","He stared straight ahead and did not move.","He was still staring at himself in the mirror.","His party was staring into the abyss.","I could see a man staring at me intently.","I sat staring at the ruins of the building.","I stared at him open-mouthed, unable to speak.","I stared in horror at his bloody mouth.","It was too cold to stand and stare.","She could only stare at him with pain in her eyes.","She stalked off, leaving them all staring after her.","She stared at him stonily as he came in.","She stared back at him.","She stared blankly at the brick wall in front of her.","She was just sitting there, staring into space.","He sat for hours just staring into space.","Peter stared in disbelief at the message on the screen.","The builder stared up at the crack in the ceiling with a thoughtful expression.","The passengers stared wide-eyed as the hijacker took out a grenade."],"opposite":"","synonyms":"stare"},{"def":"used to describe something that you have failed to see, even though it was obvious and should have been easy to see","examples":["The answer was staring us in the face but we never saw it until it was too late."],"opposite":"","synonyms":""},{"def":"to be certain to happen","examples":["Defeat was staring them in the face."],"opposite":"","synonyms":""},{"def":"to be unable to avoid something","examples":["They were staring defeat in the face."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be staring somebody in the face","def":"used to describe something that you have failed to see, even though it was obvious and should have been easy to see","examples":["The answer was staring us in the face but we never saw it until it was too late.","Defeat was staring them in the face."]},{"idiom":"be staring something in the face","def":"to be unable to avoid something","examples":["They were staring defeat in the face."]}],"phrasal":["stare out"],"related":["stare out","stare somebody down","stare somebody out","look/stare/gaze into space","fix somebody with a look, stare, gaze, etc."]},{"pos":"noun","level":"","meanings":[{"def":"an act of looking at somebody/something for a long time, especially in a way that is unfriendly or that shows surprise","examples":["She gave him a blank stare.","He fixed the interviewer with a penetrating stare.","Here, have a look at this.","She stole a glance at her watch.","She felt embarrassed under his steady gaze.","She gave the officer a blank stare and shrugged her shoulders.","He caught a glimpse of her in the crowd.","She fixed her questioner with a hostile glare."],"opposite":"","synonyms":"look"}],"idioms":[],"phrasal":[],"related":[]}]