[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sta/star_/star__us_1.mp3","phonsUS":"/stɑːr/","level":"A1","meanings":[{"def":"a large ball of burning gas in space that we see as a point of light in the sky at night","examples":["There was a big moon and hundreds of stars were shining overhead.","Sirius is the brightest star in the sky.","under the stars We camped out under the stars.","They lay down under a canopy of stars.","a dense cluster of stars at the galaxy's nucleus"],"opposite":"","synonyms":""},{"def":"an object, a decoration, a mark, etc., usually with five or six points, whose shape represents a star","examples":["a horse with a white star on its forehead","a sheriff’s star","I've put a star by the names of the girls in the class.","Liz deserves a gold star for all her hard work.","a four-star general"],"opposite":"","synonyms":""},{"def":"a mark that represents a star and tells you how good something is, especially a hotel or restaurant","examples":["three-/four-/five-star hotels","What star rating does this restaurant have?"],"opposite":"","synonyms":""},{"def":"a famous and excellent singer, performer, sports player, etc.","examples":["pop/rock/Hollywood/TV stars","a football/tennis/sports star","She acts well but she hasn't got star quality.","Get used to her face as she is a rising star.","She's a former child star.","He's so good—I'm sure he'll be a big star.","The best models receive star treatment.","I wanted to be a pop star when I was a teenager.","veteran stars of stage and screen","the Hollywood star system","Channel 4 has lined up a galaxy of stars for the coming season.","That was the movie that made him a star.","There were several big Hollywood stars at the function.","The film was nothing more than a star vehicle for Tom Hanks.","The movie didn't have enough star power.","She is one of the brightest stars of her generation."],"opposite":"","synonyms":""},{"def":"a person who has the main part, or one of the main parts, in a film, play, etc.","examples":["The star of the show was a young Italian singer.","The show has plenty of guest stars appearing each week.","She was the star of many popular television series.","He was the star turn at the celebrations.","Jackie got the star part in the school play."],"opposite":"","synonyms":""},{"def":"a person or thing that is the best of a group","examples":["a star student","Paula is the star of the class.","He was the star performer at the championships.","The star prize is a weekend for two in Paris.","The monkey was the star attraction (= the best or most popular act) at the show.","Through high school he was a track star."],"opposite":"","synonyms":""},{"def":"used to show that you feel very grateful for something that somebody has done or that you think they are wonderful","examples":["Thanks! You're a star!"],"opposite":"","synonyms":""},{"def":"a description of what somebody thinks is going to happen to somebody in the future, based on the position of the stars and planets when they were born","examples":["Do you read your stars in the paper?"],"opposite":"","synonyms":""},{"def":"to try to be successful at something that is difficult","examples":[],"opposite":"","synonyms":""},{"def":"to see flashes of light in front of your eyes, usually because you have been hit on the head","examples":[],"opposite":"","synonyms":""},{"def":"if somebody has stars in their eyes, they have dreams of becoming famous, especially as an actor, singer, etc.","examples":[],"opposite":"","synonyms":""},{"def":"to feel very grateful and lucky about something","examples":["Just thank your lucky stars you weren’t in the house at the time."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"reach for the stars","def":"to try to be successful at something that is difficult","examples":[]},{"idiom":"see stars","def":"to see flashes of light in front of your eyes, usually because you have been hit on the head","examples":[]},{"idiom":"stars in your eyes","def":"if somebody has stars in their eyes, they have dreams of becoming famous, especially as an actor, singer, etc.","examples":[]},{"idiom":"thank your lucky stars","def":"to feel very grateful and lucky about something","examples":["Just thank your lucky stars you weren’t in the house at the time."]}],"phrasal":[],"related":["all-star","co-star","one-star","two-star","dark star","film star","five-star","four-star","Star","star sign","Star Trek","star turn","Star Wars","movie star","star anise","star fruit","star-struck","three-star"]},{"pos":"verb","level":"A2","meanings":[{"def":"to have one of the main parts in a film, play, etc.","examples":["star in something He starred in that movie about the crazy professor.","star with/opposite somebody (in something) She starred opposite Cary Grant in ‘Bringing up Baby’.","No one has yet been chosen for the starring role (= the main part)."],"opposite":"","synonyms":""},{"def":"if a film, play, etc. stars somebody, that person has one of the main parts","examples":["a movie starring Jennifer Lawrence and Chris Pratt"],"opposite":"","synonyms":""},{"def":"to put a symbol with a shape like a star (= an asterisk) next to a word, etc. in order to make people notice it","examples":["be starred Treat all the sections that have been starred as priority."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]