[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sta/statu/status__us_2_rr.mp3","phonsUS":"/ˈsteɪtəs/","level":"B2","meanings":[{"def":"the legal position of a person, group or country","examples":["They were granted refugee status.","The party was denied legal status.","The company investigated the immigration status of its workers.","A majority voted for fully independent status for the region.","A referendum produced a massive majority in favour of fully independent status for the region.","Officers could determine their legal status.","She applied for resident status but was turned down.","The Institute has now achieved full status as part of the University.","The organization has charitable status.","They argued that the email had no signature and therefore no legal status.","They have acquired refugee status.","hospitals that have been given foundation status","In 1806 Napoleon raised Bavaria to the status of a kingdom.","They successfully applied for residency status."],"opposite":"","synonyms":""},{"def":"the social or professional position of somebody/something in relation to others","examples":["She achieved celebrity status overnight.","Women are only asking to be given equal status with men.","to have a high social status","low status jobs","People employed in high status occupations had lower levels of heart disease.","The only jobs on offer were of low status and badly paid.","They fear a loss of status, fear what the neighbours will say.","They were disgruntled with their low pay and lack of status.","At last James had an office that befitted his status.","Women are still denied equal status in the company.","The teaching profession has a low status in England.","They are campaigning to raise the status of nurses.","He achieved celebrity status through his role in a popular sitcom.","The struggle for equal status in society has not yet been won.","The neighbourhood has risen in status in recent years.","The company has managed to maintain its status among retailers.","High social status is attached to the legal profession.","How do people perceive the status of the full-time mother?","the change in status of teachers","My outsider status granted me special insights.","The relative status of the speakers affects what language is used.","This performance confirmed her status as a world-class athlete.","a payment made to every individual irrespective of employment status","the minority status of Catholics in Virginia","The boys lack power due to age and status.","The researchers considered age, gender, socioeconomic status, and ethnicity.","All American artists, regardless of status, were required to submit an official entry form.","They were denied an education because of their status as women.","In an absolutely egalitarian society, all human beings enjoy the same status.","the status of women in politics and public life"],"opposite":"","synonyms":""},{"def":"high rank or social position","examples":["The job brings with it status and a high income.","Marrying a rich woman helped him achieve status.","Owning the yacht has given them status.","At work he had status and respect.","Churches seem to have lost some of their status.","They see their oil paintings as symbols of their new wealth and status.","She attained international status while she was still alive."],"opposite":"","synonyms":""},{"def":"the level of importance that is given to something","examples":["This reflects the high status accorded to science in our culture.","This response is an indication of the low status attached to transport issues.","This sort of bike has status among teenagers.","In the teaching of literature, Shakespeare is given a special status.","China's status as an economic superpower","the United States' rise to superpower status","The novel soon assumed the status of a modern classic.","a car from the 50s that has acquired cult status","The show has been elevated to cult status.","Chocolate's status as an indulgent treat makes it a natural fit for rich dairy beverages and desserts.","The memorial gained the status of a national icon.","The book retains its status as a classic of its period."],"opposite":"","synonyms":""},{"def":"the situation at a particular time during a process","examples":["What is the current status of our application for funds?","She updated her Facebook status to ‘in a relationship’.","He has told family and friends of his HIV status."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["status bar","status quo","status symbol","marital status","status bars","status symbols"]}]