[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sta/state/statement__us_1.mp3","phonsUS":"/ˈsteɪtmənt/","level":"A1","meanings":[{"def":"something that you say or write that gives information or an opinion","examples":["Are the following statements true or false?","The article contained several false statements.","He made a rather misleading statement.","Is that a statement or a question?","statement about something I didn't agree with her statement about education.","His bald statement that he'd resigned concealed his anxiety about the situation.","She made one of her sweeping statements about foreigners.","He's made a few controversial statements about the conflict.","He made some ill-considered statements about wanting to take over.","She later retracted her statement that he was a hypocrite.","The leaflet contained many inaccurate statements.","Her statements regarding men were controversial.","He made an obvious statement regarding the dangers of the drug trade.","Your statement implies I had something to do with this.","This statement implied a lack of understanding of the situation.","I had my doubts about the truth of this statement.","The introduction contains some general statements about the book.","The article quotes his statement that ‘It was in Russia that I felt like an exile.’","That's a very bold statement!","Statements like that only inflame the situation."],"opposite":"","synonyms":""},{"def":"a formal or official account of facts or opinions","examples":["a joint/a written/an official statement","A government spokesperson made a statement to the press.","The court heard witness statements from several people.","The prosecution delivered a brilliant opening statement.","statement on/about something The government will issue a statement on the policy change today.","in a statement In a statement released yesterday, the company denied the allegations.","He gave a statement (= a written account of facts about a crime, used in court if legal action follows) in which he said he saw two men.","according to a statement According to a White House press statement, negotiators are still striving to reach an agreement.","A government spokesperson made a statement to the press.","She made helpful comments on my work.","the announcement of a peace agreement","He made a number of rude remarks about the food.","the declaration of war","He began by making a few general observations about the report.","He admitted giving a false statement to the police.","The government is yet to issue a statement about the attack.","The Board said in a written statement that the incident was being investigated.","Military action is being considered, according to an official statement.","They made him sign a statement implicating his friends.","In court, the witness retracted his statement.","The group claimed responsibility for the bombing in a statement posted on the internet.","She began the press conference by reading a prepared statement.","Clergy posted a statement in the local press calling for calm and tolerance.","In private she often contradicted her public statements.","The jury heard a moving victim impact statement from his widow.","The judge found that police had falsified statements attributed to Mr Murphy.","The press officer drafted a statement.","A statement by the Coalition for Animal Health condemned the move.","He filed false statements with the tax authorities.","He's trying to withdraw the statement he made to Parliament last week.","In a statement released today, the Department of Health said…","Saunder's lawyer made a brief statement to the press outside the court.","She put out a statement on behalf of the Government.","She read a statement to reporters yesterday.","The police will take a statement from each of you.","The two heads of state issued a joint statement.","a recent statement to the press","a statement condemning the death penalty","a statement on human rights","A government spokesperson made a brief statement to the press.","In a statement released today, the minister claimed he was not responsible for the error.","The finance minister will submit his budget statement next week."],"opposite":"","synonyms":"statement"},{"def":"a printed record of money paid, received, etc.","examples":["The directors are responsible for preparing the company's financial statements.","My bank sends me monthly statements.","I get monthly statements from my bank.","Their job is to prepare the company's annual financial statement.","Your next statement will show our new interest rate.","a bank/​credit card statement","The issuing banks published financial statements."],"opposite":"","synonyms":""},{"def":"a clear expression of an opinion or attitude that you make through your actions or appearance","examples":["They decided to make a political statement by refusing to vote.","The play makes a strong political statement.","statement about somebody/something The way you dress makes a statement about you.","The cleaning staff extended their strike mainly to make a statement about how determined they were.","The clothes you wear are a statement about yourself."],"opposite":"","synonyms":""},{"def":"(in England and Wales) an official report on a child’s special needs made by a local education authority","examples":["a statement of special educational needs"],"opposite":"","synonyms":""},{"def":"the act of stating or expressing something in words","examples":["When writing instructions, clarity of statement is the most important thing."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["autumn statement","bank statement","fashion statement","mission statement","spring statement","personal statement"]},{"pos":"verb","level":"","meanings":[{"def":"(in England and Wales) to officially decide and report that a child has special needs for his or her education","examples":["statemented children"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]