[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sta/state/state__us_1.mp3","phonsUS":"/steɪt/","level":"A2","meanings":[{"def":"a country considered as an organized political community controlled by one government","examples":["the Baltic States","European Union member states","the member states of the EU","The state provides free education.","In 1949 China became a communist state.","member states of the European Union","rogue states that shelter terrorists","Delegates from a number of Arab states attended the meeting.","It has not yet been recognized as an independent sovereign state.","Many Third World countries are one-party states of one type or another.","The action was opposed by several UN member states.","a newly independent state","relations between the two states"],"opposite":"","synonyms":""},{"def":"an organized political community forming part of a country","examples":["the states of Victoria and Western Australia","The hurricane swept across the southern states of the US.","Both candidates have been campaigning in key battleground states.","She decided to return to her home state of Ohio.","A handful of states have introduced similar legislation.","George W. Bush won the state of Florida.","He roamed throughout the state.","I was a correctional officer out of Utah state prison.","It can be a felony to transport wine across state lines.","Most states require all drivers to carry a minimum level of insurance.","She was selected to represent the state of Texas at the conference.","Thirty states have passed similar legislation.","The legislation must work at both the federal and state levels.","a farm tucked into the far north-west corner of the state","opposition to the Civil War in Kansas and the other border states","red states for Republicans","The Murray River is the boundary between the states of Victoria and New South Wales.","These data may have importance at the state or national level.","There are threats of power cuts across the state.","State legislatures around the country debated these labeling laws.","State law requires directors to be elected by a majority.","state budget cuts"],"opposite":"","synonyms":""},{"def":"the government of a country","examples":["matters/affairs of state","people who are financially dependent on the state","a state-owned company","They wish to limit the power of the State.","The president's wife is said to have a powerful hand in affairs of state.","the separation of church and state"],"opposite":"","synonyms":""},{"def":"the mental, emotional or physical condition that a person or thing is in","examples":["a confused mental state","state of something a confused state of mind","anxieties about the state of the country’s economy","The government has declared a state of emergency in the flooded regions.","Given the current state of knowledge, it will take years to find a solution.","A report condemned the state of prisoners' cells.","in a… state water in a liquid state","He was in a terrible state by the time he got home.","in a… state of something She was in a state of shock.","The building is in a bad state of repair (= needs to be repaired).","He was in a state of permanent depression.","in a … state to do something You're not in a fit state to drive.","(British English, informal) Look at the state of you! You can't go out looking like that.","the present state of medical knowledge","We’re worried about his mental state.","What a state this room is in (= very bad).","The car is in excellent condition.","Babies can cry themselves into a state of frenzy.","He goes into a trance-like state when he plays the guitar.","He's concerned about his mother's state of health.","He's not in a fit enough mental state to drive.","His life seems to be in a constant state of chaos.","Public speaking can produce a state of mind akin to panic.","She continues to live in a state of denial.","She managed to get the company's finances into a healthy state.","She slipped into a state of unconsciousness.","She uses music to create a particular emotional state.","The brothers' refusal to work together had brought about this sad state of affairs.","The country is in a perpetual state of anarchy.","The driver was just sitting there in a state of shock.","The education system is still in a state of flux following the recent reform.","The house was in a poor state of repair when we bought it.","The inspectors assess the physical state of schools and equipment.","His teeth were in an appalling state.","The soul continues to be reborn until it has reached a state of perfection.","We were shocked at the run-down state of the hospital.","You can either varnish the wood or leave it in its natural state.","a drug that produces altered states of consciousness","an advanced state of dehydration","Look at the state of this room!","The business is in a pretty good financial state.","There are serious concerns about the current state of the economy.","We would prefer to keep the garden in its natural state.","What kind of state are the roads in?","Distilled water is produced by condensing steam from boiled water back into its liquid state.","I cannot afford it, given the present state of our finances.","The 18th-century farmhouse is in a state of disrepair.","This work is an artistic statement of all that I feel about the state of the world."],"opposite":"","synonyms":""},{"def":"the formal ceremonies connected with high levels of government or with kings and queens","examples":["in state The president was driven in state through the streets."],"opposite":"","synonyms":""},{"def":"the United States of America","examples":["I've never been to the States."],"opposite":"","synonyms":""},{"def":"to be/become excited or anxious","examples":["She was in a real state about her exams.","He made a mistake and got into a terrible state about it.","Jane was in a terrible state after losing her job."],"opposite":"","synonyms":""},{"def":"to be dirty or untidy","examples":["What a state this place is in!","How did the carpet get into that state?"],"opposite":"","synonyms":""},{"def":"(in the Roman Catholic Church) having been forgiven by God for the wrong or evil things you have done","examples":["He died in a state of grace."],"opposite":"","synonyms":""},{"def":"a situation","examples":["This state of affairs can no longer be ignored.","the present economic situation","The ship sank in mysterious circumstances.","She felt she was in a position of power.","We were forced to work outside in freezing conditions.","Hi, Jane! How are things?","Think things over before you decide.","If that is the case (= if the situation described is true), we need more staff.","How did this unhappy state of affairs come about?"],"opposite":"","synonyms":"situation"},{"def":"the stage that has been reached in a process, etc. which has not yet been completed","examples":["What is the current state of play in the peace talks?"],"opposite":"","synonyms":""},{"def":"the score in a sports match, especially in cricket","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be in/get into a state","def":"to be/become excited or anxious","examples":["She was in a real state about her exams.","He made a mistake and got into a terrible state about it.","Jane was in a terrible state after losing her job.","What a state this place is in!","How did the carpet get into that state?"]},{"idiom":"in a state of grace","def":"(in the Roman Catholic Church) having been forgiven by God for the wrong or evil things you have done","examples":["He died in a state of grace."]},{"idiom":"a state of affairs","def":"a situation","examples":["This state of affairs can no longer be ignored.","the present economic situation","The ship sank in mysterious circumstances.","She felt she was in a position of power.","We were forced to work outside in freezing conditions.","Hi, Jane! How are things?","Think things over before you decide.","If that is the case (= if the situation described is true), we need more staff.","How did this unhappy state of affairs come about?"]},{"idiom":"the state of play","def":"the stage that has been reached in a process, etc. which has not yet been completed","examples":["What is the current state of play in the peace talks?"]}],"phrasal":[],"related":["city state","slave state","solid-state","state house","state line","swing state","client state","failed state","nation state","police state","state capture","state school","state trooper","welfare state","chief of state","head of state","lying-in-state","New York State"]},{"pos":"adjective","level":"B1","meanings":[{"def":"provided or controlled by the government of a country","examples":["state officials/agencies","state education","families dependent on state benefits (= in Britain, money given by the government to people who are poor)","state secrets (= information that could be harmful to a country if it were discovered by an enemy)","The law applies only to schools within the state system.","Charities are required to register with a state agency.","Every citizen could buy shares in privatized state property.","He was shot for passing state secrets to foreign powers.","Some prefer tax cuts to greater state spending on health and social services.","Teachers in the state sector are asking for a 7% pay rise.","The state pension is barely enough to live on.","The telephone network is still under state control.","large-scale state intervention in industry","the legitimate exercise of state power","schools outside the state system","unemployed people living on state benefits","A change in state funding will require the museum to pay for the restoration.","The film was shown on state television.","Chinese state media has condemned the attack."],"opposite":"","synonyms":""},{"def":"provided or controlled by a particular state of a country, especially in the US","examples":["the state government/legislature","California state law","a state prison/hospital/university","state police/troopers","a state tax","federal and state government policies"],"opposite":"","synonyms":""},{"def":"connected with the leader of a country attending an official ceremony","examples":["The queen is on a state visit to Berlin.","the state opening of Parliament","the state apartments (= used for official ceremonies)"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"B1","meanings":[{"def":"to formally write or say something, especially in a careful and clear way","examples":["state something He has already stated his intention to run for election.","The facts are clearly stated in the report.","There is no need to state the obvious (= to say something that everyone already knows).","state how, what, etc… State clearly how many tickets you require.","Each child was asked in turn to state what he or she wanted from the situation.","state that… He stated categorically that he knew nothing about the deal.","it is stated that… It was stated that standards at the hospital were dropping.","All the photographs in this book, unless otherwise stated, date from the 1950s.","something/somebody is stated to be/have something The contract was stated to be invalid.","The driver is stated to have three previous convictions.","to declare war","The painting was declared to be a forgery.","He has already stated his intention to run for election.","During our meeting, he indicated his willingness to cooperate.","They haven’t formally announced their engagement yet.","Has our flight been announced yet?","‘Alcohol doesn't solve problems,’ she stated flatly.","As previously stated, the phrase ‘value for money’ has an ambiguous meaning.","At the risk of stating the obvious, people who have not paid cannot be admitted.","He stated his own views quite openly.","I am merely stating the facts.","Let me state at the outset that this report contains little that is new.","Let me state for the record that my knowledge of wine is almost non-existent.","She stated categorically that she had no intention of leaving.","The committee failed to state their reasons for this decision.","The demands are more easily stated than met.","The report goes on to state that…","These facts were nowhere explicitly stated.","We cannot accept this proposal for the reasons stated above.","At the meeting, he stated his case for investing.","No such thing was stated or even implied by the professor.","The association has publicly stated its support for the proposal.","Simply stated, our goal is to take the business to new heights.","The organization refuses to state a clear position for or against."],"opposite":"","synonyms":"declare"},{"def":"to fix or announce the details of something, especially on a written document","examples":["This is not one of their stated aims.","You must arrive at the time stated.","Do not exceed the stated dose (= of medicine)."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]