[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sta/stati/station__us_2.mp3","phonsUS":"/ˈsteɪʃn/","level":"A1","meanings":[{"def":"a place where trains stop so that passengers can get on and off; the buildings connected with this","examples":["the main station","Euston Station","a train station","(British English also) a railway station","(British English) a tube/an underground station","(North American English) a subway station","at a station I get off at the next station.","I'm getting off at the next station.","I'll get a coffee at the station.","The train was just arriving at the station.","What time do you need to be at the station?","The train arrived at Oxford Station twenty minutes late.","He dropped me in front of the station.","I'll give you a lift to the station.","There's a pub opposite the station.","The train stopped just outside the station.","The train left the station on time.","We got to the station just as the train was pulling out.","Her flat is near Vauxhall station.","The main station is Birmingham New Street.","Temple is the name of both a London tube station and a Paris metro station.","There was an explosion in a subway station.","There's a newspaper kiosk in the station.","They met on the station platform.","There are cash machines on the station concourse.","There's a taxi rank just by the station entrance."],"opposite":"","synonyms":""},{"def":"a place where buses stop; the buildings connected with this","examples":["We waited for him at the bus station.","(British English also) a coach station","Victoria Coach Station","I bought a newspaper at the bus station.","The bus station is to the east of the city centre.","I'll give you a lift to the coach station.","She was waiting for a taxi outside the coach station.","The bus leaves the station at 09.00 hours."],"opposite":"","synonyms":""},{"def":"a place or building where a service is organized and provided or a special type of work is done","examples":["Report the theft at the nearest police station.","(British English) a petrol station","(North American English) a gas station","a pollution monitoring station","an agricultural research station","There were lines of people waiting at voting stations.","The first trial crops were grown at secret test stations.","‘We've lost audio, Sir,’ announced the officer at the communication station.","They established an aid station close to the front line.","There are drinks stations at every mile along the course of the race.","Humidity and temperature are measured at each station.","There's a lifeboat station on the promenade.","plans to locate a waste collection station nearby","The base station transmits the information to the operator.","a car rental return station","a gas station attendant","They were seen on CCTV on the petrol station forecourt.","Anyone interested in being a volunteer firefighter should contact the station commander.","the CIA station chief in Vietnam"],"opposite":"","synonyms":""},{"def":"a radio or television company and the programmes it broadcasts","examples":["a local radio/television/TV station","He tuned to another station.","The station broadcasts 24 hours a day.","I can pick up a lot of foreign stations on this radio.","The station airs 14 hours of local news per week.","You can listen to your favourite station on the move.","a digital radio station","The car radio was tuned to a country music station.","The song is being played on Top 40 stations across the country.","The campaign was launched on local and national stations.","The show aired on stations across the country.","They produce commercials aimed at cable stations.","They have been interviewed by a French television station.","a pay-per-view TV station","a 24-hour news station","He owns an FM radio station.","a classical radio station broadcasting on the internet","The company operates four cable television stations."],"opposite":"","synonyms":""},{"def":"your social position","examples":["above your station She was definitely getting ideas above her station."],"opposite":"","synonyms":""},{"def":"a place where somebody has to wait and watch or be ready to do work if needed","examples":["You are not to leave your station without permission."],"opposite":"","synonyms":""},{"def":"a large sheep or cattle farm in Australia or New Zealand","examples":[],"opposite":"","synonyms":""},{"def":"a small base for the army or navy; the people living in it","examples":["a naval station"],"opposite":"","synonyms":""},{"def":"a situation in which people feel very anxious and there is a lot of confused activity, especially because there is a lot to do in a short period of time","examples":["It was panic stations when the deadline was brought forward by a week."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"panic stations","def":"a situation in which people feel very anxious and there is a lot of confused activity, especially because there is a lot to do in a short period of time","examples":["It was panic stations when the deadline was brought forward by a week."]}],"phrasal":[],"related":["bus station","gas station","way station","earth station","fire station","hill station","Penn Station","power station","space station","station agent","station house","station wagon","comfort station","docking station","filling station","muster station","petrol station","police station","polling station"]},{"pos":"verb","level":"","meanings":[{"def":"to send somebody, especially from one of the armed forces, to work in a place for a period of time","examples":["troops stationed abroad"],"opposite":"","synonyms":""},{"def":"to go somewhere and stand or sit there, especially to wait for something; to send somebody somewhere to do this","examples":["She stationed herself at the window to await his return.","A photographer had been stationed at the main entrance."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]