[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sta/stay_/stay__us_1.mp3","phonsUS":"/steɪ/","level":"A1","meanings":[{"def":"to continue to be in a particular place for a period of time without moving away","examples":["+ adv./prep. Stay there and don't move!","I just want to stay in bed today.","She stayed at home (= did not go out to work) while the children were young.","(North American English also) to stay home","We ended up staying for dinner.","People are being advised to stay indoors.","Can you stay behind after the others have gone and help me clear up?","I'm staying late at the office tonight.","My hat won't stay on!","I can't stay long.","I can stay a few minutes longer.","I can stay for a few more minutes.","‘Do you want a drink?’ ‘No, thanks, I can't stay.’","stay to do something We stayed to see what would happen.","stay doing something They stayed talking until well into the night.","Alex stayed behind when the others had gone.","Stay here while I go find out what's happening.","She asked everyone else to leave the room but I was allowed to stay.","Many students choose to stay after graduating and find jobs in the area.","He preferred to stay at home and watch TV.","I was allowed to stay home from school because I was sick.","She stays in her room most of the time.","We liked the city so much we decided to stay there.","I had no more reason to stay in California.","Complications could arise which require you to stay in hospital.","We can't stay here indefinitely.","‘Stay with me!’ he pleaded.","Why don't you stay for the rest of the day?","I'm going to stay until tomorrow.","Afterwards he stayed to chat and sign autographs.","I didn't stay to watch the rest of the show.","He stayed watching for a while, then went home.","I'd love to stay chatting but I must go.","I'd love to stay and chat but I must go.","We encourage people to stay and have drinks after the movie.","Do you run away or stay and fight?","The ducklings stay close to their mother.","The camera stays on her face throughout the scene.","I dropped a sandwich on the floor and it stayed there all week."],"opposite":"","synonyms":""},{"def":"to live in a place temporarily as a guest or visitor","examples":["My sister's coming to stay next week.","She's working here for two weeks and needs a place to stay.","+ adv./prep. We found out we were staying in the same hotel.","He's staying with friends this weekend.","I missed the last bus and had to stay overnight.","+ noun I stayed three nights at my cousin's house.","She's staying with her sister.","We had an exchange student staying with us.","We've got friends coming to stay.","You can't stay here. We don't have a spare room.","Where will you be staying while you're in Scotland?","How long are you staying?","We're staying a week in the mountains and a week by the coast.","I'm staying at a hotel near the beach.","I went to stay at their house in the country.","It's one of the best places to stay in town.","We can give you tips about where to stay and what to see.","A young couple was staying in the room next door.","He stayed for over a week.","He invited her to stay for a while.","We had friends staying for the weekend.","Come and stay any time!","He needs somewhere to stay.","They haven't got anywhere to stay.","Won't you let me stay?"],"opposite":"","synonyms":""},{"def":"to continue to be in a particular state or situation","examples":["+ adj. I can't stay awake any longer.","The store stays open late on Thursdays.","to stay healthy/alive/calm/silent/safe","He never stays angry for long.","Stay tuned (= used to ask people to continue listening to or watching a particular programme on the radio or television).","+ adv./prep. I don't know why they stay together (= remain married or in a relationship).","Inflation stayed below 4 per cent last month.","We said goodbye and promised to stay in touch.","She did not want to stay in nursing all her life.","The TV stays on all day in their house.","+ noun We promised to stay friends for ever.","stay doing something She wanted to stay working in the pub.","Humans need minerals to stay healthy.","How do you stay calm under pressure?","It's important children learn how to stay safe online.","At the moment, it's all fine. Let's hope it stays that way!","The script manages to stay fresh and funny through 25 episodes.","You will have to continue to change and grow if you want to stay competitive.","Somehow the company managed to stay afloat.","People want to stay fit as they age.","She has stayed true to her principles.","Organizations invest vast amounts to stay ahead in the race for information.","advice on how to stay positive during hard times","I was told to stay quiet.","He can't stay still for five minutes.","I was so tired I could hardly stay upright.","I've tried hard to stay strong through all this.","She managed to stay cool during the meeting.","Lost and so far from other human life, he faced a desperate struggle to stay alive.","She wanted a drink but she had to stay sober.","Email is a great way to stay in touch with friends.","He managed to stay in power for almost 15 years.","It's now quite unusual to stay in the same job your whole working life.","The tax cuts will stay in place for two more years.","financial help for parents to stay at home with their children","Many small shops are struggling to stay in business.","the battle to stay on top","His big brother used to help him stay out of trouble.","I tried to stay out of sight.","It stayed cloudy for most of the day.","Let's hope it stays fine for the wedding this afternoon.","I try to stay on top of musical trends.","The project manager makes sure the project stays on track.","He planned to stay a virgin until he was married.","Don't click on the image if you want it to stay the same size.","You can't stay living with your parents forever.","I stayed hiding until he left."],"opposite":"","synonyms":""},{"def":"to now be accepted or used by most people and therefore a permanent part of our lives","examples":["It looks like televised trials are here to stay."],"opposite":"","synonyms":""},{"def":"to remain calm; to not worry","examples":["It's OK—hang loose and stay cool."],"opposite":"","synonyms":""},{"def":"(to get/stay) in good physical condition","examples":["You don't have to spend a fortune on gym membership to get in shape.","I like to stay in shape."],"opposite":"","synonyms":""},{"def":"to avoid a person or thing because they may cause problems","examples":["Steer clear of the centre of town at this time of the evening."],"opposite":"","synonyms":""},{"def":"used to tell a dog not to move","examples":[],"opposite":"","synonyms":""},{"def":"to avoid a person or thing because they may cause problems","examples":["Stay clear of the centre of town at this time of the evening."],"opposite":"","synonyms":""},{"def":"to continue doing something until it has finished or been completed, even though it is difficult","examples":["Very few of the trainees have stayed the course.","He insists that he will not quit but will stay the course."],"opposite":"","synonyms":""},{"def":"to stop yourself from doing something; to prevent you from doing something","examples":["It was prudence, not logic, that stayed his hand."],"opposite":"","synonyms":""},{"def":"to remain calm; to not worry","examples":["It's OK—stay loose and just enjoy yourselves."],"opposite":"","synonyms":""},{"def":"to sleep at somebody’s house for one night","examples":["You can always stay the night at our house.","She stayed the night at Kathryn's."],"opposite":"","synonyms":""},{"def":"if somebody/something stays put, they continue to be in the place where they are or where they have been put","examples":["He chose to stay put while the rest of us toured the area."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be here to stay | have come to stay","def":"to now be accepted or used by most people and therefore a permanent part of our lives","examples":["It looks like televised trials are here to stay."]},{"idiom":"hang/stay loose","def":"to remain calm; to not worry","examples":["It's OK—hang loose and stay cool."]},{"idiom":"(get/keep/stay) in shape","def":"(to get/stay) in good physical condition","examples":["You don't have to spend a fortune on gym membership to get in shape.","I like to stay in shape."]},{"idiom":"keep/stay/steer clear (of somebody/something)","def":"to avoid a person or thing because they may cause problems","examples":["Steer clear of the centre of town at this time of the evening."]},{"idiom":"stay!","def":"used to tell a dog not to move","examples":[]},{"idiom":"stay/steer/keep clear (of somebody/something)","def":"to avoid a person or thing because they may cause problems","examples":["Stay clear of the centre of town at this time of the evening."]},{"idiom":"stay the course","def":"to continue doing something until it has finished or been completed, even though it is difficult","examples":["Very few of the trainees have stayed the course.","He insists that he will not quit but will stay the course."]},{"idiom":"stay your hand","def":"to stop yourself from doing something; to prevent you from doing something","examples":["It was prudence, not logic, that stayed his hand."]},{"idiom":"stay/hang loose","def":"to remain calm; to not worry","examples":["It's OK—stay loose and just enjoy yourselves."]},{"idiom":"stay the night","def":"to sleep at somebody’s house for one night","examples":["You can always stay the night at our house.","She stayed the night at Kathryn's."]},{"idiom":"stay put","def":"if somebody/something stays put, they continue to be in the place where they are or where they have been put","examples":["He chose to stay put while the rest of us toured the area."]}],"phrasal":["stay around","stay away","stay in","stay on","stay out","stay out of","stay over","stay up"],"related":["stay in","stay on","stay out","stay up","long-stay","stay away","stay over","short-stay","stay around","stay out of","stay-at-home","stay-at-homes"]},{"pos":"noun","level":"A2","meanings":[{"def":"a period of staying; a visit","examples":["I enjoyed my stay in Prague.","an overnight stay","In recent years the average hospital stay for elderly patients has decreased.","It poured throughout their stay.","She has extended her stay by three days.","We did a lot of walking during our stay."],"opposite":"","synonyms":""},{"def":"a rope or wire that supports a ship’s mast, a pole, etc.","examples":[],"opposite":"","synonyms":""},{"def":"a delay in following the order of a court","examples":["to grant a stay of execution","There will be no stay of execution and few mourners for this concrete tower block, due to be demolished next month."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a stay of execution","def":"a delay in following the order of a court","examples":["to grant a stay of execution","There will be no stay of execution and few mourners for this concrete tower block, due to be demolished next month."]}],"phrasal":[],"related":[]}]