[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/ste/steer/steer__us_1.mp3","phonsUS":"/stɪr/","level":"C1","meanings":[{"def":"to control the direction in which a boat, car, etc. moves","examples":["He steered the boat into the harbour.","(figurative) He took her arm and steered her towards the door.","You row and I'll steer.","He told the pilot to steer due north.","Johnson managed to steer the plane away from the town and crash-land in a nearby field.","Pilots need to learn to steer on the ground as well as in the air.","The boat was being steered by an elderly man.","The captain steered the boat into the narrow harbour."],"opposite":"","synonyms":""},{"def":"to move in a particular direction","examples":["The ship steered a course between the islands.","The ship steered into port.","The ship steered into the harbour.","The car steered off the cliff.","The canoe steered north for two thousand miles."],"opposite":"","synonyms":""},{"def":"to take control of a situation and influence the way in which it develops","examples":["He managed to steer the conversation away from his divorce.","She steered the team to victory.","The skill is in steering a middle course between the two extremes.","Schools no longer steer girls towards arts subjects."],"opposite":"","synonyms":""},{"def":"to avoid a person or thing because they may cause problems","examples":["Steer clear of the centre of town at this time of the evening."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"keep/stay/steer clear (of somebody/something)","def":"to avoid a person or thing because they may cause problems","examples":["Steer clear of the centre of town at this time of the evening."]}],"phrasal":[],"related":["(steer, take, etc.) a middle course","keep/stay/steer clear (of somebody/something)","stay/steer/keep clear (of somebody/something)"]},{"pos":"noun","level":"","meanings":[{"def":"a piece of advice or information that helps you do something or avoid a problem","examples":["Can anyone give me a steer on this?","Do you know somebody working there who could give you a steer?","I’d really appreciate a steer in the right direction."],"opposite":"","synonyms":""},{"def":"a bull (= a male cow) that has been castrated (= had part of its sex organs removed), kept for its meat","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]