[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/ste/step_/step__us_1.mp3","phonsUS":"/step/","level":"A2","meanings":[{"def":"one of a series of things that you do in order to achieve something","examples":["We are taking steps to prevent pollution.","It's a big step giving up your job and moving halfway across the world.","a necessary/an important/a positive step","step toward(s) something This was a first step towards a united Europe.","This won't solve the problem but it's a step in the right direction.","The new drug represents a major step forward in the treatment of the disease.","Closing the factory would be a retrograde step.","Can you explain your actions?","Tougher measures against racism are needed.","This was a first step towards a united Europe.","an act of kindness","They are waiting for the results of the opinion polls before deciding their next move.","The talks mark a step towards peace.","They have taken their first tentative steps towards democracy.","We've moved a step closer to independence.","The offer constitutes a considerable step forward.","This can only be seen as a step backward.","Greece moved a step closer to the final with last night's win.","I shall take immediate steps to have this matter put right.","We shall take all necessary steps to prevent public disorder.","The new speed limit does not solve the problem, but it is a step in the right direction.","The new law is seen by many as a backward step.","The move was a first step in establishing a union.","This is a crucial first step on the ladder of literary success.","They took the unusual step of taking out newspaper advertisements.","This is a very positive step forward for everyone concerned.","The move represented a significant step forward for the young Canadian film industry.","We must take steps to ensure this won't happen again."],"opposite":"","synonyms":"action"},{"def":"one of a series of things that somebody does or that happen, which forms part of a process","examples":["Having completed the first stage, you can move on to step 2.","If you follow all the steps, nothing will go wrong.","I'd like to take this idea a step further.","This was a big step up (= to a better position) in his career.","I'll explain it to you step by step.","a step-by-step guide to building your own home","a step-by-step guide to setting up an aquarium","If he goes one step further with this crazy idea, I'll resign.","The promotion was a big step up in his career.","It's only a short step from disorder to complete chaos.","It suddenly struck her that having a baby was an irrevocable step.","What's the next step?","This is an extremely important step in the certification process.","The next logical step was for the program leaders to work closely with existing staff.","This is the first concrete step on the road to integration.","She went carefully through each step of the application process.","I'll be with you every step of the way.","Building a business involves a series of important steps.","Good communication is vital at every step of the process."],"opposite":"","synonyms":""},{"def":"the act of lifting your foot and putting it down in order to walk or move somewhere; the sound this makes","examples":["a baby’s first steps","He took a step towards the door.","We heard steps outside.","I could hear his steps coming closer.","I recognized her quick light step.","He took a hesitant step towards her.","He lagged a few steps behind.","He grew fainter with every step.","I gasped and took an involuntary step back.","I quickened my step.","I was growing more and more nervous with every step.","Take two steps forward and one step back.","One false step could mean disaster."],"opposite":"","synonyms":""},{"def":"the distance that you cover when you take a step","examples":["It's only a few steps further.","He turned around and retraced his steps (= went back the way he had come).","She moved a step closer to me.","(figurative) The hotel is only a short step (= a short distance) from the beach.","He'd only gone a few steps when he realized he'd left his keys behind.","She was only a step away from the cliff edge.","You might find your ticket if you retrace your steps back to the car.","Keep on moving—it's only a few steps further."],"opposite":"","synonyms":""},{"def":"a surface that you put your foot on in order to walk to a higher or lower level, especially one of a series","examples":["She was sitting on the bottom step of the staircase.","We walked down some stone steps to the beach.","A short flight of steps led up to the door.","She paused on the top step.","Mind the step!","She went up a flight of steps to the side entrance.","The front steps lead to an enormous terrace.","There are three steps down to the garden.","You have to go up four flights of steps to get up to the roof.","There was a pint of milk on the step outside.","Down a few steps from the entry is the main salon.","Crowds of visitors climbed the steep narrow steps to the top of the tower."],"opposite":"","synonyms":""},{"def":"a series of movements that you make with your feet and which form a dance","examples":["Do you know the steps of this dance?","He executed some dance steps for the judges.","He executed some jive steps on the pavement."],"opposite":"","synonyms":""},{"def":"the way that somebody walks","examples":["He walked with a quick light step.","There was a smile on her face and a spring in her step.","I had a spring in my step when I walked into that office for the last time.","There was a new spring in his step."],"opposite":"","synonyms":""},{"def":"a type of exercise that you do by stepping on and off a raised piece of equipment","examples":["step aerobics","a step class"],"opposite":"","synonyms":""},{"def":"a stepladder","examples":["a pair of steps","We need the steps to get into the attic."],"opposite":"","synonyms":""},{"def":"the interval between two notes that are next to each other in a scale","examples":[],"opposite":"","synonyms":""},{"def":"to change the way you are walking so that you do not walk in the same rhythm as the people you are walking or marching with","examples":["The soldiers turned without once breaking step."],"opposite":"","synonyms":""},{"def":"to change the way you are walking so that you start walking in the same rhythm as the person you are walking with","examples":["He caught her up and fell into step beside her."],"opposite":"","synonyms":""},{"def":"putting your feet on the ground in the right/wrong way, according to the rhythm of the music or the people you are moving with","examples":["He was out of step with the music.","She had trouble keeping in step with the others."],"opposite":"","synonyms":""},{"def":"having ideas that are the same as or different from other people’s","examples":["She was out of step with her colleagues."],"opposite":"","synonyms":""},{"def":"to walk carefully","examples":[],"opposite":"","synonyms":""},{"def":"to behave in a careful and sensible way","examples":["You’d better watch your step with him if you don’t want trouble."],"opposite":"","synonyms":""},{"def":"used to say that every time you make progress, something bad happens that means that the situation is worse than before","examples":[],"opposite":"","synonyms":""},{"def":"when you are one step ahead of somebody/something, you manage to avoid them or to achieve something more quickly than they do","examples":["She's always one step ahead of the competition."],"opposite":"","synonyms":""},{"def":"when you do something one step at a time you do it slowly and gradually","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"break step","def":"to change the way you are walking so that you do not walk in the same rhythm as the people you are walking or marching with","examples":["The soldiers turned without once breaking step."]},{"idiom":"fall into step (beside/with somebody)","def":"to change the way you are walking so that you start walking in the same rhythm as the person you are walking with","examples":["He caught her up and fell into step beside her."]},{"idiom":"in/out of step (with somebody/something)","def":"putting your feet on the ground in the right/wrong way, according to the rhythm of the music or the people you are moving with","examples":["He was out of step with the music.","She had trouble keeping in step with the others.","She was out of step with her colleagues."]},{"idiom":"mind/watch your step","def":"to walk carefully","examples":["You’d better watch your step with him if you don’t want trouble."]},{"idiom":"one step forward, two steps back","def":"used to say that every time you make progress, something bad happens that means that the situation is worse than before","examples":[]},{"idiom":"a/one step ahead (of somebody/something)","def":"when you are one step ahead of somebody/something, you manage to avoid them or to achieve something more quickly than they do","examples":["She's always one step ahead of the competition."]},{"idiom":"a/one step at a time","def":"when you do something one step at a time you do it slowly and gradually","examples":[]}],"phrasal":[],"related":["step-","step in","step out","step up","two-step","baby step","half step","step back","step down","goose-step","step aside","step change","step-parent","whole step","naughty step","step forward"]},{"pos":"verb","level":"B2","meanings":[{"def":"to lift your foot and move it in a particular direction or put it on or in something; to move a short distance","examples":["to step onto/off a bus","I stepped forward when my name was called out.","She stepped aside to let them pass.","We stepped carefully over the broken glass.","I turned around quickly and stepped on his toes.","She opened the door and stepped out into the sunshine.","(figurative) Going into the hotel is like stepping back in time.","Don't step in the puddle.","He stepped back hastily from the edge.","He stepped gingerly over the cat.","Would you like to step inside for a few minutes?","Could you step inside for a moment?","He stepped back into the shadows.","He stepped smartly aside to avoid her.","I accidentally stepped on her toe.","Myra stepped gingerly through the rows of plants.","The boy had stepped out into the road without looking.","We had to step carefully to avoid the broken glass.","Please step this way, Mr Jones.","She stepped outside to discover it was snowing.","I stepped away from the car, raising my hands."],"opposite":"","synonyms":""},{"def":"to do somebody’s job or work when they are suddenly or unexpectedly unable to do it","examples":["She stepped into the breach caused by Stella's illness."],"opposite":"","synonyms":""},{"def":"to continue a job or the work that somebody else has started","examples":["She stepped into her father’s shoes when he retired."],"opposite":"","synonyms":""},{"def":"used especially in orders to tell somebody to drive faster","examples":[],"opposite":"","synonyms":""},{"def":"to offend or annoy somebody, especially by getting involved in something that is their responsibility","examples":["I don’t want to step on anybody’s toes so I’ll keep quiet."],"opposite":"","synonyms":""},{"def":"to behave badly or break the rules","examples":["His boss warned him that if he stepped out of line once more he would be fired."],"opposite":"","synonyms":""},{"def":"to do what is necessary in order to benefit from an opportunity or deal with a crisis","examples":["It's important for world leaders to step up to the plate and honor their commitments on global warming.","It’s time for businesses to step up to the plate and accept responsibility."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"step into the breach","def":"to do somebody’s job or work when they are suddenly or unexpectedly unable to do it","examples":["She stepped into the breach caused by Stella's illness."]},{"idiom":"step into somebody’s shoes","def":"to continue a job or the work that somebody else has started","examples":["She stepped into her father’s shoes when he retired."]},{"idiom":"step on it","def":"used especially in orders to tell somebody to drive faster","examples":[]},{"idiom":"step on somebody’s toes","def":"to offend or annoy somebody, especially by getting involved in something that is their responsibility","examples":["I don’t want to step on anybody’s toes so I’ll keep quiet."]},{"idiom":"step out of line | be/get out of line","def":"to behave badly or break the rules","examples":["His boss warned him that if he stepped out of line once more he would be fired."]},{"idiom":"step up to the plate","def":"to do what is necessary in order to benefit from an opportunity or deal with a crisis","examples":["It's important for world leaders to step up to the plate and honor their commitments on global warming.","It’s time for businesses to step up to the plate and accept responsibility."]}],"phrasal":["step aside","step back","step down","step forward","step in","step out","step up"],"related":[]},{"pos":"combining form","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/ste/step_/step__1_us_1.mp3","level":"","meanings":[{"def":"related as a result of one parent marrying again","examples":["stepmother"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]