[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sti/stir_/stir__us_1.mp3","phonsUS":"/stɜːr/","level":"C1","meanings":[{"def":"to move a liquid or substance around, using a spoon or something similar, in order to mix it completely","examples":["stir something She stirred her tea.","Stir the paint before you use it.","stir something into something The vegetables are stirred into the rice while it is hot.","stir something in Stir in the milk until the sauce thickens.","Mix all the ingredients together in a bowl.","Oil and water do not mix.","She stirred her tea.","Blend the flour with the milk to make a smooth paste.","Boil the mixture, stirring frequently.","Bring to the boil, stirring all the time.","Chop an onion and stir it into the sauce.","Gradually stir in the beaten egg.","Stir over a medium heat for three minutes."],"opposite":"","synonyms":"mix"},{"def":"to move, or to make something move, slightly","examples":["She heard the baby stir in the next room.","stir something/somebody A slight breeze was stirring the branches.","A noise stirred me from sleep.","Nothing stirred except the wind.","The wind came in tiny puffs that hardly stirred the surface of the water."],"opposite":"","synonyms":""},{"def":"to move, or to make somebody move, in order to do something","examples":["You haven't stirred from that chair all evening!","stir yourself/somebody Come on, stir yourself. You're late!","stir somebody into/to something Their complaints have finally stirred him into action.","The students stirred restlessly in their seats.","She could hear the baby stirring in the next room."],"opposite":"","synonyms":""},{"def":"to make somebody excited or make them feel something strongly","examples":["It's a book that really stirs the imagination.","stir somebody She was stirred by his sad story.","stir somebody to something The preachers were stirred to new zeal.","He was stirred by the child's sad story.","It was not music to set hearts on fire or deeply stir the emotions.","The encounter stirred long-forgotten feelings within her.","This brutal killing has stirred the nation's conscience."],"opposite":"","synonyms":""},{"def":"to begin to be felt","examples":["A feeling of guilt began to stir in her.","New optimism was stirring throughout the country."],"opposite":"","synonyms":""},{"def":"to try to cause trouble","examples":["You're just stirring it!"],"opposite":"","synonyms":""},{"def":"to make somebody excited","examples":["The atmosphere in a theatre never failed to stir her blood."],"opposite":"","synonyms":""},{"def":"to begin to move; to hurry","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"stir the blood","def":"to make somebody excited","examples":["The atmosphere in a theatre never failed to stir her blood."]},{"idiom":"stir your stumps","def":"to begin to move; to hurry","examples":[]}],"phrasal":["stir up"],"related":["stir-fry","stir up","stir-crazy","stir-fries","stir-fried","stir-frying","stir somebody","stir something","stir the blood"]},{"pos":"noun","level":"","meanings":[{"def":"excitement, anger or shock that is felt by a number of people","examples":["Her resignation caused quite a stir.","The discovery caused something of a stir among physicists.","There was quite a stir about the book."],"opposite":"","synonyms":""},{"def":"the action of stirring something","examples":["Could you give the rice a stir?"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]