[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sto/stop_/stop__us_1.mp3","phonsUS":"/stɑːp/","level":"A1","meanings":[{"def":"to no longer move; to make somebody/something no longer move","examples":["The car stopped at the traffic lights.","Ann stopped in front of the house.","This train doesn’t stop at Oxford.","stop somebody/something He was stopped by the police for speeding.","She stopped the car opposite the school.","Suddenly he stopped dead: what was he doing?","The buses stop outside the school.","Soldiers took up positions along roads, stopping and searching cars.","Passers-by stopped and stared in the window.","She made them stop the car and let her out.","Flooding has stopped the traffic through the center of town."],"opposite":"","synonyms":""},{"def":"to no longer continue to do something; to make somebody/something no longer do something","examples":["Can't you just stop?","stop doing something That phone never stops ringing!","Don't you ever stop talking?","Please stop crying and tell me what's wrong.","She criticizes everyone and the trouble is, she doesn't know when to stop.","stop somebody/something Stop me (= make me stop talking) if I'm boring you.","Stop it! You're hurting me.","stop what… Mike immediately stopped what he was doing.","Sorry to interrupt, but I have to disagree with that.","Could I just say something here?","If I could, let me stop you there for a moment and go back to your previous point.","Actually, we seem to have strayed a bit from the topic. Can we go back to the first point?","Just a moment, Sue. Can we hear what Jack has to say on this?","May I interrupt you there? I don't think that's true.","I’m sorry, but we’re running short on time. Can you please summarize very quickly so we can finish up?","I appreciate your enthusiasm on this topic, but I’m afraid we have a couple more people to hear from.","Could you two please discuss that issue privately after the meeting? We have several more items to cover and need to move on at this point.","I’m sorry, I really have to stop you there. We've run out of time.","Let’s save that conversation for another time.","He never knows when to stop.","He couldn't stop thinking about her.","I was enjoying myself so much I didn't want to stop.","We need to stop making excuses.","After three weeks we had stopped expecting to hear any news.","She's trying to stop smoking and lose weight.","They can't stop talking about the holiday.","She didn't stop working until she was 80.","They paid farmers to stop using chemicals.","It's time to stop playing and go home."],"opposite":"","synonyms":""},{"def":"to end or finish; to make something end or finish","examples":["When is this fighting going to stop?","The bus service stops at midnight.","stop doing something Has it stopped raining yet?","stop something Doctors couldn't stop the bleeding.","The referee was forced to stop the game because of heavy snow.","She called on both sides to stop the violence.","When is the violence going to stop?","The sobs came less frequently, then stopped altogether.","The story stops and starts, with little emphasis on continuity.","The peace movement failed to stop the war.","He knew he had to stop the blood flow.","On the farm, the work never stops."],"opposite":"","synonyms":""},{"def":"to prevent somebody from doing something; to prevent something from happening","examples":["stop somebody/something I want to go and you can't stop me.","efforts to stop the spread of the disease","There's no stopping us now (= nothing can prevent us from achieving what we want to achieve).","stop somebody/something (from) doing something You can't stop people (from) saying what they think.","They tried to stop me from leaving.","There's nothing to stop you from accepting the offer.","He's dangerous and needs to be stopped.","Measures must be taken to stop the spread of the virus.","The activists failed to stop the tests from going ahead.","If she wants to go, I'm certainly not going to try and stop her.","Technology could help to stop future attacks.","The internet has stopped young people from talking to each other."],"opposite":"","synonyms":""},{"def":"to end an activity for a short time in order to do something","examples":["stop for something I'm hungry. Let's stop for lunch.","We stopped for the night in Port Augusta.","stop to do something We stopped to admire the scenery.","People just don't stop to think about the consequences.","The film really makes you stop and think.","If you just stop and listen, it's amazing what you can hear."],"opposite":"","synonyms":""},{"def":"to no longer be working or functioning; to make something be no longer working or functioning","examples":["Why has the engine stopped?","What time is it? My watch has stopped.","I felt as if my heart had stopped.","stop something Can you stop the printer once it’s started?"],"opposite":"","synonyms":""},{"def":"to stay somewhere for a short time, especially at somebody’s house","examples":["I'm not stopping. I just came to give you this message.","stop for something Can you stop for tea?"],"opposite":"","synonyms":""},{"def":"to prevent money from being paid","examples":["stop something to stop a cheque (= tell the bank not to pay it)","Employees of the failed company will have their wages stopped from tomorrow.","stop something from something (British English) Dad threatened to stop £1 a week from our pocket money if we didn't clean our rooms."],"opposite":"","synonyms":""},{"def":"to block, fill or close a hole, an opening, etc.","examples":["Stop up the other end of the tube, will you?","I stopped my ears but still heard her cry out."],"opposite":"","synonyms":""},{"def":"to be willing to do anything to get what you want, even if it is dishonest or wrong","examples":["She’ll stop at nothing to make money."],"opposite":"","synonyms":""},{"def":"to stop measuring time in a game or an activity that has a time limit","examples":[],"opposite":"","synonyms":""},{"def":"to suddenly make somebody stop by frightening or surprising them; to suddenly stop because something has frightened or surprised you","examples":["The question stopped Alice in her tracks.","Suddenly he stopped dead in his tracks: what was he doing?","(figurative) The disease was stopped in its tracks by immunization programmes."],"opposite":"","synonyms":""},{"def":"to suddenly stop, or make somebody suddenly stop, doing something","examples":["He stopped short when he heard his name.","‘I’m pregnant,’ she said. That stopped him short."],"opposite":"","synonyms":""},{"def":"to be unwilling to do something because it may involve a risk, but to nearly do it","examples":["She stopped short of calling the president a liar.","The protest stopped short of a violent confrontation."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"stop at nothing","def":"to be willing to do anything to get what you want, even if it is dishonest or wrong","examples":["She’ll stop at nothing to make money."]},{"idiom":"stop the clock","def":"to stop measuring time in a game or an activity that has a time limit","examples":[]},{"idiom":"stop/halt somebody in their tracks | stop/halt/freeze in your tracks","def":"to suddenly make somebody stop by frightening or surprising them; to suddenly stop because something has frightened or surprised you","examples":["The question stopped Alice in her tracks.","Suddenly he stopped dead in his tracks: what was he doing?","(figurative) The disease was stopped in its tracks by immunization programmes."]},{"idiom":"stop short | stop somebody short","def":"to suddenly stop, or make somebody suddenly stop, doing something","examples":["He stopped short when he heard his name.","‘I’m pregnant,’ she said. That stopped him short."]},{"idiom":"stop short of something/of doing something","def":"to be unwilling to do something because it may involve a risk, but to nearly do it","examples":["She stopped short of calling the president a liar.","The protest stopped short of a violent confrontation."]}],"phrasal":["stop by","stop in","stop off","stop out","stop over","stop up"],"related":["bus stop","non-stop","one-stop","pit stop","stop by","stop-go","stop in","stop off","stop out","stop up","tab stop","full stop","rest stop","stop over","stop light","stop-motion"]},{"pos":"noun","level":"A1","meanings":[{"def":"a place where a bus or train stops regularly for passengers to get on or off","examples":["I get off at the next stop.","Is this your stop?","Winchester will be the next station stop.","(North American English) Where's the nearest subway stop?","Piccadilly Circus is the next stop.","It's only a few stops on the subway.","I'm getting off at the last stop.","You're not allowed to get off between stops.","We were chatting and missed our stop.","The restaurant is only a few subway stops away.","The music shop was just three tram stops away from his flat."],"opposite":"","synonyms":""},{"def":"an act of stopping or stopping something; the state of being stopped","examples":["The trip included an overnight stop in Brussels.","We made several stops along the way.","She brought the car to a stop.","Work has temporarily come to a stop while the funding is reviewed.","It is time to put a stop to the violence.","They campaigned to put up a stop sign at the busy intersection outside the school.","Between twelve and two, everything comes to a dead stop.","He is making a campaign stop in Lubbock, Texas.","She brought the car to an abrupt stop.","The police found the drugs during a routine traffic stop.","The truck came to a sudden stop.","There will be a stop at Aboyne.","We had a lunch stop at Timperley.","a stop for refreshments","to put a stop to all the arguments","The flight took 15 hours including the refuelling stop.","The President made an unscheduled stop in Quebec on Monday.","After a brief stop, the bus set off again.","New York is the final stop on the band's international tour.","Please keep your seatbelts fastened until we've come to a complete stop.","They made a quick stop at a small roadside diner for supper."],"opposite":"","synonyms":""},{"def":"the mark ( . ) used at the end of a sentence and in some abbreviations, for example e.g.","examples":[],"opposite":"","synonyms":""},{"def":"a row of pipes on an organ that produce the different sounds","examples":[],"opposite":"","synonyms":""},{"def":"a handle on an organ that the player pushes in or pulls out to control the sound produced by the pipes","examples":[],"opposite":"","synonyms":""},{"def":"a speech sound made by stopping the flow of air coming out of the mouth and then suddenly releasing it, for example /p/, /k/, /t/","examples":[],"opposite":"","synonyms":""},{"def":"to stop completely","examples":["The car began to shudder and eventually came to a full stop in front of the church."],"opposite":"","synonyms":""},{"def":"frequently starting and stopping again; not continuously","examples":["Babies do not grow at a steady rate but in stops and starts."],"opposite":"","synonyms":""},{"def":"to make the greatest effort possible to achieve something","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"come to a full stop","def":"to stop completely","examples":["The car began to shudder and eventually came to a full stop in front of the church."]},{"idiom":"in stops and starts | by/in fits and starts","def":"frequently starting and stopping again; not continuously","examples":["Babies do not grow at a steady rate but in stops and starts."]},{"idiom":"pull out all the stops","def":"to make the greatest effort possible to achieve something","examples":[]}],"phrasal":[],"related":[]}]