[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sto/store/store__us_1.mp3","phonsUS":"/stɔːr/","level":"A2","meanings":[{"def":"a large shop that sells many different types of goods","examples":["It's available at London's three biggest stores."],"opposite":"","synonyms":""},{"def":"a shop, large or small","examples":["I'm going to the store.","His father opened a small grocery store.","Retail stores across Europe were reporting no stock left of the game.","You should be able to get it in any good health food store.","He looked around for a liquor store.","Buying store brands certainly works out cheaper.","Ralph Lauren's flagship store on Madison Avenue","The game will hit stores in January.","The company operates four stores in Maryland.","The company plans to open two new stores in Dublin.","The new book has been flying off store shelves.","The store offers a comprehensive line of auto parts.","You can buy music from an online store.","Ask at your local hardware store.","The chain has endured another terrible month at its high-street stores.","You can park on the street right outside the store."],"opposite":"","synonyms":""},{"def":"a website that sells things","examples":["an online store","You can get it on the app store."],"opposite":"","synonyms":""},{"def":"a quantity or supply of something that you have and use","examples":["her secret store of chocolate","a vast store of knowledge","your body's fat stores","Stores of blood sugar are metabolized to produce energy.","This is vital information to add to your store of knowledge."],"opposite":"","synonyms":""},{"def":"goods of a particular kind or for a particular purpose","examples":["medical stores","They had trouble keeping rats out of the food stores."],"opposite":"","synonyms":""},{"def":"a place where goods of a particular kind are kept","examples":["The grain store holds several thousand tonnes.","The soldiers were charged with guarding the weapons stores.","The mill ceased operations in 1940 and was used as a grain store.","You'll find a ladder in the equipment store.","We're using the shed as a temporary store for all our stuff."],"opposite":"","synonyms":""},{"def":"waiting to happen to somebody","examples":["We don't know what life holds in store for us.","If she had known what lay in store for her, she would never have agreed to go.","They think it'll be easy but they have a surprise in store."],"opposite":"","synonyms":""},{"def":"to be in charge of something for a short time while somebody is away","examples":["Who's minding the store while the boss is abroad?"],"opposite":"","synonyms":""},{"def":"to consider something to be important","examples":["She sets great store by her appearance.","It is unwise to put too much store by these statistics."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in store (for somebody)","def":"waiting to happen to somebody","examples":["We don't know what life holds in store for us.","If she had known what lay in store for her, she would never have agreed to go.","They think it'll be easy but they have a surprise in store."]},{"idiom":"mind the store","def":"to be in charge of something for a short time while somebody is away","examples":["Who's minding the store while the boss is abroad?"]},{"idiom":"set/put (great, etc.) store by something","def":"to consider something to be important","examples":["She sets great store by her appearance.","It is unwise to put too much store by these statistics."]}],"phrasal":[],"related":["in-store","store up","chain store","cold store","dark store","dime store","store-brand","store card","backing store","bottle store","general store","liquor store","package store","store-bought","store window","variety store","convenience store","department store","hardware store"]},{"pos":"verb","level":"B1","meanings":[{"def":"to put something somewhere and keep it there to use later","examples":["store something We do not have adequate space to store these documents.","store something away/up animals storing up food for the winter","He hoped the electronic equipment was safely stored away.","store something + adv/prep You can store coffee beans in the freezer to keep them fresh.","Specimens are stored at very low temperatures.","Butane can be conveniently stored as a liquid in a can.","The paintings were carefully stored in crates dependent on their size."],"opposite":"","synonyms":""},{"def":"to keep information or facts in a computer or in your brain","examples":["store something to store data/information","store something + adv./prep. Digital music files can be stored on your computer.","Thousands of pieces of data are stored in a computer's memory.","We are conducting research into how information is stored in the brain.","Each piece of information is stored in only one place in the database.","Each department has a different system for storing and retrieving data.","electronically stored information","Security restrictions control who can access the files and folders stored on the server."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["store up"],"related":[]}]