[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/str/strai/strain__us_1.mp3","phonsUS":"/streɪn/","level":"C1","meanings":[{"def":"pressure on a system or relationship because great demands are being placed on it","examples":["The transport service cannot cope with the strain of so many additional passengers.","under strain Their marriage is under great strain at the moment.","strain on something These repayments are putting a strain on our finances.","There are strains in the relationship between the two countries.","She was unable to attend because of the pressures of work.","stress-related illnesses","nervous tension","I found it a strain looking after four children.","After three years, their marriage was beginning to show signs of strain.","Increasing demand is placing undue strain on services."],"opposite":"","synonyms":"pressure"},{"def":"mental pressure or worry felt by somebody because they have too much to do or manage; something that causes this pressure","examples":["You will learn to cope with the stresses and strains of public life.","I found it a strain having to concentrate for so long.","Relax, and let us take the strain (= do things for you).","under strain Television newsreaders come under enormous strain.","After weeks of overtime, she was starting to feel the strain.","After weeks of uncertainty, the strain was beginning to take its toll.","He broke down under the strain of having to work twelve hours a day.","I found it a bit of a strain making conversation with her.","It's a real strain having to get up so early!","The internet takes the strain out of shopping.","The mental strain of sharing an office with Alison was starting to show.","the stresses and strains of a long day","I found it a strain looking after four children."],"opposite":"","synonyms":""},{"def":"the pressure that is put on something when a physical force stretches, pushes, or pulls it","examples":["under the strain The rope broke under the strain.","strain on something You should try not to place too much strain on muscles and joints.","The ground here cannot take the strain of a large building.","The cable has a 140kg breaking strain (= it will break when it is stretched or pulled by a force greater than this).","There's too much strain on the corner of the table.","a fishing line with a 15lb breaking strain","The ice gave way under the strain."],"opposite":"","synonyms":""},{"def":"an injury to a part of your body, such as a muscle, that is caused by using it too much or by twisting it","examples":["a calf/groin/leg strain","muscle strain","Sterling will play if he can shake off a slight thigh strain.","You'll get eye strain if you don't put the light on."],"opposite":"","synonyms":""},{"def":"a particular type of plant or animal, or of a disease caused by bacteria, etc.","examples":["a new strain of mosquitoes resistant to the poison","This is only one of the many strains of the disease.","H5N1 is a strain of avian influenza."],"opposite":"","synonyms":""},{"def":"a particular feature of the character of a person or group, or a quality in their manner","examples":["He had a definite strain of snobbery in him."],"opposite":"","synonyms":""},{"def":"the sound of music being played or sung","examples":["She could hear the strains of Mozart through the window.","He heard the familiar strains of a tango coming from the club."],"opposite":"","synonyms":""},{"def":"if a system or service creaks under the strain, it cannot deal effectively with all the things it is expected to do or provide","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"creak under the strain","def":"if a system or service creaks under the strain, it cannot deal effectively with all the things it is expected to do or provide","examples":[]}],"phrasal":[],"related":["eye strain","creak under the strain","strain at the leash","strain every nerve/sinew (to do something)","strain every sinew/nerve (to do something)"]},{"pos":"verb","level":"","meanings":[{"def":"to injure yourself or part of your body by making it work too hard","examples":["to strain a muscle","You’ll strain your back carrying those heavy suitcases.","He injured his knee playing hockey.","Three people were injured in the crash.","50 people were seriously wounded in the attack.","Did you hurt yourself?","Don’t strain your eyes by reading in poor light.","Are you sure you can carry all that? Don't strain yourself.","Don't strain your eyes by reading in poor light.","You'll strain your back carrying those heavy suitcases."],"opposite":"","synonyms":"injure"},{"def":"to make an effort to do something, using all your mental or physical strength","examples":["strain something to do something I strained my ears (= listened very hard) to catch what they were saying.","strain something Necks were strained for a glimpse of the stranger.","strain to do something People were straining to see what was going on.","strain (something) (for something) He burst to the surface, straining for air.","Bend gently to the left without straining.","I strained forward to get a better view.","Their ears strained for any slight sound.","We had to strain to hear what was being said.","You could see he was straining hard to understand."],"opposite":"","synonyms":""},{"def":"to try to make something do more than it is able to do","examples":["The sudden influx of visitors is straining hotels in the town to the limit.","His constant complaints were straining our patience.","The dispute has strained relations between the two countries (= made them difficult).","Her latest version of events strained their credulity still further.","Our public health laboratories are strained to (the) breaking point.","The company is already straining under the weight of a $12 billion debt.","The dispute severely strained relations between the two countries."],"opposite":"","synonyms":""},{"def":"to push hard against something; to pull hard on something","examples":["She strained against the ropes that held her.","The dogs were straining at the leash, eager to get to the park.","Several men were straining at a rope, trying to move the stalled vehicle.","The dogs were straining against the sled."],"opposite":"","synonyms":""},{"def":"to pour food, etc. through something with very small holes in it, for example a sieve, in order to separate the solid part from the liquid part","examples":["strain something Use a colander to strain the vegetables.","Strain the juice from the cherries into a small saucepan.","strain something off Strain off any excess liquid."],"opposite":"","synonyms":""},{"def":"to want to do something very much","examples":["Like all youngsters, he's straining at the leash to leave home."],"opposite":"","synonyms":""},{"def":"to try as hard as you can to do something","examples":["He strained every nerve to snatch victory from defeat."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"strain at the leash","def":"to want to do something very much","examples":["Like all youngsters, he's straining at the leash to leave home."]},{"idiom":"strain every nerve/sinew (to do something)","def":"to try as hard as you can to do something","examples":["He strained every nerve to snatch victory from defeat."]}],"phrasal":[],"related":[]}]