[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/str/strat/strategy__us_1.mp3","phonsUS":"/ˈstrætədʒi/","level":"A2","meanings":[{"def":"a plan that is intended to achieve a particular purpose","examples":["the government’s economic strategy","We need to devise an effective long-term strategy.","Often, individuals employ multiple coping strategies because one particular strategy is not sufficient","to adopt/implement/pursue a strategy","strategy for doing something to develop a strategy for dealing with unemployment","strategy to do something It's all part of an overall strategy to gain promotion.","A coherent strategy for getting more people back to work needs to be developed.","He pretended that resigning was part of his long-term career strategy.","Her rudeness was a deliberate strategy to provoke him.","It is certainly a strategy worth exploring.","The charity is drawing up a strategy to meet the needs of the homeless.","The committee drew up a draft strategy for dealing with future floods.","The company adopted aggressive marketing strategies to sell its products.","The company will now focus its strategy on its core business areas.","The company's financial strategy is not working.","The document sets out the government's new strategy.","The government has employed a dual strategy to achieve these two objectives.","The money is earmarked for the development of new product and sales strategies.","Their overall strategy is good, but one or two of the details could be improved.","Their single-minded pursuit of this controversial strategy led to their fall from power.","This strategy relies on property prices continuing to rise.","We all have different coping strategies for times of stress.","a comprehensive strategy towards regional development","a customer-oriented business strategy","a global marketing strategy","a key strategy to increase sales","a strategy aimed at reducing the risk of accidents","resource management strategies","the key idea in their strategy","the party's strategy on poverty","to develop an effective strategy for change","As a business strategy, this is unlikely to work.","The government has developed a strategy for dealing with regional unemployment.","Their overall strategy is quite good, but they need to change some of the details.","What strategies will you use to achieve this goal?","New product development strategies were presented to the committee.","This has been part of the Democratic Party campaign strategy.","Marketing techniques used to implement the strategies are provided.","They are trying to devise a strategy for preventing the disease.","Make good communications a key part of your strategy for success."],"opposite":"","synonyms":""},{"def":"the process of planning something or putting a plan into operation","examples":["Poor marketing strategy was blamed for the failure of the service to catch on.","The coming year may herald a change in strategy for major publishers.","The committee is meeting today in Washington to plot strategy.","They called a meeting to discuss investment strategy."],"opposite":"","synonyms":""},{"def":"the skill of planning the movements of armies in a battle or war; an example of doing this","examples":["military strategy","defence strategies","They're pursuing a strategy of massive retaliation.","a strategy game set during the Civil War","Agreeing to meet the rebels is obviously a high-risk strategy.","The army's strategy and tactics were highly aggressive."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["exit strategy","Department for Business, Energy and Industrial Strategy"]}]