[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/str/stret/stretch__us_1.mp3","phonsUS":"/stretʃ/","level":"B2","meanings":[{"def":"to make something longer, wider or looser, for example by pulling it; to become longer, etc. in this way","examples":["Is there any way of stretching shoes?","Stop stretching your sleeves like that!","This sweater has stretched."],"opposite":"","synonyms":""},{"def":"to become bigger or longer when you pull it and return to its original shape when you stop","examples":["The jeans stretch to provide a perfect fit."],"opposite":"","synonyms":""},{"def":"to pull something so that it is smooth and tight","examples":["stretch something (+ adv./prep.) Stretch the fabric tightly over the frame.","Striped awnings had been stretched across the courtyard.","stretch something + adj. Make sure that the rope is stretched tight."],"opposite":"","synonyms":""},{"def":"to put your arms or legs out straight and contract your muscles","examples":["He stretched and yawned lazily.","Andrea turned out the light and stretched full-length on the bed.","stretch something The exercises are designed to stretch and tone your leg muscles.","It was impossible to bend or stretch my legs."],"opposite":"","synonyms":""},{"def":"to put out an arm or a leg in order to reach something","examples":["+ adv./prep. She stretched across the table for the butter.","She stretched up to reach the top shelf.","stretch something + adv./prep. I stretched out a hand and picked up the book."],"opposite":"","synonyms":""},{"def":"to spread over an area of land","examples":["Fields and hills stretched out as far as we could see.","The traffic jam seemed to stretch for miles.","A line of cars stretched into the distance.","The flat landscape stretched to the horizon.","Beyond the mountains stretches a vast desert.","The beach seemed to stretch endlessly.","The road stretched ahead.","The wood does not stretch very far.","an area which stretches from London to the north"],"opposite":"","synonyms":""},{"def":"to continue over a period of time","examples":["The town's history stretches back to before 1500.","to stretch back years/decades/generations/centuries","The training stretches over a period of 16 months.","Endless summer days stretched out before us.","The talks look set to stretch into a second week.","The future stretched out endlessly in front of me."],"opposite":"","synonyms":""},{"def":"to be enough to buy or pay for something","examples":["I need a new car, but my savings won't stretch to it.","There are lots of things I’d like to buy, but our budget just won’t stretch that far."],"opposite":"","synonyms":""},{"def":"to make use of a lot of your money, supplies, time, etc.","examples":["The pandemic has stretched healthcare resources to the limit.","We can't take on any more work—we're fully stretched as it is.","The budget is already stretched to breaking point.","The influx of tourists in the summer stretches the capacity of local transport to its limit.","Our forces are too thinly stretched to control the chaos.","The increase in demand has severely stretched our resources.","Don't stretch yourself too thin financially.","This department is stretched to its limit."],"opposite":"","synonyms":""},{"def":"to increase your lead over somebody in a game or competition","examples":["A minute later, Kelly stretched their lead to eight points."],"opposite":"","synonyms":""},{"def":"to make use of all somebody’s skill, intelligence, etc.","examples":["I need a job that will stretch me.","She was never really stretched at school.","The book really stretches your imagination."],"opposite":"","synonyms":""},{"def":"to use something in a way that would not normally be considered fair, acceptable, etc.","examples":["He admitted that he had maybe stretched the truth a little (= not been completely honest).","The play's plot stretches credulity to the limit."],"opposite":"","synonyms":""},{"def":"to change the rules to suit a particular person or situation","examples":["Couldn't they just bend the rules and let us in without a ticket?"],"opposite":"","synonyms":""},{"def":"to go for a short walk after sitting for some time","examples":["It was good to get out of the car and stretch our legs."],"opposite":"","synonyms":""},{"def":"to allow or do something that is not usually acceptable, especially because of a particular situation","examples":["I was hoping they would stretch a point and let me stay on for a while."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"bend/stretch the rules","def":"to change the rules to suit a particular person or situation","examples":["Couldn't they just bend the rules and let us in without a ticket?"]},{"idiom":"stretch your legs","def":"to go for a short walk after sitting for some time","examples":["It was good to get out of the car and stretch our legs."]},{"idiom":"stretch a point","def":"to allow or do something that is not usually acceptable, especially because of a particular situation","examples":["I was hoping they would stretch a point and let me stay on for a while."]}],"phrasal":["stretch out","stretch yourself out"],"related":["stretch out","stretch limo","stretch marks","home stretch","stretch yourself out","stretch limos","stretch limousine","the home stretch","stretch out | stretch yourself out","stretch a point","at full stretch","stretch your legs","bend/stretch the rules","by no stretch of the imagination","not by any stretch of the imagination"]},{"pos":"noun","level":"B2","meanings":[{"def":"an area of land or water, especially a long one","examples":["a particularly dangerous stretch of road","There are tailbacks along a 10-mile stretch of the motorway.","an unspoilt stretch of coastline","You rarely see boats on this stretch of the river.","The festival is being held on a stretch of parkland near the river.","A narrow stretch of water separates the island from the mainland.","She looked at the long stretches of white sands.","a straight stretch of road","a wild uninhabited coastal stretch","an empty stretch of beach"],"opposite":"","synonyms":""},{"def":"a continuous period of time","examples":["They worked in four-hour stretches.","at a stretch She used to read for hours at a stretch (= without stopping).","He went through a tough stretch last year but things are better now.","She had been unhappy for long stretches of her life.","The summer vacation can seem like an awfully long stretch of time."],"opposite":"","synonyms":""},{"def":"a period of time that somebody spends in prison","examples":["He did a ten-year stretch for fraud."],"opposite":"","synonyms":""},{"def":"an act of stretching out your arms or legs or your body and pulling the muscles tight; the state of being stretched","examples":["We got out of the car and had a good stretch.","Only do these more difficult stretches when you are warmed up.","Stay in this position and feel the stretch in your legs.","First let's warm up by doing some stretches.","Have a good stretch from time to time to prevent yourself getting stiff.","Hold the stretch for a count of ten.","Her arms were at full stretch (= extended as far as possible)."],"opposite":"","synonyms":""},{"def":"the ability to be made longer or wider without breaking or tearing","examples":["You need a material with plenty of stretch in it.","stretch jeans"],"opposite":"","synonyms":""},{"def":"a straight part at the end of a racing track","examples":["the finishing stretch","(figurative) The campaign has entered its final stretch.","She felt a renewed burst of energy for the final stretch.","(figurative) The students have now entered the final stretch of their course."],"opposite":"","synonyms":""},{"def":"using as much energy as possible, or the greatest possible amount of supplies","examples":["Fire crews have been operating at full stretch."],"opposite":"","synonyms":""},{"def":"used to say strongly that something is not true, even if you try to imagine or believe it","examples":["She could not, by any stretch of the imagination, be called beautiful.","By no stretch of the imagination could the trip be described as relaxing."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"at full stretch","def":"using as much energy as possible, or the greatest possible amount of supplies","examples":["Fire crews have been operating at full stretch."]},{"idiom":"not by any stretch of the imagination | by no stretch of the imagination","def":"used to say strongly that something is not true, even if you try to imagine or believe it","examples":["She could not, by any stretch of the imagination, be called beautiful.","By no stretch of the imagination could the trip be described as relaxing."]}],"phrasal":[],"related":[]}]