[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/str/stree/street__us_1.mp3","phonsUS":"/striːt/","level":"A1","meanings":[{"def":"a public road in a city or town that has houses and buildings on one side or both sides","examples":["along/down/up the street I was just walking along the street when it happened.","She lives just up the street here.","across the street The bank is just across the street.","in the street He is used to being recognized in the street.","Workers took to the streets in protest.","It's not safe to walk the streets at night.","It's a medieval town, with narrow cobbled streets.","a crowded/residential/quiet/deserted street","92nd Street","10 Downing Street","You can find these shops on every street corner.","The council promised better street lighting and cleaner streets.","a street map/plan of York","My office is at street level (= on the ground floor).","a street map of London.","Oxford Street","Mile End Road.","the shoe shop in the High Street","high street shops.","A couple were arguing out in the street.","Crowds thronged the streets.","Dead bodies littered the streets.","Gangs roamed the streets at night.","He could see her across the street.","He grew up on the mean streets of one of the city's toughest areas.","He suffered extensive injuries in a street attack.","He wandered through the streets of Calcutta.","He works at a small store on Main Street.","I was living on 10th Street off Hudson.","It really irritates me when people ride bicycles in pedestrian streets.","Most local people support the idea of traffic-free streets.","Most street names were changed under the new regime.","Mozart is remembered by a street named after him.","Police were told to clear the streets of drug dealers before the Olympics.","She parks her car in the street.","She stepped out into the street.","Spectators lined the streets.","Take the second street on the right after the bridge.","The police have been patrolling the streets in this area since the murder.","The shops had no street numbers on.","The streets are teeming with traffic.","The streets were packed with people shopping.","There were photographers outside the street door so she used a back entrance.","There's a chemist's just up the street.","They walked along the street.","Thousands of people were out on the streets for the protest.","We live in Barker Street.","You've taken the wrong street.","a club just off William Street","a painting of a typical Parisian street scene","a plan to keep teenagers off the streets","people dealing drugs on the street","street fighting between police and stone-throwing youths","streets lined with cafes","the dense street pattern of the old town","the town's main shopping street","Do you have a street plan of the town?","I met him by chance in the street.","I spotted her on the other side of the street.","I walked up the street as far as the post office.","The streets are very busy at this time of year.","narrow winding streets","Many people just walk into the gallery off the street.","She looked out over the busy city streets.","a one-way street","a street sign","She crossed the street to avoid him.","It was time to take the political struggle onto the streets (= by protesting in large groups in the streets of a city)."],"opposite":"","synonyms":""},{"def":"the ideas and opinions of ordinary people, especially people who live in cities, which are considered important","examples":["The feeling I get from the street is that we have a good chance of winning this election.","The word on the street is that it's not going to happen.","Opinion on the street was divided."],"opposite":"","synonyms":""},{"def":"an average or ordinary person, either male or female","examples":["Politicians often don't understand the views of the man in the street.","What really matters to the man and woman in the street?"],"opposite":"","synonyms":""},{"def":"enjoying a comfortable way of life with plenty of money","examples":[],"opposite":"","synonyms":""},{"def":"without a home; outside, not in a house or other building","examples":["the problems of young people living on the streets","If it had been left to me I would have put him out on the street long ago.","She was thrown onto the street."],"opposite":"","synonyms":""},{"def":"working as a prostitute","examples":[],"opposite":"","synonyms":""},{"def":"much better or more advanced than somebody/something else","examples":["a country that is streets ahead in the control of environmental pollution","Beth is streets ahead of all the other students in her year."],"opposite":"","synonyms":""},{"def":"used to say that it seems easy to make money in a place","examples":[],"opposite":"","synonyms":""},{"def":"very suitable for you because it is something that you know a lot about or are very interested in","examples":["This job seems right up your street."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the man (and/or woman) in the street","def":"an average or ordinary person, either male or female","examples":["Politicians often don't understand the views of the man in the street.","What really matters to the man and woman in the street?"]},{"idiom":"on easy street","def":"enjoying a comfortable way of life with plenty of money","examples":[]},{"idiom":"(out) on/onto the streets/street","def":"without a home; outside, not in a house or other building","examples":["the problems of young people living on the streets","If it had been left to me I would have put him out on the street long ago.","She was thrown onto the street."]},{"idiom":"on/walking the streets","def":"working as a prostitute","examples":[]},{"idiom":"streets ahead (of somebody/something)","def":"much better or more advanced than somebody/something else","examples":["a country that is streets ahead in the control of environmental pollution","Beth is streets ahead of all the other students in her year."]},{"idiom":"the streets are paved with gold","def":"used to say that it seems easy to make money in a place","examples":[]},{"idiom":"(right) up your street","def":"very suitable for you because it is something that you know a lot about or are very interested in","examples":["This job seems right up your street."]}],"phrasal":[],"related":["on-street","Bond Street","Bow Street","42nd Street","Grub Street","high street","main street","off-street","side street","stop street","street cred","Wall Street","Baker Street","Basin Street","Beale Street","Civvy Street","cross street","Ermine Street","Fleet Street"]},{"pos":"adjective","level":"","meanings":[{"def":"working, living or taking place on the streets of a city; based on the daily life of ordinary people in cities","examples":["street vendors selling fruit, snacks and local handicrafts","street musicians","street kids","angry street protests/demonstrations","street sports such as skateboarding and skating","street newspapers sold by people who are homeless","street culture/dance/law","Street sport is informal and based on whatever people want to play.","He pleaded guilty to illegal street trading.","the street culture of working-class youth","The charity is having a street collection in aid of the local hospital.","people engaged in informal street selling","Tourists need to be wary of street hustlers near the station.","The show is about two rival street gangs in Manhattan.","Violent street crime has become an epidemic."],"opposite":"","synonyms":""},{"def":"showing or connected with the attitude and way of life of fashionable young people in cities","examples":["London street style","You're not very street in those old trainers."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]