[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/str/stren/strength__us_1_rr.mp3","phonsUS":"/streŋkθ/","level":"B1","meanings":[{"def":"the quality of being physically strong","examples":["He pushed against the rock with all his strength.","It may take a few weeks for you to build up your strength again.","She gradually regained strength in her legs.","He had a physical strength that matched his outward appearance.","strength to do something She didn't have the strength to walk any further.","He got the door open with brute strength.","He had just enough strength to reach for the phone.","She threw the rope with all her strength.","The series of steep hills sapped the cyclists' strength.","The Moroccan athlete ran a fast lap to test the strength of the other runners.","She summoned up every ounce of strength she possessed.","She pushed him away with unexpected strength.","It's well known that cycling builds leg strength.","It took all his strength to open the box.","I'm trying to summon up the strength to do some more work.","I'm still not quite back to full strength after my illness.","His superior physical strength won him the title.","They believe their combined strength will overwhelm the competition.","Her strength was ebbing fast, so her children were called to her bedside.","He used to entertain people with his feats of strength.","The fitness program will help you maintain your strength and endurance.","Pilates will build up muscle strength.","These exercises are a great way to increase strength while maintaining flexibility.","Older adults need strength training to keep their muscle mass and their bone density.","Bicep curls develop arm strength."],"opposite":"weakness","synonyms":""},{"def":"the ability that something has to resist force or hold heavy weights without breaking or being damaged","examples":["the strength of a rope","The panels are reinforced with steel for extra strength.","The steel adds tensile strength to the concrete.","The metal reinforcement gives it the strength to resist the high winds.","The material has exceptionally high strength for its weight.","The shape provides maximum size and strength, using minimum steel."],"opposite":"","synonyms":""},{"def":"the quality of being brave and determined in a difficult situation","examples":["During this ordeal he was able to draw strength from his faith.","She has a remarkable inner strength.","You have shown great strength of character.","My childhood memories were a great source of strength to me after my parents died.","Their reaction was so encouraging it gave me the strength to carry on.","She was able to draw on her immense inner strength.","I draw great strength from the support of my family.","When she had twins, she discovered reserves of strength that she didn't know she had.","Her love and support gave me the strength and the courage to persevere.","He put all his strength into reorganizing the department.","She took strength from the amount of people who turned up to the funeral.","Thank you for being such a pillar of strength.","After she died, I found strength in so many small things.","The situation tested the strength of her faith.","“Give me strength!” she said under her breath."],"opposite":"weakness","synonyms":""},{"def":"the power and influence that somebody/something has","examples":["Political power depends upon economic strength.","Their superior military strength gives them a huge advantage.","to negotiate from a position of strength","The rally was intended to be a show of strength by the socialists.","The country's economic strength is declining.","Today's vote is being seen as a test of strength for the government.","Her unwillingness to answer questions undermined the strength of her position.","The dispute developed into a trial of strength between management and the union.","The party are gaining political strength.","Consumer price falls will depend on the strength and speed of the economic recovery.","The film has a power and strength that gets you involved in the story.","The prosecution lawyer emphasized the strength of the evidence against him."],"opposite":"weakness","synonyms":""},{"def":"how strong or deeply felt an opinion or a feeling is","examples":["the strength of public opinion","This view has recently gathered strength (= become stronger or more widely held).","I was surprised by the strength of her feelings.","I have been overwhelmed by the strength of feeling that people have about this issue.","The opinion that the president should stand down has gained considerable strength.","The council should be aware of the strength of public opinion on homelessness."],"opposite":"","synonyms":""},{"def":"a quality or an ability that a person or thing has that gives them an advantage","examples":["The ability to keep calm is one of her many strengths.","the strengths and weaknesses of an argument","The new weapon's strength lies in its accuracy.","Consider all the strengths and weaknesses of the argument.","What's your greatest strength?","We want to learn more about the relative strengths of our students.","Her great strength lies in her flexibility.","The company's key strength is its people.","The team may not have the best players, but it plays to its strengths.","Her strength as an architect is in building design.","Each song shows the tremendous strength of the band."],"opposite":"weakness","synonyms":""},{"def":"how strong a natural force or a signal is","examples":["the strength of the sun","wind strength","the strength and direction of the tide","The phone company aims to improve signal strength within buildings."],"opposite":"","synonyms":""},{"def":"how strong a particular taste or substance is","examples":["Add more curry powder depending on the strength required.","a range of beers with different strengths (= with different amounts of alcohol in them)","a packet of double-strength mints","These wines vary in strength between 11° and 15°."],"opposite":"","synonyms":""},{"def":"how strong a country’s currency is in relation to other countries’ currencies","examples":["the relative strength of the euro against the dollar","The euro has continued to gain strength.","the continuing strength of the pound"],"opposite":"weakness","synonyms":""},{"def":"the number of people in a group, a team or an organization","examples":["The strength of the workforce is about to be doubled from 3 000 to 6 000.","The team will be back at full strength (= with all the best players) for the next match.","up to strength The Korean team was not up to strength for the final.","in strength The protesters turned out in strength (= in large numbers).","under/below strength These cuts have left the local police force under strength (= with fewer members than it needs).","the numerical strength of the Chinese army","US troop strength in Afghanistan dropped to 18 000.","The orchestra was at full strength for the Mahler symphony.","Injuries meant that the Dutch team was below strength for the final.","The Chilean team was below strength for the final."],"opposite":"","synonyms":""},{"def":"to become more and more successful","examples":["Since her appointment the department has gone from strength to strength."],"opposite":"","synonyms":""},{"def":"because somebody has been influenced or persuaded by something","examples":["I got the job on the strength of your recommendation.","She hopes to secure a recording contract on the strength of these songs."],"opposite":"","synonyms":""},{"def":"the quality of being strong because you have a great variety of good people, ideas, etc. that can contribute to the success of something","examples":["The French team does not have the strength in depth that the Australians have."],"opposite":"","synonyms":""},{"def":"being in a group gives you more power","examples":["There's strength in numbers, so encourage your friends and family to join us."],"opposite":"","synonyms":""},{"def":"a person that you can rely on to help, protect and comfort you when you are in trouble","examples":["He was a tower of strength to his sisters when their father died."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"go from strength to strength","def":"to become more and more successful","examples":["Since her appointment the department has gone from strength to strength."]},{"idiom":"on the strength of something","def":"because somebody has been influenced or persuaded by something","examples":["I got the job on the strength of your recommendation.","She hopes to secure a recording contract on the strength of these songs."]},{"idiom":"strength in depth","def":"the quality of being strong because you have a great variety of good people, ideas, etc. that can contribute to the success of something","examples":["The French team does not have the strength in depth that the Australians have."]},{"idiom":"there's strength in numbers","def":"being in a group gives you more power","examples":["There's strength in numbers, so encourage your friends and family to join us."]},{"idiom":"a tower of strength","def":"a person that you can rely on to help, protect and comfort you when you are in trouble","examples":["He was a tower of strength to his sisters when their father died."]}],"phrasal":[],"related":["industrial-strength","strength in depth","there's strength in numbers"]}]