[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/str/strea/stream__us_1.mp3","phonsUS":"/striːm/","level":"B2","meanings":[{"def":"a small, narrow river","examples":["a mountain stream","We waded across a shallow stream.","Our rivers and streams are polluted with a host of chemicals.","The stream flows through a narrow valley.","There are small fish in the stream.","We picnicked beside a bubbling stream.","a leaf floating on the stream","Many underground streams flow beneath the forest.","We waded across a little mountain stream."],"opposite":"","synonyms":""},{"def":"a continuous flow of liquid or gas","examples":["a jet stream","stream of something A stream of blood flowed from the wound.","He blew out a stream of cigar smoke.","Giant turbines blast a stream of air into the tube.","The stream of hot water hit the bottom of the bath."],"opposite":"","synonyms":""},{"def":"a continuous flow of people or vehicles","examples":["stream of something/somebody I've had a steady stream of visitors.","a continuous stream of people/traffic","in a stream Cars filed past in an endless stream."],"opposite":"","synonyms":""},{"def":"a continuous supply of something; a large number of things that happen one after the other","examples":["By licensing their works, artists can create an ongoing revenue stream.","The building needs to produce an income stream for the company.","stream of something The agency provided me with a steady stream of work.","a constant stream of enquiries","Most of the letter consisted of a stream of abuse.","He let loose a stream of insults and obscenities.","She had to deal with a constant stream of enquiries.","She was able to play streams of difficult notes with extreme accuracy.","There were endless streams of mail which could not all be read.","a constant stream of letters","The computer generates a steady stream of emails.","He let loose a stream of abuse.","We have established several different streams of funding."],"opposite":"","synonyms":""},{"def":"a continuous flow of video or sound sent over the internet; a continuous flow of computer data or instructions","examples":["You can listen to the live audio stream."],"opposite":"","synonyms":""},{"def":"a group of students of the same age and level of ability in some schools","examples":["She was put into the fast stream.","Children who find themselves in the bottom stream feel discouraged.","He was put into the top stream."],"opposite":"","synonyms":""},{"def":"to be in operation or available","examples":["The new computer system comes on stream next month."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be/come on stream","def":"to be in operation or available","examples":["The new computer system comes on stream next month."]}],"phrasal":[],"related":["jet stream","live stream","live-stream","revenue stream","Gulf Stream","stream of consciousness","the jet stream"]},{"pos":"verb","level":"","meanings":[{"def":"to move or pour out in a continuous flow; to produce a continuous flow of liquid or gas","examples":["(+ adv./prep.) Tears streamed down his face.","a streaming cold (= with a lot of liquid coming from the nose)","Stay away—I've got a streaming cold.","Sunlight streamed through the windows.","stream with something Her head was streaming with blood.","stream from something Blood was streaming from her head.","Black smoke streamed from the exhaust.","stream something The exhaust streamed black smoke."],"opposite":"","synonyms":""},{"def":"to move somewhere in large numbers, one after the other","examples":["People streamed across the bridge.","The refugees streamed north to the border.","He stared out of the window at the cars streaming along the street."],"opposite":"","synonyms":""},{"def":"to move freely, especially in the wind or water","examples":["Her scarf streamed behind her.","She was walking by the sea, her fair hair streaming."],"opposite":"","synonyms":""},{"def":"to put school students into groups according to their ability","examples":["be streamed (for something) Pupils are streamed for French and maths."],"opposite":"","synonyms":""},{"def":"to play video or sound on a computer by receiving it as a continuous stream, from the internet for example, rather than needing to wait until the whole of the material has been downloaded","examples":["You can stream the song for a single listen.","The programme was streamed on the Web 24 hours a day."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]