[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/str/stres/stress__us_1.mp3","phonsUS":"/stres/","level":"A2","meanings":[{"def":"pressure or worry caused by the problems in somebody’s life","examples":["emotional/mental stress","to suffer from stress","to relieve/reduce/alleviate stress","under stress Things can easily go wrong when people are under stress.","The incident has caused enormous stress and anxiety to my family.","She failed to withstand the stresses and strains of public life.","stress-related illnesses","stress management (= dealing with stress)","The release of the stress hormone cortisol is part of the human stress response.","Stress is often a factor in the development of long-term sickness.","She was unable to attend because of the pressures of work.","stress-related illnesses","nervous tension","I found it a strain looking after four children.","An overcrowded workplace can be a major source of stress.","He broke under stress and had to leave.","He's been under a lot of stress lately.","He's had to give up his job as leader of the project—he just couldn't take the stress.","Many workers experience a high level of stress in their daily life.","Physical exercise is a great stress reliever.","Separation is a time of high emotional stress.","Staff are encouraged to go on stress management courses.","The high mortgage payments put them under severe financial stress.","The program helps workers with work-related and family stress.","There are many things an employer can do to ease employees' stress.","Tiredness is one of the most common symptoms of stress.","an illness brought on by stress","compensation claims for undue stress in the workplace","high stress levels","the daily stress of teaching"],"opposite":"","synonyms":"pressure"},{"def":"physical pressure put on something that can damage it or make it lose its shape","examples":["stress on something When you have an injury you start putting stress on other parts of your body.","Little is known about the effects of water stress on plants.","The building was condemned because of the damage caused by excessive heat stress.","Different organisms react differently to environmental stress (= damage to the environment caused by human activity or natural events).","a stress fracture of the foot (= one caused by such pressure)","Avoid exercise that puts undue stress on the knees.","Cycling puts very little stress on the joints.","Engineers calculated the stresses borne by each of the bridge supports.","He was diagnosed with a stress fracture in his right foot.","Some woods warp under stress.","Standing all day puts stress on your feet.","Stress is applied to the wood to make it bend.","The buttresses are subjected to constant stress.","The majority of sports injuries are due to excessive mechanical stress on joints, ligaments and muscles.","The movements set up stresses in the earth's crust.","The tower exerts an enormous stress on the walls.","There is equal stress on all parts of the structure."],"opposite":"","synonyms":""},{"def":"an extra force used when pronouncing a particular word or syllable","examples":["We worked on pronunciation, stress and intonation.","stress on something There's a stress on the second syllable.","In ‘strategic’ the stress falls on the second syllable","Where does the stress fall in ‘psychological’?","The first syllable takes the stress.","Mark the primary stress in each word.","Italian words usually have the main stress on the penultimate syllable in the word."],"opposite":"","synonyms":""},{"def":"special importance given to something","examples":["She lays great stress on punctuality.","I think the company places too much stress on cost and not enough on quality.","There's been a lot of stress on getting drug sellers off the streets.","a study of child development, with the stress on acquisition of social skills","I must lay great stress on the need for secrecy."],"opposite":"","synonyms":""},{"def":"extra force used when making a particular sound in music","examples":[],"opposite":"","synonyms":""},{"def":"illness caused by difficult physical conditions","examples":["Those most vulnerable to heat stress are the elderly."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["de-stress","stress mark","stress-timed","primary stress","secondary stress","post-traumatic stress disorder"]},{"pos":"verb","level":"A2","meanings":[{"def":"to give extra force to a word or syllable when saying it","examples":["You stress the first syllable in ‘happiness’.","They might (and I stress the word 'might') do the right thing the next time.","You stress the first syllable in ‘happiness’.","‘Let nothing … nothing,’ he emphasized the word, ‘tempt you.’"],"opposite":"","synonyms":"stress"},{"def":"to emphasize a fact, an idea, etc.","examples":["stress something He stressed the importance of a good education.","She stressed the need for cooperation with the authorities.","She is at pains to stress the cultural differences between the two countries.","stress that… I must stress that everything I've told you is strictly confidential.","I can't stress enough that security is of the highest importance.","+ speech ‘There is,’ Johnson stressed, ‘no real alternative.’","it is stressed that… It must be stressed that this disease is very rare.","stress how, what, etc. I cannot stress too much how important this is.","Doctors have rightly stressed the importance of exercise.","He stressed the point very strongly that all these services cost money.","I must stress that we still know very little about this disease.","It is worth stressing that this was only a relatively small survey.","Private schools tend to stress the more academic subjects.","She has constantly stressed the government's poor record in this area.","I want to stress how important this work is.","Observers stressed the necessity for the ceasefire to be observed.","He was keen to stress the importance of physical exercise.","Health officials have repeatedly stressed that the virus appears to be relatively mild."],"opposite":"","synonyms":""},{"def":"to become or make somebody become too anxious or tired to be able to relax","examples":["I just need to get some sleep and stop stressing.","stress out I try not to stress out when things go wrong.","stress somebody (out) Driving in cities really stresses me (out)."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]