[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/str/strip/strip__us_1.mp3","phonsUS":"/strɪp/","level":"C1","meanings":[{"def":"a long narrow piece of paper, metal, cloth, etc.","examples":["a strip of material","Cut the meat into strips.","The wallpaper can then be torn off in strips.","a card with a magnetic strip on the back","Cut a strip of paper 12cm wide.","His hands were tied behind his back with a strip of fabric.","a narrow strip of leather","grilled chicken strips"],"opposite":"","synonyms":""},{"def":"a long narrow area of land, sea, etc.","examples":["the Gaza Strip","a tiny strip of garden","The islands are separated by a narrow strip of water."],"opposite":"","synonyms":""},{"def":"the uniform that is worn by the members of a sports team when they are playing","examples":["Juventus in their famous black and white strip","the team’s away strip (= that they use when playing games away from home)"],"opposite":"","synonyms":""},{"def":"an act of taking your clothes off, especially in a sexually exciting way and in front of an audience","examples":["to do a strip","a strip show"],"opposite":"","synonyms":""},{"def":"a street that has many shops, stores, restaurants, etc. along it","examples":["Sunset Strip"],"opposite":"","synonyms":""},{"def":"a series of drawings inside boxes that tell a story and are often published in newspapers","examples":[],"opposite":"","synonyms":""},{"def":"to speak angrily to somebody who has done something wrong","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"tear somebody off a strip | tear a strip off somebody","def":"to speak angrily to somebody who has done something wrong","examples":[]}],"phrasal":[],"related":["comic strip","Strip","strip club","strip light","strip mall","landing strip","Möbius strip","Moebius strip","nature strip","rumble strip","strip cartoon","strip-farming","strip mining","strip search","strip-search","bimetallic strip","magnetic strip","strip lighting"]},{"pos":"verb","level":"C1","meanings":[{"def":"to take off all or most of your clothes or another person’s clothes","examples":["I stripped and washed myself all over.","They ordered us to strip and lie down on the grass.","strip down to something She stripped down to her underwear.","strip (something) off We stripped off and ran down to the water.","She stripped off her clothes and got into bed.","strip somebody (to something) He stood there stripped to the waist (= he had no clothes on the upper part of his body).","strip somebody + adj. He was stripped naked and left in a cell.","Office workers stripped down to their shirtsleeves in the heatwave.","He stripped off his shirt."],"opposite":"","synonyms":""},{"def":"to take off your clothes as a form of entertainment; to perform a striptease","examples":[],"opposite":"","synonyms":""},{"def":"to remove a layer from something, especially so that it is completely exposed","examples":["strip something (off) Strip off all the existing paint.","After the guests had gone, I stripped all the beds (= removed all the sheets in order to wash them).","strip A off/from B Deer had stripped all the bark off the tree.","strip B of A Deer had stripped the tree of its bark."],"opposite":"","synonyms":""},{"def":"to remove all the things from a place and leave it empty","examples":["strip something (out) We had to strip out all the old wiring and start again.","strip something away First, you need to strip away all the old plaster.","(figurative) The movie aims to strip away the lies surrounding Kennedy's life.","strip something + adj. Thieves had stripped the house bare."],"opposite":"","synonyms":""},{"def":"to separate a machine, etc. into parts so that they can be cleaned or repaired","examples":["He strips and cleans his rifle every morning.","They taught us how to strip down a car engine and put it back together again."],"opposite":"","synonyms":""},{"def":"to take away property or honours from somebody, as a punishment","examples":["He was disgraced and stripped of his title.","The president had been completely stripped of power."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]