[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/str/strug/struggle__us_2.mp3","phonsUS":"/ˈstrʌɡl/","level":"B2","meanings":[{"def":"to try very hard to do something when it is difficult or when there are a lot of problems","examples":["life as a struggling artist (= one who is very poor)","struggle for something Shona struggled for breath.","a country struggling for independence","struggle to do something The firm is struggling to cope with the demand for its products.","Local workers were still struggling to find employment.","Most social enterprises struggle to survive.","We're already struggling to keep up with demand.","They struggled just to pay their bills.","She struggled for 10 years to achieve success as an actress.","I was unemployed and struggling financially.","The housing market continues to struggle.","For years, she struggled to make ends meet.","He was really struggling in geometry.","I'm really struggling with this essay.","The family struggled through the next few years.","The team struggled badly last season.","They had struggled valiantly to keep the railway operating.","He struggled desperately to get to the shore.","He struggled hard to keep the boat upright."],"opposite":"","synonyms":""},{"def":"to move somewhere or do something with difficulty","examples":["I struggled up the hill with the heavy bags.","Paul struggled out of his wheelchair.","She had to struggle into the tight dress.","She struggled to her feet and set off after him.","The small boat struggled against the waves."],"opposite":"","synonyms":""},{"def":"to fight against somebody/something in order to prevent a bad situation or result","examples":["Chloe continued to struggle, but her eyes began to close.","struggle against somebody/something He struggled against cancer for two years.","We should all struggle against injustice.","struggle with somebody/something I have been struggling with injury for a couple of years","I am struggling with the same issues that other people are.","Lisa struggled with her conscience before talking to the police."],"opposite":"","synonyms":""},{"def":"to fight somebody or try to get away from them","examples":["I struggled and screamed for help.","struggle with somebody James was hit in the mouth as he struggled with the raiders.","+ adj. How did she manage to struggle free?","She struggled furiously but could not get away.","She struggled against her attacker."],"opposite":"","synonyms":""},{"def":"to compete or argue with somebody/something, especially in order to get something","examples":["struggle for something rival leaders struggling for power","struggle with somebody/something (for something) countries struggling with each other for economic and military advantage","The two men struggled for control of the party.","The firms are struggling for market share."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["struggle along","struggle on"],"related":["struggle on","class struggle","struggle along"]},{"pos":"noun","level":"B2","meanings":[{"def":"a hard fight in which people try to obtain or achieve something, especially something that somebody else does not want them to have","examples":["Marx wrote about the class struggle.","She played a very important role during the freedom struggle.","struggle for something a struggle for independence","Three teams are locked in a struggle for this year's title.","struggle against something They took up the struggle against racism.","struggle with something her struggle with cancer","struggle (with somebody) (to do something) He is engaged in a bitter struggle with his rival to get control of the company.","struggle between A and B an ongoing power struggle between president and prime minister","the struggle between good and evil","She will not give up her children without a struggle.","the campaign for parliamentary reform","an advertising campaign","She finally won the legal battle for compensation.","the endless battle between man and nature","the struggle for independence","the struggle between good and evil","the drive for greater efficiency","a drive to reduce energy consumption","the war against crime","Workers won their fight to stop compulsory redundancies.","I've given up the struggle to keep my house clean.","The UN supported what it saw as the just struggle of an oppressed people.","The author illustrates the inner struggles of this complicated woman.","a struggle over the property","species engaged in a life-or-death struggle with the environment","the daily struggle for survival","the long struggle for democracy","the struggle against fascism","a leadership struggle"],"opposite":"","synonyms":"campaign"},{"def":"a physical fight between two people or groups of people, especially when one of them is trying to escape, or to get something from the other","examples":["There were no signs of a struggle at the murder scene.","After a short struggle, I managed to get the knife away from him.","struggle with somebody He was involved in a struggle with the police.","struggle against somebody The group supported the armed struggle against the dictator.","He got into a fight with a man in the bar.","Clashes broke out between police and demonstrators.","a drunken brawl in a bar","There were no signs of a struggle at the murder scene.","He was involved in a scuffle with a photographer.","If someone snatched your bag, would you put up a struggle?","One of the guards was hurt in the struggle.","There were the sounds of a desperate struggle."],"opposite":"","synonyms":"fight"},{"def":"something that is difficult for you to do or achieve","examples":["struggle to do something It was a real struggle to be ready on time.","They face an uphill struggle to get to the finals of the competition.","It was a bit of a struggle for me to get there so early.","It will be an uphill struggle to maintain exports at the current level.","We had a real struggle to get everything into the suitcase."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]