[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/stu/study/study__us_2.mp3","phonsUS":"/ˈstʌdi/","level":"A1","meanings":[{"def":"the activity of learning or gaining knowledge, either from books or by examining things in the world","examples":["a room set aside for private study","academic/literary/scientific study","It is important to develop good study skills.","Physiology is the study of how living things work.","Now that her children are all at school, she's going to take up full-time study again.","Students do a foundation year before specializing in their chosen field of study.","The course integrates academic study and practical training.","This grammar book is suitable both for classroom use and for independent study.","The scientific study of American dialects began in 1889.","The company allows its staff to take paid study leave.","A study group meets every Sunday at the church.","This work is the result of decades of study and research.","Students have great opportunities through study abroad and internship programs."],"opposite":"","synonyms":""},{"def":"a particular person’s learning activities, for example at a college or university","examples":["to continue your studies","Many undertake further studies after college.","She returned to her studies when her children reached school age.","When he has completed his studies, he'll travel around the world.","He needed more leisure to pursue his studies."],"opposite":"","synonyms":""},{"def":"used in the names of some academic subjects","examples":["business/media/American studies","He lectures in management studies.","She's doing women's studies at Liverpool University.","the university's cultural studies course"],"opposite":"","synonyms":""},{"def":"a piece of research that examines a subject or question in detail","examples":["to conduct/undertake a study","Research studies carried out in Italy confirmed the theory.","study on something He has recently done a study on the effects of traffic and aircraft noise.","study of something a detailed study of how animals adapt to their environment","scientific studies of fishing grounds and methods of fishing","This study shows/finds/suggests that…","the purpose/aim of a study","the results/findings of a study","in a study the methods used in the present study","in previous/earlier studies","according to a study According to a recent study published in the Journal of Sleep Research…","A new study shows that fewer students are studying science.","A preliminary study suggested that the product would be popular.","An independent study was commissioned by the department.","He has made a special study of the way that birds communicate with one another.","In a recent study, 40% of schools were found to be understaffed.","The company undertook an extensive feasibility study before adopting the new system.","The present study reveals an unacceptable level of air pollution in the city centre.","The study aims to examine bias in television news coverage.","The study compares the incidence of bone cancer in men and women.","The study group was selected from a broad cross section of the population.","The study highlighted three problem areas.","The study provided valuable insight into the development of the disease.","The ten-year study covered 13 000 people aged 15-25.","This phenomenon has been observed in both laboratory and field studies.","A comparative study was carried out into the environmental costs of different energy sources.","They undertook a study of a sample of 992 first year students in 13 secondary schools.","Most previous studies have focused on the elderly.","Clinical studies show that adding calcium to your diet can help people lose weight.","Animal studies have linked the chemical to certain cancers.","According to the study, respondents preferred the strawberry-flavoured drink.","Studies conducted in Iowa have produced similar results.","In a study of 400 patients, half of those given the medication saw the number of their headaches halved.","Study participants developed no major side effects."],"opposite":"","synonyms":""},{"def":"an academic book or article on a particular topic","examples":["a study of Jane Austen's novels","Shakespeare is the subject of a new study by Anthony Bryan."],"opposite":"","synonyms":""},{"def":"the act of considering or examining something in detail","examples":["These proposals deserve careful study.","under study the biochemical process under study"],"opposite":"","synonyms":""},{"def":"a room, especially in somebody’s home, used for reading and writing","examples":["She crossed the hallway and opened the door to her private study."],"opposite":"","synonyms":""},{"def":"a drawing or painting of something, especially one done for practice or before doing a larger picture","examples":["a study of Chartres Cathedral","a nude study"],"opposite":"","synonyms":""},{"def":"the act of showing or describing somebody/something in literature or another art form, especially a character or an aspect of behaviour","examples":["The novel is a character study of a city and its people."],"opposite":"","synonyms":""},{"def":"a piece of music designed to give a player practice in technical skills","examples":[],"opposite":"","synonyms":""},{"def":"a perfect example of something","examples":["His face was a study in concentration."],"opposite":"","synonyms":""},{"def":"thinking deeply so that you do not notice what is happening around you","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in a brown study","def":"thinking deeply so that you do not notice what is happening around you","examples":[]}],"phrasal":[],"related":["case study","self-study","study hall","study bedroom","time-and-motion study","Institute for Advanced Study","in a brown study"]},{"pos":"verb","level":"A1","meanings":[{"def":"to spend time learning about a subject by reading, going to college, etc.","examples":["He sat up very late that night, studying.","study something How long have you been studying English?","study for something Don't disturb Jane, she's studying for her exams.","study something at… My brother studied photography at the Royal College of Art.","study at… She studied at New College, Oxford.","study something under somebody a composer who studied music under Nadia Boulanger (= was taught music by Nadia Boulanger)","study under somebody He studied under Wagner in Vienna.","study to do/be something Nina is studying to be an architect.","He is studying to teach children with special needs.","I have two tests tomorrow, and I've barely had time to study.","She's studying hard at the moment.","There's nowhere for the students to study quietly.","In the third year a number of areas are studied in detail.","Did you ever study any sciences?","I had a place to study engineering at Leeds.","They are always on social media when they should be studying.","She has been studying and working in Holland for the past four years.","The faculty offers students the opportunity to study dance.","He began studying for a law degree."],"opposite":"","synonyms":""},{"def":"to watch or to look at somebody/something carefully in order to find out something","examples":["study something for something Scientists are studying photographs of the planet for signs of life.","study something He studied her face thoughtfully.","Fran was studying the menu.","She picked up the letter and studied it carefully."],"opposite":"","synonyms":""},{"def":"to examine something carefully in order to understand it","examples":["study something We will study the report carefully before making a decision.","study how, what, etc… The group will study how the region coped with the loss of thousands of jobs.","They are studying what happens to people who unexpectedly win a lot of money.","These ideas will be examined in more detail in Chapter 10.","The job involves gathering and analysing data.","He tried to analyse his feelings.","The government will review the situation later in the year.","We will study the report carefully before making a decision.","This topic will be discussed at greater length in the next chapter.","The influence of heredity is best studied in genetically identical twins.","This area has not been well studied.","She is studying the effects global warming could have on annual snowmelt.","He's been studying hedgehogs for many years.","The early modern world has not been extensively studied outside Europe.","Researchers are studying the behaviour of sharks."],"opposite":"","synonyms":"examine"}],"idioms":[],"phrasal":[],"related":[]}]