[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/stu/stuff/stuff__us_1.mp3","phonsUS":"/stʌf/","level":"B1","meanings":[{"def":"used to refer to a substance, material, group of objects, etc. when you do not know the name, when the name is not important or when it is obvious what you are talking about","examples":["What's all that sticky stuff on the carpet?","The chairs were covered in some sort of plastic stuff.","This wine is good stuff.","I don't know how you can eat that stuff!","They sell stationery and stuff (like that).","Where's all my stuff (= my possessions)?","Could you move all that stuff off the table?","I want to buy some expensive tech stuff.","Shall I help you pack your things?","Bring your swimming things.","Where’s all my stuff?","This building is government property.","Be careful not to damage other people’s property.","Prisoners were allowed no personal possessions except letters and photographs.","I’ve cleared out all that old junk from the attic.","Please make sure you have all your belongings with you when leaving the plane.","He was found guilty of handling stolen goods.","Never leave cash or other valuables lying around."],"opposite":"","synonyms":"things"},{"def":"used to refer in a general way to things that people do, say, think, etc.","examples":["Peter's article had lots of interesting stuff in it.","There's still a lot of cool stuff happening in Manchester.","I've got loads of stuff to do today.","I like reading and stuff.","The band did some great stuff on their first album.","This is all good stuff. Well done!","I don't believe in all that stuff about ghosts.","What's all this ‘Mrs Smith’ stuff? Call me Anna.","He's done so much stuff and been so many interesting places.","(North American English) I've read a whole bunch of stuff by different people over the past few days."],"opposite":"","synonyms":""},{"def":"the most important feature of something; something that something else is based on or is made from","examples":["The trip was magical; the stuff of which dreams are made.","Parades and marches were the very stuff of politics in the region.","Connor's story is the stuff of legend.","the stuff of dreams/nightmares","Let’s see what stuff you’re made of (= what sort of person you are)."],"opposite":"","synonyms":""},{"def":"to have a stronger character and to be more determined in dealing with problems than other people","examples":["Many would have given up, but Tim was made of sterner stuff."],"opposite":"","synonyms":""},{"def":"used to tell somebody not to worry about small details or things that are not important","examples":[],"opposite":"","synonyms":""},{"def":"to do what you are good at or what you have been trained to do","examples":["Some members of the team are just not doing their stuff (= doing as well as they should).","(figurative) The medicine has clearly done its stuff."],"opposite":"","synonyms":""},{"def":"something that is so easy to do or understand that it is thought to be not very serious or only suitable for children","examples":["That was kids' stuff compared with what lies ahead.","The movie is pure kids' stuff from beginning to end."],"opposite":"","synonyms":""},{"def":"to know a lot about a particular subject or job","examples":[],"opposite":"","synonyms":""},{"def":"to not care at all about something","examples":[],"opposite":"","synonyms":""},{"def":"to proudly show your ability, especially at dancing or performing","examples":["strutting your stuff to the latest chart hits"],"opposite":"","synonyms":""},{"def":"used to say that something is stupid or not true","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be made of sterner stuff","def":"to have a stronger character and to be more determined in dealing with problems than other people","examples":["Many would have given up, but Tim was made of sterner stuff."]},{"idiom":"don’t sweat the small stuff","def":"used to tell somebody not to worry about small details or things that are not important","examples":[]},{"idiom":"do your stuff","def":"to do what you are good at or what you have been trained to do","examples":["Some members of the team are just not doing their stuff (= doing as well as they should).","(figurative) The medicine has clearly done its stuff."]},{"idiom":"kids’ stuff","def":"something that is so easy to do or understand that it is thought to be not very serious or only suitable for children","examples":["That was kids' stuff compared with what lies ahead.","The movie is pure kids' stuff from beginning to end."]},{"idiom":"know your stuff","def":"to know a lot about a particular subject or job","examples":[]},{"idiom":"not give a stuff","def":"to not care at all about something","examples":[]},{"idiom":"strut your stuff","def":"to proudly show your ability, especially at dancing or performing","examples":["strutting your stuff to the latest chart hits"]},{"idiom":"stuff and nonsense","def":"used to say that something is stupid or not true","examples":[]}],"phrasal":[],"related":["hot stuff","kid stuff","stuff it","kids’ stuff","know your stuff","strut your stuff","stuff and nonsense","don’t sweat the small stuff","be made of sterner stuff","you, etc. can stuff something","and all that (jazz, rubbish, stuff, etc.)","the same old story, stuff, nonsense, etc."]},{"pos":"verb","level":"B2","meanings":[{"def":"to fill a space or container tightly with something","examples":["stuff A with B She had 500 envelopes to stuff with leaflets.","stuff B in, into, under A She had 500 leaflets to stuff into envelopes.","stuff something The fridge is stuffed to bursting.","stuff something + adj. All the drawers were stuffed full of letters and papers.","She stuffed her case with presents for the kids.","She will be carrying a suitcase stuffed with cash."],"opposite":"","synonyms":""},{"def":"to push something quickly and carelessly into a small space","examples":["She stuffed the money under a cushion.","His hands were stuffed in his pockets.","Robyn quickly stuffed clothes into an overnight bag.","The police found the money that she'd stuffed down her dress."],"opposite":"","synonyms":""},{"def":"to fill a vegetable, chicken, etc. with another type of food","examples":["Are you going to stuff the turkey?","stuffed peppers"],"opposite":"","synonyms":""},{"def":"to eat a lot of food or too much food; to give somebody a lot or too much to eat","examples":["stuff somebody/yourself He sat at the table stuffing himself.","stuff somebody/yourself with something Don't stuff the kids with chocolate before their dinner.","stuff your face We stuffed our faces at the party."],"opposite":"","synonyms":""},{"def":"to fill the dead body of an animal with material and preserve it, so that it keeps its original shape and appearance","examples":["have something/be stuffed They had had their pet dog stuffed."],"opposite":"","synonyms":""},{"def":"used to tell somebody in a rude and angry way to go away, or that you do not want something","examples":["If they don’t offer you more money, tell them to get stuffed."],"opposite":"","synonyms":""},{"def":"used to show that you have changed your mind about something or do not care about something","examples":["I didn't want a part in the play, then I thought—stuff it—why not?","Stuff it. At my age it doesn’t matter."],"opposite":"","synonyms":""},{"def":"used to tell somebody in a rude and angry way that you do not want something","examples":["I told them they could stuff their job."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"get stuffed","def":"used to tell somebody in a rude and angry way to go away, or that you do not want something","examples":["If they don’t offer you more money, tell them to get stuffed."]},{"idiom":"stuff it","def":"used to show that you have changed your mind about something or do not care about something","examples":["I didn't want a part in the play, then I thought—stuff it—why not?","Stuff it. At my age it doesn’t matter."]},{"idiom":"you, etc. can stuff something","def":"used to tell somebody in a rude and angry way that you do not want something","examples":["I told them they could stuff their job."]}],"phrasal":[],"related":[]}]