[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/stu/stupi/stupid__us_1.mp3","phonsUS":"/ˈstuːpɪd/","level":"A2","meanings":[{"def":"showing a lack of thought or good judgement","examples":["a stupid mistake/question/idea","It was a pretty stupid thing to do.","You've been warned, so don't do anything stupid.","I was stupid enough to believe him.","It was stupid of you to get involved.","That was just plain stupid!","We made some incredibly stupid business mistakes.","Success has made him stupid.","The situation is getting stupid.","a crassly stupid thing to do","Don't be so stupid."],"opposite":"","synonyms":""},{"def":"slow to learn or understand things; not clever or intelligent","examples":["He'll manage—he isn't stupid.","Forgetting my notes made me look stupid.","She always makes me feel really stupid.","She's too stupid to realize that she'd be happier without him.","He's stupid enough to believe anything.","I decided it was best to act stupid.","I felt really stupid when I realized what had happened.","I'm not entirely stupid. I checked the train times before we came out.","My sister made me look stupid in front of all my friends.","Her teachers thought she was stupid, but in fact she couldn't hear properly.","I think he's the stupidest person I've ever met.","What are you talking about, you stupid man?","You stupid idiot! Put that gun down!"],"opposite":"","synonyms":""},{"def":"used to emphasize that you are annoyed with somebody/something","examples":["I can't get the stupid thing open!","Get your stupid feet off the chair!"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["be as clever, stupid, etc. as they come","how selfish, stupid, ungrateful, etc. can you get?"]},{"pos":"noun","level":"","meanings":[{"def":"if you call somebody stupid, you are telling them that you think they are not being very intelligent","examples":["Yes, stupid, it's you I'm talking to!"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]