[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sty/style/style__us_1.mp3","phonsUS":"/staɪl/","level":"A1","meanings":[{"def":"the particular way in which something is done","examples":["a wide range of musical styles","They want a wide range of learning resources to suit different learning styles.","a management style","style of something a style of management","furniture to suit your style of living","His aggressive style of play sometimes gets him in trouble.","I really enjoy playing this style of music.","I like your style (= I like the way you do things).","Caution was not her style (= not the way she usually behaved).","I'm surprised he rides a motorbike—I'd have thought big cars were more his style (= what suited him).","He adapted his acting style to suit the material.","She was dressed in casual style.","The article is written in a conversational style.","The pianist had to tailor his style to suit the vocalist's distinctive voice.","Her style differs from that of many of her contemporaries.","a casual style of speech","an autocratic leadership style","er inimitable style of humour","a study of different teaching styles"],"opposite":"","synonyms":""},{"def":"a particular design of something, especially clothes","examples":["We stock a wide variety of styles and sizes.","Have you thought about having your hair in a shorter style?","a style that was popular in the 1950s"],"opposite":"","synonyms":""},{"def":"the quality of being fashionable in the clothes that you wear","examples":["style-conscious teenagers","Some people have no sense of style.","in style Short skirts are back in style (= fashionable).","They still refer to her as a style guru and a trend-setter."],"opposite":"","synonyms":""},{"def":"the quality of being attractive and made or done to a high standard","examples":["The hotel has been redecorated but it's lost a lot of its style.","This movie is all surface style and no substance.","She does everything with style and grace.","Long velvet curtains add a touch of style to the main room.","The whole house just oozed style.","Whatever she did, she did it with style."],"opposite":"","synonyms":""},{"def":"the features of a book, painting, building, etc. that make it typical of a particular author, artist, historical period, etc.","examples":["style (of something) a style of architecture","a fine example of Gothic style","The film has a unique visual style.","He developed a distinctive style of painting.","in the style of somebody/something a parody written in the style of Molière","The palace was rebuilt in the same style.","They were told to write the passage in the style of Hemingway.","He attempted to sing the song in the style of Elvis Presley.","The city contains many different styles of architecture.","The two artists have radically different styles.","The new houses have been built in a traditional style.","The 16th century house has been renovated and furnished in contemporary style.","He evolved his style of painting while working as a magazine illustrator."],"opposite":"","synonyms":""},{"def":"the correct use of language","examples":["It's not considered good style to start a sentence with ‘but’.","Please follow house style (= the rules of spelling, etc. used by a particular publishing company)."],"opposite":"","synonyms":""},{"def":"having the type of style mentioned","examples":["Italian-style gardens","a buffet-style breakfast"],"opposite":"","synonyms":""},{"def":"the long, thin part of a flower that carries the stigma","examples":[],"opposite":"","synonyms":""},{"def":"to stop somebody from behaving in the way they want to","examples":["She didn’t want me to go with her to the party in case I cramped her style."],"opposite":"","synonyms":""},{"def":"in an impressive way","examples":["She always celebrates her birthday in style.","He won the championship in great style."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"cramp somebody’s style","def":"to stop somebody from behaving in the way they want to","examples":["She didn’t want me to go with her to the party in case I cramped her style."]},{"idiom":"in (great, grand, etc.) style","def":"in an impressive way","examples":["She always celebrates her birthday in style.","He won the championship in great style."]}],"phrasal":[],"related":["style on","old-style","house style","style sheet","family style","family-style","Decorated style","style sheets","style something/yourself on something/somebody","cramp somebody’s style"]},{"pos":"verb","level":"","meanings":[{"def":"to design, make or shape something in a particular way","examples":["an elegantly styled jacket","He'd had his hair styled at an expensive salon."],"opposite":"","synonyms":""},{"def":"to give somebody/something/yourself a particular name or title","examples":["He styled himself Major Carter.","The company was originally styled ‘Imperial Designs’."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["style on"],"related":[]}]