[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sub/subst/substance__us_2.mp3","phonsUS":"/ˈsʌbstəns/","level":"B1","meanings":[{"def":"a type of solid, liquid or gas that has particular qualities","examples":["a sticky substance","a chemical/radioactive/hazardous substance","Some frogs produce toxic substances in their skin.","Exercise of this kind improves the balance of fatty substances in the bloodstream.","Psychoactive drugs are chemical substances that act on the brain.","a bag full of some unknown substance","a natural substance found in the body of animals","foreign substances that contaminated the experiments"],"opposite":"","synonyms":""},{"def":"a drug, especially an illegal one","examples":["illegal/controlled substances","He was disqualified from competing after testing positive to a banned substance.","Adolescent substance use remains high in the United States."],"opposite":"","synonyms":""},{"def":"the quality of being based on facts or the truth","examples":["The commission's report gives substance to these allegations.","There is some substance in what he says.","without substance It was malicious gossip, completely without substance.","His disappearance has given added substance to the argument that he stole the money.","The image of him that the media have presented has no substance.","The letters lent substance to the claims.","Their allegations were without substance.","There was little substance to his claims.","There's no substance in the story.","The party's manifesto is good on style but lacks real substance."],"opposite":"","synonyms":""},{"def":"the most important or main part of something","examples":["the substance of something Love and guilt form the substance of his new book.","The real substance of the report was in the third part.","in substance I agreed with what she said in substance, though not with every detail.","There seems to be no difference in substance between the two procedures."],"opposite":"","synonyms":""},{"def":"importance","examples":["of substance matters of substance","Nothing of any substance was achieved in the meeting.","He found it difficult to say much of substance.","No one raised any matters of substance."],"opposite":"","synonyms":""},{"def":"a rich and powerful man or woman","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a man/woman of substance","def":"a rich and powerful man or woman","examples":[]}],"phrasal":[],"related":["substance abuse","controlled substance","a man/woman of substance"]}]