[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/suc/succe/success__us_2.mp3","phonsUS":"/səkˈses/","level":"A1","meanings":[{"def":"the fact that you have achieved something that you want and have been trying to do or get","examples":["The company has achieved considerable success in this market.","Initially the venture enjoyed a fair amount of success.","success in doing something I didn't have much success in finding a job.","without success I tried a second time, but without success.","Confidence is the key to success.","Their plan will probably meet with little success.","The success or failure of the project was now in the students' control.","He attributes his success to having a stable family life.","She was pleased with her apparent success.","I owe my success to him.","It has already been used with great success.","Much of his success lies in his skill in handling staff.","Several people have reported success with this approach.","She had worked hard and was confident of success.","She tried to persuade them without success.","I've had some success in getting rid of the weeds.","The campaign to stop drink-driving had only limited success.","The company's excellent marketing has resulted in enormous international success.","The operation has a success rate of over 80%.","The year-long fight for a pay rise ended in success.","We are sad to see Hiroko go, and wish her every success in the future.","We're trying to get him to sponsor us, but there's not much hope of success.","What are our chances of success?","They have little prospect of success.","Your contribution was vital to the success of the concert.","the secret of his success with women","The company's continued success largely depends on its ability to adapt.","She has had success at national and international contests.","These changes are necessary to ensure the long-term success of the brand.","Big-money backing doesn't guarantee success.","Your input is critical to the success of the project.","Personal fulfilment is the true measure of success.","I tried baking all my own bread, with varying degrees of success."],"opposite":"","synonyms":""},{"def":"the fact of becoming rich or famous or of getting a high social position","examples":["What's the secret of your success?","They didn't have much success in life.","She was surprised by the book's success (= that it had sold a lot of copies).","Success didn't come overnight—she struggled for years before making any money.","artists who have experienced some initial success","We should not measure their success in money alone."],"opposite":"","synonyms":""},{"def":"a person or thing that has achieved a good result and been successful","examples":["The party was a great success.","a resounding/tremendous/phenomenal success.","The book proved a huge commercial success.","He's proud of his daughter's successes.","He was determined to make a success of the business.","success as something She wasn't a success as a teacher.","It is important to learn from both successes and failures.","He is eager to notch up another success.","She's made a real success of that job.","The band's new album has been a runaway success.","The event was judged a success by its organizers.","The movement has scored some notable successes.","We had one or two outstanding successes.","He had already achieved modest successes on the London stage.","If we manage to break even this year, it will be a qualified success.","It is important to celebrate our successes.","The product was a huge success.","The operation has a success rate of 80 percent.","Despite his successes, John remained modest."],"opposite":"","synonyms":""},{"def":"when you are successful in one area of your life, it often leads to success in other areas","examples":[],"opposite":"","synonyms":""},{"def":"a very great success","examples":["The evening was a resounding success.","The latest Disneyland has been a roaring success."],"opposite":"","synonyms":""},{"def":"the pleasant feeling of being successful","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"nothing succeeds like success","def":"when you are successful in one area of your life, it often leads to success in other areas","examples":[]},{"idiom":"a resounding success","def":"a very great success","examples":["The evening was a resounding success.","The latest Disneyland has been a roaring success."]},{"idiom":"the sweet smell of success","def":"the pleasant feeling of being successful","examples":[]}],"phrasal":[],"related":["success story","success stories","the sweet smell of success","nothing succeeds like success"]}]