[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/suc/succe/succeed__us_2.mp3","phonsUS":"/səkˈsiːd/","level":"A2","meanings":[{"def":"to achieve something that you have been trying to do or get; to have the result or effect that was intended","examples":["Our plan succeeded.","Whether we succeed or fail depends on ingenuity and luck.","succeed in doing something He succeeded in getting a place at art school.","I tried to discuss it with her but only succeeded in making her angry (= I failed and did the opposite of what I intended).","No company can hope to succeed at everything.","The appeal is unlikely to succeed.","They very nearly succeeded in blowing up the building.","This option has rarely succeeded in recent years.","We feel that we have largely succeeded in our aims.","The book succeeds beautifully in presenting the problem before us.","We succeeded in repairing the engine.","hints on how to succeed with interior design","to succeed against serious opposition"],"opposite":"fail","synonyms":""},{"def":"to be successful in your job, earning money, power, respect, etc.","examples":["You will have to work hard if you are to succeed.","succeed in something She doesn't have the ruthlessness required to succeed in business.","succeed as something He had hoped to succeed as a violinist.","She has succeeded in a difficult career.","You're much more likely to succeed in a business with a partner than without one.","The engineering career structure worked against women succeeding.","We are looking for individuals with a determination to succeed.","She can teach you how to succeed at tennis.","They are being given the confidence and motivation to succeed academically."],"opposite":"","synonyms":""},{"def":"to come next after somebody/something and take their/its place or position","examples":["Who succeeded Kennedy as President?","Their early success was succeeded by a period of miserable failure.","Strands of DNA are reproduced through succeeding generations.","He was appointed to succeed Sir Georg Solti as head of the Chicago Symphony Orchestra.","He was expected to succeed Jack Smith as CEO when he retired.","He was widely tipped to succeed Mrs May as leader of the party."],"opposite":"","synonyms":""},{"def":"to gain the right to a title, property, etc. when somebody dies","examples":["She succeeded to the throne (= became queen) in 1558.","He had no right to succeed to the tenancy when his father died."],"opposite":"","synonyms":""},{"def":"when you are successful in one area of your life, it often leads to success in other areas","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"nothing succeeds like success","def":"when you are successful in one area of your life, it often leads to success in other areas","examples":[]}],"phrasal":[],"related":[]}]