[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/suc/succe/successful__us_2.mp3","phonsUS":"/səkˈsesfl/","level":"A2","meanings":[{"def":"achieving your aims or what was intended","examples":["The experiment was entirely successful.","We congratulated them on the successful completion of the project.","successful in something He's always been highly successful in his work.","successful in something They were successful in winning the contract.","successful at something No one can be successful at everything.","successful at doing something I wasn't very successful at keeping the news secret.","The alliance was ultimately successful in getting its message across.","The operation was only partially successful.","Their attempts had not been entirely successful.","We hope the party will be successful in the elections.","Winning is the only way they can feel successful.","She had a phenomenally successful period as manager.","He had been successful at every job he had done.","The company has been successful in controlling costs.","I received a letter saying that my application had been successful.","The police became more successful at clearing up crime.","The successful candidate will be responsible for a large research project.","This is one of the most successful advertising campaigns in recent history.","Further tests proved successful."],"opposite":"","synonyms":""},{"def":"having become popular and/or made a lot of money","examples":["The play was very successful on Broadway.","a successful actor/businessman","She has had a long and successful career in television.","The company has had another successful year.","What makes a new product successful?","She has appeared in some of the most popular and successful films of the last couple of decades.","Successful businesses are built by strong teams.","The show was wildly successful.","The play was very successful on Broadway.","The company has had another successful year.","a highly profitable business","The movie was not a commercial success (= made no profit).","They do a lot of business in lucrative overseas markets.","Small local shops stop being economic when a supermarket opens up nearby."],"opposite":"unsuccessful","synonyms":"successful"}],"idioms":[],"phrasal":[],"related":[]}]