[{"pos":"determiner, pronoun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/suc/such_/such__us_1.mp3","phonsUS":"/sʌtʃ/","level":"A2","meanings":[{"def":"used to emphasize the great degree of something","examples":["This issue was of such importance that we could not afford to ignore it.","such a/an… Why are you in such a hurry?","It's such a beautiful day!","such is something that… (formal) Such is the elegance of this typeface that it is still a favourite of designers."],"opposite":"","synonyms":""},{"def":"of the type already mentioned","examples":["They had been invited to a Hindu wedding and were not sure what happened on such occasions.","He said he didn't have time or made some such excuse.","She longed to find somebody who understood her problems, and in him she thought she had found such a person.","We were second-class citizens and they treated us as such.","Accountants were boring. Such (= that) was her opinion before meeting Ian!"],"opposite":"","synonyms":""},{"def":"of the type that you are just going to mention","examples":["There is no such thing as a free lunch.","Such advice as he was given (= it was not very much) has proved almost worthless.","The knot was fastened in such a way that it was impossible to undo.","The damage was such that it would cost thousands to repair."],"opposite":"","synonyms":""},{"def":"and similar things or people","examples":["The centre offers activities like canoeing and sailing and such."],"opposite":"","synonyms":""},{"def":"as the word is usually understood; in the exact sense of the word","examples":["The new job is not a promotion as such, but it has good prospects.","‘Well, did they offer it to you?’ ‘No, not as such, but they said I had a good chance.’"],"opposite":"","synonyms":""},{"def":"for example","examples":["Wild flowers such as primroses are becoming rare.","‘There are loads of things to do.’ ‘Such as?’ (= give me an example)"],"opposite":"","synonyms":""},{"def":"of a kind that; like","examples":["Opportunities such as this did not come every day."],"opposite":"","synonyms":""},{"def":"used to say that there is not much of something or that it is of poor quality","examples":["The food, such as it was, was served at nine o'clock."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"… and such","def":"and similar things or people","examples":["The centre offers activities like canoeing and sailing and such."]},{"idiom":"as such","def":"as the word is usually understood; in the exact sense of the word","examples":["The new job is not a promotion as such, but it has good prospects.","‘Well, did they offer it to you?’ ‘No, not as such, but they said I had a good chance.’"]},{"idiom":"such as","def":"for example","examples":["Wild flowers such as primroses are becoming rare.","‘There are loads of things to do.’ ‘Such as?’ (= give me an example)","Opportunities such as this did not come every day.","The website has a variety of interactive exercises (e.g. matching games, crosswords and quizzes).","The website has a variety of interactive exercises, including matching games, crosswords and quizzes.","Internet technologies, such as wikis, blogs and social networking sites, have changed the way that people find information and interact with it.","Many websites allow users to contribute information. A good example of this is the ‘wiki’, a type of website that anyone can edit.","Wikis vary in how open they are. For example, some wikis allow anybody to edit content, while others only allow registered users to do this.","Wikis vary in how open they are. Some wikis, for example/for instance, allow anybody to edit content, while others only allow registered users to do this.","More and more people read their news on the internet. To take one example, over 14 million people now read the online version of ‘The Oxford Herald’.","Online newspapers are now more popular than paper ones. ‘The Oxford Herald’ is a case in point. Its print circulation has fallen in recent years, while its website attracts millions of users every month."]},{"idiom":"such as it is/they are","def":"used to say that there is not much of something or that it is of poor quality","examples":["The food, such as it was, was served at nine o'clock."]}],"phrasal":[],"related":["such-and-such","come to such a pass","no such luck","not half such a","ever so/ever such a","there’s no such thing as a free lunch"]}]