[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/suf/suffe/suffer__us_2.mp3","phonsUS":"/ˈsʌfər/","level":"B1","meanings":[{"def":"to be badly affected by a disease, pain, sad feelings, a lack of something, etc.","examples":["I hate to see animals suffering.","The country has suffered greatly at the hands of its corrupt government.","suffer from something to suffer from a disorder/a disease/an illness/a condition","patients suffering from depression/cancer","Increasing numbers of children are suffering from mental health problems.","He suffers from asthma.","The economy is still suffering badly from a lack of demand.","suffer with something to suffer with depression/a cold","suffer for something He made a rash decision and now he is suffering for it.","The lead actor had to suffer for his art by losing 10kg for the role.","Women continue to suffer in silence under the repressive regime.","Many companies are suffering from a shortage of skilled staff.","road accident victims suffering from shock","I'm sorry that you have to suffer alone like this.","They were just expected to suffer in silence.","This area suffered very badly in the storms.","Thousands of children in the world today suffer needlessly.","people suffering under repressive regimes","Premature babies are more likely to suffer from breathing difficulties in childhood.","I played tennis yesterday and I know I shall suffer for it today.","No child deserves to suffer for a parent's mistakes."],"opposite":"","synonyms":""},{"def":"to experience something unpleasant, such as injury, defeat or loss","examples":["to suffer a stroke/heart attack","Victims suffered severe injuries in the accident.","The company suffered huge losses in the last financial year.","Crops suffered serious damage as a result of the floods.","The party suffered a humiliating defeat in the general election.","His mother died young, and his sister suffered the same fate (= his sister also died young).","He suffered a massive heart attack.","She made mistakes as a teenager and spent her whole life suffering the consequences.","The tourism industry suffered a setback last year due to poor summer weather."],"opposite":"","synonyms":""},{"def":"to become worse","examples":["His school work is suffering because of family problems."],"opposite":"","synonyms":""},{"def":"to be very impatient with people that you think are stupid","examples":["She was a forceful personality who didn't suffer fools gladly."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"not suffer fools gladly","def":"to be very impatient with people that you think are stupid","examples":["She was a forceful personality who didn't suffer fools gladly."]}],"phrasal":[],"related":["not suffer fools gladly"]}]