[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sug/sugge/suggestion__us_1_rr.mp3","phonsUS":"/səˈdʒestʃən/","level":"A2","meanings":[{"def":"an idea or a plan that you mention for somebody else to think about","examples":["Can I make a suggestion?","Do you have any suggestions?","I would like to offer a suggestion.","He rejected my suggestion as impractical.","suggestion for something The report offers suggestions for improvement to policy.","I'd like to hear your suggestions for ways of raising money.","suggestion on something We welcome any comments and suggestions on these proposals.","suggestion about something Are there any suggestions about how best to tackle the problem?","suggestion that… He agreed with my suggestion that we should change the date.","We are open to suggestions (= willing to listen to ideas from other people).","We need to get it there by four. Any suggestions?","Can you give us any suggestions for a slogan?","They made three specific suggestions.","Please send your suggestions via email to…","Employee suggestion boxes invite raw ideas.","I've had several helpful suggestions from colleagues.","Management welcomes practical suggestions on how to improve the facilities.","I think we might take up the suggestion of printing the books in Hong Kong.","I'd appreciate any suggestions you may have.","We have noted your suggestion and will give it due consideration.","suggestions for further reading"],"opposite":"","synonyms":""},{"def":"a reason to think that something, especially something bad, is true","examples":["suggestion of something A spokesman dismissed any suggestion of a boardroom rift.","There is no suggestion of any impropriety.","suggestion that… There was no suggestion that he was doing anything illegal.","She left the country amid suggestions that she had stolen from the company.","They dismissed the suggestion that they hadn't worked hard.","This is a book full of provocative suggestions."],"opposite":"","synonyms":""},{"def":"putting an idea into people’s minds by connecting it with other ideas","examples":["Most advertisements work through suggestion.","the power of suggestion","There's no scientific basis to the method—it works by suggestion.","These healers claim to remove the pain by the power of suggestion.","analgesia through hypnotic suggestion"],"opposite":"","synonyms":""},{"def":"a slight amount or sign of something","examples":["She looked at me with just a suggestion of a smile.","He spoke English with a suggestion of a French accent.","Her eyes contained a strong suggestion of mischief."],"opposite":"","synonyms":""},{"def":"because somebody suggested it","examples":["At his suggestion, I bought the more expensive printer.","At the suggestion of his boss, he resigned."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"at/on somebody’s suggestion","def":"because somebody suggested it","examples":["At his suggestion, I bought the more expensive printer.","At the suggestion of his boss, he resigned."]}],"phrasal":[],"related":[]}]