[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sug/sugge/suggest__us_1_rr.mp3","phonsUS":"/səˈdʒest/","level":"A2","meanings":[{"def":"to put forward an idea or a plan for other people to think about","examples":["suggest something I'd like to suggest a different explanation for the company's decline.","suggest something to somebody The designer is known for suggesting innovative ideas to her clients.","suggest itself He thought long and hard, but no answer suggested itself.","suggest itself to somebody A solution immediately suggested itself to me (= I immediately thought of a solution).","suggest (that)… I strongly suggest (that) you don't get involved.","suggest doing something I suggested going in my car.","it is suggested that… It has been suggested that bright children take their exams early.","(British English also) It has been suggested that bright children should take their exams early.","+ speech ‘We could go for a drive,’ Nate suggested hopefully.","How about going out for a walk on Saturday?","Shall we ask Sarah to come along?","Should we ask Sarah to come along?","We could go a bit earlier and have a drink first, if you like.","What do you think of the idea of sending this to the Research Department?","Why don't you try calling his landline?","Why not just wait until they come back?","Why not simply explain your problem to them and see what they say?","Some critics argue that Picasso remained a great master all his life.","Others maintain that there is a significant deterioration in quality in his post-war work.","Picasso himself claimed that good art is created, but great art is stolen.","As Smith has noted, Picasso borrowed imagery from African art.","As the author points out, Picasso borrowed imagery from African art.","The writer challenges the notion that Picasso’s sculpture was secondary to his painting.","It has been suggested that Picasso’s painting was influenced by jazz music.","I suggest (that) we go out to eat.","She suggested using white text on a black background.","The report suggested a two-stage process.","‘Shall I tell them you're unwell?’ Alice suggested helpfully.","He suggested to the committee that they delay making a decision.","I tentatively suggested that she might be happier working somewhere else.","I strongly suggest keeping personal and business accounts separate.","I would suggest that you see your doctor about this.","It seems reasonable to suggest that all life forms on earth share a common origin."],"opposite":"","synonyms":""},{"def":"to tell somebody about a suitable person, thing, method, etc. for a particular job or purpose","examples":["suggest somebody/something for something Who would you suggest for the job?","suggest somebody/something as something She suggested Paris as a good place for the conference.","She suggested John as chairman.","suggest somebody/something Can you suggest a better way of doing it? You cannot ‘suggest somebody something’: Can you suggest me a better way of doing it?","May I suggest a white wine with this dish, Sir?","There is a suggested donation of $5 to attend the show.","suggest how, what, etc… Can you suggest how I might contact him?"],"opposite":"","synonyms":""},{"def":"to put an idea into somebody’s mind; to make somebody think that something is true","examples":["suggest (that)… All the evidence suggests (that) he stole the money.","suggest something Recent studies suggest the possibility of a cure for the disease.","Some believe that organic foods offer no health benefits, but this research suggests otherwise.","The symptoms suggest a minor heart attack.","The stage lighting was used to suggest a beach scene.","suggest something to somebody What do these results suggest to you?","There is no evidence to suggest the presence of learning difficulties.","The novel implicitly suggests that racism can explain the murder.","The evidence suggests quite strongly that the fire was caused by an explosion.","The ending is meant to suggest a form of redemption."],"opposite":"","synonyms":""},{"def":"to state something indirectly","examples":["suggest (that)… Are you suggesting (that) I’m lazy?","I’m not suggesting (that) she was responsible for the accident.","suggest something I would never suggest such a thing.","It is not far-fetched to suggest a connection between them.","You're not seriously suggesting that is a plausible explanation?","I do not mean to suggest that the poem is purely biographical.","I am merely suggesting that there is more than one way to view this matter."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]