[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sum/sum__/sum__us_1.mp3","phonsUS":"/sʌm/","level":"B2","meanings":[{"def":"an amount of money","examples":["You will be fined the sum of £200.","a large sum of money","The judge awarded them an undisclosed six-figure sum in damages.","Huge sums have been invested in this project.","The team has raised substantial sums for local charities.","£200 was an astronomical sum of money in 1547.","For his first book he received the princely sum of $400.","He joined the club two years ago for a record sum.","It seemed an absurdly high sum to pay for a coat.","Some of the paintings should fetch a tidy sum at today's auction.","The charity pays a nominal sum to lease the premises.","The gangsters offered him a sum equivalent to a whole year's earnings.","The landlord has the right to recover any sums payable under this lease.","We eventually agreed a sum and I gave him a cheque.","You will have to go to court to recover these sums.","a project that cost vast sums of public money"],"opposite":"","synonyms":""},{"def":"the number you get when you add two or more numbers together","examples":["The sum of 7 and 12 is 19.","Calculate the sum of the following figures."],"opposite":"","synonyms":""},{"def":"all of something, especially when you think that it is not very much","examples":["This is the sum of my achievements so far."],"opposite":"","synonyms":""},{"def":"a simple problem that involves calculating numbers","examples":["to do a sum in your head","I was good at sums at school.","If I've got my sums right, I should be able to afford the rent.","I did a quick sum to work out how much it would cost.","The company got its sums wrong when estimating how many customers it would attract."],"opposite":"","synonyms":""},{"def":"to be better or more effective as a group than you would think just by looking at the individual members of the group","examples":["The team is greater than the sum of its parts."],"opposite":"","synonyms":""},{"def":"used to introduce a short statement of the main points of a discussion, speech, etc.","examples":["In sum, we have no chance of winning the case."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be greater/more than the sum of its parts","def":"to be better or more effective as a group than you would think just by looking at the individual members of the group","examples":["The team is greater than the sum of its parts."]},{"idiom":"in sum","def":"used to introduce a short statement of the main points of a discussion, speech, etc.","examples":["In sum, we have no chance of winning the case."]}],"phrasal":[],"related":["sum up","dim sum","lump sum","sum total","capital sum","zero-sum game","sum totals","lump sum payment","sum up | sum something","sum somebody/something","be greater/more than the sum of its parts"]},{"pos":"verb","level":"B2","meanings":[],"idioms":[],"phrasal":["sum up"],"related":[]}]