[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sup/suppo/support__us_1.mp3","phonsUS":"/səˈpɔːrt/","level":"A2","meanings":[{"def":"to help or encourage somebody/something by saying or showing that you agree with them/it","examples":["support somebody/something to support an idea/a view","The party fully supports new welfare reform bill.","Efforts to reduce waste are strongly supported by environmental groups.","The majority of ordinary citizens did not support the war.","If you raise it at the meeting, I'll support you.","support somebody/something in something The government supported the unions in their demand for a minimum wage.","He has consistently supported the tax cuts.","I strongly support the view that education should be available to everyone.","The people of this country overwhelmingly support their president.","These policies were widely supported in the country.","Very few countries supported the United States in its action."],"opposite":"","synonyms":""},{"def":"to give or be ready to give help to somebody if they need it","examples":["an organization that supports people with AIDS","She supported her husband through many difficult times.","The company will support customers in Europe (= solve their problems with a product).","Teachers should always support and encourage their students.","The group is actively supported by several Members of Parliament.","The event was organized by Sam and Alex, ably supported by their classmates.","You need colleagues who will support you in your work.","The soloists were ably supported by the University Singers."],"opposite":"","synonyms":""},{"def":"to like a particular sports team, watch their games, etc.","examples":["Which team do you support?","Who do you support?"],"opposite":"","synonyms":""},{"def":"to help or encourage something to be successful by giving it money","examples":["The project was supported by grants from various charities.","A number of famous actors actively supported the campaign.","Several major companies are supporting the project.","The government has refused to support a new veterinary school in the region.","This work was partially supported by the government."],"opposite":"","synonyms":""},{"def":"to provide everything necessary, especially money, so that somebody/something can live or exist","examples":["He struggles to support his family.","She supported herself through college by working as a waitress in a local bar.","He turned to crime to support his drug habit.","The atmosphere of Mars could not support life.","I have two children to support.","Her parents supported her all through university.","The town supports a small fishing fleet."],"opposite":"","synonyms":""},{"def":"to help to show that something is true","examples":["Current data support this hypothesis.","There is no evidence to support his claims.","The witness's story was not supported by the evidence.","He said the figures were questionable and not well supported.","There is clear evidence that TV advertising influences what children buy.","It is clear from numerous studies that TV advertising influences what children buy.","Recent research demonstrates that TV advertising influences children’s spending habits.","Many parents think that TV advertising influences their children. This view is supported by the findings of a recent study, which show a clear link between television advertisements and children’s spending habits.","The findings also reveal that most children are unaware of the persuasive purpose of advertising.","There is little evidence that children understand the persuasive intent of advertising.","The results contradict claims that advertising is unrelated to children’s spending habits.","Manufacturers argue that it is difficult to prove that advertising alone influences what children buy.","The results of the experiment supported her theory.","Our results clearly support this view.","Research has generally supported these predictions.","The sample adequately supports this conclusion."],"opposite":"","synonyms":""},{"def":"to hold somebody/something in position; to prevent somebody/something from falling","examples":["a platform supported by concrete pillars","Support the baby's head when you hold it.","She walked carefully down the stairs, supported by her grandson."],"opposite":"","synonyms":""},{"def":"to perform in a pop or rock concert before the main performer","examples":["They were supported by a local Liverpool band."],"opposite":"","synonyms":""},{"def":"to allow a particular program, language or device to be used with it","examples":["This digital audio player supports multiple formats."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["air support","child support","life support","moral support","support group","tech support","income support","support bubble","technical support","victim support","life support machine","National Asylum Support Service","life support system","the Child Support Agency","lend support, weight, credence, etc. to something"]},{"pos":"noun","level":"A2","meanings":[{"def":"approval that you give to somebody/something because you want them to be successful","examples":["support for something There is strong public support for the policy.","There is a continued lack of support for the war.","His ideas are gaining popular support (= the support of many people).","to provide/offer support","I intend to lend my full support to the campaign.","to win/gain somebody's support","Can I rely on your support (= will you vote for me) in the election?","support from somebody/something The policy has broad support from industry.","in support of something Only a few people spoke in support of the proposal.","organizations that provide advice and support to small businesses","The idea has met with widespread support.","The project won the support of the local community.","Campaigners have enlisted the support of their local MP.","Farmers mobilized considerable support against government plans to remove import restrictions.","Fears that instability would return gave the government a broad base of support.","He had no support base within the party.","My idea only received lukewarm support from my colleagues.","She threw her full support behind him.","Support came from all sections of the community.","Support for the Liberals has risen to 30 per cent.","The candidate enjoys the firm support of local industry.","The government is trying to build popular support for an unwinnable war.","The party wishes to broaden its support among professionals.","The plan received strong support from farmers.","The poll revealed massive support for the proposal.","The proposal has the personal support of the president.","The rebel leader received expressions of support from all quarters.","They are now throwing their support to the other candidate.","Which groups does the party draw most of its support from?","one of the first scientists to come out in support of ‘The Origin of Species’","I wish to acknowledge the support of my family during the writing of this book.","We would like to thank Ana for her unwavering support over the years."],"opposite":"","synonyms":""},{"def":"money or goods that you give to somebody/something in order to help them","examples":["They received no financial support from the government.","She has no visible means of support (= no work, income etc.).","Local businesses provided financial support.","Many TV celebrities have already pledged their support to the appeal.","The pipeline is to be built with international support."],"opposite":"","synonyms":""},{"def":"sympathy and help that you give to somebody who is in a difficult or unhappy situation","examples":["Her family and friends have given her lots of support.","Thank you for all your messages of support at this difficult time.","He turned to his closest friends for support.","support staff/services","a support network/system","Thanks for all your support on the day of the funeral.","She will need a lot of emotional support at this difficult time.","We get together regularly for mutual support.","We'll need to give her lots of support when she comes out of hospital.","people who need long-term support at home"],"opposite":"","synonyms":""},{"def":"evidence that helps to show that something is true or correct","examples":["This suggestion lacks convincing experimental support.","support for something The statistics offer further support for our theory.","in support of something There is little evidence in support of this hypothesis."],"opposite":"","synonyms":""},{"def":"a thing that holds something and prevents it from falling","examples":["The supports under the bridge were starting to bend.","(figurative) When my father died, Jim was a real support.","There was some structural damage to the support.","Engineers discovered cracks in two of the supports.","(figurative) After the accident my parents were a great support."],"opposite":"","synonyms":""},{"def":"the act of holding something in position or preventing it from falling","examples":["for support She held on to his arm for support.","without support After the operation he couldn't walk without support.","A firmer mattress gives your back an improved level of support.","I wrapped a bandage around my ankle to give it some support.","He held onto his wife for support as he left the hospital.","(figurative) a price support mechanism"],"opposite":"","synonyms":""},{"def":"something you wear to hold an injured or weak part of your body in position","examples":["a knee/back support"],"opposite":"","synonyms":""},{"def":"a band or singer who performs in a pop or rock concert before the main performer","examples":["The support (act) has yet to be confirmed."],"opposite":"","synonyms":""},{"def":"technical help that a company gives to customers using their computers or other products","examples":["There is a lack of decent home user support."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]