[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sup/suppl/supplement__us_1.mp3","phonsUS":"/ˈsʌplɪmənt/","level":"C1","meanings":[{"def":"a thing that is added to something else to improve or complete it","examples":["vitamin/dietary supplements (= vitamins and other foods eaten in addition to what you usually eat)","supplement to something Industrial sponsorship is a supplement to government funding.","The farmer adds a supplement to the horse's feed.","women who take a daily supplement of folic acid","means-tested supplements to the basic pension"],"opposite":"","synonyms":""},{"def":"an extra separate section, often in the form of a magazine, that is sold with a newspaper","examples":["the Sunday colour supplements","Our special supplement is packed with ideas for healthy hair."],"opposite":"","synonyms":""},{"def":"a book or a section at the end of a book that gives extra information or deals with a special subject","examples":["the supplement to the Oxford English Dictionary","a supplement to the main report","You can use these books as supplements to the basic English course."],"opposite":"","synonyms":""},{"def":"an amount of money that you pay for an extra service or item, especially in addition to the basic cost of a holiday","examples":["supplement (for something) There is a £10 supplement for a single room.","supplement on something There is a supplement on rooms with a sea view.","at/for a supplement Safety deposit boxes are available at a supplement.","If you want to travel on a different day a flight supplement is payable.","We charge a small supplement for this service.","Weekend flights carry a supplement."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["colour supplement","Times Literary Supplement","Times Educational Supplement","color supplement","The Times Literary Supplement"]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sup/suppl/supplement__us_2.mp3","phonsUS":"/ˈsʌplɪment/","level":"C1","meanings":[{"def":"to add something to something in order to improve it or make it more complete","examples":["supplement something with something a diet supplemented with vitamin pills","supplement something He supplements his income by giving private lessons."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]