[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sup/suppl/supply__us_1.mp3","phonsUS":"/səˈplaɪ/","level":"B1","meanings":[{"def":"an amount of something that is provided or available to be used","examples":["Advances in agriculture increased the food supply.","Demand for skilled labour outstrips supply.","We ordered a month's supply of oil.","We cannot guarantee adequate supplies of raw materials.","Supplies of food are almost exhausted.","By the end of the winter the supply of grain was severely depleted.","Domestic coal supplies were more plentiful in the 1950s.","He has an endless supply of corny jokes.","Hurry, as we only have a limited supply of these TVs in stock!","I went to the office supply store.","The injured climbers had only meagre supplies of water and peanuts to live off.","It is impossible to measure the total supply of money in circulation.","Make sure you have an adequate supply of brochures.","The body needs a fresh supply of vitamin C every day.","The farmers depend on a casual labour supply at harvest time.","The studio produced a steady supply of good films.","There will soon be a shortfall in supply of qualified young people.","We should lay in a good supply of beer for the party.","a supply of spare batteries","the provision of a reliable supply of clean water to rural communities"],"opposite":"","synonyms":""},{"def":"the things such as food, medicines, fuel, etc. that are needed by a group of people, for example an army or expedition","examples":["Our supplies were running out.","food and medical supplies for refugees","The Red Cross flew emergency food supplies into the war zone.","Rebel action threatened relief supplies."],"opposite":"","synonyms":""},{"def":"the act of supplying something; the fact of receiving something that is being supplied","examples":["the electricity/energy/gas supply","The storm disrupted the town's power supply.","A stroke is caused by disruption to the blood supply to the brain.","the supply of goods and services","a contract for the supply of timber","The UN has agreed to allow the supply of emergency aid.","A stroke can disrupt the supply of oxygen to the brain.","The electricity supply had been cut off.","The electricity company disconnected our supply for non-payment of a bill."],"opposite":"","synonyms":""},{"def":"not existing in large enough quantities to satisfy demand","examples":["Basic foodstuffs were in short supply.","Sunshine will be in short supply for the west coast.","Safe drinking water is in desperately short supply."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in short supply","def":"not existing in large enough quantities to satisfy demand","examples":["Basic foodstuffs were in short supply.","Sunshine will be in short supply for the west coast.","Safe drinking water is in desperately short supply."]}],"phrasal":[],"related":["supply line","supply-side","money supply","supply chain","water supply","supply management","supply teacher","supply and demand","supply chains","in short supply"]},{"pos":"verb","level":"B1","meanings":[{"def":"to provide somebody/something with something that they need or want, especially in large quantities","examples":["supply something to somebody/something The company supplied sports equipment to schools.","supply somebody/something with something The company supplied schools with sports equipment.","supply somebody/something The well stopped supplying water for the village many years ago.","foods supplying our daily vitamin needs","This information was kindly supplied by the manufacturer.","Please supply your email address.","He was charged with intent to supply (= planning to sell) class A drugs.","Foreign governments supplied arms to the rebels.","Foreign governments supplied the rebels with arms.","This one power station keeps half the country supplied with electricity.","Local schools supply many of the volunteers.","She was jailed for supplying drugs.","Calvin readily supplied the information.","Each applicant is asked to supply a portfolio of work at interview.","Any room where gas is used must be adequately supplied with air.","He refused to supply the police with information.","She kept the guests well supplied with champagne.","The water was supplied from a tanker.","a buffet supper, generously supplied by club members"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]