[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sur/surge/surge__us_1.mp3","phonsUS":"/sɜːrdʒ/","level":"C1","meanings":[{"def":"a sudden increase of a strong feeling","examples":["She felt a sudden surge of anger.","a surge of excitement","He thought of his old teacher with a surge of affection.","His initial surge of euphoria was quickly followed by dismay.","A huge surge of emotion swept through her.","He picked up the phone with a surge of panic."],"opposite":"","synonyms":""},{"def":"a sudden increase in the amount or number of something","examples":["surge in something a surge in consumer spending","We are having trouble keeping up with the recent surge in demand.","A last-minute surge in ticket sales saved the show from closure.","surge of something After an initial surge of interest, there has been little call for our services."],"opposite":"","synonyms":""},{"def":"a sudden, strong movement forward or upwards","examples":["a tidal surge","A surge of people poured through the gates.","Police struggled to control the sudden surge forward by the demonstrators."],"opposite":"","synonyms":""},{"def":"a sudden increase in the flow of electrical power through a system","examples":["An electrical surge damaged the computer's disk drive.","The National Grid was hit by a huge power surge."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["storm surge","surge protector","surge protectors"]},{"pos":"verb","level":"C1","meanings":[{"def":"to move quickly and with force in a particular direction","examples":["The gates opened and the crowd surged forward.","Flood waters surged into their homes.","He surged past the other runners on the last lap.","A large wave sent water surging up towards them.","Her heart thumped and blood surged through her veins."],"opposite":"","synonyms":""},{"def":"to fill somebody with a strong feeling","examples":["Relief surged through her."],"opposite":"","synonyms":""},{"def":"to suddenly increase in value","examples":["Share prices surged.","Inflation surged 2 500 per cent in 2016.","Profits from cigarettes surged to $225m last year."],"opposite":"","synonyms":""},{"def":"to increase suddenly","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]