[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sur/surge/surgery__us_1.mp3","phonsUS":"/ˈsɜːrdʒəri/","level":"B2","meanings":[{"def":"medical treatment of injuries or diseases that involves cutting open a person’s body and often removing or replacing some parts; the branch of medicine connected with this treatment","examples":["major/minor surgery","to undergo heart/knee/shoulder surgery","He will require surgery on his left knee.","The doctor had to perform emergency surgery to the patient's head.","She's a specialist in reconstructive and cosmetic surgery.","The president is to undergo minor surgery to remove a small growth from his hand.","He has been performing heart surgery for ten years.","One of his specialities is minimally invasive surgery.","She felt weak for six months after undergoing major abdominal surgery.","They discussed whether patients should have to pay for all elective surgery.","patients recovering from hip replacement surgery","He will need heart bypass surgery.","My brother went on to study surgery."],"opposite":"","synonyms":""},{"def":"a place where a doctor, dentist or vet sees patients","examples":["a doctor’s/dentist’s/vet's surgery","Dr Smith isn't in the surgery today.","I'll have to go to the surgery to pick up the prescription.","I phoned the dentist's surgery and made an appointment for 2.30."],"opposite":"","synonyms":""},{"def":"the time during which a doctor, dentist or vet is available to see patients","examples":["morning/afternoon/evening surgery","surgery hours","Is there a surgery this evening?","He holds surgery from 10 a.m. to 1 p.m."],"opposite":"","synonyms":""},{"def":"a time when people can meet their Member of Parliament to ask questions and get help","examples":["a constituency surgery"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["brain surgery","tree surgery","keyhole surgery","plastic surgery","arthroscopic surgery","open-heart surgery","Bachelor of Surgery","it’s not brain surgery"]}]