[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sur/surpr/surprise__us_1_rr.mp3","phonsUS":"/sərˈpraɪz/","level":"A2","meanings":[{"def":"an event, a piece of news, etc. that is unexpected or that happens suddenly","examples":["What a nice surprise!","I have a surprise for you!","a surprise attack","There are few surprises in this year's budget.","It comes as no surprise to learn that they broke their promises.","Her letter came as a complete surprise.","‘The appointment came as a pleasant surprise to me,’ she says.","The announcements came as something of a surprise to them.","There are lots of surprises in store for visitors to the gallery.","He was there on a surprise visit to the troops.","Life’s full of surprises.","She likes springing surprises on people.","Visitors to the gallery are in for a few surprises.","I had a lovely surprise when I saw Mark there.","It was a complete surprise for me.","His refusal came as no surprise to his boss.","Johnson sprung a surprise by beating the favourite in the first round.","Roach was the surprise winner of the £10 000 first prize.","She feels that the future holds few surprises.","They launched a surprise attack on the Russian fleet.","Your mother's in for a bit of a surprise when she gets home."],"opposite":"","synonyms":""},{"def":"a feeling caused by something happening suddenly or unexpectedly","examples":["a look of surprise","in surprise She looked up in surprise.","surprise at something He gasped with surprise at her strength.","surprise at seeing, hearing, etc. They couldn't conceal their surprise at seeing us together.","I got a surprise when I saw the bill.","to somebody's surprise To everyone's surprise, the plan succeeded.","Much to my surprise, I passed.","Imagine our surprise when he walked into the room!","When we went inside we got a nasty surprise.","The decision has been greeted with surprise.","They expressed surprise at the outcome.","He feigned surprise when I went up and said hello.","His eyebrows rose in mock surprise.","It was with some surprise that I read of his resignation.","She showed no surprise at the news.","She was quick to hide her surprise.","Much to her surprise she enjoyed the party.","The president's remarks caused surprise and embarrassment.","After the initial surprise I got to like the place."],"opposite":"","synonyms":""},{"def":"the use of methods that cause feelings of surprise","examples":["A successful campaign should have an element of surprise."],"opposite":"","synonyms":""},{"def":"used to show that something is not a surprise to you, as you could easily have predicted that it would happen or be true","examples":["One of the candidates was the manager's niece, and surprise, surprise, she got the job.","Bob turned up half an hour late, surprise surprise."],"opposite":"","synonyms":""},{"def":"used when giving somebody a surprise","examples":["Surprise, surprise! Look who's here!"],"opposite":"","synonyms":""},{"def":"to happen unexpectedly so that somebody is slightly shocked; to surprise somebody","examples":["His frankness took her by surprise.","The storm took us completely by surprise."],"opposite":"","synonyms":""},{"def":"to attack or capture somebody/something unexpectedly or without warning","examples":["The police took the burglars by surprise."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"surprise, surprise","def":"used to show that something is not a surprise to you, as you could easily have predicted that it would happen or be true","examples":["One of the candidates was the manager's niece, and surprise, surprise, she got the job.","Bob turned up half an hour late, surprise surprise.","Surprise, surprise! Look who's here!"]},{"idiom":"take somebody by surprise","def":"to happen unexpectedly so that somebody is slightly shocked; to surprise somebody","examples":["His frankness took her by surprise.","The storm took us completely by surprise."]},{"idiom":"take somebody/something by surprise","def":"to attack or capture somebody/something unexpectedly or without warning","examples":["The police took the burglars by surprise."]}],"phrasal":[],"related":[]},{"pos":"verb","level":"A2","meanings":[{"def":"to make somebody feel surprised","examples":["surprise somebody It wouldn't surprise me if they got married soon.","surprise somebody how, what It's always surprised me how popular he is.","it surprises somebody that… It surprises me that you've never sung professionally.","It will surprise no one to hear that the aubergine is my favourite vegetable.","it surprises somebody to do something Would it surprise you to know that I'm thinking of leaving?","The outcome didn’t surprise me at all.","Sorry, I didn’t mean to startle you.","The explosion startled the horse.","Just the huge size of the place amazed her.","The news astonished everyone.","We were rather taken aback by her hostile reaction.","His arrogance astounded her.","The outcome did not surprise me at all.","They wanted to surprise their mother and get the breakfast ready."],"opposite":"","synonyms":"surprise"},{"def":"to attack, discover, etc., somebody suddenly and unexpectedly","examples":["The army attacked at night to surprise the rebels.","We arrived home early and surprised a burglar trying to break in."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]