[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sur/survi/survive__us_1.mp3","phonsUS":"/sərˈvaɪv/","level":"B1","meanings":[{"def":"to continue to live or exist","examples":["She was the last surviving member of the family.","Of the six people injured in the crash, only two survived.","Many of these teachers are struggling to survive financially.","He must betray his friend in order to survive.","The children had to survive by begging and stealing.","(humorous) ‘How are you these days?’ ‘Oh, surviving.’","Don't worry, it's only a scratch—you'll survive.","survive from something Some strange customs have survived from earlier times.","survive on something I can't survive on £40 a week (= it is not enough for my basic needs).","They spent two months in the jungle, surviving on small animals and fruit.","survive as something He survived as party leader until his second election defeat.","Only one copy of the book still survives.","Companies need to keep to deadlines if they are to survive and thrive.","Four of their five chickens survived to adulthood.","Nobody can survive long without water.","Once diagnosed with lung cancer, a patient is lucky to survive for five years.","Seedlings survive better in stony soil.","She cannot hope to survive long in power.","She survived through two world wars.","The frescoes have survived remarkably well.","The islanders could barely survive without an export crop.","The original apple tree survived until 1911.","Very little has survived from this period of history.","I can just about survive on what I earn."],"opposite":"","synonyms":""},{"def":"to continue to live or exist despite a dangerous event or time","examples":["survive something Her 5-year-old son miraculously survived the crash.","He only survived the attack because he was wearing body armour.","Many birds didn't survive the severe winter.","The company managed to survive the crisis.","survive something + adj. Few buildings survived the war intact.","A young boy miraculously survived a 25 000-volt electric shock.","The prime minister narrowly survived a leadership challenge.","Doctors did not expect him to survive the night.","He narrowly survived several assassination attempts."],"opposite":"","synonyms":""},{"def":"to live or exist longer than somebody/something","examples":["She survived her husband by ten years.","He is survived by his wife and two sons (= he has just died but they are still alive)."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]