[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sur/surve/survey__us_1.mp3","phonsUS":"/ˈsɜːrveɪ/","level":"A2","meanings":[{"def":"an investigation of the opinions, behaviour, etc. of a particular group of people, which is usually done by asking them questions","examples":["A recent survey showed 75 per cent of those questioned were in favour of the plan.","The survey revealed/found that…","to conduct/carry out/do/complete a survey","According to the survey, many young adults have experimented with drugs of some kind.","Another national survey conducted last year found the same result.","Roughly half of survey respondents express strong interest in additional education.","The results of the survey come as no surprise to us.","94% of people who took part in the survey said they agreed.","A customer satisfaction survey highlighted the need for clearer pricing.","The charity did a survey of people's attitudes to the disabled.","A survey into conditions in schools revealed the need for much greater investment.","The researchers used a combination of survey methods.","They are carrying out a survey of small businesses in London.","This is the largest independent survey into health ever carried out in Britain."],"opposite":"","synonyms":""},{"def":"the act of examining and recording the measurements, features, etc. of an area of land in order to make a map or plan of it","examples":["an aerial survey (= made by taking photographs from an aircraft)","A geological survey revealed the presence of oil beneath the ground."],"opposite":"","synonyms":""},{"def":"an examination of the condition of a house, etc., usually done for somebody who is thinking of buying it","examples":["a detailed structural survey"],"opposite":"","synonyms":""},{"def":"a general study, view or description of something","examples":["a comprehensive survey of modern music","a historical survey of children's clothing"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["survey course","Zagat Survey™","Ordnance Survey","Ordnance Survey map"]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sur/surve/survey__us_2_rr.mp3","phonsUS":"/sərˈveɪ/","level":"B2","meanings":[{"def":"to look carefully at the whole of something, especially in order to get a general impression of it","examples":["The next morning we surveyed the damage caused by the fire.","He surveyed himself in the mirror before going out.","She opened her eyes and surveyed her surroundings.","Her green eyes surveyed him coolly.","I surveyed the scene from my window.","She surveyed his appearance critically."],"opposite":"","synonyms":""},{"def":"to study and give a general description of something","examples":["This chapter briefly surveys the current state of European politics."],"opposite":"","synonyms":""},{"def":"to investigate the opinions or behaviour of a group of people by asking them a series of questions","examples":["We surveyed 500 smokers and found that over three quarters would like to give up.","87% of the 1 000 companies surveyed employ part-time staff.","The aim of the project is to survey public attitudes to disability.","62 percent of those surveyed disapprove of the president's handling of the problem."],"opposite":"","synonyms":""},{"def":"to measure and record the features of an area of land, for example in order to make a map or in preparation for building","examples":[],"opposite":"","synonyms":""},{"def":"to examine a building to make sure it is in good condition","examples":["Have the house surveyed before you decide whether to buy it."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]