[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sur/survi/survival__us_1.mp3","phonsUS":"/sərˈvaɪvl/","level":"B2","meanings":[{"def":"the state of continuing to live or exist, often despite difficulty or danger","examples":["the struggle/battle/fight for survival","His only chance of survival was a heart transplant.","Exporting is necessary for our economic survival.","Continued trade in these products is a threat to the survival of the species.","Chemotherapy can prolong survival in cancer patients.","Doctors gave him only a 50% chance of survival.","For the poorest people, life was merely a matter of survival.","He lacked the common instinct for survival.","Here, life is a battle for survival.","The campaign will hopefully ensure the survival of the tiger.","The arrival of this South American predator threatened the survival of native species.","his survival as leader","the chance survival of the king's letters to his mistress","In rare cases, a mutation confers a survival advantage to the organism."],"opposite":"","synonyms":""},{"def":"something that has continued to exist from an earlier time","examples":["The ceremony is a survival from pre-Christian times."],"opposite":"","synonyms":""},{"def":"the principle that only the people or things that are best adapted to their environment will continue to exist","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the survival of the fittest","def":"the principle that only the people or things that are best adapted to their environment will continue to exist","examples":[]}],"phrasal":[],"related":["Survival","survival kit","survival kits","the survival of the fittest"]},{"pos":"","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sur/survi/survival__us_2.mp3","level":"","meanings":[{"def":"a popular British television series about nature. Each programme described the life of a particular wild animal. It was broadcast from the 1960s until the 1990s.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]