[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sus/suspe/suspect__us_1.mp3","phonsUS":"/səˈspekt/","level":"B2","meanings":[{"def":"to have an idea that something is probably true or likely to happen, especially something bad, but without having definite proof","examples":["As I had suspected all along, he was not a real policeman.","suspect something If you suspect a gas leak, do not strike a match or even turn on an electric light.","Suspecting nothing, he walked right into the trap.","I didn’t want the neighbours suspecting anything.","suspect (that)… I began to suspect (that) they were trying to get rid of me.","I strongly suspect (that) this whole story is fictional.","She had no reason to suspect (that) Sylvia had not been telling the truth.","I suspect (that) she might be lying.","it is suspected that… It was suspected that the drugs had been brought into the country by boat.","suspect somebody/something to be/have something She suspected him to be an impostor.","He immediately suspected the worst.","It was widely suspected that the cadets had been acting on orders.","I would suspect that they're running short of money by now.","It was just as she had suspected: the letters had been stolen."],"opposite":"","synonyms":""},{"def":"to have an idea that somebody is guilty of something, without having definite proof","examples":["suspect somebody/something of something He resigned after being suspected of theft.","He is not suspected of any involvement in the recent attacks.","He was wrongly suspected of the crime.","They arrested four men suspected of links to an extremist group.","suspect somebody/something of doing something I suspected her of damaging the equipment.","The drug is suspected of causing over 200 deaths.","suspect somebody/something Whom do the police suspect?"],"opposite":"","synonyms":""},{"def":"to feel that something is not completely right, legal or honest, without having any proof; to not trust something","examples":["I suspected her motives in offering to help.","He dealt through a broker whose honesty he had no reason to suspect."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Prime Suspect"]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sus/suspe/suspect__us_3.mp3","phonsUS":"/ˈsʌspekt/","level":"B2","meanings":[{"def":"a person who is suspected of a crime or of having done something wrong","examples":["a murder suspect","He is the prime suspect in the case.","Five suspects have been detained for questioning.","Do you have a list of likely suspects?","She has been identified as the chief suspect.","The letter makes him a possible suspect for her murder.","The police have several suspects.","Two men were arrested as suspects in the bombing."],"opposite":"","synonyms":""},{"def":"the people you would usually expect to do something or be included in something","examples":["She thanked all the usual suspects in her acceptance speech: her family, the director, the cast and the crew."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the usual suspects","def":"the people you would usually expect to do something or be included in something","examples":["She thanked all the usual suspects in her acceptance speech: her family, the director, the cast and the crew."]}],"phrasal":[],"related":[]},{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sus/suspe/suspect__us_3.mp3","phonsUS":"/ˈsʌspekt/","level":"","meanings":[{"def":"that may be false and that cannot be relied on","examples":["Some of the evidence they produced was highly suspect.","The theory is rendered suspect by its reliance on now discredited sources."],"opposite":"","synonyms":""},{"def":"that you suspect to be dangerous or illegal","examples":["a suspect package (= one that may contain drugs, a bomb, etc.)","a controlled explosion of a suspect device (= a bomb)"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]