[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sus/suspi/suspicion__us_1.mp3","phonsUS":"/səˈspɪʃn/","level":"C1","meanings":[{"def":"a feeling that somebody has done something wrong, illegal or dishonest, even though you have no proof","examples":["They drove away slowly to avoid arousing suspicion.","on suspicion of something He was arrested on suspicion of murder.","suspicion that… I have a sneaking suspicion that she's not telling the truth.","My suspicions were confirmed when police raided the property.","She was reluctant to voice her suspicions.","His resignation seemed only to fuel suspicions.","It’s time to confront him with our suspicions.","He ended his athletics career under a cloud of suspicion when he refused to take a drug test.","Parked vehicles that arouse suspicion should be reported to the police.","Strong suspicion attached to the victim's boyfriend.","The police must have reasonable grounds for suspicion before they can get a search warrant.","The suspicion exists that Harries is stealing money from the company safe.","There is strong suspicion on both sides that information is being withheld.","information that casts suspicion on one of the most powerful figures in the party","Suspicions against the former leader remain.","Their suspicions were further fuelled when both men failed to turn up to the appointment.","We had our suspicions as to who did it, but nothing could be proved."],"opposite":"","synonyms":""},{"def":"a feeling or belief that something is true, even though you have no proof","examples":["I have a horrible suspicion that we've come to the wrong station.","I don't think he had the slightest suspicion anything was wrong.","My worst suspicions were realized when I received my redundancy notice.","The fiasco confirmed her suspicions that no thought had been put into planning the event.","I have a nasty suspicion he's organized a surprise party for me.","She was anxious to allay any suspicion that she had married for money."],"opposite":"","synonyms":""},{"def":"the feeling that you cannot trust somebody/something","examples":["Their offer was greeted with some suspicion.","Water from shallow wells should be regarded with suspicion, as it may be contaminated.","Boys were an immediate object of suspicion to her.","They viewed the new plan with great suspicion.","an atmosphere of mutual suspicion","odd behaviour that invites suspicion"],"opposite":"","synonyms":""},{"def":"a small amount of something","examples":["His mouth quivered in the suspicion of a smile.","Wasn’t there even a suspicion of truth in what he said?","The police would arrive at the slightest suspicion of trouble.","Her remarks lacked even the faintest suspicion of humour."],"opposite":"","synonyms":""},{"def":"too good, honest, etc. to have done something wrong, illegal or dishonest","examples":["Nobody who was near the scene of the crime is above suspicion.","They thought the head teacher was beyond suspicion."],"opposite":"","synonyms":""},{"def":"if the finger of blame/suspicion points or is pointed at somebody, they are suspected of having committed a crime, being responsible for something, etc.","examples":["The inquiry pointed the finger of blame at the driver of the crashed coach.","The finger of suspicion was pointed at the chicken served for lunch."],"opposite":"","synonyms":""},{"def":"suspected of doing something wrong, illegal or dishonest","examples":["The whole family is currently under suspicion of her murder.","A number of doctors came under suspicion of unethical behaviour.","He fell under suspicion of tax evasion."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"above/beyond suspicion","def":"too good, honest, etc. to have done something wrong, illegal or dishonest","examples":["Nobody who was near the scene of the crime is above suspicion.","They thought the head teacher was beyond suspicion."]},{"idiom":"the finger of blame/suspicion","def":"if the finger of blame/suspicion points or is pointed at somebody, they are suspected of having committed a crime, being responsible for something, etc.","examples":["The inquiry pointed the finger of blame at the driver of the crashed coach.","The finger of suspicion was pointed at the chicken served for lunch."]},{"idiom":"under suspicion (of something)","def":"suspected of doing something wrong, illegal or dishonest","examples":["The whole family is currently under suspicion of her murder.","A number of doctors came under suspicion of unethical behaviour.","He fell under suspicion of tax evasion."]}],"phrasal":[],"related":["the finger of blame/suspicion"]}]