[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sus/suspe/suspend__us_1.mp3","phonsUS":"/səˈspend/","level":"B2","meanings":[{"def":"to hang something from something else","examples":["be suspended from something A lamp was suspended from the ceiling.","be suspended by/on something Her body was found suspended by a rope.","be suspended by/on something from something A boat was suspended on wires from the rafters."],"opposite":"","synonyms":""},{"def":"to officially stop something for a time; to prevent something from being active, used, etc. for a time","examples":["Production has been suspended while safety checks are carried out.","The constitution was suspended as the fighting grew worse.","In the theatre we willingly suspend disbelief (= temporarily believe that the characters, etc. are real).","The EU should have the power to suspend subsidy payments to farmers who pollute the environment.","The government has decided to suspend production at the country's biggest lead plant.","Aid flights have been suspended for a week after fighting near the city's airport."],"opposite":"","synonyms":""},{"def":"to officially delay something; to arrange for something to happen later than planned","examples":["The introduction of the new system has been suspended until next year.","to suspend judgement (= delay forming or expressing an opinion)"],"opposite":"","synonyms":""},{"def":"to officially prevent somebody from doing their job, going to school, etc. for a time, as a punishment or while a complaint against them is investigated","examples":["be suspended The police officer was suspended while the complaint was investigated.","be suspended from something She was suspended from school for a week.","She has been suspended on full pay following a disciplinary hearing.","She was suspended pending the outcome of the police investigation.","The players will be automatically suspended.","We both got suspended for fighting."],"opposite":"","synonyms":""},{"def":"to float in liquid or air without moving","examples":["Small droplets are held suspended in the atmosphere."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]