[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/swe/swear/swear__us_1.mp3","phonsUS":"/swer/","level":"B2","meanings":[{"def":"to use rude or offensive language, usually because you are angry","examples":["She fell over and swore loudly.","I don't like to hear children swearing.","He heard her swear under her breath.","She was shouting, swearing, and acting in an aggressive manner towards the staff","swear at somebody/something Why did you let him swear at you like that?"],"opposite":"","synonyms":""},{"def":"to make a serious promise to do something","examples":["swear something He swore revenge on the man who had killed his father.","swear (that)… I solemnly swear (that) it will never happen again.","I swear (that) I’ll never leave you.","He swore solemnly that he would never hit her again. ‘That’ is usually left out, especially in speech.","swear to do something She made him swear not to tell anyone.","He left, swearing never to return."],"opposite":"","synonyms":""},{"def":"to promise that you are telling the truth","examples":["swear (that)… She swore (that) she’d never seen him before.","I could have sworn (= I am sure) I heard the phone ring.","swear to somebody/on something (that)… I swear to God I had nothing to do with it.","I think I put the keys back in the drawer, but I couldn't swear to it.","I swear to you, I don't know anything.","He swears up and down that he trusts me."],"opposite":"","synonyms":""},{"def":"to make a public or official promise, especially in court","examples":["swear on something Witnesses were required to swear on the Bible.","swear that… Are you willing to stand up in court and swear that you don't recognize him?","swear to do something Remember, you have sworn to tell the truth.","swear something Barons had to swear an oath of allegiance to the king.","I swear by Almighty God to tell the truth.","They refused to swear allegiance to the new ruler."],"opposite":"","synonyms":""},{"def":"to make somebody promise not to tell something to anyone","examples":["Everyone was sworn to secrecy about what had happened."],"opposite":"","synonyms":""},{"def":"to say that something is definitely true","examples":["He swore blind that he’d already paid back the money he owed me.","He swore blind that you knew all about it."],"opposite":"","synonyms":""},{"def":"to often use very rude or offensive language","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"swear blind","def":"to say that something is definitely true","examples":["He swore blind that he’d already paid back the money he owed me.","He swore blind that you knew all about it."]},{"idiom":"swear like a trooper","def":"to often use very rude or offensive language","examples":[]}],"phrasal":["swear by","swear in","swear into","swear off","swear to"],"related":["swear by","swear in","swear to","swear off","swear into","swear word","swear words","swear off something","swear to something","swear by somebody/something","swear blind","swear somebody"]}]