[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/swi/switc/switch__us_1.mp3","phonsUS":"/swɪtʃ/","level":"B1","meanings":[{"def":"to change or make something change from one thing to another","examples":["switch (over) to something We're in the process of switching over to a new system of invoicing.","switch (over) from something The company is offering good deals to customers who switch over from a competitor.","switch (over) from something to something He switched over from acting to journalism.","switch (over) If you'd like to pay monthly rather than annually, it's easy to switch over.","I found a better phone plan so I asked if I could switch.","switch between A and B Press these two keys to switch between documents on screen.","switch something (over) to something The meeting has been switched to next week.","switch something (over) from something It takes a few days to switch your account over from another bank.","switch something (over) from something to something He switched his allegiance from the British to the French.","I decided to switch my focus from swimming to cycling.","switch something over Your broadband will be switched over in less than a week.","switch something He switched sides halfway through the debate.","When did you switch jobs?","I recently switched my energy provider.","My mind suddenly switched back to my conversation with Jeremy.","The remote control allows you to switch easily between TV channels.","He decided to switch tactics."],"opposite":"","synonyms":""},{"def":"to exchange one thing for another","examples":["switch something The dates of the last two exams have been switched.","switch something over/around/round I see you've switched the furniture around (= changed its position).","switch something with something Do you think she'll notice if I switch my glass with hers?","We asked them if they would switch places with us."],"opposite":"","synonyms":""},{"def":"to do somebody else’s job for a short time or work during different hours so that they can do your job or work during your usual hours","examples":["switch (with somebody) I can't work next weekend—will you switch with me?","switch something (with somebody) Have you been able to switch your shift with anyone?","switch (something) (over/around/round) Can we switch our shifts around?"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["switch off","switch on","switch over"],"related":["switch on","dip switch","kill switch","switch off","switch over","time switch","dimmer switch","rocker switch","switch-hitter","toggle switch","bait-and-switch","timer switch","switch-hitters","asleep at the switch"]},{"pos":"noun","level":"B2","meanings":[{"def":"a small device that you press or move up and down in order to turn a light or piece of electrical equipment on and off","examples":["a light switch","an on–off switch","He flipped a switch and the lights came on.","to flick/press a switch","to throw a switch (= to move a large switch)","(figurative) A young team can't just flip a switch and have the experience needed to win.","That was in the days before electricity was available at the flick of a switch (= by simply pressing a switch).","Which switch do I press to turn it off?","This switch controls the heating system.","I couldn't find the off switch on the remote control.","Someone threw a switch and the electricity went off.","The heater is on a timer switch.","The mains switch is in the cupboard under the stairs.","The pilot reached across to the huge bank of switches on his right and flicked a couple."],"opposite":"","synonyms":""},{"def":"a change from one thing to another, especially when this is sudden and complete","examples":["a policy switch","switch in/of something a switch of priorities","switch from A to B She made the switch from full-time to part-time work when her first child was born.","The team's manager made a shrewd tactical switch in defence.","There will be no overnight switch away from old voting habits.","the recent switches between direct and indirect taxation","theatre directors who make the switch over to films","their abrupt switch in allegiance"],"opposite":"","synonyms":""},{"def":"the points on a railway line","examples":[],"opposite":"","synonyms":""},{"def":"a thin stick that bends easily","examples":[],"opposite":"","synonyms":""},{"def":"not paying enough attention to what you need to do","examples":["Someone must have been asleep at the switch to alow this to happen.","They were asleep on the job as the financial crisis deepened.","Let's hope the regulators are not asleep at the wheel."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"asleep at the switch","def":"not paying enough attention to what you need to do","examples":["Someone must have been asleep at the switch to alow this to happen.","They were asleep on the job as the financial crisis deepened.","Let's hope the regulators are not asleep at the wheel."]}],"phrasal":[],"related":[]}]