[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sym/sympa/sympathy__us_1.mp3","phonsUS":"/ˈsɪmpəθi/","level":"B2","meanings":[{"def":"the feeling of being sorry for somebody; showing that you understand and care about somebody’s problems","examples":["sympathy for somebody to express/feel sympathy for somebody","I have no sympathy for Jan—it's all her own fault.","I wish he'd show me a little more sympathy.","Our heartfelt sympathy goes out to the victims of the war.","out of sympathy for somebody Shops were closed out of sympathy for the victims.","(formal) May we offer our deepest sympathies on the death of your wife.","(formal) I would like to extend our sincere sympathies to his family at this sad time.","I'm sorry you're not well. I hope you feel better soon.","I am sorry to hear that.","That's bad luck.","How awful for you.","I'm sorry for your loss","He didn't get much sympathy from anyone.","I don't want your sympathy!","I felt a pang of sympathy for her.","It's hard to find any sympathy for such an evil man.","She expressed her deepest sympathy for him.","She married him more out of sympathy than love.","She says I haven't given her enough sympathy.","She seemed to feel some sympathy for the patients.","Their plight aroused considerable public sympathy.","a total lack of human sympathy","My sympathy lies with his wife."],"opposite":"","synonyms":""},{"def":"the act of showing support for or approval of an idea, a cause, an organization, etc.","examples":["in sympathy with somebody/something The seamen went on strike in sympathy with (= to show their support for) the dockers.","Her sympathies lie with the anti-abortion lobby.","The government showed sympathy to their cause.","She had every sympathy with him."],"opposite":"","synonyms":""},{"def":"friendship and understanding between people who have similar opinions or interests","examples":["There was no personal sympathy between them.","He has a total lack of sympathy for young people."],"opposite":"","synonyms":""},{"def":"happening because something else has happened","examples":["Share prices slipped in sympathy with the German market."],"opposite":"","synonyms":""},{"def":"not agreeing with or not wanting to support somebody/something","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in sympathy with something","def":"happening because something else has happened","examples":["Share prices slipped in sympathy with the German market."]},{"idiom":"out of sympathy with somebody/something","def":"not agreeing with or not wanting to support somebody/something","examples":[]}],"phrasal":[],"related":[]}]