[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/s/sys/syste/system__us_1.mp3","phonsUS":"/ˈsɪstəm/","level":"A2","meanings":[{"def":"an organized set of ideas or theories or a particular way of doing something","examples":["reform of the country's education system","the criminal justice system","the healthcare system","the legal/financial/political system","system for doing something Systems are in place for dealing with complaints.","system of something a system of government","How is the system organized?","The game has a complex scoring system.","Under the new system, all children will be monitored by a senior social worker.","This system allows you to study at your own speed.","Fortunately the class system is not as rigid as it once was.","The law applies to schools within the state system.","The country's economic system is close to collapse.","The governor referred to a prison system that was bankrupt of compassion.","They have a modern and efficient healthcare system.","They introduced a democratic parliamentary system in the 1980s.","He played the legal system to his own advantage.","the need to modernize the judicial system","The justice system is based on just one or two fundamental principles.","a backlog of cases clogging up the system","Once your systems are in place you can concentrate on the main focus of your business.","The new system is designed to eliminate fraud.","We need to re-examine the systems we are currently using.","The so-called reforms merely perpetuate an unjust system.","They devised an appropriate system for presenting the required information.","There is a national system for exchanging essential information.","We are implementing a new system of stock control.","Our system of granting visas is unnecessarily complicated."],"opposite":"","synonyms":""},{"def":"a group of things, pieces of equipment, etc. that are connected or work together","examples":["They installed a security system but it failed.","How does the system work?","The alarm system had been switched off.","He is currently on a life-support system in the local hospital.","attempts to disrupt the rail system","a fault in the sound system","The air-conditioning system failed.","For this month only, installing the system is free."],"opposite":"","synonyms":""},{"def":"a set of computer equipment and programs that are used together","examples":["to develop a new computer system","We're designing a voice-recognition system.","computerized information systems","The latest computer system is much more efficient.","an information retrieval system","The system runs on this workstation.","Just reboot the system and try again."],"opposite":"","synonyms":""},{"def":"a human or an animal body, or a part of it, when it is being thought of as the organs and processes that make it function","examples":["Wait until the drugs have passed through your system.","the male reproductive system","Returning to work after a long break can be a terrible shock to the system (= a big change that is difficult to deal with)."],"opposite":"","synonyms":""},{"def":"the rules or people that control a country or an organization, especially when they seem to be unfair because you cannot change them","examples":["You can't beat the system (= you must accept it).","You have to learn how to work the system if you want to succeed.","young people rebelling against the system","It's not your fault—blame the system.","She spent her years at school fighting the system.","They are all part of the corrupt system we need to change."],"opposite":"","synonyms":""},{"def":"used to say that everything is working well or that everything is ready for something to happen or be successful","examples":["The firm struggled to generate much business at the start, but now it's all systems go.","Last weekend's heavy snowfall means it's all systems go for the ski season."],"opposite":"","synonyms":""},{"def":"to do something so that you no longer feel a very strong emotion or have a strong desire","examples":["I was very angry with him, but now I feel I've got it out of my system."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"all systems go","def":"used to say that everything is working well or that everything is ready for something to happen or be successful","examples":["The firm struggled to generate much business at the start, but now it's all systems go.","Last weekend's heavy snowfall means it's all systems go for the ski season."]},{"idiom":"get something out of your system","def":"to do something so that you no longer feel a very strong emotion or have a strong desire","examples":["I was very angry with him, but now I feel I've got it out of my system."]}],"phrasal":[],"related":["midi system","system unit","expert system","honor system","immune system","limbic system","quota system","solar system","sound system","value system","Copernican system","digestive system","nervous system","operating system","system operator","distributed system","metric system","spoils system","central nervous system","Ptolemaic system"]}]