[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tac/tackl/tackle__us_1.mp3","phonsUS":"/ˈtækl/","level":"B2","meanings":[{"def":"to make a determined effort to deal with a difficult problem or situation","examples":["The government is determined to tackle inflation.","I think I'll tackle the repairs next weekend.","Firefighters tackled a blaze in a garage last night.","The drugs problem has to be tackled head-on.","The problem is being tackled with a range of measures.","We are failing to tackle the key issues."],"opposite":"","synonyms":""},{"def":"to speak to somebody about a problem or difficult situation","examples":["I tackled him about the money he owed me."],"opposite":"","synonyms":""},{"def":"to try and take the ball from an opponent","examples":["He was tackled just outside the penalty area."],"opposite":"","synonyms":""},{"def":"to make an opponent fall to the ground in order to stop them running","examples":["He can run fast and tackle hard."],"opposite":"","synonyms":""},{"def":"to deal with somebody who is violent or threatening you","examples":["He tackled a masked intruder at his home."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["nose tackle","off-tackle","fishing tackle","wedding tackle","block and tackle"]},{"pos":"noun","level":"C1","meanings":[{"def":"an act of trying to take the ball from an opponent in football (soccer), hockey, etc.; an act of knocking somebody to the ground, for example in rugby or American football","examples":["He was booked for a late tackle on Torres.","He brought the burglar down with a flying tackle.","He bruised his arm making a tackle against the Browns.","I managed to get in a sliding tackle, but he scored anyway.","Only a last-ditch tackle by Song prevented Raul from scoring.","She lost the ball in a tackle.","Their captain was sent off for a high tackle on Cooper."],"opposite":"","synonyms":""},{"def":"a player whose job is to stop opponents by knocking them to the ground","examples":[],"opposite":"","synonyms":""},{"def":"the equipment used to do a particular sport or activity, especially fishing","examples":["He owns a gun and tackle shop in the village.","We'll need some ropes and climbing tackle."],"opposite":"","synonyms":""},{"def":"a man’s sexual organs","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]