[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tag/tag__/tag__us_1.mp3","phonsUS":"/tæɡ/","level":"B2","meanings":[{"def":"a small piece of paper, cloth, plastic, etc. attached to something to identify it or give information about it","examples":["He put name tags on all his shirts.","a gift tag (= tied to a present)","The washing instructions are on the label.","address labels","Everyone at the conference had to wear a name tag."],"opposite":"","synonyms":"label"},{"def":"an electronic device that can be attached to a person, animal or object so that police, researchers, etc. know where the person, etc. is","examples":["The police use electronic tags to monitor the whereabouts of young offenders on probation."],"opposite":"","synonyms":""},{"def":"a name or phrase that is used to describe a person or thing in some way","examples":["They are finally ready to drop the tag ‘the new Beatles’.","The ‘lucky’ tag stuck for years.","The president made several jokes in an attempt to shake off his ‘humourless’ tag."],"opposite":"","synonyms":""},{"def":"a word or phrase that is added to a sentence for emphasis, for example I do in Yes, I do","examples":[],"opposite":"","synonyms":""},{"def":"a set of letters or symbols that are put before and after a piece of text or data in order to identify it or show that it is to be treated in a particular way","examples":[],"opposite":"","synonyms":""},{"def":"a short quotation or saying in a foreign language","examples":["the Latin tag ‘Si vis pacem, para bellum.’ (= if you want peace, prepare for war)"],"opposite":"","synonyms":""},{"def":"a children’s game in which one child runs after the others and tries to touch one of them","examples":[],"opposite":"","synonyms":""},{"def":"a symbol or name used by a graffiti writer and painted in a public place","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["tag on","dog tag","name tag","tag line","tag onto","tag sale","tag team","phone tag","price tag","tag along","tag cloud","question tag","tag question","telephone tag","tag lines","tag sales","tag teams"]},{"pos":"verb","level":"B2","meanings":[{"def":"to fasten a tag onto something/somebody","examples":["Each animal was tagged with a number for identification.","The containers were tagged with colour-coded labels."],"opposite":"","synonyms":""},{"def":"to attach an electronic device to a person, animal or object so that the police, researchers, etc. know where the person, etc. is","examples":["Persistent young offenders will be electronically tagged in a scheme to cut youth crime."],"opposite":"","synonyms":""},{"def":"to give somebody/something a name that describes what they are or do","examples":["The country no longer wanted to be tagged as a Third World nation."],"opposite":"","synonyms":""},{"def":"to add a set of letters or symbols to a piece of text or data in order to identify it or to show that it is to be treated in a particular way","examples":[],"opposite":"","synonyms":""},{"def":"to add a link to various users' profiles from a photo on a social media website","examples":["If you upload a photo, people can tag the people in it.","The site lets you tag and share photographs."],"opposite":"","synonyms":""},{"def":"to leave a name or mark on a piece of graffiti to show who made it","examples":["Graffiti artists started tagging and painting entire subway trains."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["tag along","tag on","tag onto"],"related":[]}]