[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tak/take_/take__us_1.mp3","phonsUS":"/teɪk/","level":"A1","meanings":[{"def":"to carry or move something from one place to another","examples":["take something Remember to take your coat when you leave.","take something with you I forgot to take my bag with me when I got off the bus.","take somebody something Shall I take my host family a gift?","take something to somebody/something Can you take my suit to the dry-cleaner's?","You need to take your laptop to the technician.","take something for somebody/something Don't forget to take a present for Catherine's new baby.","My things had already been taken to my room.","She took her bags along with her.","Think about what you need to take for the trip."],"opposite":"","synonyms":""},{"def":"to go with somebody from one place to another, especially to guide or lead them","examples":["take somebody It's too far to walk—I'll take you by car.","take somebody to something A boy took us to our room.","take somebody doing something I'm taking the kids swimming later.","take somebody to do something The boys were taken to see their grandparents most weekends.","It’s too far to walk—I’ll take you by car.","Firefighters led the survivors to safety.","The president arrived, escorted by twelve bodyguards.","My mother drove us to the airport.","The attendant showed us to our seats.","He always walked her home.","Have you walked the dog yet today?","She guided us through the busy streets.","We were guided around the museums.","She ushered her guests to their seats.","A young woman directed them to the station.","You should take her home soon.","I asked them if they'd take me with them."],"opposite":"","synonyms":"take"},{"def":"to make somebody/something go from one level, situation, etc. to another","examples":["Her energy and talent took her to the top of her profession.","The new loan takes the total debt to $100 000.","I'd like to take my argument a stage further.","He believes he has the skills to take the club forward.","We'll take the matter forward at our next meeting (= discuss it further)."],"opposite":"","synonyms":""},{"def":"to need or require a particular amount of time","examples":["take something The process took about a year.","The journey to the airport takes about half an hour.","take something to do something It takes about half an hour to get to the airport.","That cut is taking a long time to heal.","The official seemed to take hours to examine my passport.","take somebody something That should only take you ten minutes.","take somebody something to do something It took her three hours to repair her bike.","It'll take her time to recover from the illness.","take something for somebody to do something It'll take time (= take a long time) for her to recover from the illness.","+ adv. I need a shower—I won't take long.","How long do you think this storm will last?","The movie lasted over two hours.","His annoyance won’t last.","The money she gave us should last until next week.","It takes (me) at least an hour to get home from work.","How long will the flight take?","The water took ages to boil."],"opposite":"","synonyms":""},{"def":"to photograph somebody/something","examples":["take something to take a picture/photo/shot of somebody/something","to have your picture/photo taken"],"opposite":"","synonyms":""},{"def":"to use a form of transport, a road, a path, etc. to go to a place","examples":["to take the bus/train","to take a cab/plane","Take the second road on the right.","It's more interesting to take the coast road.","You'll have to take a taxi. There's no other way of getting there.","You fly to Brussels and take the train to Bruges.","We took a ferry across to the island.","We took a bus south to Cairo.","They took the night train to Vienna."],"opposite":"","synonyms":""},{"def":"to put your hands or arms around somebody/something and hold them/it; to reach for somebody/something and hold them/it","examples":["I passed him the rope and he took it.","Free newspapers: please take one.","Can you take (= hold) the baby for a moment?","He took her hand/took her by the hand (= held her hand, for example to lead her somewhere).","She took the child in her arms and kissed him."],"opposite":"","synonyms":""},{"def":"to remove something/somebody from a place or a person","examples":["Will you take your books off the table?","The sign must be taken down.","He took some keys out of his pocket.","My name had been taken off the list.","She was playing with a knife, so I took it away from her.","(informal) She was playing with a knife, so I took it off her.","(figurative) The new sports centre will take the pressure off the old one."],"opposite":"","synonyms":""},{"def":"to remove something without permission or by mistake","examples":["Someone has taken my scarf.","Did the burglars take anything valuable?","All she had taken was her passport and driving licence.","(figurative) The storms took the lives of 50 people."],"opposite":"","synonyms":""},{"def":"to get something from a particular source","examples":["take something from something The scientists are taking water samples from the river.","The machine takes its name from its inventor.","take something out of something Part of her article is taken straight (= copied) out of my book."],"opposite":"","synonyms":""},{"def":"to sit down in or use a chair, etc.","examples":["Are these seats taken?","Come in; take a seat.","May I sit here?","Sit still, will you!","Please sit down.","Come in and sit yourselves down.","She was seated at the head of the table.","She perched herself on the edge of the bed."],"opposite":"","synonyms":"sit"},{"def":"to eat, drink, etc. something","examples":["Do you take sugar in your coffee?","The doctor has given me some medicine to take for my cough.","He started taking drugs (= illegal drugs) at college."],"opposite":"","synonyms":""},{"def":"to find out and record something; to write something down","examples":["The police officer took my name and address.","Did you take notes in the class?"],"opposite":"","synonyms":""},{"def":"to do an exam or a test","examples":["When did you take your driving test?"],"opposite":"","synonyms":""},{"def":"to study a subject at school, college, etc.","examples":["She is planning to take a course in web design.","Last year I started taking yoga classes.","How many subjects are you taking this year?"],"opposite":"","synonyms":""},{"def":"to use a particular course of action in order to deal with or achieve something","examples":["take something We need to take a different approach to the problem.","The government is taking action to combat drug abuse."],"opposite":"","synonyms":""},{"def":"used with nouns to say that somebody is doing something, performing an action, etc.","examples":["to take a look","to take a break","to take a shot at somebody/something","to take a step/walk/stroll","to take a bath/shower/wash","to take a bite/drink/sip","to take a deep breath","(British English) We will take a decision on the matter next week.","She's taken a nasty fall and has her leg in plaster.","Experts have urged ministers to take the necessary steps to resolve the issue."],"opposite":"","synonyms":""},{"def":"to test or measure something","examples":["to take somebody’s temperature","I need to have my blood pressure taken."],"opposite":"","synonyms":""},{"def":"to capture a place or person; to get control of something","examples":["take something The rebels succeeded in taking the town.","The state has taken control of the company.","take something from somebody The militants took the city from government forces.","take somebody + noun The rebels took him prisoner.","He was taken prisoner by the rebels.","The bank robbers took several employees hostage."],"opposite":"","synonyms":""},{"def":"to choose, buy or rent something","examples":["I'll take the grey jacket.","We took a room at the hotel for two nights."],"opposite":"","synonyms":""},{"def":"to buy a newspaper or magazine regularly","examples":["We take the ‘Express’."],"opposite":"","synonyms":""},{"def":"to accept or receive something","examples":["If they offer me the job, I'll take it.","She was accused of taking bribes.","I'll take the call in my office.","I take full responsibility for my actions.","Why should I take the blame for somebody else's mistakes?","If you choose deceit, then you must take the consequences of your actions.","If you take my advice you'll have nothing more to do with him.","Will you take $10 for the book (= will you sell it for $10)?","The store took (= sold goods worth) $100 000 last week."],"opposite":"","synonyms":""},{"def":"to act in response to an opportunity","examples":["When the bus stopped for fuel, we took the opportunity to get something to eat.","England failed to take their chances and had to settle for a draw.","He isn't afraid to take risks.","Take the initiative and fill your life with exciting experiences."],"opposite":"","synonyms":""},{"def":"to accept somebody as a customer, patient, etc.","examples":["The school doesn't take boys (= only has girls).","The dentist can't take any new patients."],"opposite":"","synonyms":""},{"def":"to experience or be affected by something","examples":["The school took the full force of the explosion.","Can the ropes take the strain (= not break)?","The team took a terrible beating.","I'm afraid your husband has taken a turn for the worse."],"opposite":"","synonyms":""},{"def":"to be able to bear something","examples":["She can't take criticism.","I don't think I can take much more of this heat.","I find his attitude a little hard to take.","It was clear that she wasn't going to take any nonsense."],"opposite":"","synonyms":""},{"def":"to react to something/somebody in a particular way","examples":["He took the criticism surprisingly well.","These threats are not to be taken lightly.","I wish you'd take me seriously.","I was being sarcastic but you took my comment literally.","She took it in the spirit in which it was intended.","Harry took his rejection philosophically.","She took the news of her father's death very badly.","I wanted to be taken seriously as an artist.","They won't take kindly to being ordered about."],"opposite":"","synonyms":""},{"def":"to understand or consider something in a particular way","examples":["take something How am I supposed to take that remark?","Taken overall, the project was a success.","take something as something She took what he said as a compliment.","take something to do something What did you take his comments to mean?"],"opposite":"","synonyms":""},{"def":"to consider somebody/something to be somebody/something, especially when you are wrong","examples":["take somebody/something for somebody/something Even the experts took the painting for a genuine Van Gogh.","Of course I didn't do it! What do you take me for (= what sort of person do you think I am)?","take somebody/something to be somebody/something I took the man with him to be his father.","I mistakenly took her for the Senator's wife.","He's not the fool you take him for."],"opposite":"","synonyms":""},{"def":"to have a particular feeling, opinion or attitude","examples":["My parents always took an interest in my hobbies.","Don't take offence (= be offended) at what I said.","I took a dislike to him.","He takes the view that children are responsible for their own actions."],"opposite":"","synonyms":""},{"def":"to reduce one number by the value of another","examples":["take A (away) (from B) Take 5 from 12 and you're left with 7.","B take away A (informal) 80 take away 5 is 75."],"opposite":"","synonyms":""},{"def":"used to introduce somebody/something as an example","examples":["Lots of couples have problems in the first year of marriage. Take Ann and Paul."],"opposite":"","synonyms":""},{"def":"to have or start to have a particular form, position or state","examples":["Our next class will take the form of a debate.","The new president takes office in January.","The home side had a chance to take the lead."],"opposite":"","synonyms":""},{"def":"to need or require something in order to happen or be done","examples":["take somebody/something to do something It only takes one careless driver to cause an accident.","It doesn't take much to make her angry.","take something (informal) He didn't take much persuading (= he was easily persuaded)."],"opposite":"","synonyms":""},{"def":"to use something in order to work","examples":["The buses have been adapted to take biofuel."],"opposite":"","synonyms":""},{"def":"to wear a particular size in shoes or clothes","examples":["What size shoes do you take?"],"opposite":"","synonyms":""},{"def":"to have enough space for something/somebody; to be able to hold or contain a particular quantity","examples":["The bus can take 60 passengers.","The tank takes 50 litres."],"opposite":"","synonyms":""},{"def":"to be the teacher or leader in a class or a religious service","examples":["take somebody (for something) The head teacher usually takes us for French.","take something Mr Perkins took the morning service."],"opposite":"","synonyms":""},{"def":"to go over or around something","examples":["The horse took the first fence well.","He takes bends much too fast."],"opposite":"","synonyms":""},{"def":"to kick or throw the ball from a fixed or agreed position","examples":["to take a penalty/free kick/corner"],"opposite":"","synonyms":""},{"def":"to use a particular method to find out people’s opinions","examples":["to take a vote/poll/survey"],"opposite":"","synonyms":""},{"def":"to be successful; to work","examples":["The skin graft failed to take."],"opposite":"","synonyms":""},{"def":"to have or require something when used in a sentence or other structure","examples":["The verb ‘rely’ takes the preposition ‘on’."],"opposite":"","synonyms":""},{"def":"used to say that you do not care if somebody accepts or rejects your offer","examples":[],"opposite":"","synonyms":""},{"def":"used to say that somebody does not have a strong opinion about something","examples":["Dancing? I can take it or leave it."],"opposite":"","synonyms":""},{"def":"to have the qualities, ability, etc. needed to be successful","examples":[],"opposite":"","synonyms":""},{"def":"used to say that you cannot trust somebody to behave well in public","examples":["You haven’t spilled your coffee again! I can’t take you anywhere!"],"opposite":"","synonyms":""},{"def":"to accept something/somebody without wishing it/them to be different or without thinking about it/them very much in advance","examples":["She takes life as it comes."],"opposite":"","synonyms":""},{"def":"to suppose; to assume","examples":["I take it you won't be coming to the party?"],"opposite":"","synonyms":""},{"def":"used to emphasize that what you are going to say is the truth","examples":["Take it from me—he'll be a millionaire before he's 30."],"opposite":"","synonyms":""},{"def":"to make somebody physically or mentally tired","examples":["Looking after small children really takes it out of you."],"opposite":"","synonyms":""},{"def":"to decide to do something without asking permission or advice","examples":[],"opposite":"","synonyms":""},{"def":"to need a lot of effort or time; to be very difficult to do","examples":[],"opposite":"","synonyms":""},{"def":"used as an exclamation when you are hitting somebody or attacking them in some other way","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"somebody can take it or leave it","def":"used to say that you do not care if somebody accepts or rejects your offer","examples":["Dancing? I can take it or leave it."]},{"idiom":"have (got) what it takes","def":"to have the qualities, ability, etc. needed to be successful","examples":[]},{"idiom":"I, you, etc. can’t take somebody anywhere","def":"used to say that you cannot trust somebody to behave well in public","examples":["You haven’t spilled your coffee again! I can’t take you anywhere!"]},{"idiom":"take something as it comes | take somebody as they come","def":"to accept something/somebody without wishing it/them to be different or without thinking about it/them very much in advance","examples":["She takes life as it comes."]},{"idiom":"take it (that…)","def":"to suppose; to assume","examples":["I take it you won't be coming to the party?"]},{"idiom":"take it from me (that…)","def":"used to emphasize that what you are going to say is the truth","examples":["Take it from me—he'll be a millionaire before he's 30."]},{"idiom":"take it/a lot out of somebody","def":"to make somebody physically or mentally tired","examples":["Looking after small children really takes it out of you."]},{"idiom":"take it on/upon yourself to do something","def":"to decide to do something without asking permission or advice","examples":[]},{"idiom":"take some/a lot of doing","def":"to need a lot of effort or time; to be very difficult to do","examples":[]},{"idiom":"take that!","def":"used as an exclamation when you are hitting somebody or attacking them in some other way","examples":[]}],"phrasal":["be taken up with","be taken with","take aback","take after","take against","take apart","take away","take away from","take back","take down","take in","take it out on","take off","take on","take out","take out of","take out of himself/herself","take over","take through","take to","take up","take up on","take up with"],"related":["out-take","take in","take off","take-off","take on","take out","take to","take up","take-up","piss-take","take away","take back","take down","take over","double take","take aback","take after","take apart","take against"]},{"pos":"noun","level":"","meanings":[{"def":"a scene or part of a film that is filmed at one time without stopping the camera","examples":["We managed to get it right in just two takes."],"opposite":"","synonyms":""},{"def":"an amount of money that somebody receives, especially the money that is earned by a business during a particular period of time","examples":["How much is my share of the take?","The auction was predicted to make $20 million, but the actual take turned out to be half that figure."],"opposite":"","synonyms":""},{"def":"the particular opinion or idea that somebody has about something","examples":["What's his take on the plan?","a new take on the Romeo and Juliet story (= a way of presenting it)"],"opposite":"","synonyms":""},{"def":"to accept money from somebody for helping them in a dishonest or illegal way","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be on the take","def":"to accept money from somebody for helping them in a dishonest or illegal way","examples":[]}],"phrasal":[],"related":[]}]