[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tap/tap__/tap__us_1.mp3","phonsUS":"/tæp/","level":"B2","meanings":[{"def":"to hit somebody/something quickly and lightly","examples":["tap (away) (at something) Someone tapped at the door.","He was busy tapping away at his computer.","tap somebody/something Ralph tapped me on the shoulder.","Tap the icon to open the app.","He tapped home his second goal from close range.","She tapped the ice with a stick."],"opposite":"","synonyms":""},{"def":"if you tap your fingers, feet, etc. or they tap, you hit them gently against a table, the floor, etc., for example to the rhythm of music","examples":["He kept tapping his fingers on the table.","The music set everyone's feet tapping."],"opposite":"","synonyms":""},{"def":"to make use of a source of energy, knowledge, etc. that already exists","examples":["tap something We need to tap the expertise of the people we already have.","tap into something The movie seems to tap into a general sentimentality about animals."],"opposite":"","synonyms":""},{"def":"to fit a device to a phone so that somebody’s calls can be listened to secretly","examples":["He was convinced his phone was being tapped."],"opposite":"","synonyms":""},{"def":"to cut into a tree in order to get liquid from it","examples":[],"opposite":"","synonyms":""},{"def":"to choose somebody to do a particular job","examples":["Richards has been tapped to replace the retiring chairperson."],"opposite":"","synonyms":""},{"def":"to produce a tap (6)","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["tap for","tap in","tap out"],"related":["tap in","tap-in","tap for","tap out","tap dance","tap water","spinal tap","tap dancer","tap-dancing","tap penalty","tap-ins","tap dances","tap dancers","tap something","on tap"]},{"pos":"noun","level":"B2","meanings":[{"def":"a device for controlling the flow of water from a pipe into a bath or sink","examples":["bath taps","the hot/cold tap (= the tap that hot/cold water comes out of)","Turn the tap on/off.","Don't leave the tap running.","You have to run the tap a long time before the hot water comes.","the sound of a dripping tap","I put my head under the tap and let the cool water run over me."],"opposite":"","synonyms":""},{"def":"a device for controlling the flow of liquid or gas from a pipe or container","examples":["a gas tap","beer taps"],"opposite":"","synonyms":""},{"def":"a light hit with your hand or fingers","examples":["tap on something He felt a tap on his shoulder and turned round.","tap at something a tap at the door"],"opposite":"","synonyms":""},{"def":"an act of fitting a device to a phone so that somebody’s phone calls can be listened to secretly","examples":["a phone tap"],"opposite":"","synonyms":""},{"def":"a style of dancing in which you tap to the rhythm of the music with your feet, wearing special shoes with pieces of metal on the heels and toes","examples":[],"opposite":"","synonyms":""},{"def":"a speech sound that is produced by striking the tongue quickly and lightly against the part of the mouth behind the upper front teeth. The ‘t’ in later in American English is an example of a tap.","examples":[],"opposite":"","synonyms":""},{"def":"available to be used at any time","examples":["We have this sort of information on tap."],"opposite":"","synonyms":""},{"def":"beer that is on tap is in a barrel with a tap on it","examples":["The pub has two sorts of beer on tap."],"opposite":"","synonyms":""},{"def":"something that is on tap is being discussed or prepared and will happen soon","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"on tap","def":"available to be used at any time","examples":["We have this sort of information on tap.","The pub has two sorts of beer on tap."]}],"phrasal":[],"related":[]}]