[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tar/targe/target__us_1.mp3","phonsUS":"/ˈtɑːrɡɪt/","level":"A2","meanings":[{"def":"a result that you try to achieve","examples":["to meet/hit a target","The firm is on track to achieve its growth target for the year.","The university will reach its target of 5 000 students next September.","The department has missed its sales target for the third month running.","Set yourself targets that you can reasonably hope to achieve.","on target The new sports complex is on target to open in June.","off target These figures are way off target.","a target date of April 2022","a target audience/market (= the particular audience, area etc. that a product, programme, etc. is aimed at)","The film's target demographic is women aged 18–49 years.","We're using social media to communicate with our target customers.","Set yourself targets that you can reasonably hope to achieve.","attainment targets in schools","What is the main objective of this project?","He continued to pursue his goal of becoming an actor.","The object is to educate people about road safety.","He joined the society for political ends.","That’s only OK if you believe that the end justifies the means (= bad methods of doing something are acceptable if the final result is good).","Hospital performance targets will not be met.","Many pay agreements reached were over the original target of 4%.","Pupils should be given a target to aim for.","Sales so far this year are 20% above target.","She has always set herself very high targets.","The CEO has set new targets for growth.","The company pays bonuses to workers who exceed production targets.","We are well within our target for trains arriving on time.","We are working towards a target of twenty cars a week.","What's the target market for this product?"],"opposite":"","synonyms":"target"},{"def":"an object, a person or a place that people aim at when attacking","examples":["They attacked military and civilian targets.","target for somebody/something Doors and windows are an easy target for burglars.","The children became the target for their father’s aggressive outbursts.","It's a prime target (= an obvious target) for terrorist attacks.","target of something (figurative) He's become the target of a lot of criticism recently.","The bomb reached its intended target ten seconds later.","The damaged ship presented a tempting target.","The flare overshot its target and set fire to a hotel.","The missile veered way off target and landed in the sea.","The radar beam can track a number of targets almost simultaneously.","The stationary trucks were sitting targets for the enemy planes.","The company could become a takeover target.","The real target of his satire is religion.","The President is a favorite target of comedians.","Politically speaking, his jibes were right on target."],"opposite":"","synonyms":""},{"def":"an object that people practise shooting at, especially a round board with circles on it","examples":["to aim at a target","to hit/miss the target","target practice","The archers were setting up their targets.","The boys used an old tree stump as a target.","The shot went wide of the target.","Patton was just off target with a header.","(figurative) It should be possible to deliver the drug direct to the target site."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Target™","soft target","target man","target language","target men","sitting target","target languages"]},{"pos":"verb","level":"B2","meanings":[{"def":"to aim an attack or a criticism at somebody/something","examples":["target somebody/something He accused the group of deliberately targeting civilians.","The company has been targeted by animal rights groups for its use of dogs in drugs trials.","target something at somebody/something The criticism was targeted chiefly at the managing director.","The missiles were mainly targeted at the United States.","The authority was accused of unfairly targeting minority groups.","Police are actively targeting known offenders.","Children are deliberately targeted."],"opposite":"","synonyms":""},{"def":"to try to have an effect on a particular group of people or particular thing","examples":["target somebody/something Film-makers are increasingly targeting international markets.","target something at/on somebody The campaign is specifically targeted at children.","target something for something This hospital has been targeted for additional funding.","a new magazine that targets single men","an exercise that directly targets the back muscles","a carefully targeted marketing campaign","The products are targeted at young people.","The booklet is targeted at people approaching retirement.","Tax cuts should be targeted on the poor.","We sought to target help on those who most needed it.","We target our services towards specific groups of people."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]