[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tea/teach/teaching__us_3.mp3","phonsUS":"/ˈtiːtʃɪŋ/","level":"A2","meanings":[{"def":"the work of a teacher","examples":["She wants to go into teaching (= make it a career).","He has now retired from full-time teaching","The course combines classroom teaching and distance learning.","How much teaching do you actually do?","the teaching profession","teaching staff","traditional/innovative teaching methods","Applicants must hold a recognized teaching qualification.","Music can be a valuable teaching tool.","I have a part-time teaching job.","Critics say that these tests waste teaching time.","I've been in teaching for ten years.","Mr Murphy retired at the end of a 30-year teaching career.","She used puppets as teaching aids.","The aim of the campaign is to promote the teaching of science.","The teaching year runs from October to May.","Work experience is integrated into the teaching programme.","Write each teaching point on the whiteboard.","He has extensive teaching experience.","Teaching methods have not changed as much as people might think.","The system should reward good classroom teaching.","secondary school teaching"],"opposite":"","synonyms":""},{"def":"the ideas of a particular person or group, especially about politics, religion or society, that are taught to other people","examples":["views that go against traditional Catholic teaching","the teachings of Lenin","The culture is based in the teachings of Confucius.","He was hoping to deepen his awareness of Islamic teaching.","the fundamental teachings of the Buddha","the disciples who passed on Jesus's teaching","the Church's teaching on forgiveness","He followed the teachings of the Bible on this subject."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["student teaching","teaching hospital","teaching practice","teaching assistant","teaching fellow","teaching hospitals","English Language Teaching","communicative language teaching"]}]