[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tea/teach/teach__us_1.mp3","phonsUS":"/tiːtʃ/","level":"A1","meanings":[{"def":"to give lessons to students in a school, college, university, etc.; to help somebody learn something by giving information about it","examples":["She teaches at our local school.","He taught for several years before becoming a writer.","teach something I'll be teaching history and sociology next term.","to teach yoga classes","(North American English) to teach school (= teach in a school)","teach something to somebody He teaches English to advanced students.","teach somebody something He teaches them English.","teach somebody My wife teaches undergraduate students.","teach somebody about something Schools should teach children about healthy eating.","John teaches French at the local school.","She taught me how to change a tyre.","Our priority is to educate people about the dangers of drugs.","Members of staff should be instructed in the use of fire equipment.","She’s a trained midwife.","He’s training the British Olympic swimming team.","He’s the best football player I’ve ever coached.","(British English) She coaches some of the local children in maths.","(North American English) She tutors some of the local children in math.","school/​college teachers","a swimming/​science instructor","a horse trainer","Do you have a personal trainer?","a football coach","tutors working with migrant children","information which helps the teacher teach more effectively","I am not qualified to teach this subject.","training courses designed to teach managerial techniques","the languages that are commonly taught in schools today","teaching children about the world around them"],"opposite":"","synonyms":""},{"def":"to show somebody how to do something so that they will be able to do it themselves","examples":["teach somebody to do something Could you teach me to do that?","I'm trying to teach my daughter to behave.","teach somebody how, what, etc… My father taught me how to ride a bike."],"opposite":"","synonyms":""},{"def":"to make somebody feel or think in a different way","examples":["teach somebody to do something She taught me to be less critical of other people.","teach somebody that… My parents taught me that honesty was always the best policy.","teach that… The book teaches that we shouldn't be afraid of change.","teach somebody something Our experience as refugees taught us many valuable lessons."],"opposite":"","synonyms":""},{"def":"to persuade somebody not to do something again by making them suffer so much that they are afraid to do it","examples":["teach somebody to do something Lost all your money? That'll teach you to gamble.","I'll teach you to call (= punish you for calling) me a liar!","teach somebody something The accident taught me a lesson I'll never forget."],"opposite":"","synonyms":""},{"def":"to tell or show somebody how to do something that they can already do well, and probably better than you can","examples":[],"opposite":"","synonyms":""},{"def":"(you cannot) successfully make people change their ideas, methods of work, etc., when they have had them for a long time","examples":[],"opposite":"","synonyms":""},{"def":"to teach students only what is necessary in order to pass a particular test, rather than help them develop a range of skills","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"teach your grandmother to suck eggs","def":"to tell or show somebody how to do something that they can already do well, and probably better than you can","examples":[]},{"idiom":"(you can’t) teach an old dog new tricks","def":"(you cannot) successfully make people change their ideas, methods of work, etc., when they have had them for a long time","examples":[]},{"idiom":"teach to the test","def":"to teach students only what is necessary in order to pass a particular test, rather than help them develop a range of skills","examples":[]}],"phrasal":[],"related":["teach-in","pre-teach","teach-ins","teach your grandmother to suck eggs","(you can’t) teach an old dog new tricks"]}]