[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tea/team_/team__us_1.mp3","phonsUS":"/tiːm/","level":"A1","meanings":[{"def":"a group of people who play a particular game or sport against another group of people","examples":["a football/basketball/soccer team","They play volleyball for the national team.","We played against a team from the neighbouring school.","(British English) Whose team are you in?","(North American English) Whose team are you on?","The team is/are not playing very well this season.","a team event (= one played by groups of people rather than individual players)","Cole has been selected for the team to meet Italy next week.","I'm playing for the first team this week.","Our team lost the final.","The team competes in a local league.","Can you get a team together by Saturday?","He hopes to sign with an NFL team.","She's in the team for the World Championships.","Spain are fielding a three-man team in this race.","There are six teams taking part.","You didn't make the team, I'm afraid.","After two years out with injury, he's back on the team.","Giles led his team to a first Test victory for 10 years.","He is likely to be selected for the England cricket team to play South Africa.","We want to encourage team sports in schools.","What team do you support?","The lads were given a rousing half-time team talk by the coach.","We have a great team chemistry.","The manager gives his team talks in English."],"opposite":"","synonyms":""},{"def":"a group of people who work together at a particular job","examples":["a team member/leader","a member of the senior management team","She leads a research team of twenty scientists.","He joined the legal team five years ago.","team of somebody A team of experts has/have been called in to investigate.","He works with a team of researchers.","She was part of the design team working on the project.","as a team We're learning to work together as a team.","We have a team of eight working on product development.","The charity sent a team to the area hit by the earthquake.","The team consisted of six investigators and two secretaries.","It took a tremendous team effort to finish the project on time.","The team will work closely with other government departments.","There are 20 people in the team.","Willing volunteers formed teams of helpers to carry everything in.","You and I make a good team.","a crack team of lawyers","a joint team of European and North American economists","a specially trained team of advisers","a member of the senior management team","the Army Parachute Display Team","He thanked his legal team and his family for their support.","He was part of a research team under Professor James."],"opposite":"","synonyms":""},{"def":"two or more animals that are used together to pull a cart, etc.","examples":[],"opposite":"","synonyms":""},{"def":"to give up something that is important to you or to do something that is unpleasant in order to benefit your friends or colleagues","examples":["Sometimes you have to take one for the team.","I know it sounds unfair, but we need you to take one for the team."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"take one for the team","def":"to give up something that is important to you or to do something that is unpleasant in order to benefit your friends or colleagues","examples":["Sometimes you have to take one for the team.","I know it sounds unfair, but we need you to take one for the team."]}],"phrasal":[],"related":["A-team","tag team","team up","farm team","SWAT team","crash team","dream team","team player","team spirit","team building","team handball","team players","team spirits","team up (with somebody)","team somebody/something up (with somebody)"]},{"pos":"verb","level":"","meanings":[{"def":"to put two or more things or people together in order to do something or to achieve a particular effect","examples":["This production of ‘Macbeth’ teams two of our finest actors.","He was teamed with his brother in the doubles."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["team up"],"related":[]}]