[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/ten/tend_/tend__us_1.mp3","phonsUS":"/tend/","level":"B1","meanings":[{"def":"to be likely to do something or to happen in a particular way because this is what often or usually happens","examples":["Women tend to live longer than men.","People tend to be happier if they are in a long-term relationship.","When I'm tired, I tend to make mistakes.","It tends to get very cold here in the winter.","People tend to think that the problem will never affect them.","I tend to agree with many of the points you make.","I tend to focus on dance, but acting and singing are equally important to me.","Large class size will tend to increase the use of the lecture.","Women generally earn less than men.","Generally speaking, jobs traditionally done by women are paid at a lower rate than those traditionally done by men.","In general/By and large, women do not earn as much as men.","Certain jobs, like nursing and cleaning, are still mainly carried out by women.","Senior management posts are predominantly held by men.","Most senior management posts tend to be held by men.","Women are, for the most part, still paid less than men.","Economic and social factors are, to a large extent, responsible for women being concentrated in low-paid jobs."],"opposite":"","synonyms":""},{"def":"to take a particular direction or often have a particular quality","examples":["His views tend towards the extreme.","Prices have tended downwards over recent years."],"opposite":"","synonyms":""},{"def":"to care for somebody/something","examples":["tend somebody/something a shepherd tending his sheep","Doctors and nurses tended the injured.","well-tended gardens","tend to somebody/something Ambulance crews were tending to the injured.","They helped the farmers tend their cattle.","She lovingly tended her garden.","He tended to her every need."],"opposite":"","synonyms":""},{"def":"to serve customers in a store, bar, etc.","examples":["He had a job tending bar in San Francisco."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]