[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/ter/term_/term__us_1.mp3","phonsUS":"/tɜːrm/","level":"A2","meanings":[{"def":"a word or phrase used as the name of something, especially one connected with a particular type of language","examples":["a technical/legal/generic term","a glossary of terms","a term of abuse","What is the meaning of the term ‘globalization’?","William Gibson coined the term (= invented the term) ‘cyberspace’ in 1984.","term for something ‘Old man’ is a slang term for ‘father’.","The term ‘Generation X’ refers to the people born in the 1950s and 1960s.","‘Register’ is the term commonly used to describe different levels of formality in language.","I would describe myself, for want of a better term, as a nerd.","Do not write more than 200 words.","He uses a lot of long words.","technical/​legal/​scientific terms","‘Old man’ is a slang term for ‘father’.","Who coined the phrase ‘fake news’?","He tends to use a lot of slang expressions that I’ve never heard before.","‘Let the cat out of the bag’ is an idiom meaning to tell a secret by mistake.","It is important to clarify what is meant by climate change.","Climate change can/may be defined as ‘the long-term fluctuations in temperature, precipitation, wind and other aspects of the earth’s climate’.","A generally accepted definition of global warming is the gradual increase in the overall temperature of the earth’s atmosphere due to the greenhouse effect.","The greenhouse effect is defined by the author as the process by which heat from the sun is trapped in the earth’s atmosphere, causing the temperature of the earth to rise.","The author uses the term climate change to refer to any significant change in measures of climate lasting for an extended period.","The term ‘carbon footprint’ refers to the amount of carbon dioxide released into the atmosphere as a result of the activities of an individual or organization.","Scientists suggest that increased carbon dioxide in the atmosphere will result in an increase in global temperatures, and the term ‘global warming’ is used to describe this phenomenon.","I prefer the term ‘network’ to ‘community’.","I think we can apply the term ‘genius’ to the painter.","The term ‘acid rain’ was coined in the 19th century.","Try entering the search term ‘classical music’.","He hadn't realized that ‘chuck’ was a term of endearment."],"opposite":"","synonyms":"word"},{"def":"(especially in the UK) one of the three periods in the year during which classes are held in schools, universities, etc.","examples":["the spring/summer/autumn/fall term","during term Many students now have paid employment during term.","(British English) It's nearly the end of term.","(North American English) It's nearly the end of the term."],"opposite":"","synonyms":""},{"def":"a period of time for which something lasts; a fixed or limited time","examples":["during the president’s first term of/in office","term as something a term as president/mayor/governor/prime minister","term of something He was sentenced to a prison/jail term of 25 years for the offence.","She served a five-year term of imprisonment.","The contract was for a fixed term of five years.","to extend the term of a loan","His presidential term expires at the end of May.","The term of agreement can be for either two or three years.","Her current term runs until January 2024.","She is now seeking her second term in the Senate.","The lease is granted for a set term of years.","The president wants to make tax reform a top priority during his second term."],"opposite":"","synonyms":""},{"def":"the end of a particular period of time, especially one for which something is expected to last","examples":["His life had reached its natural term.","This view of the economy is approaching its term (= it will soon be old-fashioned).","(medical) The pregnancy went to full term (= lasted the normal length of time).","Her baby was born at term."],"opposite":"","synonyms":""},{"def":"each of the various parts in a series, an equation, etc.","examples":[],"opposite":"","synonyms":""},{"def":"used to describe what will happen a long, short, etc. time in the future","examples":["Such a development seems unlikely, at least in the short term (= it will not happen for quite a long time).","In the longer term, children of depressed mothers are more likely to suffer from childhood depression.","In the long term, our efforts will pay off."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in the long/short/medium term","def":"used to describe what will happen a long, short, etc. time in the future","examples":["Such a development seems unlikely, at least in the short term (= it will not happen for quite a long time).","In the longer term, children of depressed mothers are more likely to suffer from childhood depression.","In the long term, our efforts will pay off."]}],"phrasal":[],"related":["full-term","half-term","long-term","term time","term-time","fixed-term","Hilary term","medium-term","search term","short-term","term paper","Trinity term","Michaelmas term","longer-term","term papers","in the long/short/medium term"]},{"pos":"verb","level":"B2","meanings":[{"def":"to use a particular name or word to describe somebody/something","examples":["term somebody/something + adj. At his age, he can hardly be termed young.","term somebody/something + noun His research focuses on what he loosely terms ‘African ceremonies’.","term somebody/something as something Her condition would be more accurately termed as ‘chronic fatigue’.","This material is variously termed ash, clinker, cinders or slag.","The new measure is part of what is termed a Road Safety Strategy."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]