[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/ter/terro/terror__us_1.mp3","phonsUS":"/ˈterər/","level":"B2","meanings":[{"def":"a feeling of extreme fear","examples":["a feeling of sheer/pure terror","Her eyes were wild with terror.","in terror People fled from the explosion in terror.","He lives in terror of (= is constantly afraid of) losing his job.","Some women have a terror of losing control in the birth process.","(literary) The very name of the enemy struck terror into their hearts.","(a) fear of flying","She showed no fear.","Her eyes were wild with terror.","I had a sudden moment of panic.","The doctor said there was no cause for alarm.","She cried out in fright.","He inspired terror in everyone he met.","He was filled with absolute terror at the sight.","He was found hiding in terror.","His face was white with terror.","She was trembling from terror and excitement.","The three kids lived in a state of terror."],"opposite":"","synonyms":"fear"},{"def":"a person, situation or thing that makes you very afraid","examples":["These street gangs have become the terror of the neighbourhood.","The terrors of the night were past.","(literary) Death holds no terrors for (= does not frighten or worry) me."],"opposite":"","synonyms":""},{"def":"violent action or the threat of violent action that is intended to cause fear, usually for political purposes","examples":["a campaign of terror","terror tactics/groups","The president declared a war on terror (= a campaign against the use of terror).","He said that the whole world must unite to fight terror in all its forms.","The group has resorted to terror to try to get what it wants.","people who carry out acts of terror"],"opposite":"","synonyms":""},{"def":"a person (usually a child) or an animal that causes you trouble or is difficult to control","examples":["Their kids are real little terrors."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["terror-stricken","reign of terror","reigns of terror"]}]