[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tex/text_/text__us_1.mp3","phonsUS":"/tekst/","level":"A1","meanings":[{"def":"any form of written material","examples":["a computer that can process text","printed text","Highlight the area of text on screen and press the ‘delete’ key.","one of the best HTML text editors available","When you point at the icon, a small text box appears.","Use the mouse to move chunks of text from place to place.","The program allows you to import text files from other word processors."],"opposite":"","synonyms":""},{"def":"a piece of writing that you have to answer questions about in an exam or a lesson","examples":["Read the text carefully and then answer the questions.","We discussed the use of metaphor in the text.","a poetic text about growing up in rural England"],"opposite":"","synonyms":""},{"def":"a written message that you send using a mobile phone","examples":["She sent me a text to say she would be late."],"opposite":"","synonyms":""},{"def":"the main printed part of a book or magazine, not the notes, pictures, etc.","examples":["My job is to lay out the text and graphics on the page.","She wrote the text for a book of photographs.","Hand symbols in the main body of the text cross-refer the reader to the appendices.","The catalogue consists of colour reproductions of the paintings with accompanying text.","The illustrations are printed separately from the main text.","The photographs are accompanied by text."],"opposite":"","synonyms":""},{"def":"the written form of a speech, a play, an article, etc.","examples":["The newspaper had printed the full text of the president's speech.","Can you act out this scene without referring to the text?","The filmed version of Henry V stays close to the original text.","He stood up and began reading from a prepared text.","She strayed from the text in a few places to illustrate some of her more interesting points.","I posted the full text for free on my site."],"opposite":"","synonyms":""},{"def":"a book, play, etc., especially one that is being studied","examples":["a literary text","sacred/religious/ancient texts","Her books appear on lists of recommended texts in universities.","The book exhibits a close reading of primary texts as well as scholarly commentaries.","We're studying dramatic texts by Mexican playwrights.","It is one of the most difficult literary texts of all time.","Students are requested not to buy texts prior to the first class."],"opposite":"","synonyms":""},{"def":"a book that teaches a particular subject and that is used especially in schools and colleges","examples":["medical texts"],"opposite":"","synonyms":""},{"def":"a sentence or short passage from the Bible that is read out and discussed by somebody, especially during a religious service","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["set text","plain text","text editor","text message","text-message","text-messaging","text-to-speech","text editors","text messages","rich text format"]},{"pos":"verb","level":"A2","meanings":[{"def":"to send somebody a written message using a mobile phone","examples":["text (somebody) Text me when you're on your way.","Kids seem to be texting non-stop these days.","text somebody something I'll text you the final score."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]