[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/the/theme/theme__us_1.mp3","phonsUS":"/θiːm/","level":"B1","meanings":[{"def":"the subject or main idea in a talk, piece of writing or work of art","examples":["the central/main/key/major theme","Births are a recurring theme in Leigh's work.","Hot temperatures were a common theme over the past couple of weeks.","theme of something The stories are all variations on the theme of unhappy marriage.","North American literature is the main theme of this year's festival.","The President stressed a favourite campaign theme—greater emphasis on education.","The naked male figure was always the central theme of Greek art.","Through sculptures Chen explored themes of illness, exile and cultural difference.","He gave a talk on the theme of teenage unemployment.","His later novels develop the theme of alienation.","Several familiar themes emerged from the discussion.","The same themes run through all her novels.","universal themes of love and loneliness","The play touches on universal themes of loss and grief."],"opposite":"","synonyms":""},{"def":"a short tune that is repeated or developed in a piece of music","examples":["The trumpets' theme is then taken up by the rest of orchestra."],"opposite":"","synonyms":""},{"def":"music that is played at the beginning and end and/or is often repeated in a film, television programme, etc.","examples":["the theme from ‘The Godfather’","The film's haunting musical theme stayed in my head for days.","He wrote and sang the theme to the hit TV series, ‘Minder’.","His theme is played each time he appears on screen."],"opposite":"","synonyms":""},{"def":"a short piece of writing on a particular subject, done for school","examples":[],"opposite":"","synonyms":""},{"def":"the part of a sentence or clause that contains information that is not new to the reader or audience","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["theme music","theme park","theme parks"]},{"pos":"adjective","level":"","meanings":[{"def":"a pub, bar, etc. that is designed to reflect a particular subject or period of history","examples":["an Irish theme pub"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]