[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/the/theor/theory__us_2_rr.mp3","phonsUS":"/ˈθiːəri/","level":"B1","meanings":[{"def":"a formal set of ideas that is intended to explain why something happens or exists","examples":["theory of something the theory of evolution/relativity","scientific/economic theory","The theories were tested on a sample of the population.","theory about something He developed a new theory about the cause of stomach ulcers.","theory on something theories on human behaviour","theory behind something She has written a book explaining the theory behind her art.","according to a theory According to the theory of relativity, nothing can travel faster than light.","The debate is centred around two conflicting theories.","Current feminist theory consists of several different trends.","His comments are just abstract theory and show little understanding of the realities of the situation.","the dominant strand of postmodern theory","the existence of a grand unified theory that determines everything in the universe","Further experiments seemed to confirm this theory.","He wrote a number of books on political theory.","It is a theory that cannot be proved or disproved.","Marx's theories of history raise one or two major questions.","The theory was first advanced back in the 16th century.","This is all theory so far…you'll need to back it up with facts."],"opposite":"","synonyms":""},{"def":"the principles on which a particular subject is based","examples":["the theory and practice of language teaching","This is your chance to put theory into practice .","literary theory"],"opposite":"","synonyms":""},{"def":"an opinion or idea that somebody believes is true but that is not proved","examples":["theory about something Theories abound (= people have lots of different ideas) about what happened.","theory on something Here's my theory on how the story's going to end.","theory that… I don't subscribe to the theory that all Hollywood audiences want a happy ending.","Police are working on the theory that the murderer was known to the family.","I have this theory that most people prefer being at work to being at home.","He has a theory about why dogs walk in circles before going to sleep.","If the theory is correct, any child can be taught to be a musical genius.","a conspiracy theory about the princess's death","One of her pet theories is that people who restrict their calorie intake live longer.","She doesn't agree with the theory that rich people work harder than poor people."],"opposite":"","synonyms":""},{"def":"used to say that a particular statement is supposed to be true but may in fact be wrong","examples":["In theory, these machines should last for ten years or more.","That sounds fine in theory, but have you really thought it through?","‘Aren’t you supposed to be retired?’ ‘Yes, in theory.’","In theory, all children get an equal chance at school."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in theory","def":"used to say that a particular statement is supposed to be true but may in fact be wrong","examples":["In theory, these machines should last for ten years or more.","That sounds fine in theory, but have you really thought it through?","‘Aren’t you supposed to be retired?’ ‘Yes, in theory.’","In theory, all children get an equal chance at school."]}],"phrasal":[],"related":["game theory","atomic theory","chaos theory","binding theory","conspiracy theory","critical theory","decision theory","quantum theory","catastrophe theory","information theory","grand unified theory","government and binding theory","games theory"]}]