[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/thi/thing/thing__us_1.mp3","phonsUS":"/θɪŋ/","level":"A1","meanings":[{"def":"an object whose name you do not use because you do not need to or want to, or because you do not know it","examples":["Can you pass me that thing over there?","She's very fond of sweet things (= sweet foods).","He's just bought one of those exercise things.","Turn that thing off while I'm talking to you!"],"opposite":"","synonyms":""},{"def":"an object that is not alive in the way that people and plants are","examples":["Don't treat her like that—she's a person, not a thing!","He's good at making things with his hands.","She took no interest in the people and things around her.","Books may one day become a thing of the past (= something that no longer exists).","I need to buy a few basic things like bread and milk."],"opposite":"","synonyms":""},{"def":"objects, clothing or tools that belong to somebody or are used for a particular purpose","examples":["Shall I help you pack your things?","Bring your swimming things with you.","I'll just clear away the breakfast things.","Put your things (= coat, etc.) on and let's go.","Come on kids, get your things together—we're going.","Hang on a second—I'll just take off my painting things.","He hadn't washed up the dinner things yet."],"opposite":"","synonyms":""},{"def":"a fact, an event, a situation or an action; what somebody says or thinks","examples":["They talked about many things, like books, music and films.","There are a lot of things she doesn't know about me.","There's another thing I need to tell you.","Bad things happen to good people.","I've got lots of things to do today.","He has things on his mind.","The most important thing in life is to have fun!","She said the first thing that came into her head.","Forgetting her was the only thing in the world I found I couldn't do.","He found the whole thing (= the situation) very boring.","Let's forget the whole thing (= everything).","Among other things, I have to deal with mail and keep the accounts.","I like camping, climbing and that sort of thing.","‘Why did you tell her our secret?’ ‘I did no such thing!’","There's no such thing as a typical day in this job.","One thing is for sure—it will be a memorable evening!","The main thing to remember is to switch off the burglar alarm.","That was the most puzzling aspect of the situation.","…the most puzzling thing about…","Curiosity is an essential attribute for a journalist.","…an essential thing for a journalist to have.","This bird has several interesting characteristics.","There are several interesting things about this bird.","I want to know every detail of what happened.","…everything about…","Noise is a familiar feature of city life.","…a familiar thing in city life.","She has campaigned on many controversial issues.","…many controversial things.","We have several important matters to deal with at this meeting.","…several important things…","That’s a very interesting point you made.","…a very interesting thing you said.","The book covers a number of subjects.","…a number of things.","We discussed a wide range of topics.","…a wide range of things.","Her generosity is one of her most attractive traits.","…one of the most attractive things about her.","Having your own computer is very useful.","Having your own computer is a very useful thing.","I have something important to tell you.","I have an important thing to tell you.","Do you want anything else?","Do you want any other thing?","I have so much to tell you.","I have so many things to tell you.","She knows a lot about basketball.","She knows many things about basketball.","There's another thing I'd like to ask you.","Advertising on blogs is going to be the next big thing.","Apologizing is never the easiest thing to do.","Calling a doctor seemed the logical thing to do.","Entertaining people is the most natural thing in the world for her.","He has a funny way of doing things.","He loses his temper at the slightest thing.","I admit it was a foolish thing to do.","I did all the right things but I couldn't get the engine to start.","I did my usual thing of losing my keys.","I marched into his office to get a few things straight.","I've better things to do than stand here chatting all day!","If she works hard she's capable of great things.","It's impossible to get things done when you're looking after a baby.","One thing led to another and we ended up dating.","People defraud their companies every day, but Mike would never do such a thing!","She helped with the everyday things like shopping and cooking.","That wasn't a very smart thing to do!","The amazing thing is, he wouldn't accept any money!","The best thing about Alan is he's always honest.","The last thing she wanted was to upset her parents.","There are some weird things going on in that house.","We chatted about school, but I could tell she had other things on her mind.","What's the next thing you want me to do?","There's another thing I'd like to ask you.","The key thing is to remain calm.","Who's been saying things about me?","Try to look on your rejection as a positive thing.","Too much studying can be a bad thing.","There are plenty of things to say about it.","The pay cut was just a taste of things to come.","That was a horrible thing to say to her.","Jack knows a thing or two about kids—he has five.","It's such a small thing to ask.","I wanted to be a musician, but teaching music is the next best thing.","I give thanks for every little thing.","It's just a practice, not the real thing.","He's the nearest thing to a film star I've ever met."],"opposite":"","synonyms":""},{"def":"the general situation, as it affects somebody","examples":["Things haven't gone entirely to plan.","I wish things could have been different.","(informal) Hi, Jane! How are things?","As things stand at present, he seems certain to win.","All things considered (= considering all the difficulties or problems), she's done very well.","They're trying to change things for the better.","Things have changed over the last few years.","He's happy with the way things have worked out.","Why do you make things so difficult for yourself?","the present economic situation","The ship sank in mysterious circumstances.","She felt she was in a position of power.","We were forced to work outside in freezing conditions.","Hi, Jane! How are things?","Think things over before you decide.","If that is the case (= if the situation described is true), we need more staff.","How did this unhappy state of affairs come about?","Think things over before you decide.","Don't worry about it—just let things take their course.","He apologized, and asked for a chance to put things right.","He offered to help, but she assured him she had things in hand.","Her apology only served to make things worse.","I have to work things out my own way.","I just don't know if things are going to work out.","I want to get things sorted out before I go away.","I'm sure things will turn out OK.","She'd started the term studying hard, but now was beginning to let things slip.","Sorry, I didn't mean to complicate things.","There was a week to go to the deadline and things were looking good.","They hired temporary staff to keep things going over the summer.","Things came to a head when money was found to be missing from the account.","Things looked bleak for the future of the factory.","Try not to let things get to you.","Try to look at things from my point of view.","We arranged to meet and talk things over.","We were in trouble but now things are looking up.","You should suggest changes, rather than accept things as they are."],"opposite":"","synonyms":"situation"},{"def":"a quality or a concept","examples":["Reality and truth are not the same thing.","The two of them have one thing in common—they never give up.","The good thing about this job is all the travelling."],"opposite":"","synonyms":""},{"def":"what is needed or socially acceptable","examples":["You need something to cheer you up—I know just the thing!","to say the right/wrong thing","The best thing to do is to apologize.","He did the decent thing and resigned.","He did the right thing and went back to his wife.","She always manages to say the wrong thing.","Iced tea—the very thing!"],"opposite":"","synonyms":""},{"def":"used to say that something is important or real","examples":["I don't understand why these corny films are still a thing in 2020.","I'm not sure that ‘modular techno music’ is really a thing."],"opposite":"","synonyms":""},{"def":"used with negatives to mean ‘anything’ in order to emphasize what you are saying","examples":["I haven't got a thing to wear!","She hasn't had a thing to eat all day.","There wasn't a thing we could do to help.","Ignore what he said—it doesn't mean a thing.","I'm going to arrive early because I don't want to miss a thing.","I can't see a thing without my glasses.","Nobody said a thing when he appeared with a wig on.","She's tricked you, and you can't do a thing about it."],"opposite":"","synonyms":""},{"def":"all that can be described in a particular way","examples":["She loves all things Japanese."],"opposite":"","synonyms":""},{"def":"a living creature","examples":["All living things are composed of cells."],"opposite":"","synonyms":""},{"def":"used to talk to or about a person or an animal, to show how you feel about them","examples":["You silly thing!","You must be starving, you poor things.","The cat's very ill, poor old thing.","The baby's a pretty little thing."],"opposite":"","synonyms":""},{"def":"if the conditions stay the same; if other conditions are the same","examples":["All things being equal, we should finish the job tomorrow.","All other things being equal, the bigger fighter should win."],"opposite":"","synonyms":""},{"def":"used when you do not want to complete a list","examples":["She likes nice clothes and things like that.","I've been busy shopping and things."],"opposite":"","synonyms":""},{"def":"as was shown or proved by later events","examples":["I didn't need my umbrella, as it turned out (= because it didn't rain)."],"opposite":"","synonyms":""},{"def":"as was shown or proved by later events","examples":["As things turned out, the weather—and the whole weekend—were perfect."],"opposite":"","synonyms":""},{"def":"to please everyone by changing your attitudes or opinions to suit different people","examples":[],"opposite":"","synonyms":""},{"def":"to be understood or used in different ways by different people","examples":[],"opposite":"","synonyms":""},{"def":"to be socially acceptable behaviour","examples":[],"opposite":"","synonyms":""},{"def":"to be lucky that…","examples":["It's a good thing we got here early.","It's a good thing you remembered to turn off the gas!"],"opposite":"","synonyms":""},{"def":"used to say that although something seems to be bad, it could have good results","examples":["We didn't want the press to get hold of the story, but it might be no bad thing.","It's no bad thing to express your anger."],"opposite":"","synonyms":""},{"def":"to have found a job, situation or style of life that is pleasant or easy","examples":[],"opposite":"","synonyms":""},{"def":"to imagine that you can see or hear something that is in fact not there","examples":[],"opposite":"","synonyms":""},{"def":"people say chance would be a fine thing to show that they would like to do or have the thing that somebody has mentioned, but that they do not think that it is very likely","examples":[],"opposite":"","synonyms":""},{"def":"a situation in which somebody only just wins or loses, for example in a competition or an election","examples":["Mr Taylor’s election defeat was a close-run thing.","The invasion never happened but it was a close-run thing."],"opposite":"","synonyms":""},{"def":"a situation in which success or failure is equally possible","examples":["We got him out in the end, but it was a close thing."],"opposite":"","synonyms":""},{"def":"to have the same result or meaning","examples":[],"opposite":"","synonyms":""},{"def":"to do what you want to do or what interests you, without thinking about other people; to be independent","examples":[],"opposite":"","synonyms":""},{"def":"to have a powerful emotional effect on somebody","examples":["That song just does things to me."],"opposite":"","synonyms":""},{"def":"early in the morning/late in the evening","examples":["I need the report on my desk first thing Monday morning.","I took the dog for a walk last thing before going to bed."],"opposite":"","synonyms":""},{"def":"the most important matters must be dealt with first","examples":["We have a lot to discuss, but, first things first, let's have a cup of coffee!"],"opposite":"","synonyms":""},{"def":"used to introduce one of two or more reasons for doing something","examples":["‘Why don't you get a car?’ ‘Well, for one thing, I can't drive!’"],"opposite":"","synonyms":""},{"def":"to have something arranged in the way that you want, even though other people want it to be arranged differently","examples":["The German team weren't going to let the English have everything their own way."],"opposite":"","synonyms":""},{"def":"to have a strong like or dislike of somebody/something in a way that seems strange or unreasonable","examples":["She has a thing about men with beards."],"opposite":"","synonyms":""},{"def":"to be sexually attracted to somebody; to like something very much","examples":["Liz has always had a thing for guys in bands.","He has a thing for the new girl in the office.","Jamie has a thing for fast cars."],"opposite":"","synonyms":""},{"def":"in the way that things usually happen","examples":["In the nature of things, young people often rebel against their parents."],"opposite":"","synonyms":""},{"def":"B is very different from A, for example it is more difficult, serious or important","examples":["Romance is one thing; marriage is quite another.","It's one thing to tease your sister, but it's another to hit her."],"opposite":"","synonyms":""},{"def":"it isn’t something that you really enjoy or are interested in","examples":[],"opposite":"","synonyms":""},{"def":"it is something that only a particular group understands","examples":["You wouldn't know what it means—it's a girl thing."],"opposite":"","synonyms":""},{"def":"to know/tell somebody some useful, interesting or surprising information about somebody/something","examples":["She's been married five times, so she knows a thing or two about men!"],"opposite":"","synonyms":""},{"def":"to make something seem more important than it really is","examples":[],"opposite":"","synonyms":""},{"def":"a situation in which you are successful, but which could also have ended badly","examples":["Phew! That was a near thing! It could have been a disaster.","We won in the end but it was a near thing."],"opposite":"","synonyms":""},{"def":"to know nothing at all about something/somebody","examples":["We’ve lived next to him for years, but we still don’t know the first thing about him."],"opposite":"","synonyms":""},{"def":"not considered socially acceptable","examples":["It wouldn't be quite the thing to turn up in running gear."],"opposite":"","synonyms":""},{"def":"not healthy or normal","examples":[],"opposite":"","synonyms":""},{"def":"used to say that you do not want to discuss or think about something bad or unpleasant that has happened, but just accept it","examples":["It wasn't your fault. It was just one of those things."],"opposite":"","synonyms":""},{"def":"used to complain that a lot of unpleasant things keep happening to you","examples":[],"opposite":"","synonyms":""},{"def":"used to suggest that the way one event or action leads to others is so obvious that it does not need to be stated","examples":["He offered me a ride home one night, and, well, one thing led to another and now we're married!"],"opposite":"","synonyms":""},{"def":"used before mentioning a worry or problem you have with something","examples":["I'd love to come—the only thing is I might be late."],"opposite":"","synonyms":""},{"def":"to work, study, etc. too hard or for too long","examples":["He's been overdoing things recently.","I overdid it in the gym and hurt my back."],"opposite":"","synonyms":""},{"def":"to take a risk because you have successfully avoided problems in the past","examples":["You didn't get caught last time, but don't push your luck!"],"opposite":"","synonyms":""},{"def":"to take a risk because you have successfully avoided problems in the past","examples":["Don't push things—we don't want it all to go wrong now."],"opposite":"","synonyms":""},{"def":"actually what somebody claims that something is","examples":["Are you sure it's the real thing (= love), not just infatuation?"],"opposite":"","synonyms":""},{"def":"the way things seem to be organized; the way somebody wants everything to be organized","examples":["My personal problems are not really important in the overall scheme of things.","This small annoyance isn't much in the grand scheme of things.","I don't think marriage figures in his scheme of things."],"opposite":"","synonyms":""},{"def":"the way things are likely to develop in the future","examples":["Are solar-powered cars the shape of things to come?","This new system could be the shape of things to come."],"opposite":"","synonyms":""},{"def":"used to say ‘yes’ to a suggestion or request","examples":["‘Are you coming?’ ‘Sure thing.’"],"opposite":"","synonyms":""},{"def":"to relax and avoid working too hard or doing too much","examples":["The doctor told me to take it easy for a few weeks.","I like to take things easy when I’m on holiday."],"opposite":"","synonyms":""},{"def":"to not think about what will happen in the future","examples":["I don't know if he'll get better. We're just taking it one day at a time."],"opposite":"","synonyms":""},{"def":"to not think about what will happen in the future","examples":["I don't know if he'll get better. We're just taking things one day at a time."],"opposite":"","synonyms":""},{"def":"there is only one possible course of action","examples":[],"opposite":"","synonyms":""},{"def":"used to say that you should accept an unpleasant situation or event because you cannot change it","examples":[],"opposite":"","synonyms":""},{"def":"a situation or an activity of the type mentioned","examples":["She really didn't want to be involved in the whole family thing."],"opposite":"","synonyms":""},{"def":"used to introduce an important fact, reason or explanation","examples":["I'm sorry my assignment isn't finished. The thing is, I've had a lot of other work this week."],"opposite":"","synonyms":""},{"def":"used to introduce a problem about something/somebody","examples":["The thing with Karl is, he's always late."],"opposite":"","synonyms":""},{"def":"used to refer to ghosts and other supernatural things that cannot be explained","examples":["There are mysterious lights in the sky and things that go bump in the night."],"opposite":"","synonyms":""},{"def":"to do what people or society expect, especially in a difficult situation","examples":["He did the decent thing and resigned."],"opposite":"","synonyms":""},{"def":"used to say that, although something is pleasant, you do not want to have too much of it","examples":[],"opposite":"","synonyms":""},{"def":"because you have been busy with various problems, events or things you had to do","examples":["I completely forgot her birthday, what with one thing and another."],"opposite":"","synonyms":""},{"def":"to arrange something in a particular way, especially by being clever","examples":["Can you work it so that we get free tickets?"],"opposite":"","synonyms":""},{"def":"to arrange something in a particular way, especially by being clever","examples":["Can you work things so that we get Friday afternoon off?"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"all/other things being equal","def":"if the conditions stay the same; if other conditions are the same","examples":["All things being equal, we should finish the job tomorrow.","All other things being equal, the bigger fighter should win."]},{"idiom":"and things (like that)","def":"used when you do not want to complete a list","examples":["She likes nice clothes and things like that.","I've been busy shopping and things."]},{"idiom":"as it/things turned out","def":"as was shown or proved by later events","examples":["I didn't need my umbrella, as it turned out (= because it didn't rain)."]},{"idiom":"as things/it turned out","def":"as was shown or proved by later events","examples":["As things turned out, the weather—and the whole weekend—were perfect."]},{"idiom":"be all things to all men/people","def":"to please everyone by changing your attitudes or opinions to suit different people","examples":[]},{"idiom":"be the done thing","def":"to be socially acceptable behaviour","examples":[]},{"idiom":"be a good thing (that)…","def":"to be lucky that…","examples":["It's a good thing we got here early.","It's a good thing you remembered to turn off the gas!"]},{"idiom":"be no bad thing (that)…","def":"used to say that although something seems to be bad, it could have good results","examples":["We didn't want the press to get hold of the story, but it might be no bad thing.","It's no bad thing to express your anger."]},{"idiom":"be onto a good thing","def":"to have found a job, situation or style of life that is pleasant or easy","examples":[]},{"idiom":"be seeing/hearing things","def":"to imagine that you can see or hear something that is in fact not there","examples":[]},{"idiom":"chance would be a fine thing","def":"people say chance would be a fine thing to show that they would like to do or have the thing that somebody has mentioned, but that they do not think that it is very likely","examples":[]},{"idiom":"a close-run thing","def":"a situation in which somebody only just wins or loses, for example in a competition or an election","examples":["Mr Taylor’s election defeat was a close-run thing.","The invasion never happened but it was a close-run thing."]},{"idiom":"a close thing","def":"a situation in which success or failure is equally possible","examples":["We got him out in the end, but it was a close thing."]},{"idiom":"come to/be the same thing","def":"to have the same result or meaning","examples":[]},{"idiom":"do your own thing","def":"to do what you want to do or what interests you, without thinking about other people; to be independent","examples":[]},{"idiom":"do things to somebody","def":"to have a powerful emotional effect on somebody","examples":["That song just does things to me."]},{"idiom":"first/last thing","def":"early in the morning/late in the evening","examples":["I need the report on my desk first thing Monday morning.","I took the dog for a walk last thing before going to bed."]},{"idiom":"first things first","def":"the most important matters must be dealt with first","examples":["We have a lot to discuss, but, first things first, let's have a cup of coffee!"]},{"idiom":"for one thing","def":"used to introduce one of two or more reasons for doing something","examples":["‘Why don't you get a car?’ ‘Well, for one thing, I can't drive!’"]},{"idiom":"have it/things/everything your own way","def":"to have something arranged in the way that you want, even though other people want it to be arranged differently","examples":["The German team weren't going to let the English have everything their own way."]},{"idiom":"have a thing about somebody/something","def":"to have a strong like or dislike of somebody/something in a way that seems strange or unreasonable","examples":["She has a thing about men with beards."]},{"idiom":"have a thing for somebody/something","def":"to be sexually attracted to somebody; to like something very much","examples":["Liz has always had a thing for guys in bands.","He has a thing for the new girl in the office.","Jamie has a thing for fast cars."]},{"idiom":"in the nature of things","def":"in the way that things usually happen","examples":["In the nature of things, young people often rebel against their parents."]},{"idiom":"A is one thing, B is another | it’s one thing to do A, it’s another thing to do B","def":"B is very different from A, for example it is more difficult, serious or important","examples":["Romance is one thing; marriage is quite another.","It's one thing to tease your sister, but it's another to hit her."]},{"idiom":"it isn’t my, his, etc. thing","def":"it isn’t something that you really enjoy or are interested in","examples":[]},{"idiom":"it’s a… thing","def":"it is something that only a particular group understands","examples":["You wouldn't know what it means—it's a girl thing."]},{"idiom":"know/tell somebody a thing or two (about somebody/something)","def":"to know/tell somebody some useful, interesting or surprising information about somebody/something","examples":["She's been married five times, so she knows a thing or two about men!"]},{"idiom":"make a (big) thing of/about something","def":"to make something seem more important than it really is","examples":[]},{"idiom":"a near thing","def":"a situation in which you are successful, but which could also have ended badly","examples":["Phew! That was a near thing! It could have been a disaster.","We won in the end but it was a near thing."]},{"idiom":"not know, etc. the first thing about something/somebody","def":"to know nothing at all about something/somebody","examples":["We’ve lived next to him for years, but we still don’t know the first thing about him."]},{"idiom":"not quite the thing","def":"not considered socially acceptable","examples":["It wouldn't be quite the thing to turn up in running gear."]},{"idiom":"(just) one of those things","def":"used to say that you do not want to discuss or think about something bad or unpleasant that has happened, but just accept it","examples":["It wasn't your fault. It was just one of those things."]},{"idiom":"one (damned/damn) thing after another","def":"used to complain that a lot of unpleasant things keep happening to you","examples":[]},{"idiom":"one thing leads to another","def":"used to suggest that the way one event or action leads to others is so obvious that it does not need to be stated","examples":["He offered me a ride home one night, and, well, one thing led to another and now we're married!"]},{"idiom":"the only thing is…","def":"used before mentioning a worry or problem you have with something","examples":["I'd love to come—the only thing is I might be late."]},{"idiom":"overdo it/things","def":"to work, study, etc. too hard or for too long","examples":["He's been overdoing things recently.","I overdid it in the gym and hurt my back."]},{"idiom":"push your luck | push it/things","def":"to take a risk because you have successfully avoided problems in the past","examples":["You didn't get caught last time, but don't push your luck!"]},{"idiom":"push things/it | push your luck","def":"to take a risk because you have successfully avoided problems in the past","examples":["Don't push things—we don't want it all to go wrong now."]},{"idiom":"the real thing","def":"actually what somebody claims that something is","examples":["Are you sure it's the real thing (= love), not just infatuation?"]},{"idiom":"the/somebody’s scheme of things","def":"the way things seem to be organized; the way somebody wants everything to be organized","examples":["My personal problems are not really important in the overall scheme of things.","This small annoyance isn't much in the grand scheme of things.","I don't think marriage figures in his scheme of things."]},{"idiom":"the shape of things to come","def":"the way things are likely to develop in the future","examples":["Are solar-powered cars the shape of things to come?","This new system could be the shape of things to come."]},{"idiom":"sure thing","def":"used to say ‘yes’ to a suggestion or request","examples":["‘Are you coming?’ ‘Sure thing.’"]},{"idiom":"take it/things easy","def":"to relax and avoid working too hard or doing too much","examples":["The doctor told me to take it easy for a few weeks.","I like to take things easy when I’m on holiday."]},{"idiom":"take it/things one day at a time","def":"to not think about what will happen in the future","examples":["I don't know if he'll get better. We're just taking it one day at a time."]},{"idiom":"take things/it one day at a time","def":"to not think about what will happen in the future","examples":["I don't know if he'll get better. We're just taking things one day at a time."]},{"idiom":"there’s only one thing for it","def":"there is only one possible course of action","examples":[]},{"idiom":"these things are sent to try us","def":"used to say that you should accept an unpleasant situation or event because you cannot change it","examples":[]},{"idiom":"the (whole)… thing","def":"a situation or an activity of the type mentioned","examples":["She really didn't want to be involved in the whole family thing."]},{"idiom":"the thing is","def":"used to introduce an important fact, reason or explanation","examples":["I'm sorry my assignment isn't finished. The thing is, I've had a lot of other work this week."]},{"idiom":"the thing (about/with something/somebody) is","def":"used to introduce a problem about something/somebody","examples":["The thing with Karl is, he's always late."]},{"idiom":"things that go bump in the night","def":"used to refer to ghosts and other supernatural things that cannot be explained","examples":["There are mysterious lights in the sky and things that go bump in the night."]},{"idiom":"to do the decent thing","def":"to do what people or society expect, especially in a difficult situation","examples":["He did the decent thing and resigned."]},{"idiom":"too much of a good thing","def":"used to say that, although something is pleasant, you do not want to have too much of it","examples":[]},{"idiom":"(what) with one thing and another","def":"because you have been busy with various problems, events or things you had to do","examples":["I completely forgot her birthday, what with one thing and another."]},{"idiom":"work it/things","def":"to arrange something in a particular way, especially by being clever","examples":["Can you work it so that we get free tickets?"]},{"idiom":"work things/it","def":"to arrange something in a particular way, especially by being clever","examples":["Can you work things so that we get Friday afternoon off?"]}],"phrasal":[],"related":["young thing","bright young thing","next big thing","sure thing","a close thing","a near thing","the real thing","first/last thing","a close-run thing","be the done thing","the only thing is…","to do the decent thing","one thing leads to another","chance would be a fine thing","the best thing since sliced bread","one (damned/damn) thing after another","make a (big) thing of/about something","there’s no such thing as a free lunch","not know the first thing about somebody/something","not know, etc. the first thing about something/somebody"]}]