[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tho/thoug/thought__us_2.mp3","phonsUS":"/θɔːt/","level":"A2","meanings":[{"def":"something that you think of or remember","examples":["thought of doing something I couldn't bear the thought of waiting any longer.","thought of something/somebody The very thought of it makes me feel sick.","thought of somebody/something doing something I don't like the thought of you walking home alone.","thought (that)… She was struck by the sudden thought that he might already have left.","thought on something Thank you for sharing your thoughts on this topic.","I'd like to hear your thoughts on the subject.","thought about something He shared his thoughts about the future of technology.","at the thought of something He shuddered at the thought of going to the dentist.","He often expresses his thoughts on Twitter.","I've just had a thought (= an idea).","Would Mark be able to help? It's just a thought.","‘Why don't you try the other key?’ ‘That's a thought!’","Just then a worrying thought came to me.","Suddenly a thought struck him—he didn't even know her name.","I must admit, the thought crossed my mind too.","Negative thoughts can be a symptom of depression.","All kinds of thoughts raced through my mind.","An image of his boss came into his mind, but he brushed the thought aside.","Before going on stage, I breathe deeply and think positive thoughts.","Do you have any final thoughts?","He lay there thinking gloomy thoughts about life and death.","He remained aloof, thinking his own thoughts.","The children were overjoyed at the thought of going to the seaside on holiday.","She said she couldn't bear the thought of living alone in the house.","The mere thought of lice makes my head itch.","It was a comforting thought that at least her father hadn't suffered.","The thought crossed my mind that Jim might know the answer.","My immediate thought was that he must be joking.","Such a thought never entered my head.","This is hardly an original thought.","patients that are suffering from depression and suicidal thoughts","She tried to put the thought out of her mind.","This was a very disturbing thought.","What a horrible thought!","Let me share a few random thoughts with you.","He's not the kind of man to keep his thoughts to himself."],"opposite":"","synonyms":""},{"def":"a person’s mind and all the ideas that they have in it when they are thinking","examples":["This is the time of year when our thoughts turn to summer holidays.","in somebody's thoughts You are always in my thoughts.","He shook his head to clear his thoughts.","Her thoughts drifted back to that night.","I tried to turn my thoughts to pleasanter things.","She occupied all his waking thoughts.","She often seems to know what I'm thinking, as though she can read my thoughts."],"opposite":"","synonyms":""},{"def":"the act of thinking seriously and carefully about something","examples":["I've given the matter careful thought.","We need to put some thought into how to solve this problem.","Not enough thought has gone into this essay.","without thought They had acted rashly, without thought.","After a moment's thought, I accepted his offer.","He gave little thought to the impact of his actions on his family.","He was so upset, he was incapable of coherent thought.","I couldn't see what thought processes led him to that conclusion.","My job is so repetitive, it does not require much conscious thought.","The article was intended to provoke thought.","You should give the offer serious thought.","I don't think he's given the matter a moment's thought."],"opposite":"","synonyms":""},{"def":"the power or process of thinking","examples":["A good teacher encourages independence of thought.","She was lost in thought (= concentrating so much on her thoughts that she was not aware of her surroundings).","She is known for her deep thought and intellectual ways.","She was deep in thought and didn't hear me call her.","That line of thought can only lead to one conclusion.","The constitution guarantees freedom of thought and belief.","They accused their opponents of being ‘politically correct thought police’."],"opposite":"","synonyms":""},{"def":"a feeling of care or worry","examples":["Spare a thought for those without enough to eat this winter.","Don't give it another thought (= to tell somebody not to worry after they have said they are sorry).","It's the thought that counts (= used to say that somebody has been very kind even if they have only done or given something small or unimportant).","Thank you for the flowers—it was a very kind thought.","Spare a thought for us—we'll be working through the night to finish the report.","He ran into the burning house with no thought for his own life."],"opposite":"","synonyms":""},{"def":"an intention or a hope of doing something","examples":["thought (of doing something) She had given up all thought of changing her job.","thought (of something) He acted with no thoughts of personal gain."],"opposite":"","synonyms":""},{"def":"ideas in politics, science, etc. connected with a particular person, group or period of history","examples":["feminist thought","Marxist thought remained at the centre of the country's politics.","Political thought went through some major changes during the 19th century.","There isn't much real evidence relating to early Greek thought.","We're studying the history of scientific thought from the 15th century onward."],"opposite":"","synonyms":""},{"def":"to try to control your emotions and become calm","examples":["I'm fine—I just need a minute to collect myself."],"opposite":"","synonyms":""},{"def":"to prepare yourself mentally for something","examples":["She paused to collect her thoughts before entering the interview room."],"opposite":"","synonyms":""},{"def":"an idea that makes you think seriously and carefully","examples":["The programme certainly provides plenty of food for thought."],"opposite":"","synonyms":""},{"def":"to make somebody think seriously about something or hesitate before doing something","examples":["Popular resistance to the measures should give the government pause for thought."],"opposite":"","synonyms":""},{"def":"to change your opinion after thinking about something again","examples":["You’re not having second thoughts about it, are you?"],"opposite":"","synonyms":""},{"def":"used to say that you have changed your opinion","examples":["I'll wait here. No, on second thoughts, I'll come with you."],"opposite":"","synonyms":""},{"def":"used to ask somebody what they are thinking about","examples":[],"opposite":"","synonyms":""},{"def":"used to say that you find a suggestion unacceptable or that you hope that something will never happen","examples":["Me get married? Perish the thought!"],"opposite":"","synonyms":""},{"def":"a way of thinking that a number of people share","examples":["There are two schools of thought about how this illness should be treated.","He belongs to the school of thought that says that competition can be very stimulating for children."],"opposite":"","synonyms":""},{"def":"the connected series of thoughts that are in your head at a particular time","examples":["The phone ringing interrupted my train of thought.","I lose my train of thought when there are distractions."],"opposite":"","synonyms":""},{"def":"we believe a thing because we want it to be true","examples":[],"opposite":"","synonyms":""},{"def":"immediately; without stopping to think about something further","examples":["He dived in after her without a second thought.","I accepted the offer without a second thought."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"collect yourself/your thoughts","def":"to try to control your emotions and become calm","examples":["I'm fine—I just need a minute to collect myself.","She paused to collect her thoughts before entering the interview room."]},{"idiom":"food for thought","def":"an idea that makes you think seriously and carefully","examples":["The programme certainly provides plenty of food for thought."]},{"idiom":"give (somebody) pause for thought","def":"to make somebody think seriously about something or hesitate before doing something","examples":["Popular resistance to the measures should give the government pause for thought."]},{"idiom":"have second thoughts","def":"to change your opinion after thinking about something again","examples":["You’re not having second thoughts about it, are you?"]},{"idiom":"on second thoughts","def":"used to say that you have changed your opinion","examples":["I'll wait here. No, on second thoughts, I'll come with you."]},{"idiom":"a penny for your thoughts | a penny for them","def":"used to ask somebody what they are thinking about","examples":[]},{"idiom":"perish the thought","def":"used to say that you find a suggestion unacceptable or that you hope that something will never happen","examples":["Me get married? Perish the thought!"]},{"idiom":"school(s) of thought","def":"a way of thinking that a number of people share","examples":["There are two schools of thought about how this illness should be treated.","He belongs to the school of thought that says that competition can be very stimulating for children."]},{"idiom":"a train of thought","def":"the connected series of thoughts that are in your head at a particular time","examples":["The phone ringing interrupted my train of thought.","I lose my train of thought when there are distractions."]},{"idiom":"the wish is father to the thought","def":"we believe a thing because we want it to be true","examples":[]},{"idiom":"without a second thought","def":"immediately; without stopping to think about something further","examples":["He dived in after her without a second thought.","I accepted the offer without a second thought."]}],"phrasal":[],"related":["thought leader","thought police","thought-provoking","thought leadership","well thought of","well thought out","thought leaders","thought polices","give (somebody) pause for thought","food for thought","perish the thought","I thought as much","school(s) of thought","the wish is father to the thought"]}]