[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/thr/threa/threaten__us_2.mp3","phonsUS":"/ˈθretn/","level":"B2","meanings":[{"def":"to say that you will cause trouble, hurt somebody, etc. if you do not get what you want","examples":["threaten somebody/something They broke my windows and threatened me.","People have even threatened his life.","I contacted this band and threatened legal action.","threaten somebody with something The attacker threatened them with a gun.","He was threatened with dismissal if he continued to turn up late for work.","threaten something The threatened strike has been called off.","Students are threatening legal action.","threaten to do something The hijackers threatened to kill one passenger every hour if their demands were not met.","The bank is threatening to sue him.","threaten that… They threatened that passengers would be killed.","threaten + speech ‘I'm going to kill him!’ she threatened.","I never felt threatened by him.","Did he ever say anything to suggest that he felt threatened, or that his life was in danger?","She had repeatedly threatened to commit suicide.","The union threatened that unless the new rules were withdrawn, they would call a strike."],"opposite":"","synonyms":""},{"def":"to seem likely to happen or cause something unpleasant","examples":["A storm was threatening.","When war threatens, people act irrationally.","threaten to do something This dispute threatens to split the party.","threaten something The clouds threatened rain.","threaten something with something Many species are now threatened with extinction.","The theatre was threatened with closure."],"opposite":"","synonyms":""},{"def":"to be a danger to something","examples":["Pollution is threatening marine life.","to threaten national security","They are not currently an endangered or threatened species.","Our marriage was constantly threatened by his other women.","Our way of life is gravely threatened.","She claimed that the conflict was threatening stability in the region."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]