[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/thr/threa/threat__us_1.mp3","phonsUS":"/θret/","level":"B2","meanings":[{"def":"a statement in which you tell somebody that you will punish or harm them, especially if they do not do what you want","examples":["threat against somebody/something to make threats against somebody","threat to do something She is prepared to carry out her threat to resign.","He received death threats from right-wing groups.","a phony bomb threat","threat of something crimes involving violence or the threat of violence","It's unwise to make threats that you cannot carry out.","The kids took no notice of the teacher's idle threats.","The company's pay offer was accompanied by thinly veiled threats if it was rejected.","The government refused to give in to the hijackers' threats.","Teachers have lifted their threat of strike action."],"opposite":"","synonyms":""},{"def":"the possibility of trouble, danger or disaster","examples":["under threat (from somebody/something) These ancient woodlands are under threat from new road developments.","Many wild plants are under threat of extinction.","threat of something There is a real threat of war.","the threat of terrorism/violence/attack","the imminent/immediate/real/potential threat of something","With little access to clean drinking water and sanitation, the inhabitants face a constant threat of disease.","The forecast is for rain with the threat of thunderstorms.","At the end of the Cold War, the nuclear threat receded.","What can we do to counter this threat?"],"opposite":"","synonyms":""},{"def":"a person or thing that is likely to cause trouble, danger, etc.","examples":["threat to somebody/something Drugs pose a major threat to our society.","We're facing a very strong terrorist threat.","He is unlikely to be a threat to the Spanish player in the final.","The missiles present a clear threat to the security of the nation.","The magazine asked about the greatest threats to world peace.","a threat to health/life/safety","threat from something the threat from overfishing","Viruses and other internet security threats can look like valid files or photos.","Food insecurity represents a serious threat for humanity.","the environmental threat posed by oil spillages","Translators do not yet perceive computers as a threat to their livelihood.","The opposition presents no immediate threat to the government.","The junta reacted violently to the perceived threat to its authority."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["bomb threat"]}]