[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/thr/threa/thread__us_1.mp3","phonsUS":"/θred/","level":"C1","meanings":[{"def":"a thin string of cotton, wool, silk, etc. used for sewing or making cloth","examples":["a needle and thread","a robe embroidered with gold thread","the delicate threads of a spider’s web","You've pulled a thread in your jumper."],"opposite":"","synonyms":""},{"def":"an idea or a feature that is part of something greater; an idea that connects the different parts of something","examples":["A common thread runs through these discussions.","The author skilfully draws together the different threads of the plot.","I lost the thread of the argument (= I could no longer follow it).","The speaker lost his thread (= forgot what he wanted to say) halfway through the talk.","As the film progresses, the threads of the plot slowly begin to unravel.","I found it hard to follow the main thread of his argument.","On studying the different historians' accounts, common threads emerge.","Apart from one or two loose threads, the police now had the complete picture of what happened."],"opposite":"","synonyms":""},{"def":"a long, thin line of something","examples":["A thread of light emerged from the keyhole.","a silvery thread of water","Thin threads of blood glittered on his forehead and cheeks."],"opposite":"","synonyms":""},{"def":"a series of connected messages on email, social media, etc. that have been sent by different people","examples":[],"opposite":"","synonyms":""},{"def":"the raised line that runs around the length of a screw and that allows it to be fixed in place by twisting","examples":[],"opposite":"","synonyms":""},{"def":"clothes","examples":[],"opposite":"","synonyms":""},{"def":"to be in great danger","examples":[],"opposite":"","synonyms":""},{"def":"to return to an earlier situation or way of life after a period doing something else","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"hang by a hair/thread","def":"to be in great danger","examples":[]},{"idiom":"pick up the threads","def":"to return to an earlier situation or way of life after a period doing something else","examples":[]}],"phrasal":[],"related":["thread vein","golden thread","thread veins","hang by a hair/thread"]},{"pos":"verb","level":"","meanings":[{"def":"to pass something long and thin, especially thread, through a narrow opening or hole","examples":["to thread a needle (with cotton)","to thread cotton through a needle","A tiny wire is threaded through a vein to the heart."],"opposite":"","synonyms":""},{"def":"to move or make something move through a narrow space, avoiding things that are in the way","examples":["+ adv./prep. The waiters threaded between the crowded tables.","thread your way + adv./prep. It took me a long time to thread my way through the crowd."],"opposite":"","synonyms":""},{"def":"to join two or more objects together by passing something long and thin through them","examples":["to thread beads (onto a string)","Thread the cubes of meat and vegetables onto metal skewers."],"opposite":"","synonyms":""},{"def":"to pass film, tape, string, etc. through parts of a piece of equipment so that it is ready to use","examples":[],"opposite":"","synonyms":""},{"def":"to sew or twist a particular type of thread into something","examples":["a robe threaded with gold and silver"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]