[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tid/tide_/tide__us_1.mp3","phonsUS":"/taɪd/","level":"C1","meanings":[{"def":"a regular rise and fall in the level of the sea, caused by the pull of the moon and sun; the flow of water that happens as the sea rises and falls","examples":["the ebb and flow of the tide","The tide is in/out.","Is the tide coming in or going out?","The body was washed up on the beach by the tide.","We'll swim back to the beach before the tide turns.","Short-term loans are designed to tide borrowers over until their next payday.","She tied her hair up with ribbon.","We have to get up early to catch the tide.","We went out to sea on the ebb tide.","the time of day when the highest tides occur"],"opposite":"","synonyms":""},{"def":"the direction in which the opinion of a large number of people seems to be moving","examples":["It takes courage to speak out against the tide of opinion.","There is a growing tide of opposition to the idea.","a tide of optimism","He didn't have the courage to swim against the political tide.","In the early 1990s there was a marked turn of the tide.","Seeing the tide was now running in his direction, he renewed his campaign for reform.","the shifting tides of history"],"opposite":"","synonyms":""},{"def":"a large amount of something unpleasant that is increasing and is difficult to control","examples":["There is anxiety about the rising tide of crime.","Measures have been taken to stem the tide of pornography (= stop it from getting worse)."],"opposite":"","synonyms":""},{"def":"a feeling that you suddenly have that gets stronger and stronger","examples":["A tide of rage surged through her.","They were carried along on a tide of euphoria."],"opposite":"","synonyms":""},{"def":"a time or season of the year","examples":["Christmastide"],"opposite":"","synonyms":""},{"def":"to agree with/oppose the attitudes or opinions that most other people have","examples":[],"opposite":"","synonyms":""},{"def":"used to say that there is a change in somebody’s luck or in how successful they are being","examples":["The tide turned for the Canadian at the start of the second set.","This contract is probably our last chance to turn the tide."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"go, swim, etc. with/against the tide","def":"to agree with/oppose the attitudes or opinions that most other people have","examples":[]},{"idiom":"the tide turned | turn the tide","def":"used to say that there is a change in somebody’s luck or in how successful they are being","examples":["The tide turned for the Canadian at the start of the second set.","This contract is probably our last chance to turn the tide."]}],"phrasal":[],"related":["low tide","rip tide","high tide","neap tide","tide over","tide pool","flood tide","spring tide","tide somebody over (something)"]},{"pos":"verb","level":"","meanings":[],"idioms":[],"phrasal":["tide over"],"related":[]}]