[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tie/tie__/tie__us_1.mp3","phonsUS":"/taɪ/","level":"A2","meanings":[{"def":"to attach or hold two or more things together using string, rope, etc.; to fasten somebody/something with string, rope, etc.","examples":["tie something + adv./prep. She tied the newspapers in a bundle.","He had to tie her hands together.","They tied him to a chair with cable.","I tie back my hair when I'm cooking.","The box was tied with plastic string.","His hands were tied behind his back.","tie something Shall I tie the package or tape it?","We'll swim back to the beach before the tide turns.","Short-term loans are designed to tide borrowers over until their next payday.","She tied her hair up with ribbon.","Her hair was tied into a loose ponytail.","The prisoners were tied hand and foot.","A scarf was tied around her neck."],"opposite":"","synonyms":""},{"def":"to fasten something to or around something else","examples":["She tied a label on to the suitcase.","Anything which might be blown over was tied down or moved inside.","Did you tie the balloons on tightly?","I tied the bundle onto the end of the string.","She tied the rope securely to a tree.","He tied his bathrobe firmly around him."],"opposite":"","synonyms":""},{"def":"to make a knot in a piece of string, rope, etc.","examples":["to tie a ribbon","Can you help me tie my tie?","Tie the cords neatly.","Can you tie a bow tie?","He tied his shoes (= the laces on his shoes) with a double knot.","tie something up Tie up your shoelaces!","tie something in something I tied a knot in the rope."],"opposite":"","synonyms":""},{"def":"to be closed or fastened with a knot, etc.","examples":["The skirt ties at the waist."],"opposite":"","synonyms":""},{"def":"to connect or link somebody/something closely with somebody/something else","examples":["be tied (to something/somebody) Pay increases are tied to inflation.","Their company's future is closely tied to our own.","The house is tied to the job, so we'll have to move when I retire.","Production and consumption are inextricably tied together.","You can't stay tied to her forever."],"opposite":"","synonyms":""},{"def":"to limit somebody's freedom to act and make them unable to do everything they want to","examples":["be tied (by something) to be tied by a contract","be tied to something I want to work but I'm tied to the house with the baby.","Carers can be completely tied to their homes.","be tied to doing something I don't want to be tied to coming home at a particular time."],"opposite":"","synonyms":""},{"def":"to have the same number of points","examples":["tie (with somebody) England tied 2–2 with Germany in the first round.","tie for something They tied for second place.","tie something The scores are tied at 3–3.","Last night's vote was tied."],"opposite":"","synonyms":""},{"def":"to join notes with a tie","examples":[],"opposite":"","synonyms":""},{"def":"(too much under) the influence and control of somebody","examples":["The British prime minister is too apt to cling to Washington's apron strings."],"opposite":"","synonyms":""},{"def":"to tie somebody’s hands and feet together so that they cannot move or escape","examples":[],"opposite":"","synonyms":""},{"def":"to prevent somebody from doing what they want by creating rules, limits, etc.","examples":[],"opposite":"","synonyms":""},{"def":"to be unable to do what you want to do because of rules, promises, etc.","examples":["I really wish I could help but my hands are tied."],"opposite":"","synonyms":""},{"def":"to become or make somebody very confused","examples":["I got myself tied up in knots when I tried to explain the legal system to them."],"opposite":"","synonyms":""},{"def":"to get married","examples":[],"opposite":"","synonyms":""},{"def":"to get very drunk","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"(tied to) somebody’s apron strings","def":"(too much under) the influence and control of somebody","examples":["The British prime minister is too apt to cling to Washington's apron strings."]},{"idiom":"bind/tie somebody hand and foot","def":"to tie somebody’s hands and feet together so that they cannot move or escape","examples":[]},{"idiom":"have your hands tied","def":"to be unable to do what you want to do because of rules, promises, etc.","examples":["I really wish I could help but my hands are tied."]},{"idiom":"tie somebody/yourself (up) in knots","def":"to become or make somebody very confused","examples":["I got myself tied up in knots when I tried to explain the legal system to them."]},{"idiom":"tie the knot","def":"to get married","examples":[]},{"idiom":"tie one on","def":"to get very drunk","examples":[]}],"phrasal":["tie down","tie in","tie off","tie up"],"related":["tie in","tie-in","tie up","tie-up","bolo tie","bow tie","cup tie","tie down","tie-dye","tie off","black tie","twist tie","white tie","white-tie","kipper tie","bootlace tie","old school tie"]},{"pos":"noun","level":"A2","meanings":[{"def":"a long, narrow piece of cloth worn around the neck, especially by men, with a knot in front","examples":["He was dressed impeccably in a suit and tie.","They prefer their employees to wear a shirt and tie.","a striped silk tie","His tie was askew and his hair dishevelled.","His tie was undone.","a collar and tie"],"opposite":"","synonyms":""},{"def":"a piece of string or wire used for fastening or tying something","examples":["ties for closing plastic bags"],"opposite":"","synonyms":""},{"def":"a strong connection between people or organizations","examples":["family ties","diplomatic/economic/bilateral ties","emotional ties","the ties of friendship","tie with somebody/something The firm has close ties with an American corporation.","Although he was raised as a Roman Catholic, he has cut his ties with the Church.","tie between somebody/something There is a strong tie between her and her daughters.","Ties between the two countries remain very strong.","tie to somebody/something giant corporations with close ties to the administration","Both sides agreed to strengthen political ties.","They severed ties after a dispute.","The community was bound by family ties and a strong church.","ties of kinship","to establish diplomatic ties with China"],"opposite":"","synonyms":""},{"def":"a thing that limits somebody’s freedom of action","examples":["He was still a young man and he did not want any ties.","They have broken the ties that bound them."],"opposite":"","synonyms":""},{"def":"a situation in a game or competition when two or more players have the same score","examples":["The match ended in a tie.","There was a tie for first place.","a tie between Egypt and France","They snatched a dramatic 7–7 tie with Wales in the final match.","The Chair has the casting vote in the event of a tie.","There was a 129–vote tie between her and Alderman Scot."],"opposite":"","synonyms":""},{"def":"a sports match, especially a football (soccer) match, that is part of a larger competition","examples":["the first leg of the tie between Leeds and Roma","They have a second round tie away to Ipswich Town."],"opposite":"","synonyms":""},{"def":"a curved line written over two notes of the same pitch (= how high or low a note is) to show that they are to be played or sung as one note","examples":[],"opposite":"","synonyms":""},{"def":"one of the heavy pieces of wood or concrete on which the rails (= metal bars) on a railway track are laid","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]