[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tim/time_/time__us_1.mp3","phonsUS":"/taɪm/","level":"A1","meanings":[{"def":"what is measured in minutes, hours, days, etc.","examples":["The world exists in time and space.","The changing seasons mark the passage of time.","in time A visit to the museum will take you back in time to the 1930s.","At this point in time, it seems unlikely that he will write any more books.","over time Perceptions change over time (= as time passes).","As time goes on I love this city more and more.","As time went by we saw less and less of each other.","The main character is able to travel through time.","They say that time heals all wounds.","Her skills improved with time.","It helps to pass the time.","Time drags in this job."],"opposite":"","synonyms":""},{"def":"the time shown on a clock in minutes and hours","examples":["What time is it/What’s the time?","Do you have the time?","(British English) What time do you make it?","(North American English) What time do you have?","Let me just check the time.","The time is now half past ten.","(British English) Can she tell the time yet (= say what time it is by looking at a clock)?","(North American English) Can she tell time yet?","My watch keeps perfect time (= always shows the correct time).","Look at the time! We'll be late.","This time tomorrow I'll be in Canada."],"opposite":"","synonyms":""},{"def":"the time measured in a particular part of the world","examples":["6 o’clock local time","We're two hours behind Central European Time."],"opposite":"","synonyms":""},{"def":"the time when something happens or when something should happen","examples":["What time do you finish work?","The baby loves bath time.","A computer screen shows arrival and departure times.","time to do something I think it's time to go to bed.","This is hardly the time to discuss politics.","time for something It's time for lunch.","time (that)… It's time the kids were in bed.","It's time that farmers listened to consumers.","by the time (that)… By the time you get there the meeting will be over.","at a… time Have I called at a bad time? Shall I call back later?","We stock six different beers at any one time.","at the time I didn't realize it at the time, but that was the best day of my life.","The promotion came at just the right time for me.","The new product will launch when the time is right.","You'll feel differently about it when the time comes (= when it happens).","around the time of something Several articles were published around the time of his death in 2018.","Is this an appropriate time to discuss my salary?","It's time for a break.","We need to fix a time for the next meeting.","At the time of writing, a ceasefire is under discussion.","Your time will come."],"opposite":"","synonyms":""},{"def":"an amount of time; the amount of time available to work, rest, etc.","examples":["I can't go with you—I don't have time.","He spends a lot of his time working.","time for something Do you have time for a chat?","time to do something Allow plenty of time to get to the airport.","I can probably make the time to see them.","It takes time to make changes in the law.","We have no time to lose (= we must hurry).","We got to the airport with time to spare.","She plans to study overseas for an extended period of time.","What do you like to do in your free time?","She doesn’t have much spare time.","Sorry, I can’t spare the time.","Don't waste any more time!","What a waste of time!","Time's running out for them to complete the project.","I didn't finish the test—I ran out of time.","Time's up—have you worked out the answer yet?","He never takes any time off (= time spent not working).","Jane's worked here for some time (= for a fairly long period of time).","Do it now please—not in three hours' time (= three hours from now).","The journey time is two hours.","I don’t want to take up too much of your precious time.","What’s the hurry? We have all the time in the world.","A great deal of time has been spent on developing this software.","De Niro makes the most of limited screen time.","Do you need more time?","He put all his time into the show.","I can certainly do the job if you give me time.","I can never find time to write letters.","I had no time to think.","I'll be back in ten minutes' time.","The coach plans to give younger players more playing time.","They didn't allow much time for discussion.","This doesn't leave much time for us to get ready.","We had to wait some time before the bus arrived.","We will discuss this matter later, if time permits.","We're wasting precious time.","Where does the time go?","You would save time with a dishwasher.","Have you lived abroad for any length of time?","He'd been thinking about quitting his job for quite some time."],"opposite":"","synonyms":""},{"def":"a period of time, either long or short, during which you do something or something happens","examples":["His injuries will take a long time to heal.","It took them a long time to get home.","Did you have to wait a long time to see the doctor?","for a time I lived in Egypt for a time.","I was only there for a short time.","The early morning is the best time of day.","Her parents died a long time ago.","At one time (= at a period of time in the past) Emily was my best friend.","Mr Curtis was the manager in my time (= when I was working there).","The leaves start to turn red at this time of (the) year.","There's less traffic at this time of day.","What are you doing out of bed at this time of night?","It was a fun time for us girls."],"opposite":"","synonyms":""},{"def":"a period of history connected with particular events or experiences in people’s lives","examples":["at the time of something The movie is set at the time of the Russian Revolution.","in… time(s) the politician who promised ‘peace in our time’","in ancient times","The Industrial Revolution took place in Victorian times.","the violent times we live in (= the present period of history)","in times of something in times of trouble","The business was successful, even during difficult times.","Times are hard for the unemployed.","Times have changed since Grandma was young."],"opposite":"","synonyms":""},{"def":"an occasion when you do something or when something happens","examples":["Every time I hear that song I feel happy.","It doesn't matter if you don't win every time (= every time you play).","Next time you're here let's have lunch together.","He failed his driving test three times.","He's determined to pass this time.","When was the last time you saw her?","I see her two or three times a week.","How many times (= how often) do I have to tell you not to do that?","(especially North American English) I remember one time (= once) we had to abandon our car in the snow.","(formal) At no time did I give my consent to the plan.","For the first time in history, more than half of us now live in cities.","I can remember the first time I met her.","I told her not to do it for the umpteenth time.","I've told you countless times.","The chairlift can take four people at a time.","three times out of ten","There were times—sometimes whole weeks—when I thought it wasn't worth trying to complete the project."],"opposite":"","synonyms":""},{"def":"an event or occasion that you experience in a particular way","examples":["Did you have a good time in Spain?","They're having a hard time dealing with her illness.","I had an awful time in the hospital.","Mike and I shared some really good times."],"opposite":"","synonyms":""},{"def":"how long somebody takes to run a race or complete an event","examples":["The winner's time was 11.6 seconds.","She completed the 500 metres in record time (= faster than any previous runner).","one of the fastest times ever"],"opposite":"","synonyms":""},{"def":"the number of beats (= units of rhythm) in a bar of music","examples":["This piece is in four-four time.","a slow waltz time","The conductor beat time with a baton."],"opposite":"","synonyms":""},{"def":"the correct speed and rhythm of a piece of music","examples":["in time to something Try and dance in time to the music (= with the same speed and rhythm).","Clap your hands to keep time (= sing or move with the correct speed and rhythm).","in/out of time to play in/out of time (= follow/not follow the correct speed and rhythm)","He always plays in perfect time."],"opposite":"","synonyms":""},{"def":"used to say that something should have happened before now","examples":[],"opposite":"","synonyms":""},{"def":"if you do something against time, you do it as fast as you can because you do not have much time","examples":["They're working against time to try and get people out of the rubble alive."],"opposite":"","synonyms":""},{"def":"earlier/later than was expected","examples":["We finished 15 minutes ahead of time.","The plane took off an hour behind time."],"opposite":"","synonyms":""},{"def":"having advanced or new ideas that other people use or copy later","examples":[],"opposite":"","synonyms":""},{"def":"during the whole of a particular period of time","examples":["The letter was in my pocket all the time (= while I was looking for it)."],"opposite":"","synonyms":""},{"def":"very often; repeatedly","examples":["She leaves the lights on all the time."],"opposite":"","synonyms":""},{"def":"always","examples":["Our representatives are ready to help you at all times.","Hot water is available at all times."],"opposite":"","synonyms":""},{"def":"even when the circumstances are very good","examples":["He's never very happy at the best of times—he'll be much worse now!"],"opposite":"","synonyms":""},{"def":"at one time; together","examples":["She was laughing and crying at the same time."],"opposite":"","synonyms":""},{"def":"used to introduce a fact that is different and must be considered","examples":["You have to be firm, but at the same time you should try and be sympathetic."],"opposite":"","synonyms":""},{"def":"separately or in groups of two, three, etc. on each occasion","examples":["We had to go and see the principal one at a time.","She ran up the stairs two at a time.","He surfs the internet for hours at a time."],"opposite":"","synonyms":""},{"def":"at the age you are (especially when you are not young)","examples":["Eyesight doesn't get any better at my time of life."],"opposite":"","synonyms":""},{"def":"sometimes","examples":["He can be really bad-tempered at times.","The rain will become heavy at times in the afternoon.","He can be rather moody at times."],"opposite":"","synonyms":""},{"def":"to mark or follow the rhythm of music, by waving a stick, tapping your foot (= hitting it against the floor), etc.","examples":["She beat time with her fingers."],"opposite":"","synonyms":""},{"def":"happening before you were born or can remember or before you lived, worked, etc. somewhere","examples":["‘Were you taught by Professor Pascal?’ ‘No, he was before my time.’"],"opposite":"","synonyms":""},{"def":"before the usual time in somebody’s life when something happens","examples":["She got old before her time."],"opposite":"","synonyms":""},{"def":"old-fashioned in your ideas, methods, etc.","examples":[],"opposite":"","synonyms":""},{"def":"to be able to take advantage of opportunities when they come","examples":["His success was down to being in the right place at the right time."],"opposite":"","synonyms":""},{"def":"to still be alive after the time when you were expected to die","examples":["He’s been living on borrowed time ever since his last heart attack."],"opposite":"","synonyms":""},{"def":"to be doing something that other people are likely to soon stop you from doing","examples":["According to the latest opinion polls, the government is living on borrowed time."],"opposite":"","synonyms":""},{"def":"used to encourage somebody who has not been successful at something","examples":["Never mind— better luck next time.","If you didn't win a prize, better luck next time."],"opposite":"","synonyms":""},{"def":"to wait for the right time to do something","examples":["He decided to bide his time until he got an opportunity to talk to her alone."],"opposite":"","synonyms":""},{"def":"to do something in order to delay an event, a decision, etc.","examples":["The negotiators kept the gunman talking to buy time for the hostages."],"opposite":"","synonyms":""},{"def":"to say or decide that it is time for something to finish","examples":[],"opposite":"","synonyms":""},{"def":"a very difficult or unpleasant job or time","examples":["I've had a devil of a job finding you."],"opposite":"","synonyms":""},{"def":"to spend time in prison","examples":[],"opposite":"","synonyms":""},{"def":"whenever there is a choice","examples":["I don't really like cities—give me the countryside every time."],"opposite":"","synonyms":""},{"def":"if you do something for old times’ sake, you do it because it is connected with something good that happened to you in the past","examples":[],"opposite":"","synonyms":""},{"def":"for a short period of time but not permanently","examples":["You can leave your suitcase here for the time being."],"opposite":"","synonyms":""},{"def":"beginning on that day; from that time","examples":["From that time forth she gave me endless friendship and encouragement."],"opposite":"","synonyms":""},{"def":"occasionally but not regularly","examples":["She has to work at weekends from time to time."],"opposite":"","synonyms":""},{"def":"to delay something so that you can have more time to make a decision, deal with a problem, etc.","examples":[],"opposite":"","synonyms":""},{"def":"to deliberately make a situation difficult and unpleasant for somebody","examples":["They really gave me a hard time at the interview."],"opposite":"","synonyms":""},{"def":"used to say that you prefer a particular thing or person to the one that has just been mentioned","examples":["We don't go out much. Give me a quiet night in front of the TV any day!"],"opposite":"","synonyms":""},{"def":"to have no difficulties or problems","examples":["He’s had an easy time of it since he married Lucy."],"opposite":"","synonyms":""},{"def":"to enjoy yourself very much","examples":[],"opposite":"","synonyms":""},{"def":"to like and be interested in somebody/something","examples":["I've always had a lot of time for Mary."],"opposite":"","synonyms":""},{"def":"to dislike somebody/something","examples":["I have no time for lazy people like Steve."],"opposite":"","synonyms":""},{"def":"to have many problems or difficulties to deal with; to not be successful","examples":["He’s had a thin time of it since losing his job."],"opposite":"","synonyms":""},{"def":"to enjoy yourself very much","examples":[],"opposite":"","synonyms":""},{"def":"to have nothing to do or not be busy","examples":[],"opposite":"","synonyms":""},{"def":"to enjoy yourself very much; to have a very good time","examples":["The kids had a whale of a time at the theme park."],"opposite":"","synonyms":""},{"def":"when enough time has passed","examples":["It is possible that in the course of time a cure for cancer will be found.","In the course of time, I began to understand."],"opposite":"","synonyms":""},{"def":"when the time is appropriate, usually after a long period","examples":["I have no doubt that she’ll tell us in the fullness of time."],"opposite":"","synonyms":""},{"def":"early; with enough time so that you are not in a hurry","examples":["Get to the airport in good time."],"opposite":"","synonyms":""},{"def":"used to say that something will be done or will happen at the appropriate time and not before","examples":["Be patient, Emily! All in good time."],"opposite":"","synonyms":""},{"def":"at the very last moment; just before something bad happens, so that you manage to avoid it, but only just","examples":["They escaped from the smoke-filled house just in the nick of time."],"opposite":"","synonyms":""},{"def":"so soon or so quickly that it is surprising","examples":["The kids will be leaving home in no time."],"opposite":"","synonyms":""},{"def":"a long time ago in the past","examples":["In olden times people would gather in town squares to gossip and exchange stories."],"opposite":"","synonyms":""},{"def":"how and when you want to, even though this might annoy other people","examples":["He always does the work, but in his own sweet time.","She just ignores all the criticism and continues on her own sweet way."],"opposite":"","synonyms":""},{"def":"when you are ready and not sooner","examples":["Don't hassle him! He'll do it in his own good time."],"opposite":"","synonyms":""},{"def":"in your free time and not when you usually work or study","examples":[],"opposite":"","synonyms":""},{"def":"after a period of time when a situation has changed","examples":["They learned to accept their stepmother in time.","You'll get used to the work in time."],"opposite":"","synonyms":""},{"def":"not late; with enough time to be able to do something","examples":["Will we be in time for the six o'clock train?","The ambulance got there just in time (= to save somebody's life)."],"opposite":"","synonyms":""},{"def":"used to say that you think somebody should do something soon","examples":["It's about time you cleaned your room!"],"opposite":"","synonyms":""},{"def":"used to say that something will definitely happen, although you are not sure when","examples":["It's only a matter of time before they bring out their own version of the software."],"opposite":"","synonyms":""},{"def":"to change and develop your ideas, way of working, etc. so that you do what is modern and what is expected","examples":["Many complained that the Royal Family had failed to move with the times."],"opposite":"","synonyms":""},{"def":"to spend time doing something that is not important while you are waiting for something else to happen","examples":["We killed time playing cards."],"opposite":"","synonyms":""},{"def":"used to say hello to somebody you have not seen for a long time","examples":[],"opposite":"","synonyms":""},{"def":"to complete a journey quickly","examples":["We made excellent time and arrived in Spain in two days."],"opposite":"","synonyms":""},{"def":"to do something quickly or very often because you wish you had started doing it sooner","examples":["I’ll have to work hard now to make up for lost time."],"opposite":"","synonyms":""},{"def":"many times; frequently","examples":[],"opposite":"","synonyms":""},{"def":"to pass the time while you wait for something more interesting","examples":["I'm just marking time in this job—I'm hoping to get into journalism."],"opposite":"","synonyms":""},{"def":"to make marching movements without moving forwards","examples":[],"opposite":"","synonyms":""},{"def":"on the next, first, etc. occasion that the same thing happens","examples":["He repeated none of the errors he'd made first time round.","This time round it was not so easy."],"opposite":"","synonyms":""},{"def":"used to say that something is usually true or almost always happens","examples":["Nine times out of ten she gives the right answer."],"opposite":"","synonyms":""},{"def":"almost always","examples":[],"opposite":"","synonyms":""},{"def":"used to say that something should have happened before now","examples":[],"opposite":"","synonyms":""},{"def":"to refuse to speak to somebody because you do not like or respect them","examples":["Since the success of her novel, people shake her hand who once wouldn't have given her the time of day."],"opposite":"","synonyms":""},{"def":"now is the best time to do something, not in the future","examples":[],"opposite":"","synonyms":""},{"def":"that has ever existed","examples":["Many rated him the best singer of all time."],"opposite":"","synonyms":""},{"def":"used, especially at the beginning of stories, to mean ‘a long time ago in the past’","examples":["Once upon a time there was a beautiful princess."],"opposite":"","synonyms":""},{"def":"at the arranged or correct time; not late","examples":["The train arrived right on time."],"opposite":"","synonyms":""},{"def":"to say hello to somebody and have a short conversation with them","examples":[],"opposite":"","synonyms":""},{"def":"to find or create reasons why something has to be delayed, often so you have longer to prepare for it","examples":["His legal team, clearly playing for time, sought to have the case heard a month later."],"opposite":"","synonyms":""},{"def":"a situation in which you have to do something or finish something very fast before it is too late","examples":["Getting food to the starving refugees is now a race against time."],"opposite":"","synonyms":""},{"def":"something that you feel shows what things are like now, especially how bad they are","examples":["The increasing number of people owning guns is an alarming sign of the times."],"opposite":"","synonyms":""},{"def":"it is better to deal with something immediately because if you wait it may become worse or more difficult and cause extra work","examples":[],"opposite":"","synonyms":""},{"def":"to not think about what will happen in the future","examples":["I don't know if he'll get better. We're just taking it one day at a time."],"opposite":"","synonyms":""},{"def":"to use as much time as you need without hurrying","examples":["There's no rush—take your time."],"opposite":"","synonyms":""},{"def":"used to say you think somebody is late or is too slow in doing something","examples":["You certainly took your time getting here!"],"opposite":"","synonyms":""},{"def":"to spend some time away from your usual work or activity in order to rest or do something else instead","examples":["She is taking time out from her music career for a year.","We stopped for a well-earned rest.","Let’s take a break.","The drug brought a brief respite from the pain.","Take time out to relax by the pool.","This delay gives the party a breathing space in which to sort out its policies."],"opposite":"","synonyms":"rest"},{"def":"the fact that something has not happened before does not mean that it will never happen","examples":[],"opposite":"","synonyms":""},{"def":"used when you have failed to do something twice and hope that you will succeed the third time","examples":[],"opposite":"","synonyms":""},{"def":"often; on many or all occasions","examples":["You will get a perfect result time after time if you follow these instructions.","Time and again, the girls have shown how strong and determined they can be."],"opposite":"","synonyms":""},{"def":"one and a half times the usual rate of pay","examples":["We get time and a half on Sundays."],"opposite":"","synonyms":""},{"def":"time seems to pass very quickly","examples":["How time flies! I've got to go now.","Time has flown since the holiday began."],"opposite":"","synonyms":""},{"def":"time is valuable, and should not be wasted","examples":[],"opposite":"","synonyms":""},{"def":"used to say that somebody can wait for something to happen or can wait before doing something","examples":[],"opposite":"","synonyms":""},{"def":"used to say that something used to happen in the past","examples":["Time was when you could go for a walk in the country and not see another person for miles.","Time was when we never needed to lock our house at night."],"opposite":"","synonyms":""},{"def":"used to say that you will have to wait for some time to find out the result of a situation","examples":["Only time will tell if the treatment has been successful."],"opposite":"","synonyms":""},{"def":"during the whole of a particular period of time","examples":["My keys were in my pocket the whole time (= while I was looking for them)."],"opposite":"","synonyms":""},{"def":"very often; repeatedly","examples":["He drums his fingers on the table the whole time—it's very annoying."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"(and) about time (too) | (and) not before time","def":"used to say that something should have happened before now","examples":[]},{"idiom":"against time","def":"if you do something against time, you do it as fast as you can because you do not have much time","examples":["They're working against time to try and get people out of the rubble alive."]},{"idiom":"ahead of/behind time","def":"earlier/later than was expected","examples":["We finished 15 minutes ahead of time.","The plane took off an hour behind time."]},{"idiom":"ahead of your time","def":"having advanced or new ideas that other people use or copy later","examples":[]},{"idiom":"all the time | the whole time","def":"during the whole of a particular period of time","examples":["The letter was in my pocket all the time (= while I was looking for it).","She leaves the lights on all the time."]},{"idiom":"at all times","def":"always","examples":["Our representatives are ready to help you at all times.","Hot water is available at all times."]},{"idiom":"at the best of times","def":"even when the circumstances are very good","examples":["He's never very happy at the best of times—he'll be much worse now!"]},{"idiom":"at the same time","def":"at one time; together","examples":["She was laughing and crying at the same time.","You have to be firm, but at the same time you should try and be sympathetic."]},{"idiom":"at a time","def":"separately or in groups of two, three, etc. on each occasion","examples":["We had to go and see the principal one at a time.","She ran up the stairs two at a time.","He surfs the internet for hours at a time."]},{"idiom":"at my, your, his, etc. time of life","def":"at the age you are (especially when you are not young)","examples":["Eyesight doesn't get any better at my time of life."]},{"idiom":"at times","def":"sometimes","examples":["He can be really bad-tempered at times.","The rain will become heavy at times in the afternoon.","He can be rather moody at times."]},{"idiom":"beat time (to something)","def":"to mark or follow the rhythm of music, by waving a stick, tapping your foot (= hitting it against the floor), etc.","examples":["She beat time with her fingers."]},{"idiom":"before my, your, his, etc. time","def":"happening before you were born or can remember or before you lived, worked, etc. somewhere","examples":["‘Were you taught by Professor Pascal?’ ‘No, he was before my time.’","She got old before her time."]},{"idiom":"behind the times","def":"old-fashioned in your ideas, methods, etc.","examples":[]},{"idiom":"be in the right place at the right time","def":"to be able to take advantage of opportunities when they come","examples":["His success was down to being in the right place at the right time."]},{"idiom":"be (living) on borrowed time","def":"to still be alive after the time when you were expected to die","examples":["He’s been living on borrowed time ever since his last heart attack.","According to the latest opinion polls, the government is living on borrowed time."]},{"idiom":"better luck next time","def":"used to encourage somebody who has not been successful at something","examples":["Never mind— better luck next time.","If you didn't win a prize, better luck next time."]},{"idiom":"bide your time","def":"to wait for the right time to do something","examples":["He decided to bide his time until he got an opportunity to talk to her alone."]},{"idiom":"buy time","def":"to do something in order to delay an event, a decision, etc.","examples":["The negotiators kept the gunman talking to buy time for the hostages."]},{"idiom":"call time (on something)","def":"to say or decide that it is time for something to finish","examples":[]},{"idiom":"a devil of a job/time","def":"a very difficult or unpleasant job or time","examples":["I've had a devil of a job finding you."]},{"idiom":"do time","def":"to spend time in prison","examples":[]},{"idiom":"every time","def":"whenever there is a choice","examples":["I don't really like cities—give me the countryside every time."]},{"idiom":"for old times’ sake","def":"if you do something for old times’ sake, you do it because it is connected with something good that happened to you in the past","examples":[]},{"idiom":"for the time being","def":"for a short period of time but not permanently","examples":["You can leave your suitcase here for the time being."]},{"idiom":"from that time/day forth","def":"beginning on that day; from that time","examples":["From that time forth she gave me endless friendship and encouragement."]},{"idiom":"from time to time","def":"occasionally but not regularly","examples":["She has to work at weekends from time to time."]},{"idiom":"gain time","def":"to delay something so that you can have more time to make a decision, deal with a problem, etc.","examples":[]},{"idiom":"give somebody a hard time","def":"to deliberately make a situation difficult and unpleasant for somebody","examples":["They really gave me a hard time at the interview."]},{"idiom":"give me something/somebody (any day/time)","def":"used to say that you prefer a particular thing or person to the one that has just been mentioned","examples":["We don't go out much. Give me a quiet night in front of the TV any day!"]},{"idiom":"have an easy time (of it)","def":"to have no difficulties or problems","examples":["He’s had an easy time of it since he married Lucy."]},{"idiom":"have a high old time","def":"to enjoy yourself very much","examples":[]},{"idiom":"have a lot of time for somebody/something","def":"to like and be interested in somebody/something","examples":["I've always had a lot of time for Mary."]},{"idiom":"have no time for somebody/something | not have much time for somebody/something","def":"to dislike somebody/something","examples":["I have no time for lazy people like Steve."]},{"idiom":"have a thin time (of it)","def":"to have many problems or difficulties to deal with; to not be successful","examples":["He’s had a thin time of it since losing his job."]},{"idiom":"have the time of your life","def":"to enjoy yourself very much","examples":[]},{"idiom":"have time on your hands | have time to kill","def":"to have nothing to do or not be busy","examples":[]},{"idiom":"have a whale of a time","def":"to enjoy yourself very much; to have a very good time","examples":["The kids had a whale of a time at the theme park."]},{"idiom":"in the course of time","def":"when enough time has passed","examples":["It is possible that in the course of time a cure for cancer will be found.","In the course of time, I began to understand."]},{"idiom":"in the fullness of time","def":"when the time is appropriate, usually after a long period","examples":["I have no doubt that she’ll tell us in the fullness of time."]},{"idiom":"in good time","def":"early; with enough time so that you are not in a hurry","examples":["Get to the airport in good time."]},{"idiom":"(all) in good time","def":"used to say that something will be done or will happen at the appropriate time and not before","examples":["Be patient, Emily! All in good time."]},{"idiom":"in the nick of time","def":"at the very last moment; just before something bad happens, so that you manage to avoid it, but only just","examples":["They escaped from the smoke-filled house just in the nick of time."]},{"idiom":"in (less than/next to) no time","def":"so soon or so quickly that it is surprising","examples":["The kids will be leaving home in no time."]},{"idiom":"in olden times","def":"a long time ago in the past","examples":["In olden times people would gather in town squares to gossip and exchange stories."]},{"idiom":"in your own sweet time/way","def":"how and when you want to, even though this might annoy other people","examples":["He always does the work, but in his own sweet time.","She just ignores all the criticism and continues on her own sweet way."]},{"idiom":"in your own (good) time","def":"when you are ready and not sooner","examples":["Don't hassle him! He'll do it in his own good time."]},{"idiom":"in your own time","def":"in your free time and not when you usually work or study","examples":[]},{"idiom":"in time","def":"after a period of time when a situation has changed","examples":["They learned to accept their stepmother in time.","You'll get used to the work in time."]},{"idiom":"in time (for something/to do something)","def":"not late; with enough time to be able to do something","examples":["Will we be in time for the six o'clock train?","The ambulance got there just in time (= to save somebody's life)."]},{"idiom":"it’s about/high time","def":"used to say that you think somebody should do something soon","examples":["It's about time you cleaned your room!"]},{"idiom":"it’s just/only a matter of time (before…)","def":"used to say that something will definitely happen, although you are not sure when","examples":["It's only a matter of time before they bring out their own version of the software."]},{"idiom":"keep up/move with the times","def":"to change and develop your ideas, way of working, etc. so that you do what is modern and what is expected","examples":["Many complained that the Royal Family had failed to move with the times."]},{"idiom":"kill time | kill an hour, a couple of hours, etc.","def":"to spend time doing something that is not important while you are waiting for something else to happen","examples":["We killed time playing cards."]},{"idiom":"long time no see","def":"used to say hello to somebody you have not seen for a long time","examples":[]},{"idiom":"make good, etc. time","def":"to complete a journey quickly","examples":["We made excellent time and arrived in Spain in two days."]},{"idiom":"make up for lost time","def":"to do something quickly or very often because you wish you had started doing it sooner","examples":["I’ll have to work hard now to make up for lost time."]},{"idiom":"many a time | many’s the time (that)…","def":"many times; frequently","examples":[]},{"idiom":"mark time","def":"to pass the time while you wait for something more interesting","examples":["I'm just marking time in this job—I'm hoping to get into journalism."]},{"idiom":"(the) next, first, second, etc. time round","def":"on the next, first, etc. occasion that the same thing happens","examples":["He repeated none of the errors he'd made first time round.","This time round it was not so easy."]},{"idiom":"nine times out of ten | ninety-nine times out of a hundred","def":"used to say that something is usually true or almost always happens","examples":["Nine times out of ten she gives the right answer."]},{"idiom":"ninety-nine times out of a hundred","def":"almost always","examples":[]},{"idiom":"(and) not before time | (and) about time (too)","def":"used to say that something should have happened before now","examples":[]},{"idiom":"not give somebody the time of day","def":"to refuse to speak to somebody because you do not like or respect them","examples":["Since the success of her novel, people shake her hand who once wouldn't have given her the time of day."]},{"idiom":"(there is) no time like the present","def":"now is the best time to do something, not in the future","examples":[]},{"idiom":"of all time","def":"that has ever existed","examples":["Many rated him the best singer of all time."]},{"idiom":"once upon a time","def":"used, especially at the beginning of stories, to mean ‘a long time ago in the past’","examples":["Once upon a time there was a beautiful princess."]},{"idiom":"on time","def":"at the arranged or correct time; not late","examples":["The train arrived right on time."]},{"idiom":"pass the time of day (with somebody)","def":"to say hello to somebody and have a short conversation with them","examples":[]},{"idiom":"play for time","def":"to find or create reasons why something has to be delayed, often so you have longer to prepare for it","examples":["His legal team, clearly playing for time, sought to have the case heard a month later."]},{"idiom":"a race against time/the clock","def":"a situation in which you have to do something or finish something very fast before it is too late","examples":["Getting food to the starving refugees is now a race against time."]},{"idiom":"a sign of the times","def":"something that you feel shows what things are like now, especially how bad they are","examples":["The increasing number of people owning guns is an alarming sign of the times."]},{"idiom":"a stitch in time (saves nine)","def":"it is better to deal with something immediately because if you wait it may become worse or more difficult and cause extra work","examples":[]},{"idiom":"take it/things one day at a time","def":"to not think about what will happen in the future","examples":["I don't know if he'll get better. We're just taking it one day at a time."]},{"idiom":"take your time (over something) | take your time to do something/doing something","def":"to use as much time as you need without hurrying","examples":["There's no rush—take your time.","You certainly took your time getting here!"]},{"idiom":"take time out","def":"to spend some time away from your usual work or activity in order to rest or do something else instead","examples":["She is taking time out from her music career for a year.","We stopped for a well-earned rest.","Let’s take a break.","The drug brought a brief respite from the pain.","Take time out to relax by the pool.","This delay gives the party a breathing space in which to sort out its policies."]},{"idiom":"there’s a first time for everything","def":"the fact that something has not happened before does not mean that it will never happen","examples":[]},{"idiom":"third time lucky","def":"used when you have failed to do something twice and hope that you will succeed the third time","examples":[]},{"idiom":"time after time | time and (time) again","def":"often; on many or all occasions","examples":["You will get a perfect result time after time if you follow these instructions.","Time and again, the girls have shown how strong and determined they can be."]},{"idiom":"time and a half","def":"one and a half times the usual rate of pay","examples":["We get time and a half on Sundays."]},{"idiom":"time flies","def":"time seems to pass very quickly","examples":["How time flies! I've got to go now.","Time has flown since the holiday began."]},{"idiom":"time is money","def":"time is valuable, and should not be wasted","examples":[]},{"idiom":"time is on your side","def":"used to say that somebody can wait for something to happen or can wait before doing something","examples":[]},{"idiom":"time was (when)…","def":"used to say that something used to happen in the past","examples":["Time was when you could go for a walk in the country and not see another person for miles.","Time was when we never needed to lock our house at night."]},{"idiom":"time (alone) will tell | only time will tell","def":"used to say that you will have to wait for some time to find out the result of a situation","examples":["Only time will tell if the treatment has been successful."]},{"idiom":"the whole time | all the time","def":"during the whole of a particular period of time","examples":["My keys were in my pocket the whole time (= while I was looking for them).","He drums his fingers on the table the whole time—it's very annoying."]}],"phrasal":[],"related":["Time","all-time","any time","big time","me-time","old-time","one-time","time lag","time out","Time Out","two-time","face time","full time","full-time","game-time","good-time","half-time","lead time"]},{"pos":"verb","level":"B2","meanings":[{"def":"to measure how long it takes for something to happen or for somebody to do something","examples":["time something ‘How long does it take to get to Leeds from here?’ ‘I don’t know, I’ve never timed it.’","time something at something The winner was timed at 20.4 seconds.","time how long… Time how long it takes you to run ten laps.","Time how long it takes you to answer the questions."],"opposite":"","synonyms":""},{"def":"to arrange to do something or arrange for something to happen at a particular time","examples":["time something for something She timed her arrival for shortly after 3.","be… timed Their visit was perfectly timed.","The runners set off at precisely timed intervals.","Their request was poorly timed (= it was made at the wrong time).","time something + adv. If we time it right, we should miss the traffic.","‘I hope we're not too early.’ ‘You couldn't have timed it better!’","be timed to do something The announcement of her new role was timed to coincide with the launch of her latest book.","The meeting is timed for 2 o'clock.","The schedule must be carefully timed.","This campaign is well timed.","a beautifully timed entrance","The show is timed to coincide with the launch of her new book."],"opposite":"","synonyms":""},{"def":"to hit or kick a ball at a particular moment in a sports game","examples":["She timed the pass perfectly.","a beautifully timed shot"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["time out"],"related":[]},{"pos":"","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tim/time_/time__us_2.mp3","level":"","meanings":[{"def":"a popular US news magazine, published every week. It was started in 1923 by Henry Luce (1898-1967), the husband of Clare Booth Luce, and Briton Hadden (1898-1929). It created offices for its journalists around the world and has developed a particular style of writing which is sometimes called Timese. The magazine now has several different international versions. People consider it a great honour to have their picture on the cover of the magazine, and as a special feature every year it chooses a man or woman of the year.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]