[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tit/title/title__us_4.mp3","phonsUS":"/ˈtaɪtl/","level":"A1","meanings":[{"def":"the name of a book, poem, painting, piece of music, etc.","examples":["What's title of her new book?","a book/album title","Some of his song titles and lyrics have also attracted criticism.","under a title His poems were published under the title of ‘Love and Reason’.","the title track from their latest CD (= the song with the same title as the disc)","She has sung the title role in ‘Carmen’ (= the role of Carmen in that opera).","The title character (= the person mentioned in the name of the book, play, etc.) is a native of Colombia."],"opposite":"","synonyms":""},{"def":"a particular book or magazine","examples":["The company publishes twenty new titles a year.","40% of new titles were actually new editions of existing books.","Sony has released six new game titles."],"opposite":"","synonyms":""},{"def":"a word in front of a person’s name to show their rank or profession, whether or not they are married, etc.","examples":["The present duke inherited the title from his father.","Give your name and title (= Mr, Miss, Ms, Dr, etc.).","My name is Maria.","His name is Tom Smith.","John T. Harvey","Hillary Rodham Clinton.","Hello, Maria.","Hello, Mr Brown.","Thank you, Doctor.","She has a title.","The king bestowed lands and titles upon his followers.","The justices are accorded the courtesy title ‘Lord’.","Count Victor Oldenburg and Hess, to give him his full title","‘Mrs’ was a courtesy title for any unmarried woman in business at that time.","‘Minister’ is one of several diplomatic titles."],"opposite":"","synonyms":""},{"def":"a name that describes a job","examples":["The official title of the job is ‘Administrative Assistant’.","What is your name and job title?","Bessie Smith earned the title ‘Empress of the Blues’.","In 2017, Brooks assumed the title of chairman.","She bears the grand title ‘Divisional President of the Finances Committee’.","He was given the title of ‘wise man’."],"opposite":"","synonyms":""},{"def":"the position of being the winner of a competition, especially a sports competition","examples":["She has won three world titles.","He'll be defending his title at this week's French Open.","the world heavyweight title","the league/division/national title","a title fight (= in boxing)","Suzuki won seven consecutive batting titles in Japan's Pacific League.","Deportivo clinched the title with a goal in the final seconds of the last game of the season.","He's a leading contender for the European title.","She's hoping to win her third Olympic title.","They won 5–1 in the final to retain the title.","He has been building up fitness for his world title challenge."],"opposite":"","synonyms":""},{"def":"the legal right to own something, especially land or property; the document that shows you have this right","examples":["He claims he has title to the land."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["title bar","half-title","title deed","title page","title-holder","working title","courtesy title","title bars","title deeds","title pages","title-holders"]},{"pos":"verb","level":"B2","meanings":[{"def":"to give a book, piece of music, etc. a particular name","examples":["be titled… Their first album was titled ‘Made in Valmez’.","an article titled ‘Is Music Dead?’","These poems are from a manuscript tentatively titled ‘The Hunter’."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]