[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/ton/tone_/tone__us_1.mp3","phonsUS":"/təʊn/","level":"B2","meanings":[{"def":"the quality of somebody’s voice, especially expressing a particular emotion","examples":["speaking in hushed/low/clipped/measured, etc. tones","a conversational tone","a tone of surprise","Don't speak to me in that tone of voice (= in that unpleasant way).","There's not need to take that tone (= speak critically or rudely) with me—it's not my fault we're late.","‘You ought to have thought of them,’ she said in a reproachful tone.","Excuse me, I don't like your tone.","Her tone betrayed her impatience.","Her tone sounded sincere but I knew she was lying.","His tone changed dramatically when he saw the money.","In cool, clipped tones, he told her what had happened.","She answered him in a brisk, matter-of-fact tone.","His tone was faintly mocking.","The question was posed in a flat tone.","The rising tone of her voice emphasized her panic.","When she heard my accent, she adopted a warmer tone.","We heard the dulcet tones of the sergeant, bawling at us to get on parade."],"opposite":"","synonyms":""},{"def":"the general character and attitude of something such as a piece of writing, or the atmosphere of an event","examples":["The overall tone of the book is gently nostalgic.","She set the tone for the meeting with a firm statement of company policy.","Trust you to lower the tone of the conversation (= for example by telling a rude joke).","in tone The article was moderate in tone and presented both sides of the case.","a change in tone","The film takes a sudden shift in tone in the final minutes.","The newspaper said voters had been turned off by the negative tone of the campaign.","He uses humour to lighten the tone of the novel.","His letter was very negative in tone.","The general tone of the report was favourable.","The movie has a jokey tone throughout.","The music perfectly matches the tone of the movie.","The newspaper sets a high moral tone in its editorial about politicians' private lives.","There is a marked change of tone in the second half of the book."],"opposite":"","synonyms":""},{"def":"the quality of a sound, especially the sound of a musical instrument or one produced by electronic equipment","examples":["the full rich tone of the trumpet","the sweet tone of the flute","the volume and tone controls on a car stereo"],"opposite":"","synonyms":""},{"def":"a shade of a colour","examples":["a carpet in warm tones of brown and orange","You should use a foundation that matches your skin tone.","Dark, rich tones will absorb light to make a room look smaller.","Her hair was lit with copper tones.","muted tones of blue and green"],"opposite":"","synonyms":""},{"def":"how strong and tight your muscles or skin are","examples":["how to improve your muscle/skin tone"],"opposite":"","synonyms":""},{"def":"a sound heard on a phone line","examples":["the dialling tone","(North American English) the dial tone","Please speak after the tone (= for example as an instruction on an answering machine).","I keep getting the engaged tone."],"opposite":"","synonyms":""},{"def":"one of the five longer intervals in a musical scale, for example the interval between C and D or between E and F♯","examples":[],"opposite":"","synonyms":""},{"def":"the pitch (= how high or low a sound is) of a syllable in speaking","examples":["a rising/falling tone"],"opposite":"","synonyms":""},{"def":"a particular pitch pattern on a syllable in languages such as Chinese, that can be used to recognize the difference in meanings","examples":[],"opposite":"","synonyms":""},{"def":"having the type of tone mentioned","examples":["a bright-toned soprano","olive-toned skin"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["two-tone","tone-deaf","tone down","tone poem","tone unit","earth tone","Touch-Tone™","tone-on-tone","dialling tone","quarter-tone","tone language","fundamental tone","dial tone","twelve-tone","tone poems","tone units","tone group","tone languages"]},{"pos":"verb","level":"","meanings":[{"def":"to make your muscles, skin, etc. tighter and stronger","examples":["Massage will help to tone up loose skin under the chin.","a beautifully toned body"],"opposite":"","synonyms":""},{"def":"to match the colour of something","examples":["The beige of his jacket toned (in) with the cream shirt."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["tone down"],"related":[]}]