[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tos/toss_/toss__us_1_rr.mp3","phonsUS":"/tɔːs/","level":"C1","meanings":[{"def":"to throw something lightly or carelessly","examples":["toss something + adv./prep. I tossed the book aside and got up.","toss something to somebody He tossed the ball to Anna.","toss somebody something He tossed Anna the ball.","Some kids were throwing stones at the window.","She threw the ball and he caught it.","She tossed her jacket onto the bed.","Rioters hurled a brick through the car’s windscreen.","She flung the letter down onto the table.","I chucked him the keys.","They were lobbing stones over the wall.","He tossed the letter over to me.","She tossed her jacket onto the bed.","She picked up the package and casually tossed it into her bag.","The bodies were unceremoniously tossed into mass graves.","(figurative) The improvements had to be tossed overboard because of lack of money.","(figurative) It's an idea that gets tossed around from time to time."],"opposite":"","synonyms":"throw"},{"def":"to throw a coin in the air in order to decide something, especially by guessing which side is facing upwards when it lands","examples":["toss something Let's toss a coin.","toss (somebody) for something (especially British English) There's only one ticket left—I'll toss you for it.","toss up (for something) (British English) We tossed up to see who went first.","toss up between A and B (British English, figurative) He had to toss up between (= decide between) paying the rent or buying food."],"opposite":"","synonyms":""},{"def":"to move your head suddenly upwards, especially to show that you are annoyed or impatient","examples":["She just tossed her head and walked off.","She tossed back her blonde hair."],"opposite":"","synonyms":""},{"def":"to move or make somebody/something move from side to side or up and down","examples":["Branches were tossing in the wind.","I couldn't sleep but kept tossing and turning in bed all night.","She tossed about restlessly all night with a high fever.","toss somebody/something Our boat was being tossed by the huge waves."],"opposite":"","synonyms":""},{"def":"to shake or turn food in order to cover it with oil, butter, etc.","examples":["Drain the pasta and toss it in melted butter.","Toss the vegetables lightly in olive oil.","Pour the vinaigrette over the salad and toss well."],"opposite":"","synonyms":""},{"def":"to throw a pancake upwards so that it turns over in the air and lands back in the frying pan so you can fry the other side","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["toss off"],"related":["toss off","toss-up","full toss","pitch-and-toss","toss-ups","toss something","toss off | toss somebody/yourself off","argue the toss","not give a toss (about somebody/something)"]},{"pos":"noun","level":"","meanings":[{"def":"an act of throwing a coin in the air in order to decide something","examples":["The final result was decided on/by the toss of a coin.","to win/lose the toss (= to guess correctly/wrongly which side of a coin will face upwards when it lands on the ground after it has been thrown in the air)","England won the toss and chose to kick off.","The team captains called the toss (= guessed which way a coin would land)."],"opposite":"","synonyms":""},{"def":"an act of moving your head suddenly upwards, especially to show that you are annoyed or impatient","examples":["She dismissed the question with a toss of her head."],"opposite":"","synonyms":""},{"def":"an act of throwing something, especially in a competition or game","examples":["a toss of 10 metres"],"opposite":"","synonyms":""},{"def":"to continue to disagree about a decision, especially when it is too late to change it or it is not very important","examples":[],"opposite":"","synonyms":""},{"def":"to not care at all about somebody/something","examples":["Nobody gives a toss what you think!"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"argue the toss","def":"to continue to disagree about a decision, especially when it is too late to change it or it is not very important","examples":[]},{"idiom":"not give a toss (about somebody/something)","def":"to not care at all about somebody/something","examples":["Nobody gives a toss what you think!"]}],"phrasal":[],"related":[]}]