[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tot/total/total__us_1.mp3","phonsUS":"/ˈtəʊtl/","level":"B1","meanings":[{"def":"being the amount or number after everyone or everything is counted or added together","examples":["Their total cost was $18 000.","This brought the total number of accidents so far this year to 113.","The club has a total membership of 300.","the total profit/sales/revenue/income/expenditure/value","Try to cut down on the total amount of fat that you eat.","The total student population at Cambridge University is around 13,000 students."],"opposite":"","synonyms":""},{"def":"used when you are emphasizing something, to mean ‘to the greatest degree possible’","examples":["The room was in total darkness.","They wanted a total ban on handguns.","The evening was a total disaster.","I can't believe you'd tell a total stranger about it!","These comments indicate a total lack of understanding.","They lived with an almost total lack of information about what was happening.","She maintained total artistic control over a project.","I always expect total honesty from my employees.","She was a total mystery to him despite their long association.","Six years of total war had left no citizen untouched.","The emperor demanded total submission from his subjects.","The game ended in a total rout.","There was a look of total concentration on her face.","They were to surrender immediately or face total annihilation."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["sum total","grand total","running total","total physical response","total quality management","total cost of ownership"]},{"pos":"noun","level":"B1","meanings":[{"def":"the amount you get when you add several numbers or amounts together; the final number of people or things when they have all been counted","examples":["a total of something You got 47 points on the written examination and 18 on the oral, making a total of 65.","His businesses are worth a combined total of $3 billion.","Out of a total of 15 games, they only won 2.","He was jailed for a total of six months.","in total The repairs came to over £500 in total (= including everything).","The number of employees has tripled, bringing the total to 400.","Rainfall totals for the month were below normal.","The UK had the largest share of the European art market - 56% of the total.","180 vehicles out of a total of 900 examined were not roadworthy.","A donation of $250 has been received, bringing the total to $3 750.","Britain's jobless total rose by 20 000 last month.","He won a career total of 19 gold medals.","In total, they spent 420 hours on the project.","The Greens achieved a total of 18 seats."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"C1","meanings":[{"def":"to reach a particular total","examples":["Imports totalled $1.5 billion last year.","In 2005–6, college enrolments totalled some 5 400."],"opposite":"","synonyms":""},{"def":"to add up the numbers of something/somebody and get a total","examples":["Each student's points were totalled and entered in a list."],"opposite":"","synonyms":""},{"def":"to damage a car very badly, so that it is not worth repairing it","examples":["She never forgave him for totaling her car."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]