[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tou/tour_/tour__us_2.mp3","phonsUS":"/tʊr/","level":"A2","meanings":[{"def":"a journey made for pleasure during which several different towns, countries, etc. are visited","examples":["a walking/sightseeing/bus tour","tour of/round/around something a coach tour of northern France","They embarked on a tour around the country.","a tour operator (= a person or company that organizes tours)","a business trip","a five-minute trip by taxi","a long and difficult journey across the mountains","a tour of Bavaria","the first expedition to the South Pole","We went on an all-day excursion to the island.","The children were on a day’s outing from school.","We had a day out at the beach.","We met a group of Italians on a tour in Peru.","They made a whistle-stop tour of the five major towns.","This summer we went on a walking tour around Provence.","We're going on a tour of Bavaria.","You can join an organized tour or you can visit independently.","I'd like to do a tour of Belgium on foot."],"opposite":"","synonyms":"trip"},{"def":"an act of walking around a town, building, etc. in order to visit it","examples":["We were given a guided tour (= by somebody who knows about the place) of the palace.","a virtual tour (= shown on a computer) of the Taj Mahal","a tour of inspection (= an official visit of a factory, classroom, etc. made by somebody whose job is to check that everything is working as expected)","a tour guide","tour of/round/around something Our host gave us a quick tour of the house.","Come on, I'll give you the grand tour of the backyard.","I made a lightning tour of the office to say goodbye.","She takes tourists on ghost tours of Edinburgh.","The next tour will begin at four o'clock.","Garden tours are offered throughout the summer.","After a whirlwind tour of the temples, it was time to find a hotel."],"opposite":"","synonyms":""},{"def":"an official series of visits made to different places by a sports team, an orchestra, an important person, etc.","examples":["The band is currently on a nine-day tour of France.","on tour The band is on tour in France.","a concert tour","a world/European/UK tour","a tour bus","The prince will visit Boston on the last leg (= part) of his American tour.","a book/lecture/speaking tour","Are you doing a tour for this new book?","The group will shortly go on a ten-city European tour.","We are going back to Prague as part of a small tour.","The president embarked on a whirlwind tour of the provinces.","Simon and Garfunkel's 2003 reunion tour","The band is just back from a sell-out Asian tour.","The group will shortly go on a ten-city European tour.","a promotional tour for her new book","the couple's first official overseas tour","Dolly Parton's tour bus","He wasn't selected for England's tour party to Australia.","Phone for details of the band's tour dates.","The team's tour manager called a press conference."],"opposite":"","synonyms":""},{"def":"a period of time when somebody is serving in the military or as a diplomat in a particular place","examples":["He served tours all over the world during his 35-year career."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["grand tour","package tour","tour de force","tour of duty","Tour of Britain","Grand Tour","tour of duties"]},{"pos":"verb","level":"B1","meanings":[{"def":"to travel around a place, for example on holiday, or to perform, to advertise something, etc.","examples":["tour something He toured America with his one-man show.","She toured the country promoting her book.","(+ adv./prep.) We spent four weeks touring around Europe.","He's toured across Europe, the UK and North America.","She is currently touring with her new band.","He no longer tours.","The band toured the UK last year.","The town makes an ideal base for touring the Highlands.","I was on my own as I toured round.","We plan to tour all over the country.","She has toured extensively in the US.","The Beatles stopped touring years before."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]