[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tow/town_/town__us_1.mp3","phonsUS":"/taʊn/","level":"A1","meanings":[{"def":"a place with many houses, shops, etc. where people live and work. It is larger than a village but smaller than a city.","examples":["The nearest town is ten miles away.","a university/seaside/market town","in a town I live in a small town.","How many people live in the town?","We spent a month in the French town of Le Puy.","They live in a rough part of town.","I spent years moving from town to town.","It was built as a new town in the 1960s.","Kitzbühel is an ancient fortified town with fine medieval buildings.","She has gone back to live in her home town.","a 19th-century mill town that used to produce cotton","a busy market town","a lake just outside the town","a sleepy provincial town in southern France","a thriving holiday town","the dusty border town of Eagle Pass, Texas","the rolling hills that surround the town","the sun-drenched beach towns of Southern California","Sackville is a small university town in eastern Canada."],"opposite":"","synonyms":""},{"def":"the people who live in a particular town","examples":["The whole town is talking about it."],"opposite":"","synonyms":""},{"def":"the area of a town where most of the shops and businesses are","examples":["We are only five minutes from the centre of town.","in town Mum's in town doing some shopping.","Can you give me a lift into town?","Millie hit the town, looking for excitement."],"opposite":"","synonyms":""},{"def":"a particular town where somebody lives and works or one that has just been referred to","examples":["in town I'll be in town next week if you want to meet.","This restaurant serves the best steaks in town.","out of town He married a girl from out of town.","The gossips finally drove her out of town.","He left town yesterday for a conference in Cape Town.","I was out of town last week.","They wanted to move out of town and start a new life in the country.","They'll be back in town tomorrow."],"opposite":"","synonyms":""},{"def":"life in towns or cities as opposed to life in the country","examples":["Pollution is just one of the disadvantages of living in the town.","Do you prefer the town to the country?"],"opposite":"","synonyms":""},{"def":"to do something with a lot of energy, enthusiasm, etc., especially by spending a lot of money","examples":["They really went to town on the decorations for the party."],"opposite":"","synonyms":""},{"def":"a man who frequently goes to fashionable parties, clubs, theatres, etc.","examples":["In his new suit, he looked quite the man about town."],"opposite":"","synonyms":""},{"def":"the most important thing of a particular type, or the only thing that is available","examples":[],"opposite":"","synonyms":""},{"def":"visiting restaurants, clubs, theatres, etc. for entertainment, especially at night","examples":["a night on the town","How about going out on the town tonight?"],"opposite":"","synonyms":""},{"def":"to go to a lot of different bars, clubs, etc. and enjoy yourself","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"go to town (on something)","def":"to do something with a lot of energy, enthusiasm, etc., especially by spending a lot of money","examples":["They really went to town on the decorations for the party."]},{"idiom":"a/the man about town","def":"a man who frequently goes to fashionable parties, clubs, theatres, etc.","examples":["In his new suit, he looked quite the man about town."]},{"idiom":"the only game in town","def":"the most important thing of a particular type, or the only thing that is available","examples":[]},{"idiom":"(out) on the town","def":"visiting restaurants, clubs, theatres, etc. for entertainment, especially at night","examples":["a night on the town","How about going out on the town tonight?"]},{"idiom":"paint the town red","def":"to go to a lot of different bars, clubs, etc. and enjoy yourself","examples":[]}],"phrasal":[],"related":["new town","Our Town","Bean Town","boom town","home town","town hall","twin town","county town","ghost town","market town","shanty town","small-town","town centre","town clerk","town crier","town house","company town","out-of-town","town meeting","town planner"]}]