[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tra/trade/trade__us_1.mp3","phonsUS":"/treɪd/","level":"B1","meanings":[{"def":"the activity of buying and selling or of exchanging goods or services between people or countries","examples":["international/foreign/global/world trade","trade in something the international trade in oil","the illegal trade in wildlife","the arms/drugs trade","The Senate has approved a trade agreement with Latin American nations.","trade between/with somebody/something Trade between the two countries has increased.","an international trade barrier to GM food","Market prices and trade liberalization have increased prices.","trade negotiations/talks","Public support for the current trade policy is declining.","a bilateral trade deal","The US has restricted trade with India.","Several local companies took part in a trade mission to Spain.","Steps were taken to ban the trade in ivory.","The US was accused of employing unfair trade practices.","The countries were locked in a trade war, refusing to allow imports of each other's goods.","The five countries formed a regional trade bloc.","They already dominated the domestic trade in raw jute.","Trade between the Adriatic ports and their hinterland had grown.","attempts to curb the illicit trade in exotic species","the boom and slump periods of a trade cycle","the evil trade in drugs"],"opposite":"","synonyms":""},{"def":"a particular type of business","examples":["the building/food/tourist trade","in the… trade He works in the retail trade (= selling goods in shops/stores).","the fur/book trade","She's in the wholesale fruit trade.","the area's dependence on the tourist trade","Employment in the building trade is notoriously irregular.","He built up a trade in seeds, corn, and manure."],"opposite":"","synonyms":""},{"def":"a particular area of business and the people or companies that are connected with it","examples":["They offer discounts to the trade (= to people who are working in the same business).","a trade magazine/journal","Their company is respected and well known in the trade.","It's a trade association that represents all segments of the dairy industry.","The vase was bought by a trade buyer.","These flour sacks are known in the trade as ‘pockets’.","the trade body representing water companies"],"opposite":"","synonyms":""},{"def":"the amount of goods or services that you sell","examples":["Trade was very good last month.","All around the pyramids, salespeople were doing a roaring trade in souvenirs.","Shops have lost a day's trade.","Stores are doing a brisk trade in wizard accessories and vampire kits."],"opposite":"","synonyms":""},{"def":"a job, especially one that involves working with your hands and that requires special training and skills","examples":["by trade He was a carpenter by trade.","When she leaves school, she wants to learn a trade.","She was surrounded by the tools of her trade (= everything she needs to do her job).","It’s very difficult to find work at the moment.","Only half the people here are in paid employment.","He had a very distinguished career in the Foreign Office.","He hopes to enter the medical profession.","Please state your name, age, and occupation.","Carpentry is a highly skilled trade.","If you've got a trade, you need never be out of work.","Dressmaking is a highly skilled trade.","the tools needed to carry on a trade"],"opposite":"","synonyms":"work"},{"def":"to sell a lot of something very quickly","examples":["The ice-cream vendors were doing a roaring trade."],"opposite":"","synonyms":""},{"def":"a person who can do many different types of work, but who perhaps does not do them very well","examples":[],"opposite":"","synonyms":""},{"def":"to look for customers, passengers, etc. in order to do business","examples":["taxis plying for trade outside the theatre"],"opposite":"","synonyms":""},{"def":"to do your work or business","examples":["This is the restaurant where he plied his trade as a cook.","Drug dealers openly plied their trade in front of children."],"opposite":"","synonyms":""},{"def":"the clever ways of doing things, known and used by people who do a particular job or activity","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"do a roaring trade (in something)","def":"to sell a lot of something very quickly","examples":["The ice-cream vendors were doing a roaring trade."]},{"idiom":"a jack of all trades","def":"a person who can do many different types of work, but who perhaps does not do them very well","examples":[]},{"idiom":"ply for trade/hire/business","def":"to look for customers, passengers, etc. in order to do business","examples":["taxis plying for trade outside the theatre"]},{"idiom":"ply your trade","def":"to do your work or business","examples":["This is the restaurant where he plied his trade as a cook.","Drug dealers openly plied their trade in front of children."]},{"idiom":"the tricks of the trade","def":"the clever ways of doing things, known and used by people who do a particular job or activity","examples":[]}],"phrasal":[],"related":["trade at","trade in","trade-in","trade on","trade up","trade-up","trade off","trade-off","fair trade","fair-trade","free trade","slave trade","trade down","trade fair","trade name","trade route","trade show","trade union","trade winds"]},{"pos":"verb","level":"B1","meanings":[{"def":"to buy and sell things","examples":["trade in something The firm openly traded in arms.","trade with somebody Early explorers traded directly with the Indians.","trade in something with somebody Her family traded in textiles with the Far East.","trading partners (= countries that you trade with)","trade something Our products are now traded worldwide.","In 1900, more than 60% of cotton goods traded internationally were made in Lancashire.","trade something with somebody The turnover of agricultural goods traded with the US amounted to $45 million last year.","He claimed that all businesses should be able to trade freely on Sundays.","After settling in Madeira they began trading in flour, sugar, and leather.","countries trading illegally in rhinoceros horn"],"opposite":"","synonyms":""},{"def":"to exist and operate as a business or company","examples":["The firm has now ceased trading.","trade as somebody/something They traded as ‘Walker and Son’.","The company trades under the name ‘English Estates’.","They now trade as a partnership."],"opposite":"","synonyms":""},{"def":"to be bought and sold, or to buy and sell something, on a stock exchange","examples":["Shares were trading at under half their usual value.","trade something Shares in the company haven't been publicly traded since 1998."],"opposite":"","synonyms":""},{"def":"to exchange something that you have for something that somebody else has","examples":["trade (somebody) something to trade secrets/insults/jokes","Cabinet colleagues traded insults over the future of the pound.","trade something for something She traded her posters for his CD.","trade something with somebody I wouldn't mind trading places with her for a day."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["trade at","trade down","trade in","trade off","trade on","trade up"],"related":[]}]