[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tra/tradi/tradition__us_1.mp3","phonsUS":"/trəˈdɪʃn/","level":"A2","meanings":[{"def":"a belief, custom or way of doing something that has existed for a long time among a particular group of people; a set of these beliefs or customs","examples":["religious/cultural/ancient traditions","This region is steeped in tradition.","a tradition of something The company has a long tradition of fine design.","The company has continued its tradition of innovation.","The British are said to love tradition (= to want to do things in the way they have always been done).","They broke with tradition (= did things differently) and got married quietly.","by tradition By tradition, children play tricks on 1 April.","according to tradition According to tradition, a tree grew on this spot.","There's a tradition in our family that we have a party on New Year's Eve.","in the tradition of somebody He's a politician in the tradition of (= similar in style to) Kennedy.","a native culture expressed almost wholly through an oral tradition (= that is only spoken and not written down)","He is motivated by a family tradition of charity and good works.","his country's rich folk traditions","His work has earned him a central place in the African American literary tradition.","By tradition, ships are often referred to as ‘she’ in English.","Following in the Hitchcock tradition, he always appears in the films he directs.","He broke with the family tradition and did not go down the mines.","In a departure from tradition, the bride wore a red dress.","He made it clear he was not going to be bound by tradition.","In time-honoured tradition, a bottle of champagne was smashed on the ship.","It became an annual tradition for me to ice the cake.","Japan's rich cultural tradition and history","The building was constructed in the best traditions of church architecture.","The girl had challenged the traditions of her patriarchal tribe.","The locals get together every year to keep this age-old tradition alive.","The tradition dates back to the 16th century.","They have inherited a rich tradition of music and dance.","This region has a great musical tradition.","an oral tradition handed down from generation to generation","people of all faith traditions","Brittany has a lively and very distinctive sense of tradition.","Germany has a tradition of good quality newspapers.","He decided not to follow the family tradition of joining the navy.","This year there will be a break with tradition.","The Punjabi have a proud military tradition.","He is carrying on the family tradition of public service.","This approach is in keeping with a long tradition."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]