[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tra/traff/traffic__us_1.mp3","phonsUS":"/ˈtræfɪk/","level":"A1","meanings":[{"def":"the vehicles that are on a road at a particular time","examples":["There's always a lot of traffic at this time of day.","There are currently delays of 40 minutes due to heavy traffic.","She left home early to avoid the rush-hour traffic.","The road will be closed to through traffic for eight weeks.","The car veered across the road into the path of oncoming traffic.","in traffic They were stuck in traffic and missed their flight.","a plan to reduce traffic congestion","traffic police (= who control traffic on a road or stop drivers who are breaking the law)","She was badly injured in a road traffic accident.","The delay is due simply to the volume of traffic.","We got used to the constant noise of the traffic.","Building larger roads could generate more traffic.","I stood waiting for a gap in the oncoming traffic.","She waved her arms at the passing traffic, pleading for someone to stop.","Sheep are a traffic hazard in the hills.","The traffic was terrible on the way here.","Traffic clogs the streets of the city centre.","Traffic thins noticeably after 9 a.m.","Traffic was held up for six hours by the accident.","We joined the traffic heading north.","We set off early to beat the traffic.","a policeman on traffic duty","Expect traffic delays around the area.","Flooding caused traffic chaos.","He pleaded guilty to a minor traffic offence.","He used to be a traffic cop.","The area is closed to through traffic.","The town's medieval streets cannot cope with modern commuter traffic.","Traffic flow has improved since the charge was introduced.","Traffic fumes are the main cause of air pollution.","Traffic was lighter than usual."],"opposite":"","synonyms":""},{"def":"the movement of ships, trains, aircraft, etc. along a particular route","examples":["transatlantic traffic","The line is used by both passenger and freight traffic."],"opposite":"","synonyms":""},{"def":"the movement of people or goods from one place to another","examples":["commuter/freight/passenger traffic","the traffic of goods between one country and another"],"opposite":"","synonyms":""},{"def":"the movement of messages and signals through an electronic communication system","examples":["the computer servers that manage global internet traffic","web/network traffic","Telecom operators have upgraded their networks to improve their capacity as data traffic increases.","Our company will help you generate site traffic.","These tips should help you generate more targeted traffic to your website."],"opposite":"","synonyms":""},{"def":"illegal trade in something","examples":["the traffic in firearms"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["traffic jam","traffic cone","traffic light","traffic calming","traffic circle","traffic island","traffic warden","air traffic control","air traffic controller","National Air Traffic Services","traffic cones","traffic jams","traffic lights","traffic circles","traffic islands","traffic wardens"]},{"pos":"verb","level":"","meanings":[{"def":"to move people illegally, especially in order to make them work in bad conditions without proper payment","examples":["The women had been trafficked and forced into sex work.","Organized criminal gangs are trafficking in migrants.","Many people were trafficked across the border.","trafficked children"],"opposite":"","synonyms":""},{"def":"to buy and sell something illegally","examples":["Smugglers were trafficking arms across the border to the rebels.","to traffic in drugs"],"opposite":"","synonyms":""},{"def":"to spread or try to encourage a harmful idea or type of behaviour","examples":["We have no time for people who traffic in bigotry.","They trafficked all kinds of baseless conspiracy theories."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]