[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tra/trail/trail__us_1.mp3","phonsUS":"/treɪl/","level":"C1","meanings":[{"def":"a long line or series of marks that is left by somebody/something","examples":["a trail of blood","tourists who leave a trail of litter everywhere they go","The hurricane left a trail of destruction behind it."],"opposite":"","synonyms":""},{"def":"a track, sign or smell that is left behind and that can be followed, especially in hunting","examples":["The hounds were following the fox's trail.","on the trail of somebody/something The police are still on the trail of the escaped prisoner.","Fortunately the trail was still warm (= clear and easy to follow).","The trail had gone cold.","Ants follow a scent trail laid down previously.","The dog had picked up the trail of a rabbit.","The fox had crossed a stream, and the hounds lost the trail.","Detectives had found several new clues and were back on the murderer's trail.","The couple laid a false trail to escape the press photographers.","They had to find the kidnappers before the trail went cold."],"opposite":"","synonyms":""},{"def":"a path through the countryside","examples":["a trail through the forest","We set off to walk the trail that winds along the Colorado River.","The trail was covered with deep snow.","The Norfolk Coast path is part of a National Trail.","The Appalachian Trail runs from Maine to Georgia.","A woodland trail leads off to the right.","The trail wends its way through leafy woodland and sunny meadows."],"opposite":"","synonyms":""},{"def":"a route that is followed for a particular purpose","examples":["a tourist trail (= of famous buildings)","politicians on the campaign trail (= travelling around to attract support)","In 1967 she hit the hippy trail to India.","We did the Inca trail."],"opposite":"","synonyms":""},{"def":"to be the first to do or to discover something that others follow","examples":["The department is blazing a trail in the field of laser surgery."],"opposite":"","synonyms":""},{"def":"to start a journey","examples":["The following spring I hit the road."],"opposite":"","synonyms":""},{"def":"close to catching or finding the person or thing that you have been running after or searching for","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"blaze a trail","def":"to be the first to do or to discover something that others follow","examples":["The department is blazing a trail in the field of laser surgery."]},{"idiom":"hit the road/trail","def":"to start a journey","examples":["The following spring I hit the road."]},{"idiom":"hot on somebody’s/something’s tracks/trail","def":"close to catching or finding the person or thing that you have been running after or searching for","examples":[]}],"phrasal":[],"related":["trail off","audit trail","paper trail","trail away","trail bike","nature trail","vapour trail","national trail","Santa Fe Trail","Oregon Trail","Chisholm Trail","Overland Trail","Trail of Tears","trail bikes","vapor trail","breadcrumb trail"]},{"pos":"verb","level":"C1","meanings":[{"def":"to pull something behind somebody/something, usually along the ground; to be pulled along in this way","examples":["trail something A jeep trailing a cloud of dust was speeding in my direction.","I trailed my hand in the water as the boat moved along.","(+ adv./prep.) The bride's dress trailed behind her.","The little boy trailed a dirty old blanket behind him.","Don't let the blanket trail on the ground.","Her scarf was trailing in the mud."],"opposite":"","synonyms":""},{"def":"to walk slowly because you are tired or bored, especially behind somebody else; to go from one place to another without enthusiasm","examples":["The kids trailed around after us while we shopped for clothes.","I trailed wearily after the others.","The last walkers came trailing down the hill.","We walked home in the rain, with the kids trailing along behind.","They spent their lives trailing around the country.","I spent months trailing from one audition to the next."],"opposite":"","synonyms":""},{"def":"to be losing a game or other contest","examples":["United were trailing 2–0 at half-time.","trail by something We were trailing by five points.","trail in something This country is still trailing badly in scientific research.","trail somebody/something The Conservatives are trailing Labour in the opinion polls.","Liverpool are now trailing badly in the league.","They were trailing by 12 points until the last few minutes of the game.","Lazio were trailing to a 47th-minute goal by Roma."],"opposite":"","synonyms":""},{"def":"to follow somebody/something by looking for signs that show you where they have been","examples":["The police trailed Dale for days.","They spent three hours trailing a deer through the woods.","Sharks were trailing the ship."],"opposite":"","synonyms":""},{"def":"to grow or hang downwards over something or along the ground; to move downwards over something","examples":["trailing plants","He had tears trailing down his cheeks."],"opposite":"","synonyms":""},{"def":"to advertise a film, TV programme, etc. in advance","examples":["It was trailed heavily as the Big Film of the New Year."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["trail away","trail off"],"related":[]}]