[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tra/train/training__us_1.mp3","phonsUS":"/ˈtreɪnɪŋ/","level":"A2","meanings":[{"def":"the process of learning the skills that you need to do a job","examples":["staff training","training in something Few candidates had received any training in management.","training in doing something She has some training in dealing with children with emotional problems.","training for somebody The company failed to provide adequate training for staff.","Volunteers will undergo intensive training.","a training course/session/programme","Employees should be given training in safety procedures.","He is good at selling, although he has had no formal training.","New recruits undergo six weeks' basic training at the base.","No one must operate the machinery without proper training.","She's an accountant by training.","The soldiers were building a bridge as a training exercise.","This local newspaper has been a training ground for several top journalists.","Training for nurses was on strictly formal lines.","Using spreadsheets requires minimal training.","You have to do a year's intensive training to become a paramedic.","a teacher training college","an army training base","Please list any job-related training you have received.","Various training activities will take place throughout the weekend.","Vocational training should not be seen as less important than an academic education."],"opposite":"","synonyms":""},{"def":"the process of preparing to take part in a sports competition by doing physical exercise","examples":["He suffered an ankle injury during training this week.","in training for something She is currently in training for the New York City marathon.","in training We are already back in pre-season training.","Lewis is in serious training for the Olympics.","She did six months' hard training before the marathon.","He twisted an ankle during training and will miss tomorrow's game.","I go to football training after school.","Meyer went through a gruelling training schedule over the winter months."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["training camp","training shoe","circuit training","cross-training","interval training","physical training","potty-training","spring training","teacher training","toilet-training","training college","training ground","training wheels","weight training","autogenic training","secure training centre","high-intensity interval training"]}]