[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tra/trans/transition__us_1.mp3","phonsUS":"/trænˈzɪʃn/","level":"B2","meanings":[{"def":"the process or a period of changing from one state or condition to another","examples":["transition from something to something the transition from school to full-time work","transition to something He will remain head of state during the period of transition to democracy.","transition from something Only after he stepped down could a genuine transition from dictatorship begin.","a three-year transition period","He has not met with the transition team members.","The company was slow to make the transition from paper to computer.","transition between A and B We need to ensure a smooth transition between the old system and the new one.","in transition This course is useful for students who are in transition from one training programme to another.","Her transition from child star to movie mogul was complete.","The country is in transition from an agricultural to an industrial society."],"opposite":"","synonyms":""},{"def":"the process of starting to live your life as a person of a different sex, to match your gender identity","examples":["She wrote to co-workers announcing her transition and asking them to refer to her with female pronouns."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["transition metal","transition metals","transition element"]},{"pos":"verb","level":"","meanings":[{"def":"to change or to make something change from one state or condition to another","examples":["They transitioned from print journalism to the digital world.","Almost every country in the world has made the decision to transition away from fossil fuels.","transition somebody/something They decided to transition the farm to organic."],"opposite":"","synonyms":""},{"def":"to start living your life as a person of a different sex, to match your gender identity","examples":["The singer told fans about his decision to transition."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]