[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tra/trans/transfer__us_1_rr.mp3","phonsUS":"/trænsˈfɜːr/","level":"B2","meanings":[{"def":"to move from one place to another; to move something/somebody from one place to another","examples":["transfer (to something) The film studio is transferring to Hollywood.","(especially North American English) If I spend a semester in Madrid, will my credits transfer?","transfer from something to something The system only allows air to go one way, preventing air from transferring from one tire to another.","transfer something/somebody from something to something How can I transfer money from my bank account to his?","transfer something/somebody to something The patient was transferred to another hospital.","transfer something/somebody from something (especially North American English) I couldn't transfer all my credits from junior college.","transfer something Assets can be transferred overseas.","transfer something into/onto something She transferred the sauce into a china jug.","transfer something between A and B The honeybee transfers pollen between flowers.","Customers still can't easily transfer money between accounts."],"opposite":"","synonyms":""},{"def":"to move from one job, school, situation, etc. to another; to arrange for somebody to move","examples":["transfer to something Children usually transfer to secondary school at 11 or 12.","transfer from something This is her first season in the Ohio State team after transferring from Tennessee.","transfer from something to something Students can transfer from a community college to a university.","He transferred to UCLA after his freshman year.","transfer somebody from something Ten employees are being transferred from the sales department.","transfer somebody to something His superiors transferred him to easier assignments.","transfer somebody from something to something She was promoted and transferred from the department of law to the Institute of Legal Studies.","transfer somebody 98 percent of our patients are admitted, transferred, or discharged within four hours."],"opposite":"","synonyms":""},{"def":"to change to a different vehicle during a journey; to arrange for somebody to change to a different vehicle during a journey","examples":["transfer from something to something It was a relief, after transferring from ship to ship, to just sit and relax.","I transferred at Bahrain for a flight to Singapore.","transfer somebody from something to something Passengers are transferred from the airport to the hotel by taxi."],"opposite":"","synonyms":""},{"def":"to copy information, music, an idea, etc. from one method of recording or presenting it to another; to be recorded or presented in a different way","examples":["transfer something to something You can transfer data to a memory stick in a few seconds.","transfer something Data is easily transferred electronically.","transfer something from something (to something) You can transfer songs from your computer to a phone.","transfer to something The novel does not transfer well to the movies.","An audio file should transfer in a matter of minutes."],"opposite":"","synonyms":""},{"def":"if you transfer a feeling, a disease, or power, etc. from one person to another, the second person has it, often instead of the first","examples":["Joe had already transferred his affections from Lisa to Cleo.","I decided to transfer my loyalty to my local team.","This disease is sometimes transferred from mother to baby (= so that the baby has it as well as the mother).","Can the disease be transferred across species?","Skills cannot be transferred directly from a trainer to a trainee."],"opposite":"","synonyms":""},{"def":"to officially arrange for something to belong to somebody else or for somebody else to control something","examples":["He transferred the property to his son.","Sovereignty was formally transferred on December 27."],"opposite":"","synonyms":""},{"def":"to move, or to move somebody, to a different sports team, especially a professional football (soccer) team","examples":["transfer (from…) (to…) He transferred to Everton for £60 million.","transfer somebody (from…) (to…) He was transferred from Spurs to Arsenal for a huge fee."],"opposite":"","synonyms":""},{"def":"to send a phone call that you have received to another phone number","examples":["I'll just transfer you to customer service.","Customers are able to transfer calls from their landline to their mobile."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["cash transfer","credit transfer","language transfer","money transfer","transfer student","file transfer protocol","Hypertext Transfer Protocol"]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tra/trans/transfer__us_2.mp3","phonsUS":"/ˈtrænsfɜːr/","level":"B2","meanings":[{"def":"the act of moving somebody/something from one place, group or job to another; an occasion when this happens","examples":["electronic data transfer","transfer of something After the election there was a swift transfer of power.","transfer to something He has asked for a transfer to the company's Paris branch.","transfer of something from something to something the transfer of currency from one country to another","transfer from something to something I asked for a transfer from my company to one of their California offices.","I did a file transfer from one PC to another.","transfer (of something) between somebody/something the transfer of property between private buyers","Her boss recommended a permanent transfer overseas.","Only the owner can make a transfer of goods.","The law schools accept a large number of second-year transfer students.","The war caused a massive transfer of population.","There has been a net transfer of lower-paid people away from the inner cities."],"opposite":"","synonyms":""},{"def":"an act of changing to a different place, vehicle or route when you are travelling","examples":["The transfer from the airport to the hotel is included in the price.","The hotel can arrange airport transfers."],"opposite":"","synonyms":""},{"def":"a ticket that allows a passenger to continue their journey on another bus or train","examples":[],"opposite":"","synonyms":""},{"def":"the act of moving a sports player from one club or team to another","examples":["It was the first goal he had scored since his transfer from Chelsea.","His club have given him a free transfer.","a transfer fee","to be on the transfer list (= available to join another club)","the January transfer window (= a period in the year when transfers can take place)"],"opposite":"","synonyms":""},{"def":"a picture or design that can be removed from a piece of paper and stuck onto a surface, for example by being pressed or heated","examples":[],"opposite":"","synonyms":""},{"def":"the process of using behaviour that has already been learnt in one situation in a new situation","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]