[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tra/trans/translation__us_2_rr.mp3","phonsUS":"/trænzˈleɪʃn/","level":"B1","meanings":[{"def":"the process of changing something that is written or spoken into another language","examples":["an error in translation","translation from something into something He specializes in translation from Danish into English.","translation from something The request must have lost something in the translation from the French.","translation into something Several books are already in translation into other languages.","translation into something The poems do not survive the translation into English.","translation of something (into something) The systems are used for the online translation of text.","in translation The book loses something in translation.","The irony is lost in translation.","There will be simultaneous translation in English and Chinese."],"opposite":"","synonyms":""},{"def":"a text or word that has been changed from one language into another","examples":["translation of something The usual translation of ‘glasnost’ is ‘openness’.","a copy of Dryden’s translation of the Aeneid","A full English translation of this speech is widely available on the internet.","a rough translation (= not translating everything exactly)","a literal translation (= following the original words exactly)","a free translation (= not following the original words exactly)","a word-for-word translation","in translation I have only read Tolstoy in translation.","I have a translation to do for Friday.","She tried making her own translation of the contract.","The translation of the Latin motto reads ‘Not for oneself, but for others’."],"opposite":"","synonyms":""},{"def":"the process of changing something into a different form","examples":["the translation of theory into practice","the translation of sporting potential into Olympic gold medals"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["loan translation","machine translation","grammar translation method"]}]