[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tra/trans/translate__us_2.mp3","phonsUS":"/trænzˈleɪt/","level":"B1","meanings":[{"def":"to express the meaning of speech or writing in a different language","examples":["translate something into something He translated the letter into English.","Her books have been translated into 24 languages.","Can you help me translate this legal jargon into plain English?","translate something from something This chapter was translated from the French by Oliver Breen.","translate something from something into something His works have been translated from French into countless languages.","translate something as something ‘Suisse’ had been wrongly translated as ‘Sweden’.","translate (something) The novel has been widely translated.","I don't speak Greek so Dina offered to translate for me.","translate from something My work involves translating from German.","translate into something My father dictated in Polish while I translated into English.","translate from something into something I spoke to him through my friend who translated from Arabic into English."],"opposite":"","synonyms":""},{"def":"to be changed from one language to another","examples":["Most poetry does not translate well.","translate as something The Welsh name translates as ‘Land's End’.","It's a Spanish word that roughly translates as 'unease'.","‘Tiramisu’ literally translates as ‘pull-me-up’."],"opposite":"","synonyms":""},{"def":"to change something into a different form; to lead to a particular result","examples":["translate something (into something) It's time to translate words into action.","translate into something I hope all the hard work will translate into profits.","You need to translate your ideas into practice.","A small increase in local spending will translate into a big rise in council tax.","Teacher expectations do not automatically translate themselves into student results.","The lost trade revenue ultimately translated into job losses at home.","Most attempts to translate Shakespeare to the small screen are not successful.","The story translates well to the screen.","I'm not sure how well the American system would translate to a European context."],"opposite":"","synonyms":""},{"def":"to understand something in a particular way or give something a particular meaning","examples":["the various words and gestures that we translate as love"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]