[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tra/trans/transport__us_1.mp3","phonsUS":"/ˈtrænspɔːrt/","level":"A2","meanings":[{"def":"a system for carrying people or goods from one place to another using vehicles, roads, etc.","examples":["air/freight/road transport","the government’s transport policy","The region has good transport links.","We need a reliable transport network.","Modern transport systems have been a severe threat to the environment.","Good public transport infrastructure is urgently required.","He sits on the passenger transport authority.","Investment in transport infrastructure has increased.","The book deals with the history of road transport.","The industry was faced with a huge transport problem.","Transport costs are currently funded by the taxpayer."],"opposite":"","synonyms":""},{"def":"a vehicle or method of travel","examples":["Applicants must have their own transport.","Transport to and from the airport is included in the price.","His bike is his only means of transport.","The train is the preferred mode of transport for commuters working in Dublin.","Hitchhiking is a common form of transport.","The car broke down, leaving us without transport.","people who have no access to private transport","Staff who transfer to a different office will receive a transport allowance."],"opposite":"","synonyms":""},{"def":"the activity or business of carrying goods from one place to another using lorries, trains, etc.","examples":["The goods were damaged during transport.","controls on the transport of nuclear waste","Transport to market is most commonly done by truck."],"opposite":"","synonyms":""},{"def":"a ship, plane or lorry used for carrying soldiers, supplies, etc. from one place to another","examples":[],"opposite":"","synonyms":""},{"def":"strong feelings and emotions","examples":["to be in transports of delight"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["public transport","transport cafe","Transport for London","Department for Transport","transport cafes","Sustainable transport","International Air Transport Association","Transport and General Workers' Union","National Union of Rail, Maritime and Transport Workers"]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tra/trans/transport__us_2.mp3","phonsUS":"/trænˈspɔːrt/","level":"B1","meanings":[{"def":"to take something/somebody from one place to another in a vehicle","examples":["to transport goods/passengers","transport something/somebody + adv./prep. He collapsed and was immediately transported to hospital.","Most of our luggage was transported by sea.","Cattle could be transported by rail to any part of the country.","Our furniture can easily be transported from the shop to your home.","The animals are transported in trucks, often without being fed or watered for days.","Too many goods are currently being transported by road."],"opposite":"","synonyms":""},{"def":"to move something somewhere by means of a natural process","examples":["The seeds are transported by the wind.","Blood transports oxygen around the body."],"opposite":"","synonyms":""},{"def":"to make somebody feel that they are in a different place, time or situation","examples":["The book transports you to another world."],"opposite":"","synonyms":""},{"def":"(in the past) to send somebody to a far away place as a punishment","examples":["British convicts were transported to Australia for life."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]