[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tra/trave/travel__us_2.mp3","phonsUS":"/ˈtrævl/","level":"A1","meanings":[{"def":"to go from one place to another, especially over a long distance","examples":["I go to bed early if I'm travelling the next day.","+ adv./prep. to travel around the world","I love travelling by train.","We always travel first class.","I travel abroad a lot.","They travelled on the bus to and from work together.","We travelled to California for the wedding.","They enjoy travelling to other European countries.","My client travels extensively on business.","When I finished college I went travelling for six months (= spent time visiting different places).","travel something As a journalist, she has travelled the world.","He travelled the length of the Nile in a canoe.","I travel 40 miles to work every day.","They travelled huge distances in search of food.","Many residents must travel long distances to a grocery store.","He travels back and forth across the Atlantic.","He travels with a huge entourage.","I prefer travelling independently to going on a package holiday.","She travels widely in her job.","The dissidents were unable to hold meetings or travel freely.","The job gives her the opportunity to travel abroad.","We decided to travel by car.","We had to travel separately as we couldn't get seats on the same flight.","We plan to travel through Thailand and into Cambodia.","business people who travel regularly to the US","information for the backpacker who wants to travel farther afield","Children under five travel free.","I spent a year travelling around Africa.","More people travel by air than ever before.","We travelled the length and breadth of the country.","We've travelled a long way in the past few days.","Hundreds of hospital patients may have to travel long distances for treatment."],"opposite":"","synonyms":""},{"def":"to go or move at a particular speed, in a particular direction, or a particular distance","examples":["to travel at 50 miles an hour","Messages travel along the spine from the nerve endings to the brain.","News travels fast these days.","He never travelled far from the home he shared with his mother.","The wide streets allow cars to travel at high speeds.","In the film, he travels back in time to the '50s.","Is it possible for anything to travel faster than the speed of light?","They seem to be travelling north.","The truck was travelling at 90 mph when it veered off the road."],"opposite":"","synonyms":""},{"def":"to be still in good condition after a long journey","examples":["Some wines do not travel well."],"opposite":"","synonyms":""},{"def":"to be equally successful in another place and not just where it began","examples":["These recipes travel well and don't require unusual ingredients or equipment.","Some writing travels badly (= is not successful) in translation."],"opposite":"","synonyms":""},{"def":"to go fast","examples":["Their car can really travel!"],"opposite":"","synonyms":""},{"def":"to take more than three steps while you are holding the ball, without bouncing it on the ground, which is against the rules of the game","examples":[],"opposite":"","synonyms":""},{"def":"to take very little with you when you go on a trip","examples":["She travels light, choosing to use as little equipment as possible."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"travel light","def":"to take very little with you when you go on a trip","examples":["She travels light, choosing to use as little equipment as possible."]}],"phrasal":[],"related":["travel-sick","travel agency","travel agent","travel sickness","travel agents","travel agencies","travel agent’s","travel-sickness","Association of British Travel Agents","travel light"]},{"pos":"noun","level":"A1","meanings":[{"def":"the act or activity of travelling","examples":["air/rail/space travel","travel expenses","The job involves a considerable amount of foreign travel.","the travel industry","travel sickness","a travel bag/clock (= for use when travelling)","a travel guide (= a book of useful information for travellers)","If you're going abroad, get some travel insurance.","your passport and other travel documents","The pass allows unlimited travel on all public transport in the city.","I used my compass to confirm my direction of travel.","What are your favourite time travel stories?","Most experts advise against air travel for at least three weeks after a heart attack.","The bus is their preferred mode of travel.","The price includes travel from Bangkok to Phuket.","Continued fighting makes travel in the area dangerous.","The new bypass will reduce travel time to the airport.","Expenditure on business travel was reduced.","the holiday travel season","I always pack a travel alarm.","(figurative) The party needs to set out a clear direction of travel (= what its plans are) for healthcare."],"opposite":"","synonyms":""},{"def":"time spent travelling, especially in foreign countries and for pleasure","examples":["travels + adv./prep. The novel is based on his travels in India.","Her work is influenced by her travels around the globe.","on your travels When are you off on your travels (= going travelling)?"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]