[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tre/treat/treatment__us_1.mp3","phonsUS":"/ˈtriːtmənt/","level":"B1","meanings":[{"def":"something that is done to cure an illness or injury, or to make somebody look and feel good","examples":["The drug is used in the treatment of depression.","treatment for something He is receiving treatment for shock.","She has been undergoing cancer treatment.","He may have to seek treatment abroad.","These bites rarely require treatment.","Two motorists needed hospital treatment following the accident.","The centre provides treatment to young drug addicts.","She is responding well to treatment.","to require hospital/medical treatment","No effective treatment exists for this highly infectious disease.","There are various treatments available for this condition.","Guests at the health spa receive a range of beauty treatments.","He's in treatment for cocaine addiction.","Paramedics are to have extra training in administering on-the-spot treatment.","When his depression worsened, he decided to seek treatment.","a herbal drug that is used in the treatment of dizziness","drugs approved for AIDS treatment","She may require follow-up treatment.","The treatment lasts about six weeks."],"opposite":"","synonyms":""},{"def":"a way of behaving towards or dealing with a person or thing","examples":["the brutal treatment of political prisoners","Certain city areas have been singled out for special treatment.","Why does she always get preferential treatment (= treatment that is better than other people get)?","She was given the VIP treatment after winning gold for her country at the Rio Olympics.","He had done nothing to deserve such cruel treatment.","The treatment meted out to captured soldiers was harsh.","You shouldn't put up with such shabby treatment."],"opposite":"","synonyms":""},{"def":"a way of dealing with or discussing a subject, work of art, etc.","examples":["Shakespeare’s treatment of madness in ‘King Lear’"],"opposite":"","synonyms":""},{"def":"a process by which something is cleaned, or protected against something","examples":["a sewage treatment plant","treatment for something an effective treatment for dry rot"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["ill-treatment","shock treatment","sewage treatment plant","sewage treatment works","People for the Ethical Treatment of Animals"]}]