[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tre/treat/treat__us_1.mp3","phonsUS":"/triːt/","level":"B1","meanings":[{"def":"to behave in a particular way towards somebody/something","examples":["treat somebody/something with something to treat people with respect","to treat people with caution/suspicion/dignity","Treat your keyboard with care and it should last for years.","treat somebody/something + adv./prep. All candidates will be treated equally, regardless of age.","They treat their animals quite badly.","She felt unfairly treated.","treat somebody/something like something My parents still treat me like a child.","treat somebody/something as something He was treated as a hero on his release from prison.","treat somebody/something as if… They treat him as if he weren't even there.","Parents still tend to treat boys differently from girls.","He is guilty and should be treated accordingly.","You should treat people with more respect.","the tendency to treat older people as helpless and dependent","He treated the idea with suspicion."],"opposite":"","synonyms":""},{"def":"to consider something in a particular way","examples":["I decided to treat his remark as a joke."],"opposite":"","synonyms":""},{"def":"to deal with or discuss something in a particular way","examples":["treat something + adv./prep. The question is treated in more detail in the next chapter.","These allegations are being treated very seriously indeed.","treat something as something All cases involving children are treated as urgent."],"opposite":"","synonyms":""},{"def":"to give medical care or attention to a person, an illness, an injury, etc.","examples":["treat somebody for something She was treated for sunstroke.","The students involved were treated for head injuries.","treat somebody The clinic has treated several thousand patients free of charge .","She was treated in hospital.","treat somebody (for something) with something He was treated for depression with medication prescribed by his doctor.","treat something to treat a disease/a condition/cancer","The hospital treated forty cases of malaria last year.","Antibiotics are used to treat bacterial infections.","treat something with something The condition is usually treated with drugs and a strict diet.","She was treated for cuts and bruises.","The drug is effective at treating depression.","We can treat this condition quite successfully with antibiotics."],"opposite":"","synonyms":""},{"def":"to use a chemical substance or process to clean, protect, preserve, etc. something","examples":["treat something (with something) to treat crops with insecticide","wood treated with preservative","Chemically treated hair can become dry and brittle.","You need to treat this wood for woodworm.","Water is discharged from the sewage works after being treated."],"opposite":"","synonyms":""},{"def":"to pay for something that somebody/you will enjoy and that you do not usually have or do","examples":["She treated him to lunch.","Don't worry about the cost—I'll treat you.","I'm going to treat myself to a new pair of shoes."],"opposite":"","synonyms":""},{"def":"to treat somebody with no respect at all","examples":["They treat their workers like dirt."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"treat somebody like dirt","def":"to treat somebody with no respect at all","examples":["They treat their workers like dirt."]}],"phrasal":["treat to"],"related":["treat to","ill-treat","trick or treat","treat somebody to something","a treat","treat somebody like dirt","handle/treat, etc. somebody with kid gloves"]},{"pos":"noun","level":"","meanings":[{"def":"something very pleasant that somebody can enjoy, especially something that you give somebody or do for them","examples":["When I was young chocolate was a treat.","as a treat We took the kids to the zoo as a special treat.","in for a treat You've never been to this area before? Then you're in for a real treat.","Let's go out for lunch—my treat (= I will pay).","the pleasures and pains of everyday life","It’s been a pleasure meeting you.","the delights of living in the country","the joys and sorrows of childhood","It was a great privilege to hear her sing.","You’ve never been to this area before? Then you’re in for a real treat.","It was a great honour to be invited here today.","Snails are a tasty treat for hedgehogs.","If you have never seen one of these fish then you have missed a treat.","If their latest album is half as good as their last one, we've a real treat in store."],"opposite":"","synonyms":"pleasure"},{"def":"extremely well or good","examples":["His idea worked a treat (= was successful).","I don’t know whether she can act but she looks a treat."],"opposite":"","synonyms":""},{"def":"said by children who visit people’s houses at Halloween and threaten to play tricks on people who do not give them sweets","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a treat","def":"extremely well or good","examples":["His idea worked a treat (= was successful).","I don’t know whether she can act but she looks a treat."]},{"idiom":"trick or treat","def":"said by children who visit people’s houses at Halloween and threaten to play tricks on people who do not give them sweets","examples":[]}],"phrasal":[],"related":[]}]