[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tre/trend/trend__us_1.mp3","phonsUS":"/trend/","level":"B1","meanings":[{"def":"a general direction in which a situation is changing or developing","examples":["social/economic/political/demographic trends","fashion/market trends","trend towards something There is a growing trend towards later retirement.","trend in something The article discusses current trends in language teaching","This downward trend in sales is likely to continue.","There has been an upward trend in the number of accidents reported.","Predicting long-term trends in consumer behaviour is more difficult.","trend for something A trend for romance and nostalgia has emerged.","trend for somebody/something to do something There is an increasing trend for students to live at home.","You seem to have set (= started) a new trend.","This trend is being reversed (= is going in the opposite direction).","One region is attempting to buck (= oppose or resist) the trend of economic decline.","Inflation continued its downward trend last month.","Regional growth figures are following the national trend.","The number of visitors to the city is showing an upward trend.","The underlying trend of inflation is still upwards.","If this trend continues, the species could soon become extinct.","on trend Linen is on trend (= fashionable) again this summer.","Car crime in Oxford fell significantly last year.","Car crime fell by about a quarter over a 12-month period.","The number of stolen vehicles dropped from 1 013 to 780, a fall of 26 per cent.","According to this data, 780 vehicles were stolen, 26 per cent down on the previous year.","There was an 11 per cent drop in reported thefts from motor vehicles, from 1 971 to 1 737.","These figures show that, as far as car crime is concerned, the main trend is downwards.","I can see a worrying trend in these results.","In the 1960s, Britain set the fashion trends.","The increase in crime in London was just part of a wider trend.","The latest figures show a clear growth trend in the service sector.","We are following the American trend towards more flexible working conditions.","a trend away from narrow specialization","Trends suggest that the car is becoming increasingly popular."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["on-trend","warming trend"]},{"pos":"verb","level":"","meanings":[{"def":"to change or develop in a general direction","examples":["Prices have been trending upwards."],"opposite":"","synonyms":""},{"def":"to be discussed a lot on social media within a short period of time","examples":["See what's trending on Twitter in your local area right now."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]