[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tri/trial/trial__us_2.mp3","phonsUS":"/ˈtraɪəl/","level":"B2","meanings":[{"def":"a formal examination of evidence in court by a judge and often a jury, to decide if somebody accused of a crime is guilty or not","examples":["a murder/criminal trial","on trial He's on trial for murder.","She will stand trial/go on trial for fraud.","He should have been arrested and put on trial.","He was facing trial on a murder charge.","The men were arrested but not brought to trial.","She is awaiting trial on corruption charges.","He did not receive a fair trial.","the right to trial by jury","She was detained without trial.","a trial judge/lawyer/court","She became a key witness in the trial.","They will lose their right to a jury trial.","A series of show trials of former senior officials of the ousted regime took place.","A trial date has been set for May 10.","More than a hundred witnesses gave evidence at the trial.","Opposition leaders had been jailed without trial.","She faces trial for murder.","The judge halted the trial when it emerged witnesses had been threatened.","The judge ordered a new trial on the grounds that evidence had been withheld.","The letters that were shown during his trial turned out to be forgeries.","The rebels were brutally executed after summary trials.","The trial collapsed after a key prosecution witness admitted lying.","(figurative) The president faces trial by television tonight when he takes part in a live debate.","The case never came to trial.","He will go to trial on charges of robbery and assault.","Parker was committed for trial yesterday at Southwark Crown Court.","A trial date will be set for sometime in the spring."],"opposite":"","synonyms":""},{"def":"the process of testing the ability, quality or performance of somebody/something, especially before you make a final decision about them","examples":["a clinical/field/randomized/controlled trial","Australia and the US have conducted joint trials of the drone.","She agreed to employ me for a trial period.","on trial We had the machine on trial for a week.","The system was introduced on a trial basis for one month.","a trial separation (= of a couple whose marriage is in difficulties)","a trial of strength (= a contest to see who is stronger)","A new stocktaking system is currently under trial at the supermarket.","There's a 30-day free trial of the software available.","Human trials of the vaccine could begin within two years.","The trial showed a dramatic reduction in side effects.","a trial involving hundreds of patients","Scientists have reported encouraging results in trials of the new GM rice."],"opposite":"","synonyms":""},{"def":"a competition or series of tests to find the best players for a sports team or an important event","examples":["Olympic trials","He had a trial with Chelsea when he was young.","As a teenager, he had trials for several top clubs.","She just missed selection when she came third in the trials.","Gates played his second trial game in midfield."],"opposite":"","synonyms":""},{"def":"an event at which animals compete or perform","examples":["horse trials"],"opposite":"","synonyms":""},{"def":"an experience or a person that causes difficulties for somebody","examples":["the trials and tribulations of married life","trial to somebody She was a sore trial to her family at times.","(figurative) My first day at work was a trial by fire."],"opposite":"","synonyms":""},{"def":"the process of solving a problem by trying various methods until you find a method that is successful","examples":["Children learn to use computer programs by trial and error."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"trial and error","def":"the process of solving a problem by trying various methods until you find a method that is successful","examples":["Children learn to use computer programs by trial and error."]}],"phrasal":[],"related":["trial run","field trial","show trial","time trial","trial balloon","clinical trial","Scopes trial","trial runs","trial balloons","trial and error"]},{"pos":"verb","level":"","meanings":[{"def":"to test the ability, quality or performance of something to see if it will be effective or successful","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]