[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tri/trip_/trip__us_1.mp3","phonsUS":"/trɪp/","level":"A1","meanings":[{"def":"a journey to a place and back again, especially a short one for pleasure or a particular purpose","examples":["Did you have a good trip?","We went on a trip to the mountains.","a boat/coach/bus trip","a business/school/shopping trip","a fishing/camping trip","They took a trip down the river.","We had to make several trips to bring all the equipment over.","Jack made a return trip (= another visit to the same place) later that year.","The return trip (= back to the place where you started) on the bike was much easier and quicker than the outbound trip.","He went with her on her overseas trips.","She's away on a short trip.","He is planning a trip to Vienna.","They organize short bike trips.","He has just returned from a three-day trip to Australia.","a business trip","a five-minute trip by taxi","a long and difficult journey across the mountains","a tour of Bavaria","the first expedition to the South Pole","We went on an all-day excursion to the island.","The children were on a day’s outing from school.","We had a day out at the beach.","Enjoy your trip!","He makes frequent trips to Poland.","He's just back from a trip to Alaska.","I had to cut short my trip when my wallet was stolen.","My last trip abroad was two years ago.","Don't make a special trip just to get my newspaper.","In their last two away trips, Everton were defeated by Spurs.","The first prize is a free trip to New York.","The food alone made the trip worthwhile.","The rest of our trip was uneventful.","The trip home took us five hours!","They are hoping to complete the trip in four days.","They saved for years for their trip of a lifetime to Hawaii.","Well, have a safe trip back!","a five-minute trip by taxi","her dream trip to New Zealand","Because of bad weather conditions, the trip was cancelled.","Tomorrow there will be a boat trip to the island.","We used to go on school trips to France when we were kids."],"opposite":"","synonyms":"trip"},{"def":"the experience that somebody has if they take a powerful drug that affects the mind and makes them imagine things","examples":["an acid (= LSD) trip"],"opposite":"","synonyms":""},{"def":"an act of falling or nearly falling down, because you hit your foot against something","examples":[],"opposite":"","synonyms":""},{"def":"things you say to somebody in order to make them feel guilty about something","examples":["Don't lay a guilt trip on your child about schoolwork.","She was trying to lay a guilt trip on me."],"opposite":"","synonyms":""},{"def":"time that you spend thinking about and remembering the past or going to a place again in order to remind yourself of past experiences","examples":["Visiting my old school was a real trip down memory lane."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a guilt trip","def":"things you say to somebody in order to make them feel guilty about something","examples":["Don't lay a guilt trip on your child about schoolwork.","She was trying to lay a guilt trip on me."]},{"idiom":"a trip/walk down memory lane","def":"time that you spend thinking about and remembering the past or going to a place again in order to remind yourself of past experiences","examples":["Visiting my old school was a real trip down memory lane."]}],"phrasal":[],"related":["day trip","ego trip","trip hop","trip up","road trip","field trip","power trip","round trip","round-trip","round-trip ticket","trip somebody up","trip up | trip somebody","a guilt trip","a trip/walk down memory lane","roll/slip/trip off the tongue","slip/roll/trip off the tongue","a walk/trip down memory lane"]},{"pos":"verb","level":"B2","meanings":[{"def":"to catch your foot on something and fall or almost fall","examples":["She tripped and fell.","trip over/on something Someone will trip over that cable.","I tripped over my own feet and fell down the stairs.","(figurative) I was tripping over my words in my excitement to tell them the news.","(figurative) Lawyers were tripping over each other (= competing with each other in a hurried way) to get a piece of the action.","trip over/up Be careful you don't trip up on the step.","She tripped on the loose stones.","One of the boys tripped over and crashed into a tree."],"opposite":"","synonyms":""},{"def":"to catch somebody’s foot and make them fall or almost fall","examples":["As I passed, he stuck out a leg and tried to trip me up.","The referee said Morgan was tripped and gave a penalty."],"opposite":"","synonyms":""},{"def":"to walk, run or dance with quick light steps","examples":["She said goodbye and tripped off along the road.","She came tripping lightly down the stairs.","(figurative) a melody with a light tripping rhythm"],"opposite":"","synonyms":""},{"def":"to release a switch, etc. or to operate something by doing so","examples":["to trip a switch","Any intruders will trip the alarm."],"opposite":"","synonyms":""},{"def":"to be under the influence of a drug that makes you hallucinate","examples":[],"opposite":"","synonyms":""},{"def":"to be easy to say or pronounce","examples":["It's not a name that exactly trips off the tongue, is it?"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"roll/slip/trip off the tongue","def":"to be easy to say or pronounce","examples":["It's not a name that exactly trips off the tongue, is it?"]}],"phrasal":["trip up"],"related":[]}]