[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tri/trium/triumph__us_1.mp3","phonsUS":"/ˈtraɪʌmf/","level":"C1","meanings":[{"def":"a great success, achievement or victory","examples":["one of the greatest triumphs of modern science","triumph over somebody/something It was a personal triumph over her old rival.","Hollywood's favourite actor was modest about his latest triumph.","The team enjoyed a memorable triumph last night.","their recent triumph against Brazil","The union scored a triumph in negotiating a minimum wage within the industry.","They hailed the signing of the agreement as a major diplomatic triumph.","the triumph of the human spirit","The birth of the red panda cub is being hailed as a triumph for the zoo's breeding programme.","triumph against seemingly insuperable odds"],"opposite":"","synonyms":""},{"def":"the feeling of great pleasure or joy that you get from a great success or victory","examples":["a shout of triumph","in triumph The winning team returned home in triumph.","‘I’ve done it,’ she thought with a sweet sense of triumph.","This was her moment of triumph."],"opposite":"","synonyms":""},{"def":"an excellent example of how successful something can be","examples":["Her arrest was a triumph of international cooperation."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Triumph"]},{"pos":"verb","level":"","meanings":[{"def":"to defeat somebody/something; to be successful","examples":["As is usual in this kind of movie, good triumphs over evil in the end.","France triumphed 3–0 in the final.","She was confident that she would ultimately triumph over adversity.","Tomorrow we will face the enemy and will triumph."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tri/trium/triumph__us_2.mp3","level":"","meanings":[{"def":"a former British company, established in 1902, which made motor cycles and (later) cars. Triumph motor cycles were popular both in Britain and abroad from the 1920s. The original Triumph company began making cars in 1923 and the car and motorcycle businesses were separated in 1936. Its most successful models were the TR series of sports cars and the small, relatively cheap, Triumph Herald. Triumph cars stopped being made in the 1980s. Triumph motorcycles are still made by a company called Triumph Motorcycles Ltd that started in 1983.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]