[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tro/troub/trouble__us_2.mp3","phonsUS":"/ˈtrʌbl/","level":"A2","meanings":[{"def":"a problem, worry, difficulty, etc. or a situation causing this","examples":["We have trouble getting staff.","to make/cause/spell trouble for somebody","He could make trouble for me if he wanted to.","Sorry, I didn't mean to cause any trouble.","Falling shark numbers could spell (= cause) big trouble for ocean ecosystems.","trouble with somebody/something The trouble with you is you don't really want to work.","We've never had much trouble with vandals around here.","Her trouble is she's incapable of making a decision.","The trouble is (= what is difficult is) there aren't any trains at that time.","The only trouble is we won't be here then.","No, I don't know his number—I have quite enough trouble remembering my own.","financial troubles","She was on the phone for an hour telling me her troubles.","Our troubles aren't over yet.","Finance was the least of his troubles.","There was trouble brewing (= a problem was developing) among the workforce.","I've had trouble sleeping recently.","I can see trouble ahead.","He had a reputation for making trouble in the classroom.","In times of trouble she always turns to her mother.","He was obviously upset, and muttered something about girlfriend trouble.","Her troubles began last year when she lost her job.","He put his past troubles behind him and built up a successful new career.","The printer's causing trouble again.","I've had endless trouble with my car.","Trouble often comes when you're least expecting it.","I've never been one to run away from trouble."],"opposite":"","synonyms":""},{"def":"a situation in which you can be criticized or punished","examples":["in trouble If I don't get this finished in time, I'll be in trouble.","We're in deep/serious trouble now!","When she saw the teacher coming she knew she was in big trouble.","in trouble with somebody He's in trouble with the police.","My brother was always getting me into trouble with my parents.","out of trouble Did you manage to stay out of trouble?"],"opposite":"","synonyms":""},{"def":"a situation that is difficult or dangerous","examples":["The company ran into trouble early on, when a major order was cancelled.","A yachtsman got into trouble off the coast and had to be rescued.","She got into serious financial trouble after running up large debts."],"opposite":"","synonyms":""},{"def":"an angry or violent situation","examples":["The police were expecting trouble after the match.","If you're not in by midnight, there'll be trouble (= I'll be very angry).","He had to throw out a few drunks who were causing trouble in the bar.","Just don't start any trouble.","Look, we don't want any trouble, so we'll leave.","Trouble blew up when the gang was refused entry to a nightclub.","We left before the trouble started.","trouble between the races","Troops were stationed nearby in case of crowd trouble."],"opposite":"","synonyms":""},{"def":"illness or pain","examples":["back trouble","He suffers from heart trouble.","I've been having trouble with my knee.","I recommend you get insurance against sickness and unemployment.","She resigned because of ill health.","heart trouble."],"opposite":"","synonyms":"illness"},{"def":"something that is wrong with a machine, vehicle, etc.","examples":["mechanical trouble","My car's been having engine trouble."],"opposite":"","synonyms":""},{"def":"extra effort or work","examples":["I don't want to put you to a lot of trouble.","I'll get it if you like, that will save you the trouble of going out.","Making your own yogurt is more trouble than it's worth.","She went to a lot of trouble to find the book for me.","Nothing is ever too much trouble for her (= she's always ready to help).","I can call back later—it's no trouble (= I don't mind).","I hope the children weren't too much trouble.","It is worth taking the trouble to read the introduction.","He thanked me for my trouble and left.","I never meant to cause you any trouble .","Do you think it's worth the trouble of booking seats in advance?","They went to enormous trouble to make her stay a pleasant one.","Why don't we bring a pizza to save you the trouble of cooking?"],"opposite":"","synonyms":""},{"def":"to behave in a way that is very likely to result in trouble","examples":["He was asking for trouble when he insulted their country."],"opposite":"","synonyms":""},{"def":"to make a woman who is not married pregnant","examples":[],"opposite":"","synonyms":""},{"def":"to cause problems or difficulties","examples":["My back's been giving me a lot of trouble lately.","The children didn't give me any trouble at all when we were out."],"opposite":"","synonyms":""},{"def":"to behave in a way that is likely to cause an argument, violence, etc.","examples":["Drunken youths hang around outside looking for trouble."],"opposite":"","synonyms":""},{"def":"to try hard to do something well","examples":["They take a lot of trouble to find the right person for the right job."],"opposite":"","synonyms":""},{"def":"to do something even though it involves effort or difficulty","examples":["She didn't even take the trouble to find out how to spell my name."],"opposite":"","synonyms":""},{"def":"if you talk to somebody about your problems and worries, instead of keeping them to yourself, they seem less serious","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be asking for trouble | be asking for it","def":"to behave in a way that is very likely to result in trouble","examples":["He was asking for trouble when he insulted their country."]},{"idiom":"get somebody into trouble","def":"to make a woman who is not married pregnant","examples":[]},{"idiom":"give (somebody) (some, no, any, etc.) trouble","def":"to cause problems or difficulties","examples":["My back's been giving me a lot of trouble lately.","The children didn't give me any trouble at all when we were out."]},{"idiom":"look for trouble","def":"to behave in a way that is likely to cause an argument, violence, etc.","examples":["Drunken youths hang around outside looking for trouble."]},{"idiom":"take trouble over/with something | take trouble doing/to do something","def":"to try hard to do something well","examples":["They take a lot of trouble to find the right person for the right job."]},{"idiom":"take the trouble to do something","def":"to do something even though it involves effort or difficulty","examples":["She didn't even take the trouble to find out how to spell my name."]},{"idiom":"a trouble shared is a trouble halved","def":"if you talk to somebody about your problems and worries, instead of keeping them to yourself, they seem less serious","examples":[]}],"phrasal":[],"related":["foul trouble","trouble spot","trouble at t' mill","trouble spots","be asking for trouble","a trouble shared is a trouble halved"]},{"pos":"verb","level":"B2","meanings":[{"def":"to make somebody worried or upset","examples":["What is it that's troubling you?","He was deeply troubled by the allegations.","This latest news troubled him deeply.","This report raises numerous troubling questions."],"opposite":"","synonyms":""},{"def":"to interrupt somebody because you want to ask them something","examples":["trouble somebody Sorry to trouble you, but could you tell me the time?","I hate to trouble you, but could you move your car?","trouble somebody with something I don't want to trouble the doctor with such a small problem.","(formal) trouble somebody to do something Could I trouble you to open the window, please?"],"opposite":"","synonyms":""},{"def":"to make an effort to do something","examples":["He rushed into the room without troubling to knock."],"opposite":"","synonyms":""},{"def":"to cause pain","examples":["My back's been troubling me again.","He has been troubled with a knee injury."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]