[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tru/true_/true__us_1.mp3","phonsUS":"/truː/","level":"A1","meanings":[{"def":"connected with facts rather than things that have been invented or guessed","examples":["Indicate whether the following statements are true or false.","Can you prove that what you say is true?","All the rumours turned out to be true.","be true (that)… Is it true she's leaving?","It is certainly true that money can't buy you happiness.","I think it would be true to say that the show was a success.","That's not strictly (= completely) true.","The novel is based on a true story.","true for somebody/something Unfortunately, these findings do not hold true (= are not valid) for women and children.","Exercise can help in the development of social skills, and this is especially true for kids playing team sports.","true of somebody/something The music is dull and uninspiring, and the same is true of the acting.","You never spoke a truer word (= used to emphasize that you agree with what somebody has just said).","Are the following statements true or false?","Is it true (that) she’s leaving?","I got about half the answers right.","What’s the right time?","Only one of the answers is correct.","Check that all the details are correct.","It is literally true that I never heard of him until I was in my late twenties.","That is undoubtedly true.","The story is more or less true.","It's hardly true to call cleaning windows a ‘profession’.","This degree of inequality was by no means true of all 19th-century marriages.","This is in fact true in most situations.","We hope that this will prove true.","What applies at a local level holds doubly true at a national level.","What is true for buyers is equally true for sellers.","While technically true, this is unfair.","While this is certainly true for some, it is not the case for others."],"opposite":"untrue","synonyms":"true"},{"def":"real or exact, especially when this is different from how something seems","examples":["the true face of war (= what it is really like rather than what people think it is like)","This project demonstrates the true value of teamwork.","The true cost of these experiments to the environment will not be known for years to come.","He reveals his true character to very few people.","I did not realize the true nature of their relationship.","She was unable to hide her true feelings for him.","the true face of socialism","She is not the true owner of this house."],"opposite":"","synonyms":""},{"def":"having the qualities or characteristics of the thing mentioned","examples":["It was true love between them.","He's a true gentleman.","The painting is a masterpiece in the truest sense of the word.","He is credited with inventing the first true helicopter."],"opposite":"","synonyms":""},{"def":"used to admit that a particular fact or statement is correct, although you think that something else is more important","examples":["true (that)… It's true that he could do the job, but would he fit in with the rest of the team?","It's perfectly true that I didn't help much, but I was busy.","‘We could get it cheaper.’ ‘True, but would it be as good?’","True enough, but that doesn't tell the whole story.","While the film is undoubtedly too long, it is nevertheless an intriguing piece of cinema.","It can be argued that the movie is too long. It is nonetheless an intriguing piece of cinema.","The film is undoubtedly too long. Still, it is an intriguing piece of cinema.","Of course, huge chunks of the book have been sacrificed in order to make a two-hour movie, but it is nevertheless a successful piece of storytelling.","Critics are wrong to argue that the film’s plot is too complicated. Certainly there are a couple of major twists, but audiences will have no difficulty following them.","It is true that you cannot make a good movie without a good script, but it is equally true that a talented director can make a good script into an excellent film.","It remains to be seen whether these two movies herald a new era of westerns, but there is no doubt that they represent welcome additions to the genre."],"opposite":"","synonyms":""},{"def":"showing respect and support for a particular person or belief in a way that does not change, even in different situations","examples":["a true friend","true to somebody/something She has always been true to herself (= done what she thought was good, right, etc.).","He was true to his word (= did what he promised to do).","Many were executed for remaining true to their principles.","Knights swore to be true to their lord."],"opposite":"","synonyms":""},{"def":"being an accurate version or copy of something","examples":["The movie is not true to the book.","The painting is a true likeness of her.","The article isn't at all true to what I actually said.","True to her prediction, it began snowing later that day.","Is it your wish that I should sign these minutes as a true record of that meeting?","This account is now accepted as a true reflection of what actually happened."],"opposite":"","synonyms":""},{"def":"straight and accurate","examples":["His aim was true (= he hit the target)."],"opposite":"","synonyms":""},{"def":"to become reality","examples":["Winning the medal was like a dream come true.","All her wishes came true."],"opposite":"","synonyms":""},{"def":"to give the impression of being sincere/true or not sincere/true","examples":["It may seem a strange story but it rings true to me.","His expressions of support rang rather hollow.","His promise rang hollow."],"opposite":"","synonyms":""},{"def":"used to say that you cannot believe that something is as good as it seems","examples":["‘I'm afraid you were quoted the wrong price.’ ‘I thought it was too good to be true.’"],"opposite":"","synonyms":""},{"def":"that you have used or relied on in the past successfully","examples":["a tried and true method for solving the problem"],"opposite":"","synonyms":""},{"def":"your real character, rather than the one that you usually allow other people to see","examples":["It was only after they got married that he showed himself in his true colours."],"opposite":"","synonyms":""},{"def":"used to say that somebody is behaving in the way that you expect them to behave, especially when this is annoying","examples":["True to form, she managed to upset everyone before leaving."],"opposite":"","synonyms":""},{"def":"seeming real rather than invented","examples":["I don’t think the characters are very true to life."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"come true","def":"to become reality","examples":["Winning the medal was like a dream come true.","All her wishes came true."]},{"idiom":"ring true/hollow/false","def":"to give the impression of being sincere/true or not sincere/true","examples":["It may seem a strange story but it rings true to me.","His expressions of support rang rather hollow.","His promise rang hollow."]},{"idiom":"too good to be true","def":"used to say that you cannot believe that something is as good as it seems","examples":["‘I'm afraid you were quoted the wrong price.’ ‘I thought it was too good to be true.’"]},{"idiom":"tried and true","def":"that you have used or relied on in the past successfully","examples":["a tried and true method for solving the problem"]},{"idiom":"your true colours","def":"your real character, rather than the one that you usually allow other people to see","examples":["It was only after they got married that he showed himself in his true colours."]},{"idiom":"true to form","def":"used to say that somebody is behaving in the way that you expect them to behave, especially when this is annoying","examples":["True to form, she managed to upset everyone before leaving."]},{"idiom":"true to life","def":"seeming real rather than invented","examples":["I don’t think the characters are very true to life."]}],"phrasal":[],"related":["true-blue","true-life","true crime","true north","True Confessions","tried and true","true to life","out of true","your true colors","your true colours","ring true/hollow/false"]},{"pos":"adverb","level":"","meanings":[{"def":"in a direct line","examples":["The arrow flew straight and true to the target.","He shot true."],"opposite":"","synonyms":""},{"def":"to tell the truth","examples":["He had spoken truer than he knew."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"","meanings":[{"def":"if an object is out of true, it is not straight or in the correct position","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"out of true","def":"if an object is out of true, it is not straight or in the correct position","examples":[]}],"phrasal":[],"related":[]}]