[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/tru/trust/trust__us_1.mp3","phonsUS":"/trʌst/","level":"B2","meanings":[{"def":"the belief that somebody/something is good, sincere, honest, etc. and will not try to harm or trick you","examples":["Our partnership is based on trust.","This is a relationship built on mutual trust.","It has taken years to earn their trust.","We worked hard to gain the trust of local people.","Talking openly with your team helps to build trust.","trust in somebody/something Her trust in him was unfounded.","If you put your trust in me, I will not let you down.","I want to thank all those people who have placed their trust in me.","She will not betray your trust (= do something that you have asked her not to do).","He was appointed to a position of trust (= a job involving a lot of responsibility, because people trust him).","This is a serious breach of trust.","The company has to earn the trust and confidence of consumers again.","trust between somebody and somebody There is a lack of trust between the two countries.","They had little trust for outsiders.","We need to restore public trust.","I will do all I can do to deserve your trust.","It's good that you kept her trust.","The President needs to rebuild his personal trust with the electorate.","Does the plan have the trust and cooperation of the workers?","They have placed great trust in him as a negotiator.","This girl does not exactly inspire trust.","This requires a certain level of trust among the community's members.","We have absolute trust in the teachers.","efforts to promote mutual trust between nations","the fragile trust that existed between them"],"opposite":"","synonyms":""},{"def":"the belief that something is true or correct or that you can rely on it","examples":["We place so much trust in computers that it gets a little scary.","Voters need to have trust in the voting system.","Public trust in science is harmed by inaccurate journalism.","If I were you, I would not place too much trust in their findings.","a campaign to build consumer trust in the quality of dairy products","They followed the instructions in blind trust that all would turn out well."],"opposite":"","synonyms":""},{"def":"an arrangement by which an organization or a group of people has legal control of money or property that has been given to somebody, usually until that person reaches a particular age; an amount of money or property that is controlled in this way","examples":["He set up a trust for his children.","The money will be held in trust until she is 18.","Our fees depend on the value of the trust.","His father put the money in trust for him until he was 21.","a publicly traded real estate investment trust"],"opposite":"","synonyms":""},{"def":"an organization or a group of people that invests money that is given or lent to it and uses the profits to help a charity","examples":["a charitable trust","They ran the trust as a non-profit making concern.","The trust owns the land and the buildings."],"opposite":"","synonyms":""},{"def":"a group of companies that work together illegally to reduce competition, control prices, etc.","examples":["anti-trust laws"],"opposite":"","synonyms":""},{"def":"being taken care of by somebody","examples":["The family pet was left in the trust of a neighbour."],"opposite":"","synonyms":""},{"def":"to believe what somebody says even though you do not have any proof or evidence to show that it is true","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in somebody’s trust | in the trust of somebody","def":"being taken care of by somebody","examples":["The family pet was left in the trust of a neighbour."]},{"idiom":"take something on trust","def":"to believe what somebody says even though you do not have any proof or evidence to show that it is true","examples":[]}],"phrasal":[],"related":["trust in","trust to","blind trust","trust fund","trust with","unit trust","hospital trust","trust territory","Civic Trust","Brains Trust","Landmark Trust","National Trust","Prince's Trust","Wellcome Trust","Outward Bound Trust","Terrence Higgins Trust","National Childbirth Trust","Prince's Regeneration Trust","Wildfowl and Wetlands Trust"]},{"pos":"verb","level":"B2","meanings":[{"def":"to have confidence in somebody; to believe that somebody is good, sincere, honest, etc.","examples":["trust somebody She trusts Alan implicitly.","He has shown that he can't be trusted.","Never trust a man who will not look you in the eye.","a trusted adviser/friend","trust somebody to do something You can trust me not to tell anyone.","She nodded, not trusting herself to speak.","Which party do you trust to run the economy?","I knew I could trust John.","I was afraid to trust anyone after that.","In my position I cannot risk blindly trusting anyone.","You can never entirely trust even a ‘tame’ leopard.","It seems you can't trust anyone these days.","Can they be trusted to carry out the work properly?","She didn't trust herself to speak."],"opposite":"","synonyms":""},{"def":"to believe that something is true or correct or that you can rely on it","examples":["trust something He trusted her judgement.","Always trust your instincts.","a trusted source","trust what… Don't trust what the newspapers say!","You can trust me not to tell anyone.","Don't trust what you read on the internet!","He was the sort of person you could depend on.","Can you depend on her version of what happened?","Can I rely on you to keep this secret?","You can’t rely on any figures you get from them.","I’m counting on you to help me.","We can’t count on the good weather lasting.","They need a leader they can believe in.","I was reluctant to trust the evidence of my senses.","Such figures are not to be trusted."],"opposite":"","synonyms":"trust"},{"def":"to hope and expect that something is true","examples":["I trust (that) you have no objections to our proposals?"],"opposite":"","synonyms":""},{"def":"to not trust somebody at all","examples":["He says he just wants to help you but I wouldn’t trust him an inch if I were you."],"opposite":"","synonyms":""},{"def":"that you have used or relied on in the past successfully","examples":["a tried and trusted method for solving the problem","Some teachers prefer the tried and trusted methods of language learning."],"opposite":"","synonyms":""},{"def":"used when somebody does or says something that you think is typical of them","examples":["Trust John to forget Sue's birthday!"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"not trust somebody an inch","def":"to not trust somebody at all","examples":["He says he just wants to help you but I wouldn’t trust him an inch if I were you."]},{"idiom":"tried and tested/trusted","def":"that you have used or relied on in the past successfully","examples":["a tried and trusted method for solving the problem","Some teachers prefer the tried and trusted methods of language learning."]},{"idiom":"trust you, him, her, etc. (to do something)","def":"used when somebody does or says something that you think is typical of them","examples":["Trust John to forget Sue's birthday!"]}],"phrasal":["trust in","trust to","trust with"],"related":[]}]