[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/t/twi/twist/twist__us_1.mp3","phonsUS":"/twɪst/","level":"C1","meanings":[{"def":"to bend or turn something into a particular shape","examples":["Twist the wire to form a circle.","Her hair was twisted into a knot on top of her head."],"opposite":"","synonyms":""},{"def":"to bend or turn something into a shape or position that is not normal or natural; to be bent or turned in this way","examples":["twist something (+ adv./prep.) He grabbed me and twisted my arm behind my back.","+ adv./prep. Her face twisted in anger.","Her mouth was twisted out of shape by grief.","His mouth twisted bitterly.","My stomach twisted into knots.","Nicola's face twisted into a grimace of disgust.","The bike was just a heap of twisted metal.","The boy's leg was twisted back painfully."],"opposite":"","synonyms":""},{"def":"to turn part of your body around while the rest stays still","examples":["twist something (+ adv./prep.) He twisted his head around to look at her.","+ adv./prep. She twisted in her chair when I called her name.","Hold your arms out to the sides and twist your upper body.","He twisted sideways to face her.","Tim twisted round and glared at her."],"opposite":"","synonyms":""},{"def":"to turn your body with quick, sharp movements and change direction often","examples":["I twisted and turned to avoid being caught.","+ adv./prep. She tried unsuccessfully to twist free.","twist something/yourself + adv./prep. He managed to twist himself round in the restricted space.","She fired again and saw the creature twist violently.","Rachel twisted and turned in her sleep.","The prisoner twisted in his seat, trying to free the ropes around his wrists."],"opposite":"","synonyms":""},{"def":"to turn something around in a circle with your hand","examples":["Twist the knob to the left to open the door.","Nervously I twisted the ring on my finger.","She placed her hand on the doorknob and twisted slowly.","Try twisting the handle to the right."],"opposite":"","synonyms":""},{"def":"to bend and change direction often","examples":["The road twists and turns along the coast.","narrow twisting streets","a twisting staircase"],"opposite":"","synonyms":""},{"def":"to injure part of your body, especially your ankle, wrist or knee, bending it in an uncomfortable way","examples":["She fell and twisted her ankle."],"opposite":"","synonyms":""},{"def":"to wind something around or through an object","examples":["She twisted a scarf around her head.","I twisted the bandage around his leg.","The telephone cable has got twisted (= wound around itself)."],"opposite":"","synonyms":""},{"def":"to move or grow by winding around something","examples":["A snake was twisting around his arm."],"opposite":"","synonyms":""},{"def":"to deliberately change the meaning of what somebody has said, or to present facts in a particular way, in order to benefit yourself or harm somebody else","examples":["You always twist everything I say.","The newspaper was accused of twisting the facts."],"opposite":"","synonyms":""},{"def":"to turn or wind strings, etc. together to make something longer or thicker","examples":["They had twisted the sheets into a rope and escaped by climbing down it."],"opposite":"","synonyms":""},{"def":"to say or do something unkind deliberately; to make somebody who is unhappy feel even more unhappy","examples":["Marcia laughed as she twisted the knife still deeper.","Just to twist the knife, the filmmakers have provided a surprise ending."],"opposite":"","synonyms":""},{"def":"to persuade or force somebody to do something","examples":[],"opposite":"","synonyms":""},{"def":"to persuade somebody to do anything that you want","examples":["She has always been able to twist her parents around her little finger."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"turn/twist the knife (in the wound)","def":"to say or do something unkind deliberately; to make somebody who is unhappy feel even more unhappy","examples":["Marcia laughed as she twisted the knife still deeper.","Just to twist the knife, the filmmakers have provided a surprise ending."]},{"idiom":"twist somebody’s arm","def":"to persuade or force somebody to do something","examples":[]},{"idiom":"twist/wrap/wind somebody around your little finger","def":"to persuade somebody to do anything that you want","examples":["She has always been able to twist her parents around her little finger."]}],"phrasal":["twist off"],"related":["twist off","twist tie","French twist","Oliver Twist","the twist","twist ties","get your knickers in a twist","twist something","twist somebody’s arm","round the bend/twist","turn/twist the knife (in the wound)","twist/wrap/wind somebody around your little finger","wind/twist/wrap somebody around your little finger","wrap/twist/wind somebody around your little finger"]},{"pos":"noun","level":"C1","meanings":[{"def":"the action of turning something with your hand, or of turning a part of your body","examples":["She gave the lid another twist and it came off.","He gave a shy smile and a little twist of his head.","He finished him off with a quick twist of the knife."],"opposite":"","synonyms":""},{"def":"an unexpected change or development in a story or situation","examples":["the twists and turns of his political career","The story has taken another twist.","The disappearance of a vital witness added a new twist to the case.","By a curious twist of fate we met again only a week or so later.","a bizarre twist to the tale","The writer takes well-known fairy tales and gives them an ironic twist.","In a bizarre twist to the evening the police came at eleven and arrested our host.","The movie gives this old legend a real modern twist.","the latest twist in the saga of high-level corruption","horror movies with twist endings","I thought it would be an interesting twist on the zombie movie.","I added my own twist to the whole thing.","classic French dishes with a twist"],"opposite":"","synonyms":""},{"def":"a sharp bend in a road or river","examples":["The car followed the twists and turns of the mountain road.","They approached a twist in the path."],"opposite":"","synonyms":""},{"def":"a thing that has been twisted into a particular shape","examples":["mineral water with a twist of lemon","A twist in the hose was stopping the water coming out.","a wry twist to her lips"],"opposite":"","synonyms":""},{"def":"a fast dance that was popular in the 1960s, in which you twist from side to side","examples":[],"opposite":"","synonyms":""},{"def":"to become angry, confused or upset","examples":[],"opposite":"","synonyms":""},{"def":"crazy","examples":["She's gone completely round the twist."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"get your knickers in a twist","def":"to become angry, confused or upset","examples":[]},{"idiom":"round the bend/twist","def":"crazy","examples":["She's gone completely round the twist."]}],"phrasal":[],"related":[]}]