[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/u/unc/uncom/uncomfortable__us_4.mp3","phonsUS":"/ʌnˈkʌmftəbl/","level":"B1","meanings":[{"def":"not letting you feel physically comfortable; unpleasant to wear, sit on, etc.","examples":["uncomfortable shoes","uncomfortable to do something The headphones can be uncomfortable to wear.","I couldn't sleep because the bed was so uncomfortable.","I find these chairs incredibly uncomfortable."],"opposite":"comfortable","synonyms":""},{"def":"not feeling physically relaxed, warm, etc.","examples":["I was sitting in an extremely uncomfortable position.","it is uncomfortable to do something It was uncomfortable to walk for long periods of time.","She still finds it uncomfortable to stand without support.","Sharp stones on the path made walking barefoot rather uncomfortable."],"opposite":"comfortable","synonyms":""},{"def":"anxious, embarrassed or afraid and unable to relax; making you feel like this","examples":["He looked distinctly uncomfortable when the subject was mentioned.","uncomfortable with something She felt uncomfortable with the way George looked at her.","They are uncomfortable with the idea of a military assault.","The thought made her even more uncomfortable.","There was an uncomfortable silence.","uncomfortable about doing something She was always a little uncomfortable about being photographed.","uncomfortable about something They are uncomfortable about the compromises they have made.","uncomfortable to do something The film is often very uncomfortable to watch.","it is uncomfortable to do something It is very uncomfortable to have to admit that we might share some responsibility for the situation.","A few remain highly uncomfortable with the idea of same-sex marriage.","He started to get a bit uncomfortable as the conversation continued.","I noticed that Elisa was suddenly uncomfortable and blushing.","Planners seem a little uncomfortable with the current government guidelines.","She was a little uncomfortable about this situation.","The way he looked at her made her distinctly uncomfortable.","This discussion leaves them uncomfortable.","Some teachers feel uncomfortable about imposing group work on students.","They were uncomfortable with the new management style.","It was an uncomfortable situation for everyone."],"opposite":"comfortable","synonyms":""},{"def":"unpleasant or difficult to deal with","examples":["an uncomfortable fact","I had the uncomfortable feeling that it was my fault.","Her letter was an uncomfortable reminder of responsibilities I preferred to forget about."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]