[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/u/unc/uncon/unconscious__us_1.mp3","phonsUS":"/ʌnˈkɑːnʃəs/","level":"B2","meanings":[{"def":"in a state like sleep because of an injury or illness, and not able to use your senses","examples":["They found him lying unconscious on the floor.","She was knocked unconscious.","She fell unconscious after breathing in the gas.","It was a powerful sedative that would render them unconscious within minutes.","Her eyes closed as she went unconscious.","The attack left her unconscious.","an unconscious patient"],"opposite":"","synonyms":""},{"def":"existing or happening without you realizing or being aware; not deliberate","examples":["unconscious desires","Freud sought to unlock the workings of the unconscious mind.","the danger of unconscious bias","The brochure is full of unconscious humour.","She believes there is unconscious discrimination against women in science.","These impulses are often totally unconscious.","Human beings are driven by many unconscious impulses.","Prejudice very often operates at an unconscious level.","She researches into the depths of the unconscious mind.","Your choice of ideal partner can either be conscious or unconscious."],"opposite":"","synonyms":""},{"def":"not aware of somebody/something; not noticing something; not conscious","examples":["She is unconscious of the effect she has on people.","He was quite unconscious of the danger.","Parents are often quite unconscious of the ways in which they influence their children.","He made his way down the street, unconscious of the people, cars and buildings around him."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["unconscious bias","collective unconscious","the unconscious"]},{"pos":"noun","level":"","meanings":[{"def":"the part of a person’s mind with thoughts, feelings, etc. that they are not aware of and cannot control but that can sometimes be understood by studying their behaviour or dreams","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]