[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/u/und/under/understand__us_2.mp3","phonsUS":"/ˌʌndərˈstænd/","level":"A1","meanings":[{"def":"to know or realize the meaning of words, a language, what somebody says, etc.","examples":["understand (something) Can you understand French?","Do you understand the instructions?","She didn't understand the form she was signing.","His accent made him difficult to understand.","I'm not sure that I understand. Go over it again.","I don't want you doing that again. Do you understand?","understand what… I don't understand what he's saying.","I’m sorry, I didn’t quite understand.","Would you mind explaining that again? I’m not sure that I’ve understood correctly.","Sorry, I don't quite follow (you).","Can I just check that I’ve got this right?","I’m not quite/​exactly clear about/​really sure what I’m supposed to do.","Sorry, could you repeat that? I didn’t hear what you said.","Sorry, would you mind repeating what you just said?","If I understand you correctly, you want me to phone the customer and apologise?","Do you mean (to say) that the deal's off?","What exactly are you saying?","So you're saying that the meeting's cancelled?","Sorry, did you mean that I should wait here or come back later?","Can you just confirm your date of birth for me, please?","Why are you wanting a new phone when your current one works perfectly well?","What shall we do tonight? I’m thinking bowling.","I’m loving the weather today!","I could barely understand a word of his story.","If I've understood you correctly…","The girl understands immediately and promises to be more careful.","I finally understood what she meant.","What is generally understood by ‘democracy’?"],"opposite":"","synonyms":""},{"def":"to know or realize how or why something happens, how it works or why it is important","examples":["understand something Doctors still don't understand much about the disease.","No one is answering the phone—I can't understand it.","I fully understand the reason for your decision.","She understands the importance of good design.","understand why, what, etc… I could never understand why she was fired.","It is easy to understand how he made this mistake.","They’re too young to understand what is happening.","understand somebody/something doing something I just can't understand him taking the money.","(formal) I just can't understand his taking the money.","understand that… He was the first to understand that we live in a knowledge economy.","be understood as something The national housing market is better understood as a collection of small, local housing markets.","I don’t understand the instructions.","Doctors still don’t understand much about the disease.","‘It opens like this.’ ‘Oh, I see.’","Oh yes, I see what you mean.","She didn’t get the joke.","I don’t get you.","Sorry—I don’t quite follow.","The plot is almost impossible to follow.","They failed to grasp the importance of his words.","The concept of infinity is almost impossible for the human mind to comprehend.","Her behaviour wounded him in a way he did not really understand.","They won't necessarily understand the pros and cons of the matter.","The effects of these chemicals on the body are still poorly understood.","These beliefs are best understood as a form of escapism.","a woman struggling to understand an incomprehensible situation","I can't understand what all the fuss is about.","We came to understand why certain things happened in certain ways.","She understood that this was her last chance."],"opposite":"","synonyms":"understand"},{"def":"to know somebody’s character, how they feel and why they behave in the way they do","examples":["understand somebody Nobody understands me.","He doesn't understand women at all.","We understand each other, even if we don’t always agree.","understand what, how, etc… They understand what I have been through.","I understand how hard things have been for you.","understand (that…) I quite understand that you need some time alone.","If you want to leave early, I'm sure he'll understand.","understand somebody doing something I quite understand you needing some time alone.","(formal) I quite understand your needing some time alone.","These categories help us to better understand our readers.","She realized that she had never properly understood him."],"opposite":"","synonyms":""},{"def":"to think or believe that something is true because you have been told that it is","examples":["understand (that)… I understand (that) you wish to see the manager.","Am I to understand that you refuse?","understand somebody/something to be/have something The Prime Minister is understood to have been extremely angry about the report.","it is understood that… It is understood that the band are working on their next album."],"opposite":"","synonyms":""},{"def":"to agree something with somebody without it needing to be said","examples":["I thought it was understood that my expenses would be paid."],"opposite":"","synonyms":""},{"def":"to realize that a word in a phrase or sentence is not expressed and to supply it in your mind","examples":["In the sentence ‘I can't drive’, the object ‘a car’ is understood."],"opposite":"","synonyms":""},{"def":"to make somebody believe/understand something","examples":["I was given to understand that she had resigned."],"opposite":"","synonyms":""},{"def":"to make your meaning clear, especially in another language","examples":["He doesn't speak much Japanese but he can make himself understood."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"give somebody to believe/understand (that)…","def":"to make somebody believe/understand something","examples":["I was given to understand that she had resigned."]},{"idiom":"make yourself understood","def":"to make your meaning clear, especially in another language","examples":["He doesn't speak much Japanese but he can make himself understood."]}],"phrasal":[],"related":["give somebody to believe/understand (that)…"]}]