[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/u/und/under/understanding__us_1.mp3","phonsUS":"/ˌʌndərˈstændɪŋ/","level":"A2","meanings":[{"def":"the knowledge that somebody has about a particular subject or situation","examples":["Students will gain a broad understanding of the workings of Parliament.","a deep/clear understanding of something","Unions said her comments showed a complete lack of understanding of what the civil service does.","She possesses a thorough understanding of the nature of the threat we are faced with.","The book aims to inform readers seeking a greater understanding of the issues involved.","The committee has little or no understanding of the problem.","to develop/improve/increase understanding of something","to contribute to/lead to an understanding of something","Most of the students have a sound understanding of English grammar.","The existence of God is beyond human understanding (= humans cannot know whether God exists or not).","Our understanding of the process is now much better.","Such an approach to education does not expand children's knowledge and understanding of the world.","The report gave the commission an understanding of the types of problems the police were facing.","The course is designed for healthcare professionals who need a basic understanding of the subject.","All of this research informs our understanding of how disease processes work.","He had a poor understanding of international law.","He showed a full understanding of the sequence of events.","How children change so quickly is beyond my understanding.","Scientists are seeking a better understanding of the process.","She has only a limited understanding of what the job involves.","Some religions have a common understanding of the nature of a divine being.","The book aims to give children a balanced understanding of food and the environment.","The idea of eternity is beyond our full understanding.","The students seem to have a reasonable level of understanding of how genes work.","This change of policy reflects a growing understanding of the extent of the problem.","You need to read more widely to gain a proper understanding of the issue.","a book that will deepen your understanding of global warming","His writings reflect a good understanding of the society he lived in.","Our growing understanding of genetics raises some complex issues.","She has always shown great understanding of local political structures.","The course should help enhance your understanding of the treatments available.","There is a general lack of understanding about the problems facing newly arrived immigrants.","You will need to have a thorough understanding of financial systems."],"opposite":"","synonyms":""},{"def":"the ability to understand why people behave in a particular way and to forgive them when they do something wrong","examples":["Organizers of the rally say they want to promote understanding, tolerance and open-mindedness","These efforts would foster mutual understanding and respect for different values.","We must tackle the problem with sympathy and understanding.","Try to show a little more understanding.","understanding between A and B We are looking for a better understanding between the two nations.","He didn't show much understanding towards her when she lost her job.","Greater contact between the two groups should lead to a better mutual understanding.","She gave me a look filled with sympathetic understanding.","She suddenly had a new understanding for her mother.","There is generally good will and understanding between workers and employers."],"opposite":"","synonyms":""},{"def":"an informal agreement","examples":["understanding about something We finally came to an understanding about what hours we would work.","understanding that… We have this understanding that nobody talks about work over lunch.","understanding with somebody I think I've reached an understanding with my mother.","I have a clear understanding with any lawyer I hire.","There is an unspoken understanding that Hugh will be in charge while Jane is away.","They came to an understanding on when final payment was to be made.","an understanding between the companies to fight against the proposed tax reform"],"opposite":"","synonyms":""},{"def":"the particular way in which somebody understands something","examples":["My understanding of the situation is different","It was our understanding that you had already been informed.","My understanding is that we're meeting him at the theatre.","The statement is open to various understandings."],"opposite":"","synonyms":""},{"def":"used to introduce a condition that must be agreed before something else can happen","examples":["They agreed to the changes on the understanding that they would be introduced gradually.","I thought you gave me the book on the understanding that I could keep it."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"on the understanding that…","def":"used to introduce a condition that must be agreed before something else can happen","examples":["They agreed to the changes on the understanding that they would be introduced gradually.","I thought you gave me the book on the understanding that I could keep it."]}],"phrasal":[],"related":[]},{"pos":"adjective","level":"","meanings":[{"def":"showing sympathy for other people’s problems and being willing to forgive them when they do something wrong","examples":["She has very understanding parents."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]