[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/u/unf/unfor/unfortunate__us_1.mp3","phonsUS":"/ʌnˈfɔːrtʃənət/","level":"B2","meanings":[{"def":"having bad luck; caused by bad luck","examples":["He was unfortunate to lose in the final round.","It was an unfortunate accident.","The unfortunate animal was locked inside the house for a week."],"opposite":"fortunate","synonyms":""},{"def":"if you say that a situation is unfortunate, you wish that it had not happened or that it had been different","examples":["She described the decision as ‘unfortunate’.","It was unfortunate that he couldn't speak English.","You're putting me in a most unfortunate position.","It is vital that more is done to prevent the illegal trade in wild animals.","(Compare: We have to do more to stop people trading wild animals illegally.)","It is clear that more needs to be done to protect biodiversity.","(Compare: We clearly need to do more to protect biodiversity.)","It is unfortunate that the practice of keeping monkeys as pets still continues.","(Compare: It’s absolutely terrible that people still keep monkeys as pets.)","It is difficult for many people to understand the reasons why certain individuals choose to hunt animals for sport.","(Compare: I can’t understand why anyone would want to kill animals for fun.)","Unfortunately, it would seem that not enough is being done to support tiger conservation.","(Compare: Governments aren’t doing enough to help tiger conservation.)","There is no doubt that the greatest threat to polar bears comes from global warming.","(Compare: I believe that the greatest threat…)"],"opposite":"","synonyms":""},{"def":"embarrassing and/or offensive","examples":["It was an unfortunate choice of words."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"","meanings":[{"def":"a person who does not have much luck, money, etc.","examples":["one of life’s unfortunates"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]