[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/u/uni/union/union__us_2.mp3","phonsUS":"/ˈjuːniən/","level":"B1","meanings":[{"def":"an organization of workers, usually in a particular industry, that exists to protect their interests, improve conditions of work, etc.","examples":["I've joined the union.","Teachers' unions in England are demanding the same improvements as in Scotland.","a union leader/official/representative/activist","the right to form a union","Do you belong to a union?","The union represents five million workers.","public sector unions","Greece's main workers' union","a union member","a member of a union","a fall in union membership","She became active in the teachers' union.","The nurses' union negotiated a 3% pay rise.","The union represents 40% of all hospital workers.","The union threatened strike action if its demands were not met.","He spoke out at a meeting of the National Union of Journalists.","The figures come from a survey by public-sector unions.","The news emerged yesterday after a meeting between managers and union representatives.","unofficial action not authorized by the union leadership"],"opposite":"","synonyms":""},{"def":"an association or a club for people or organizations with the same interest","examples":["the Scottish Rugby Union"],"opposite":"","synonyms":""},{"def":"a group of states or countries that have the same central government or that agree to work together","examples":["the former Soviet Union","the European Union","Churchill was not hostile to the continent's attempt at forming a union.","The crisis will be discussed as a meeting of African Union leaders this week."],"opposite":"","synonyms":""},{"def":"the US (used especially at the time of the Civil War)","examples":["the Union and the Confederacy","the State of the Union address by the President"],"opposite":"","synonyms":""},{"def":"the act of joining two or more things together; the state of being joined together","examples":["a meeting to discuss economic and currency union","union with something Northern Ireland’s union with Britain","union between A and B the union between mainland Tanzania and the Zanzibar Island","sexual union","Some of the member states wanted a closer union rather than the loose confederation that developed.","a move in the direction of full political union","currency union between the two countries"],"opposite":"","synonyms":""},{"def":"a marriage","examples":["Their union was blessed with six children."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["non-union","civil union","labor union","Rugby Union","trade union","credit union","customs union","Union Carbide","Union Square","Western Union","students’ union","Union Jack","Act of Union","European Union","Mothers' Union","Union Pacific Railroad","European Monetary Union","Grand Union Canal","Amateur Athletic Union"]}]