[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/u/uni/unit_/unit__us_1.mp3","phonsUS":"/ˈjuːnɪt/","level":"A2","meanings":[{"def":"a single thing, person or group that is complete by itself but can also form part of something larger","examples":["After 1946 the British Government treated the four territorial divisions as a single unit.","The basic unit of society is the family.","The cell is the unit of which all living organisms are composed.","the role of the family unit in the community"],"opposite":"","synonyms":""},{"def":"a single item of the type of product that a company sells","examples":["The game's selling price was $15 per unit.","What's the unit cost?","The manufacturer sold 73 000 units in the first quarter.","China produced 65 million units last year."],"opposite":"","synonyms":""},{"def":"one of the parts into which a textbook or a series of lessons is divided","examples":["Each unit of the course that we completed felt like a real achievement.","in a unit The present perfect is covered in Unit 8.","The university is recruiting staff to teach the new units.","You learned this in the first unit."],"opposite":"","synonyms":""},{"def":"a group of people who work or live together, especially for a particular purpose","examples":["army/military/combat/police units","a special unit of the FBI","Medical units were operating in the disaster area.","Two members of the unit died on the mission.","They formed small units of 15 to 20 people.","The marching column encountered large units of the enemy.","in a unit Soldiers in the unit are trained to survive in the snow and cold.","The army is collaborating with guerrilla units in the border region.","Enemy units have infiltrated the territory.","The new manager changed a talented collection of individuals into a cohesive unit.","Large departments were broken down into smaller units."],"opposite":"","synonyms":""},{"def":"a department, especially in a hospital, that provides a particular type of care or treatment","examples":["the intensive care unit","a maternity unit","The cancer research unit is attached to the local university.","patients in the psychiatric unit"],"opposite":"","synonyms":""},{"def":"a piece of furniture, especially a cupboard, that fits with and matches others of the same type","examples":["a fitted kitchen with white units","floor/wall units","bedroom/kitchen units"],"opposite":"","synonyms":""},{"def":"a fixed quantity, etc. that is used as a standard measurement","examples":["a unit of measurement","Women are advised not to drink more than fourteen units of alcohol per week.","a unit of time/length/weight","a unit of currency, such as the euro or the dollar","per unit Electricity is ten pence per unit.","The law requires almost all federal agencies to use metric units.","The highest carbon emissions per unit of energy are from coal."],"opposite":"","synonyms":""},{"def":"a small machine that has a particular purpose or is part of a larger machine","examples":["a waste disposal unit","the central processing unit of a computer","an air-conditioning unit"],"opposite":"","synonyms":""},{"def":"a single flat, house or section in a building or group of buildings","examples":["a housing/residential unit","to build new affordable housing units","(Australian English, New Zealand English) The site is being redeveloped for 62 home units.","a single dwelling unit","a retail/business unit","an industrial unit"],"opposite":"","synonyms":""},{"def":"any whole number from 0 to 9","examples":["a column for the tens and a column for the units"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["tone unit","system unit","unit trust","vanity unit","lexical unit","astronomical unit","visual display unit","waste disposal unit","central processing unit","unit trusts","efficiency unit","critical care unit","British thermal unit","intensive care unit","graphics processing unit"]}]