[{"pos":"preposition","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/u/unl/unlik/unlike__us_1.mp3","phonsUS":"/ˌʌnˈlaɪk/","level":"B1","meanings":[{"def":"different from a particular person or thing","examples":["Music is quite unlike any other art form.","The sound was not unlike that of birds singing."],"opposite":"","synonyms":""},{"def":"used to contrast somebody/something with another person or thing","examples":["Unlike most systems, this one is very easy to install.","This survey highlights a number of differences in the way that teenage boys and girls in the UK spend their free time.","One of the main differences between the girls and the boys who took part in the research was the way in which they use the internet.","Unlike the girls, who use the internet mainly to keep in touch with friends, the boys questioned in this survey tend to use the internet for playing computer games.","The girls differ from the boys in that they tend to spend more time keeping in touch with friends on the phone or on social networking websites.","Compared to the boys, the girls spend much more time chatting to friends on the phone.","On average the girls spend four hours a week chatting to friends on the phone. In contrast, very few of the boys spend more than five minutes a day talking to their friends in this way.","The boys prefer competitive sports and computer games, whereas/while the girls seem to enjoy more cooperative activities, such as shopping with friends.","When the girls go shopping, they mainly buy clothes and cosmetics. The boys, on the other hand, tend to purchase computer games or gadgets."],"opposite":"","synonyms":""},{"def":"not typical of somebody/something","examples":["It's very unlike him to be so late."],"opposite":"like","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adjective","level":"","meanings":[{"def":"different from each other","examples":["They are both teachers. Otherwise they are quite unlike."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to show, by clicking a special button, that you disagree with something on social media, a news website, a blog, etc.","examples":[],"opposite":"","synonyms":""},{"def":"to not be liked by people; to be unpopular","examples":["The article suggests his character was unliked by many."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]