[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/u/unu/unusu/unusual__us_1_rr.mp3","phonsUS":"/ʌnˈjuːʒuəl/","level":"A2","meanings":[{"def":"different from what is usual or normal","examples":["The case is highly unusual.","Police then took the unusual step of publishing the names and pictures of the two suspects.","it is unusual for somebody/something to do something It's not unusual for young doctors to work a 70-hour week (= it happens often).","It's unusual for the trees to flower so early.","it is unusual to do something It was a bit unusual to see her up and about before nine in the morning.","She has a very unusual name.","She hadn't noticed anything unusual about Susan's behaviour.","It was considered unusual at the time for a woman to study medicine.","It's not at all unusual to feel very tired in the early months of pregnancy.","The organization is unusual in several respects.","This is a highly unusual case.","He's a man of unusual strength and courage.","He's a writer with an unusual sensitivity to the differences between past and present.","If you have an unusual hobby you would like to share with our readers, write to…","It was unusual to see anyone out on the streets at this hour.","It's highly unusual for her to be so late.","The best teachers had enthusiasm and an unusual energy and commitment.","The conference has generated an unusual degree of interest.","The house has several unusual but interesting features.","The new chairman has an unusual breadth of experience.","The painter reveals unusual skill in representing three-dimensional objects."],"opposite":"","synonyms":""},{"def":"different from other similar things and therefore interesting and attractive","examples":["an unusual colour","Are you looking for an unusual gift idea this Christmas?","their unusual mix of funk, rock, hip hop, jazz and techno"],"opposite":"","synonyms":""},{"def":"a category of very severe punishment that is banned under US law","examples":["This important case confronts the issue of what constitutes cruel and unusual punishment.","Detainees are subjected to malnutrition, forced labor, and to other cruel and unusual punishments."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"cruel and unusual punishment","def":"a category of very severe punishment that is banned under US law","examples":["This important case confronts the issue of what constitutes cruel and unusual punishment.","Detainees are subjected to malnutrition, forced labor, and to other cruel and unusual punishments."]}],"phrasal":[],"related":["cruel and unusual punishment"]}]