[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/u/upd/updat/update__us_1_rr.mp3","phonsUS":"/ˌʌpˈdeɪt/","level":"B1","meanings":[{"def":"to make something more modern by adding new parts, etc.","examples":["an updated version of the app","It's about time we updated our software.","Ensure that your site is updated to the latest version of the software.","The program automatically updates your antivirus settings.","They have just recently updated their server software."],"opposite":"","synonyms":""},{"def":"to give somebody the most recent information about something; to add the most recent information to something","examples":["update somebody I'll be updating you shortly.","update somebody on something I called the office to update them on the day's developments.","update something The site tells you when the information was last updated.","Our records are regularly updated.","Data is automatically updated on a daily basis.","update something with something The files are constantly updated with new information.","Could you update me on how the work is progressing?","The official site is updated on a regular basis.","updating all the files manually","The road map has been fully updated."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/u/upd/updat/update__us_2.mp3","phonsUS":"/ˈʌpdeɪt/","level":"B1","meanings":[{"def":"a report or broadcast that gives the most recent information about something; a new version of something containing the most recent information","examples":["They will send you regular updates by email.","a news/weather update","update on something Now let's get an update on our other big story of the day.","The police will give an update on the progress of the investigation tomorrow.","The committee agreed to provide an update on the situation at the school","Stand by for an update from our White House correspondent.","We are expecting an update from the hospital this morning.","We will bring you more updates as soon as possible","Here's a quick update on the travel situation.","I added your name to my update list.","I get regular updates by email.","The 6 o'clock news provides the latest updates.","The report gives an update on the currency crisis.","We need an update to the mailing list.","We'll have a live update on the storm's progress from the experts.","an update on the political crisis"],"opposite":"","synonyms":""},{"def":"the most recent improvements to a computer program that are sent to users of the program","examples":["software updates","How do I get myself set up to receive automatic updates?","We recommend checking for security updates regularly.","I downloaded the latest updates.","update to something the most recent update to the software","In Windows you can set up automatic updates.","You have to download the update and save it to your hard drive.","Google had to release an update for the toolbar."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]