[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/u/upg/upgra/upgrade__us_1_rr.mp3","phonsUS":"/ˌʌpˈɡreɪd/","level":"C1","meanings":[{"def":"to make a machine, computer system, etc. more powerful and efficient; to start using a new and better version of a machine, system, etc.","examples":["upgrade something We are constantly upgrading our software to meet customers' needs.","upgrade (from something) (to something) customers who want to upgrade from version 4.2 to version 4.5","Users can easily upgrade to the new version."],"opposite":"","synonyms":""},{"def":"to improve the condition of a building, etc. in order to provide a better service","examples":["to upgrade the town’s leisure facilities","The towpath was upgraded for use by cyclists."],"opposite":"","synonyms":""},{"def":"to give somebody a better seat on a plane, room in a hotel, etc. than the one that they have paid for","examples":["be upgraded (to something) On the flight back, we were upgraded to business class."],"opposite":"","synonyms":""},{"def":"to give somebody a more important job","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/u/upg/upgra/upgrade__us_2.mp3","phonsUS":"/ˈʌpɡreɪd/","level":"C1","meanings":[{"def":"the act of making a machine, computer system, etc. more powerful and efficient; the more powerful and efficient machine, computer system, etc.","examples":["instructions for installing an upgrade to the existing system"],"opposite":"","synonyms":""},{"def":"the act of improving the condition of a building, etc. in order to provide a better service","examples":["The building urgently needs an upgrade."],"opposite":"","synonyms":""},{"def":"the act of giving somebody a better seat on a plane, room in a hotel, etc. than the one that they paid for; the seat, room, etc. itself","examples":["Frequent flyers qualify for a free upgrade."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]