[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/u/ups/upset/upset__us_2.mp3","phonsUS":"/ˌʌpˈset/","level":"B1","meanings":[{"def":"unhappy or disappointed because of something unpleasant that has happened","examples":["I understand how upset you must be feeling.","upset about/at/over something There's no point getting upset about it.","upset about/at/over doing something He was really upset over not getting the present he wanted from Father Christmas.","I was upset at missing all the excitement.","upset (that)… She was upset that he had left without saying goodbye.","upset with somebody I think she may be a bit upset with you.","She was still upset about her divorce.","The incident had left him visibly angry and upset."],"opposite":"","synonyms":""},{"def":"an illness in the stomach that makes you feel sick (= want to vomit) or have diarrhoea","examples":["I've been off work with an upset stomach."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["upset the apple cart"]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/u/ups/upset/upset__us_1.mp3","phonsUS":"/ʌpˈset/","level":"B1","meanings":[{"def":"to make somebody/yourself feel unhappy, anxious or annoyed","examples":["upset somebody/yourself This decision is likely to upset a lot of people.","Try not to let him upset you.","Don't upset yourself about it—let's just forget it ever happened.","He had clearly been upset by the incident.","it upsets somebody that… It upset him that nobody had bothered to tell him about it.","it upsets somebody to do something It upsets me to think of her all alone in that big house.","I'm sorry—I didn't mean to upset you.","Keep the volume down—we don't want to upset the neighbours!","She was sensitive and easily upset.","She's obviously deeply upset by his behaviour.","upset by the death of their pet"],"opposite":"","synonyms":""},{"def":"to make a plan, situation, etc. go wrong","examples":["He arrived an hour late and upset all our arrangements.","Their plans were upset even more by days of torrential rain.","The disagreement further upset relations between the two countries."],"opposite":"","synonyms":""},{"def":"to make somebody feel sick (= want to vomit) after they have eaten or drunk something","examples":[],"opposite":"","synonyms":""},{"def":"to make something fall over by hitting it by accident","examples":["She stood up suddenly, upsetting a glass of wine."],"opposite":"","synonyms":""},{"def":"to cause problems for somebody or cause their plans, arrangements, etc. to fail","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"upset the apple cart","def":"to cause problems for somebody or cause their plans, arrangements, etc. to fail","examples":[]}],"phrasal":[],"related":[]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/u/ups/upset/upset__us_3.mp3","phonsUS":"/ˈʌpset/","level":"","meanings":[{"def":"a situation in which there are problems or difficulties, especially when these are unexpected","examples":["The company has survived the recent upset in share prices.","His health has not been improved by all the upset at home."],"opposite":"","synonyms":""},{"def":"a situation in which a person or team beats the person or team that was expected to win","examples":["The biggest upset of the tournament came when the top seed was beaten in the second round."],"opposite":"","synonyms":""},{"def":"an illness in the stomach that makes you feel sick (= want to vomit) or have diarrhoea","examples":["a stomach upset"],"opposite":"","synonyms":""},{"def":"the state of being unhappy, disappointed or worried because of something unpleasant that has happened","examples":["It had been the cause of much emotional upset."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]