[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/u/urg/urge_/urge__us_1.mp3","phonsUS":"/ɜːrdʒ/","level":"B2","meanings":[{"def":"to advise or try hard to persuade somebody to do something","examples":["urge somebody to do something If you ever get the chance to visit this place, I strongly urge you to do so.","Police are urging anyone who saw the accident to contact them immediately.","She urged him to stay.","I urge people to vote yes on May 5.","The charity urged the government to reconsider its decision.","The authorities urged residents to stay indoors.","The NFU is urging its members to support the proposed scheme.","The police are urging anyone with new information to come forward.","urge that… The report urged that all children be taught to swim.","urge (somebody) + speech ‘Why not give it a try?’ she urged (him).","We’d recommend you to book your flight early.","a recommended price of $50","I’d advise you not to tell him.","The group does not advocate the use of violence.","The situation is dangerous and the UN is urging caution.","He has repeatedly urged the government to do something about this.","‘Get on with it!’ he urged her impatiently.","‘Please come!’ he urged."],"opposite":"","synonyms":"recommend"},{"def":"to recommend something strongly","examples":["urge something The situation is dangerous and the UN is urging caution.","EU foreign ministers urged an independent inquiry into allegations of human rights violations.","urge something on/upon somebody The prime minister is urging restraint on Washington.","He urged a tax increase upon congress as a way of damping down consumer spending."],"opposite":"","synonyms":""},{"def":"to make a person or an animal move more quickly and/or in a particular direction, especially by pushing or forcing them","examples":["He urged his horse forward."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["urge on"],"related":["urge on","urge somebody"]},{"pos":"noun","level":"","meanings":[{"def":"a strong desire to do something","examples":["Freud claimed that this behaviour was caused by the repression of sexual urges.","urge to do something I had a sudden urge to hit him.","I felt a sudden urge to smash the teapot against the wall.","I suppressed a strong urge to yawn.","Leaving him off the guest list satisfied her urge for revenge.","She resisted the urge to kiss him.","an instinctive urge to tap your feet to the beat of the music","the human urge to control the environment","the primal urge to reproduce","She felt a violent urge to laugh, but suppressed it, with difficulty.","a biological/​primitive urge"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]