[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/u/use/use__/use__us_1.mp3","phonsUS":"/juːz/","level":"A1","meanings":[{"def":"to do something with a machine, a method, an object, etc. for a particular purpose","examples":["use something Can I use the photocopier?","He makes beer using traditional methods.","The applicator makes the glue easy to use.","Have you ever used this software before?","The oven looked as if it had never been used.","How often do you use (= travel by) the bus?","They were able to achieve a settlement without using military force.","a little-used path through the wood","a widely used technique for assessing the strength of metals","I have some information you may be able to use (= to get an advantage from).","use something for something We used a carrot for the snowman’s nose.","use something for doing something chemicals that are used for cleaning","use something to do something Police used tear gas to disperse the crowds.","This tree bark can be used to make a black dye.","use something as something The building is currently being used as a warehouse.","You can't keep using your bad back as an excuse.","use something in something The drug is also used in the treatment of cancer.","Candidates are not allowed to use dictionaries in the exam.","Credit cards, used appropriately, are a great financial tool.","Do you habitually use display screen equipment in your job?","Manufacturers tend to use disks made in the US.","The church is sometimes used as a concert venue.","The tennis court is sometimes used as a car park.","These garden shears are lightweight and easy to use.","a technique that is pimarily used in eye surgery","an etching technique used exclusively by Picasso","Don't keep asking me what to do—just use your common sense!","You should learn to use your time more efficiently."],"opposite":"","synonyms":""},{"def":"to take a particular amount of a liquid, substance, etc. in order to achieve or make something","examples":["This type of heater uses a lot of electricity.","I hope you haven't used all the milk.","This paint is very expensive, so please use it sparingly."],"opposite":"","synonyms":""},{"def":"to say or write particular words or a particular type of language","examples":["use something The poem uses simple language.","That's a word I never use.","You have to use the past tense.","‘Ethics’ and ‘morality’ are often used interchangeably.","use something to do something ‘Pop art’ is a term used to describe a movement that began in the 1950s."],"opposite":"","synonyms":""},{"def":"to be kind, friendly, etc. to somebody with the intention of getting an advantage for yourself from them","examples":["Can't you see he's just using you for his own ends?","I felt used."],"opposite":"","synonyms":""},{"def":"to take illegal drugs","examples":["Most of the inmates have used drugs at some point in their lives.","(slang) She's been using since she was 13.","the factors that make people likely to use heroin"],"opposite":"","synonyms":""},{"def":"used to say that you would like to have something very much","examples":["I think we could all use a drink after that!"],"opposite":"","synonyms":""},{"def":"used to tell somebody to think about something, especially when they have asked for your opinion or said something stupid","examples":["‘Why don't you want to see him again?’ ‘Oh, use your head!’"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"I, you, etc. could use something","def":"used to say that you would like to have something very much","examples":["I think we could all use a drink after that!"]},{"idiom":"use your head","def":"used to tell somebody to think about something, especially when they have asked for your opinion or said something stupid","examples":["‘Why don't you want to see him again?’ ‘Oh, use your head!’"]}],"phrasal":["use up"],"related":["use up","fair use","single-use","point of use","make use of","use your loaf","use your head","be of no use","use something","be no use (to somebody)","be of use (to somebody)","have no use for somebody","have no use for something","put something to good use","it’s no use (doing something)","make use of something/somebody","use a sledgehammer to crack a nut","a fat lot of good, use, etc."]},{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/u/use/use__/use__us_2.mp3","phonsUS":"/juːs/","level":"A2","meanings":[{"def":"the act of using something; the state of being used","examples":["A ban was imposed on the use of chemical weapons.","You can't justify the use of military force.","I'm not sure that this is the most valuable use of my time.","for… use These videos are intended for classroom use.","for use in something The software is designed for use in schools.","in use The chapel was built in the 12th century and is still in use today.","for the use of somebody (formal) The bar is for the use of members only.","Drug use in this age group is on the increase.","Holding a lavish party was not the best use of scarce funds.","I don't recommend the use of chemicals in home gardens.","If side effects occur, discontinue use.","Only half the land was fit for immediate use.","The CD is intended for use as background music.","The layout of the furniture makes optimum use of the space available.","The phone is in constant use.","The prints remain on file for future use.","The study showed that 75% of people favoured the use of ID cards.","There is a high risk of developing side effects from prolonged use of the drug.","This antiseptic is for external use only.","This model has been designed for greater ease of use.","This phone number is only for use in an emergency.","This room is now ready for use.","This software is no longer in common use.","a campaign to encourage wider use of public transport","a style of writing with an excessive use of metaphor","an article with a judicious use of examples","an efficient use of resources","fire extinguishers for home use","for the exclusive use of club members","lifetime use of cigarettes","the daily use of a deodorant","the fair use of copyrighted material","the first country to ban the use of antidepressants in children","the sustainable use of natural resources"],"opposite":"","synonyms":""},{"def":"a purpose for which something is used; a way in which something is or can be used","examples":["The plant has various medical uses.","This chemical has a wide range of industrial uses.","use for something Can you find a use for this old table?","I'm sure you'll think of a use for it.","What use is a mouse without a computer?","The product has several potential uses.","This herb has a variety of uses.","Water was reserved for drinking or medicinal uses.","Commercial activity on the site will constitute a change of use."],"opposite":"","synonyms":""},{"def":"the right or opportunity to use something, for example something that belongs to somebody else","examples":["I have the use of the car this week.","They denied us use of the college library.","Guests have free use of the hotel pool.","We gave them the use of our house while we were away."],"opposite":"","synonyms":""},{"def":"the ability to use your mind or body","examples":["He lost the use of his legs (= became unable to walk) in an accident.","After a while she regained the use of her fingers.","Since his stroke he hasn't had the use of his left hand.","the full use of your mental faculties"],"opposite":"","synonyms":""},{"def":"a particular word or phrase, used with a particular meaning","examples":["The phrase ‘all told’ comes from an old use of the verb ‘tell’, meaning ‘to count’."],"opposite":"","synonyms":""},{"def":"to not be useful or helpful","examples":["You can throw those away—they're no use to anyone.","It's of no practical use to me."],"opposite":"","synonyms":""},{"def":"to be useful","examples":["Can I be of any use (= can I help)?","Could this old coat be of use to you?"],"opposite":"","synonyms":""},{"def":"to start/stop being used","examples":["When did this word come into common use?","These pesticides are gradually going out of use.","The expression went out of use some time ago.","a technology which came into use at the end of the last century"],"opposite":"","synonyms":""},{"def":"to dislike somebody","examples":["I've no use for people who don't make an effort."],"opposite":"","synonyms":""},{"def":"to not need something","examples":["Living underground and having little use for eyes, moles are virtually blind.","I have no use for my golf clubs any more."],"opposite":"","synonyms":""},{"def":"to be useful sometimes","examples":["I know you don't like him, but he has his uses."],"opposite":"","synonyms":""},{"def":"used to say that there is no point in doing something because it will not be successful or have a good result","examples":["What's the use of worrying about it?","It's no use—I can't persuade her.","It's no use running—the train has already gone.","What's the use of denying it?"],"opposite":"","synonyms":""},{"def":"to use something/somebody, especially in order to get an advantage","examples":["We could make better use of our resources.","to make effective use of technology","You should make use of your contacts.","We made use of the car while you were away.","He made full use of the opportunity to travel."],"opposite":"","synonyms":""},{"def":"to be able to use something for a purpose, and get an advantage from doing so","examples":["She'll be able to put her languages to good use in her new job.","Don't throw that box away—I'm sure I could put it to some use."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be no use (to somebody)","def":"to not be useful or helpful","examples":["You can throw those away—they're no use to anyone.","It's of no practical use to me."]},{"idiom":"be of use (to somebody)","def":"to be useful","examples":["Can I be of any use (= can I help)?","Could this old coat be of use to you?"]},{"idiom":"come into/go out of, etc. use","def":"to start/stop being used","examples":["When did this word come into common use?","These pesticides are gradually going out of use.","The expression went out of use some time ago.","a technology which came into use at the end of the last century"]},{"idiom":"have no use for somebody","def":"to dislike somebody","examples":["I've no use for people who don't make an effort."]},{"idiom":"have no use for something","def":"to not need something","examples":["Living underground and having little use for eyes, moles are virtually blind.","I have no use for my golf clubs any more."]},{"idiom":"have its/their/your uses","def":"to be useful sometimes","examples":["I know you don't like him, but he has his uses."]},{"idiom":"it’s no use (doing something) | what’s the use (of doing something)?","def":"used to say that there is no point in doing something because it will not be successful or have a good result","examples":["What's the use of worrying about it?","It's no use—I can't persuade her.","It's no use running—the train has already gone.","What's the use of denying it?"]},{"idiom":"make use of something/somebody","def":"to use something/somebody, especially in order to get an advantage","examples":["We could make better use of our resources.","to make effective use of technology","You should make use of your contacts.","We made use of the car while you were away.","He made full use of the opportunity to travel."]},{"idiom":"put something to good use","def":"to be able to use something for a purpose, and get an advantage from doing so","examples":["She'll be able to put her languages to good use in her new job.","Don't throw that box away—I'm sure I could put it to some use."]}],"phrasal":[],"related":[]}]