[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/u/use/usefu/useful__us_2.mp3","phonsUS":"/ˈjuːsfl/","level":"A1","meanings":[{"def":"that can help you to do or achieve what you want","examples":["a useful tool","useful information","The Minister said that a meeting with the strikers would serve no useful purpose.","The website turned out to be a really useful resource.","useful to somebody He might be useful to us.","useful for somebody/something The mortgages are especially useful for people with fluctuating incomes.","useful for doing something These plants are particularly useful for brightening up shady areas.","it is useful to do something It can be useful to write a short summary of your argument first.","it is useful for somebody to do something It is useful for students to receive constructive feedback on their progress.","useful in something These drugs are useful in the treatment of many forms of cancer.","useful in doing something Here are some tips that may be useful in helping you deal with your problem.","Don't just sit watching television—make yourself useful (= be helpful).","This information could prove useful.","Both scholars and general readers will find the book extremely useful.","Your knowledge of German may come in useful (= be useful in a particular situation).","Some products can be recycled at the end of their useful life.","Internet booking is useful for people who want a short break.","It needs to give more information to be truly useful.","It was useful as a short-term measure.","She has made an exceptionally useful contribution to the debate.","She told Fred to make himself useful.","She was very useful in dealing with foreign visitors.","The same information is equally useful when negotiating.","The subject is practically useful and will stand you in good stead when looking for a job.","This method has proved the most generally useful.","This tool is useful for a variety of purposes.","an undoubtedly useful skill","information which will be useful to new mothers","some leaflets which you might find useful","to provide rewarding and socially useful employment","useful for people who need a short break","Regular tests are useful for monitoring progress.","a useful book/​gadget"],"opposite":"","synonyms":""},{"def":"good; of the right standard","examples":["He's a very useful player."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]