[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/u/use/user_/user__us_2.mp3","phonsUS":"/ˈjuːzər/","level":"A2","meanings":[{"def":"a person or thing that uses something","examples":["road users","The service allows users to download and read a wide collection of books for no charge.","computer/internet/mobile phone users","wheelchair users","Service users can now get help 365 days a year.","Our advice to companies and home users is to waste no time in implementing this security patch.","a site with more than 2 million registered users","Many of the centre's regular users were mothers with young children.","The average user spends 40 minutes a day on unnecessary email.","We're always working to improve the user experience.","We're expecting the user base to expand significantly.","Although the sites don't charge user fees, some make money by selling ads.","The site enables users to access census data.","The service is designed to let users share large files.","user of something The main users of this service are government departments.","A special entrance is being built for wheelchair users.","Existing users will be able to upgrade their software at a reduced price.","The larger users of the service have to pay more.","These security holes allow malicious users to hijack your account.","They offer a short course to first-time users of the software.","We'll have about 500 million wireless users accessing the internet.","a casual user of cocaine","a computer intended for business and home users","a survey of health service users","heavy users of credit","a user manual","Users need to be suspicious of all unsolicited email.","new security features designed to help users protect their accounts against hackers"],"opposite":"","synonyms":""},{"def":"a person who uses illegal drugs","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["end user","user fee","user ID","multi-user","power user","user group","user-friendly","user experience","user-friendliness","user-generated","user interface","user-friendlier","user interfaces","user experiences","user-friendliest","user-generated content"]}]