[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/v/vac/vacat/vacation__us_4.mp3","phonsUS":"/veɪˈkeɪʃn/","level":"A1","meanings":[{"def":"a period of time spent travelling or resting away from home","examples":["on vacation They're on vacation in Hawaii right now.","I'm going on vacation for a couple of weeks.","You look tired—you should take a vacation.","We're planning a summer vacation to Europe next year.","I just got back from a family vacation in New Orleans.","The job includes two weeks' paid vacation.","a vacation home","He had a lot of unused vacation time.","I get four weeks’ holiday/​vacation a year.","He’s on holiday/​vacation this week.","I like to take my holiday/​vacation in the winter.","the summer holidays/​vacation.","The school will be closed Monday because it’s a holiday.","Employees no longer have a fixed number of vacation days.","He hadn't taken a real vacation in years.","I have put in for vacation time.","I hope the bad weather didn't ruin your vacation.","I may go on an extended vacation to Bermuda.","I wasn't able to use all of my vacation time last year.","Military personnel receive a month of paid vacation.","Orlando is a popular vacation resort for British tourists.","She needed a little vacation to clear her head.","She took a well-deserved vacation to Mexico.","She was going to spend her vacation in Hawaii all by herself.","The President cut short his working vacation by two days.","The sisters are on summer vacation with their family.","He has a private jet and a vacation home in Switzerland.","He went on vacation some time last week.","How was your vacation?","Let us help you with your vacation plans!","She's gone on vacation to Massachusetts.","The area is a popular vacation choice for families.","The couple had left for a European vacation.","The senator is on vacation in Maine.","They usually go on a ski vacation this time of year.","Vacation time and other benefits were cut.","Their son is home on vacation.","When I got back from my vacation, there was a letter waiting for me."],"opposite":"","synonyms":""},{"def":"(in the UK) one of the periods of time when universities or courts of law are closed; (in the US) one of the periods of time when schools, colleges, universities or courts of law are closed","examples":["the Christmas/Easter/summer vacation","(British English) the long vacation (= the summer vacation)","during/in the vacation I got a full-time job during the vacation.","I wrote the essay during the Christmas vacation.","I'm going travelling in the vacation.","Most students get vacation jobs.","She went home to her parents for the Easter vacation.","Students had a two-week vacation at the end of December.","The long summer vacation breaks the rhythm of instruction.","The schools were closed for summer vacation."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","level":"","meanings":[{"def":"to spend a holiday somewhere","examples":["They are currently vacationing in Florida."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]