[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/v/val/value/value__us_2.mp3","phonsUS":"/ˈvæljuː/","level":"B1","meanings":[{"def":"how much something is worth in money or other goods for which it can be exchanged","examples":["to go up/rise/increase in value","to go down/fall/decline in value","rising property values","The value of the shares has continued to fall.","to the value of something The winner will receive a prize to the value of £1 000.","of value Don't leave anything of value in the car.","Sports cars tend to hold their value well.","house prices","How much are these? They don’t have a price on them.","I can’t afford it at that price.","A new computer system has been installed at a cost of £80 000.","The winner will receive a prize to the value of £1 000.","The garden was transformed at great expense.","Running a car is a big expense.","He has a personal net worth of $10 million.","Dramatic developments on the stock market tripled the value of his shares.","It's hard to put a value on a company with large assets and turnover but low profits.","Jewellery to the value of a million pounds was stolen last night.","Paintings to the value of two million euros were stolen last night.","Regular servicing will add to the resale value of your PC.","The land has dropped in value.","The piano has held its value.","They were accused of artificially inflating the value of the company's securities.","Use current market values to determine the worth of your assets.","a residual value of 10% of its original cost","a share with a nominal value of $50","the high value of the dollar","London property values are rising fast."],"opposite":"","synonyms":"price"},{"def":"how much something is worth compared with its price","examples":["to be good/great value (= worth the money it costs)","to be bad/poor value (= not worth the money it costs)","Larger sizes give the best value for money.","The hotel gives value for money.","They're only £40—not bad value, really.","This great value-for-money offer is only available to society members.","Charter flights give very good value for money.","This restaurant is excellent value.","Though a little more expensive, the larger model gives better value for money.","Our products deliver value."],"opposite":"","synonyms":""},{"def":"the quality of being useful or important","examples":["The value of regular exercise should not be underestimated.","She placed a high value on loyalty.","of value He didn't say anything of value.","of value to somebody The arrival of canals was of great value to many industries.","to be of little/no value to somebody","value to somebody The library's value to the community is enormous.","This ring has great sentimental value for me.","I suppose it has a certain novelty value (= it's interesting because it's new).","food with a high nutritional value","The story has very little news value.","Branding has to add value to the product.","His published account of his travels is of dubious value to other explorers.","It has an added value for native speakers of English.","Many people question the social value of talk shows.","Pottery fragments are of great value to archaeologists.","The real value of the book lies in its wonderful characterization.","This would greatly enhance the value of the book as a resource for scholars.","We began to recognize the value of advice from others.","You can't underestimate the value of networking.","a program which demonstrates the value of education","The stolen necklace only had sentimental value for her.","the nutritional value of eggs","I suppose it has a certain novelty value but you'll soon get bored of it.","Most of his writings are of little real value."],"opposite":"","synonyms":""},{"def":"beliefs about what is right and wrong and what is important in life","examples":["We need to be guided by our moral values.","a return to traditional values in education, such as firm discipline","The school's core values include the ability to work with others.","The young have a completely different set of values and expectations.","Families adhered to the values instilled by the church.","I won't compromise my artistic values.","Is it the role of schools to foster spiritual values?","They hold very middle-class values.","What shared values do you have with your friends?","a prevailing set of cultural values","a society that has failed to preserve its traditional values","the cultural values shared by all the ethnic groups","the dominant values of a society","the principles and values embodied in the Constitution","the rejection of parental values by a child","The party's election campaign emphasized its belief in family values."],"opposite":"","synonyms":""},{"def":"the amount represented by a letter or symbol","examples":["Let y have the value 33."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["face value","value-free","value-laden","market value","replay value","street value","value system","nuisance value","surrender value","value judgement","value added tax","fair market value","par value","value systems","value judgment","value judgments","value judgements","take something at face value"]},{"pos":"verb","level":"B2","meanings":[{"def":"to think that somebody/something is important","examples":["value somebody/something He has come to value her advice and support.","They don’t seem to value honesty very highly.","value somebody/something as something I really value him as a friend.","value somebody/something for something The area is valued for its vineyards.","She's a valued member of staff.","During my illness I learned to value the ordinary things in life.","He hated to be valued for his looks alone.","Housework is negatively valued as a retreat from a disliked alternative—employment work.","I value her very highly as a friend.","Tulips are valued for their beauty.","one of the most socially valued roles in contemporary society—being a parent","the fear of losing the independence that they rightly value","They don't seem to value honesty very highly.","They hold back through fear of losing the independence that they rightly value."],"opposite":"","synonyms":""},{"def":"to decide that something is worth a particular amount of money","examples":["be valued at something The property has been valued at over $2 million.","get something valued You should get the painting valued.","The company has recently been valued at $6 billion.","I took my violin into the shop to get it valued."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]