[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/v/var/varie/variety__us_3.mp3","phonsUS":"/vəˈraɪəti/","level":"A2","meanings":[{"def":"several different sorts of the same thing","examples":["There is a wide variety of patterns to choose from.","He resigned for a variety of reasons.","This tool can be used in a variety of ways.","The text consists of extracts from a variety of sources.","articles and essays on a variety of topics","I don't eat meat, only fish, but there's a good variety available here.","The day-long excursion is one of a variety on offer for tourists.","I was impressed by the variety of dishes on offer.","Menus offer a good variety of seafood.","The market sold a bewildering variety of cheeses.","He has written on a great variety of subjects.","a series of discussions on a variety of issues","The songs are in a variety of styles.","Costs vary widely and depend on a variety of factors.","Visitors are able to enjoy a variety of activities.","State aid can take a variety of forms.","Asbestos was formerly used in a variety of products.","a Toronto company that offers a variety of Web-based services","These goals can be met using a variety of techniques.","The hotel's 104 rooms come in a variety of sizes."],"opposite":"","synonyms":""},{"def":"the quality of not being the same or not doing the same thing all the time","examples":["It's the variety that makes my job so enjoyable.","We all need variety in our diet.","We want more variety in our work.","a constant craving for variety and adventure","The festival demonstrates the variety of the UK music scene.","There is wide variety in shape and colour.","a country of great variety","the rich variety of the local bird life"],"opposite":"","synonyms":""},{"def":"a type of a thing, for example a plant or language, that is different from the others in the same general group","examples":["Apples come in a great many varieties.","variety of something different varieties of English","This is a very rare variety of orchid.","A typical estate in the region will grow at least three grape varieties.","My cooking is of the ‘quick and simple’ variety.","The variety of English that they speak is closer to American than British.","high-yielding varieties of rice","cultivated varieties such as the damask rose","breeders who develop new varieties","Old varieties of rose can be less resistant to diseases.","There are hundreds of different varieties of apple."],"opposite":"","synonyms":""},{"def":"a form of theatre or television entertainment that consists of a series of short performances, such as singing, dancing and funny acts","examples":["a variety show/theatre"],"opposite":"","synonyms":""},{"def":"having a range of different experiences makes life more interesting","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"variety is the spice of life","def":"having a range of different experiences makes life more interesting","examples":[]}],"phrasal":[],"related":["Variety","variety meats","variety store","garden-variety","Variety Club","Royal Variety Performance","variety stores","variety is the spice of life"]},{"pos":"","level":"","meanings":[{"def":"a US newspaper of the entertainment industry, published each week in New York. It includes reviews of plays, films, etc. and special articles about the entertainment world, and is known for its original and informal style of language. It was first published in 1905. From 1933 to 2013 there was a daily edition based in Los Angeles called Daily Variety. Its website features entertainment news, videos and photos.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]