[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/v/var/vary_/vary__us_4.mp3","phonsUS":"/ˈveri/","level":"B2","meanings":[{"def":"to be different from each other in size, shape, etc.","examples":["New techniques were introduced with varying degrees of success.","Estimates of how many civilians were killed varied widely.","Class size varies greatly.","vary in something The students' work varies considerably in quality.","The rooms vary in size.","There are a number of routes to the summit, with varying levels of difficulty.","Personal preference naturally varies.","Services offered vary among the main banks.","The sword hardly varied in form from the 12th to the 15th century.","Gender roles vary across cultures.","The doses used vary between 2 and 10mg/​kg."],"opposite":"","synonyms":""},{"def":"to change or be different according to the situation","examples":["vary with something The menu varies with the season.","vary by something Cancer rates vary significantly by gender and ethnicity.","vary from somebody/something to somebody/something Results can vary greatly from year to year.","Pulse rates vary slightly from person to person.","vary between A and B Class numbers vary between 25 and 30.","Costs are likely to vary depending on where you live.","‘What time do you start work?’ ‘It varies.’","vary according to something Prices vary according to the type of room you require.","Dictionaries are produced with specific markets in mind, and their contents vary accordingly.","Its speed varies from 20 mph to 35 mph.","Prices can vary enormously.","The danger of a heart attack varies with body weight.","The availability of good medical care tends to vary inversely with the need for it.","The drug is available in several forms, and dosages vary accordingly.","The leaf's size varies widely according to the area where it grows.","The rate of growth varies considerably between different industries.","The situation varies slightly from country to country.","The speed of the car hardly varied.","Voting patterns vary geographically.","Voting behaviour varies geographically.","What can be found will inevitably vary according to the area under study.","a study of how moral values vary over time","the continuously varying intensities of natural light"],"opposite":"","synonyms":""},{"def":"to make changes to something to make it slightly different","examples":["The job enables me to vary the hours I work.","The aerobics instructor varies the routine each week.","Consumers may apply to the lender to vary the terms of their contract.","Drivers need to take note of the weather conditions and vary their speed accordingly."],"opposite":"","synonyms":""},{"def":"used to say that people may experience a particular thing in different ways","examples":["Highly recommend the company! Of course, your mileage may vary."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"your mileage may vary","def":"used to say that people may experience a particular thing in different ways","examples":["Highly recommend the company! Of course, your mileage may vary."]}],"phrasal":[],"related":["your mileage may vary","your milage may vary"]}]