[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/v/veh/vehic/vehicle__us_5.mp3","phonsUS":"/ˈviːəkl/","level":"A2","meanings":[{"def":"a thing that is used for transporting people or goods from one place to another, such as a car or lorry","examples":["motor vehicles (= cars, buses, lorries, etc.)","Are you the driver of this vehicle?","The police think that he was driving a stolen vehicle.","rows of parked vehicles","He was seen driving away and his vehicle registration number was given to the police.","Hire a four-wheel-drive vehicle—there are lots of spots to discover off the beaten track.","She was blinded by the lights from an oncoming vehicle.","Sniffer dogs were brought in to follow the men after they abandoned the vehicle in a ditch.","The bus crashed into a stationary vehicle.","The city centre is off-limits to wheeled vehicles.","The president's car was being followed by a convoy of vehicles.","The thieves escaped in a stolen vehicle.","The vehicle was impounded as part of the police investigation.","Total vehicle sales increased 5% from last year.","Two drivers escaped injury when their vehicles collided near Thirsk.","Vehicle crime has dropped by 16%.","a vehicle equipped with a GPS receiver","car owners whose vehicles have been towed (away)","deaths from motor vehicle accidents","taxis and private-hire vehicles","tighter controls on vehicle emissions","vehicles running on biodiesel","vehicles running on lead-free petrol","Tanks and armoured vehicles were used against the rebels.","The paths will separate cycles from motor vehicles.","The photograph had been taken from the window of a moving vehicle.","Thousands of thefts from vehicles are reported every day.","We heard the sound of a vehicle approaching."],"opposite":"","synonyms":""},{"def":"something that can be used to express your ideas or feelings, or as a way of achieving something","examples":["Art may be used as a vehicle for propaganda.","The play is an ideal vehicle for her talents.","The Students' Union is the main vehicle of communication for students in the college.","The play is a perfect vehicle for her talents.","Soccer acts as a vehicle of expression for deprived or disaffected youth."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["motor vehicle","utility vehicle","recreational vehicle","all-terrain vehicle","heavy goods vehicle","sport utility vehicle","Driver and Vehicle Licensing Agency","high-occupancy vehicle lane"]}]