[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/v/ven/ventu/venture__us_1.mp3","phonsUS":"/ˈventʃər/","level":"C1","meanings":[{"def":"a business project or activity, especially one that involves taking risks","examples":["A disastrous business venture lost him thousands of dollars.","The directors of the company refused to undertake such a risky venture.","a cooperative venture by companies at the science park"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["venture on","joint venture","venture into","venture capital","Venture Scout","venture into something","venture on something"]},{"pos":"verb","level":"C1","meanings":[{"def":"to go somewhere even though you know that it might be dangerous or unpleasant","examples":["They ventured nervously into the water.","He's never ventured abroad in his life.","A few people ventured out into the street.","He ventured deeper into the forest.","She ventured cautiously into the room.","She would not have dared venture here alone.","Some of the men ventured farther out to sea.","They never ventured from their buildings after sunset.","They rarely ventured beyond their local market town.","We ventured down to the south coast over the weekend."],"opposite":"","synonyms":""},{"def":"to say or do something in a careful way, especially because it might upset or offend somebody","examples":["venture something She hardly dared to venture an opinion.","He ventured a tentative smile.","venture to do something I ventured to suggest that she might have made a mistake.","+ speech ‘And if I say no?’ she ventured.","venture that… He ventured that the data might be flawed."],"opposite":"","synonyms":""},{"def":"to risk losing something valuable or important if you are not successful at something","examples":["It was wrong to venture his financial security on such a risky deal."],"opposite":"","synonyms":""},{"def":"used to say that you have to take risks if you want to achieve things and be successful","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"nothing ventured, nothing gained","def":"used to say that you have to take risks if you want to achieve things and be successful","examples":[]}],"phrasal":["venture into","venture on"],"related":[]}]