[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/v/ver/versi/version__us_1.mp3","phonsUS":"/ˈvɜːrʒn/","level":"B1","meanings":[{"def":"a form of something that is slightly different from an earlier form or from other forms of the same thing","examples":["version of something the latest version of the software package","an expanded version of the article","The original/final version is vastly superior.","a new/different/modified/revised version","an earlier/a previous version","an updated version of the app","a print/an online version","to create/produce/offer/release/use a version","There are two versions of the game, a long one and a short one.","the DVD version of the film","This amended version of the bill went to the Senate.","an edited version of her speech to the National Press Club in Canberra","the full version of the report","the de luxe/luxury version","I've only played the version for PC.","This is an edited version of the review.","A future version of the camera is currently being developed.","Keep a copy of the rough version of your essay.","Only one newspaper printed the full version of the speech.","The company will roll out an enhanced version of its operating system in the new year.","The new version comes out in June.","Theirs is a watered-down version of socialism.","This is the official version of the painter's biography.","You can download a free trial version from the website.","a more advanced version of the initial concept","versions for home users, businesses, and students","an earlier version of this computer software","the Japanese-language version of the software","the final version of the architectural plans","the less expensive generic version of the drug","the latest version of the Volkswagen Golf"],"opposite":"","synonyms":""},{"def":"a film, play, piece of music, etc. that is based on a particular piece of work but is in a different form, style or language","examples":["version of something the film version of ‘War and Peace’","The English version of the novel is due for publication next year.","He also starred in the stage version.","an animated version of the story","an instrumental version of the song","The piece also exists in a version for two pianos.","an abridged version for children","He wrote his own version of the legend.","The film version does not live up to the original novel.","The children read the novel in its abridged version."],"opposite":"","synonyms":""},{"def":"a description of an event from the point of view of a particular person or group of people","examples":["We have no way of knowing which version is true.","version of what, how, etc… She gave us her version of what had happened that day.","Their versions of how the accident happened conflict.","version of something She agreed to give her version of events to journalists.","Each side has its own version of the truth.","Are these newspaper reports true?","It was many years before the full story was made public.","the front-page story","She gave the police a full account of the incident.","She gave us her version of what had happened that day."],"opposite":"","synonyms":"report"}],"idioms":[],"phrasal":[],"related":["alpha version","beta version","cover version","Authorized Version","Revised Version","American Standard Version","Revised Standard Version"]}]