[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/v/vic/victo/victory__us_1.mp3","phonsUS":"/ˈvɪktəri/","level":"B2","meanings":[{"def":"success in a game, an election, a war, etc.","examples":["to win a narrow victory","The outcome left both sides claiming victory.","an election victory","Neither side is strong enough to achieve a military victory.","victory in something a decisive/landslide victory in the election","She is confident of victory in Saturday's final.","victory over somebody/something The team are celebrating a 3–2 victory over Poland.","victory against somebody/something He hopes to lead his side to victory against Australia.","victory for somebody/something The case is being seen as a victory for freedom of speech.","a victory speech/celebration/parade","A goal in the final seconds of the game sealed their victory.","Any mistake by the Democrats could deliver a Republican victory.","Bush barely eked out a victory in 2000.","He saw it as a small victory over the increasingly repressive policies.","He surprised the nation with an upset victory over the incumbent leader.","His party won a landslide victory in the elections.","Of their nine consecutive victories, five have been at home.","She made a victory sign with her two fingers.","The Dutch champions were denied victory in a tough 2–2 draw at Porto.","The England cricket team has tasted victory for the first time this season.","The Hungarians pulled off a surprise victory against the Italian champions.","The army won the decisive victory that changed the course of the war.","The case was hailed as a victory for the common man.","The winners took a victory lap after the race.","They would do anything to ensure victory for themselves.","They would do whatever lay in their power to ensure victory for themselves.","This series of bloodless victories won him widespread domestic support.","Union leaders hailed the socialists' victory as a huge step forward.","a 98 000-vote victory margin","a victory against Fascism","their resounding victory over England","Chelmsford finished 10 runs short of victory.","It represented a significant political victory for Williamson.","Neither side has yet claimed outright victory.","The team is aiming for a hat-trick of victories in Germany this weekend."],"opposite":"","synonyms":""},{"def":"to win something easily","examples":["He swept to victory in the final of the championship.","Labour swept to victory in the 1945 election."],"opposite":"","synonyms":""},{"def":"to win something even though it seemed up until the last moment that you would lose","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"roar, romp, sweep, etc. to victory","def":"to win something easily","examples":["He swept to victory in the final of the championship.","Labour swept to victory in the 1945 election."]},{"idiom":"snatch victory from the jaws of defeat","def":"to win something even though it seemed up until the last moment that you would lose","examples":[]}],"phrasal":[],"related":["Victory","moral victory","Pyrrhic victory","Victory at Sea","sweep to victory","romp home/to victory","snatch victory from the jaws of defeat"]}]