[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/v/vic/victi/victim__us_1.mp3","phonsUS":"/ˈvɪktɪm/","level":"B1","meanings":[{"def":"a person who has been attacked, injured or killed as the result of a crime, a disease, an accident, etc.","examples":["murder/rape victims","She was the innocent victim of an arson attack.","victims of crime/abuse/violence","the alleged victim of a serious assault","Several countries have pledged millions of dollars to help the victims of the tsunami .","The team will try to identify potential victims of domestic violence.","accident/disaster victims","flood/earthquake/hurricane victims","AIDS/cancer/stroke/heart attack victims","families/relatives of the victims","expressions of sympathy for the victims and their families","He made a victim impact statement to the court.","Boys are the primary victims of corporal punishment.","He managed to lure victims into his car.","He targeted younger victims, often single women.","In his fantasies, women became passive and sometimes even willing victims.","In his trial, he tried to portray himself as the victim of an uncaring society.","Not all victims have been identified yet.","Stop playing the victim—you knew exactly what was happening.","The cut in benefits for the unemployed is a classic case of blaming the victim.","The government is sending aid to flood victims.","The helpline takes calls from child-abuse victims.","The intended victims were selected because they seemed vulnerable.","The train crash claimed its tenth victim yesterday when the driver died in hospital.","The victim suffered severe cuts to the upper lip.","This victim mentality is sadly all too prevalent in our country.","a bill aimed at compensating victims of air pollution","a service to remember the victims of the terrorist attacks","groups claiming victim status","the child victims of the war","the failure to protect domestic-violence victims","A new programme will assist stroke victims for whom mobility has become difficult.","AIDS victims are prone to pick up infections.","He shouldn't feel ashamed—he was an innocent victim."],"opposite":"","synonyms":""},{"def":"a person who has been tricked","examples":["They were the victims of a cruel hoax.","The site offers help and advice for anyone who has been the victim of a scam.","ways to avoid becoming a victim of fraud","She defrauded her unsuspecting victims of millions of pounds.","He defrauded his innocent victims of millions of pounds.","Tourists are easy victims for pickpockets."],"opposite":"","synonyms":""},{"def":"a person or thing that is badly affected by a situation, a decision, etc.","examples":["Schools are the latest victims of cuts in public spending.","The small company became a victim of its own success when it could not supply all its orders on time."],"opposite":"","synonyms":""},{"def":"an animal or a person that is killed and offered as a sacrifice","examples":["a sacrificial victim"],"opposite":"","synonyms":""},{"def":"to be injured, cheated, damaged or killed by somebody/something","examples":["Many plants have fallen victim to the sudden frost.","Her son fell victim to tuberculosis.","Unfortunately, she fell victim to an unscrupulous landlord."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"fall victim (to something)","def":"to be injured, cheated, damaged or killed by somebody/something","examples":["Many plants have fallen victim to the sudden frost.","Her son fell victim to tuberculosis.","Unfortunately, she fell victim to an unscrupulous landlord."]}],"phrasal":[],"related":["fashion victim","victim support"]}]