[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/v/vid/video/video__us_1.mp3","phonsUS":"/ˈvɪdiəʊ/","level":"A1","meanings":[{"def":"a system of recording moving pictures and sound, either using a digital method of storing data or (in the past) using videotape","examples":["A wedding is the perfect subject for video.","on video The robbery was captured on video.","Most of the movie was shot on digital video.","I can't find the video channel on this television.","The jury watched video footage of the riots.","The speech was broadcast via a video link to thousands standing outside.","Video files can be readily transmitted over digital broadband.","You need a broadband internet connection to stream video online."],"opposite":"","synonyms":""},{"def":"a short film or recording of an event, made using digital technology and viewed on a computer, especially over the internet","examples":["The school made a short promotional video.","More than a million people have watched a video of the incident.","She posted a series of videos on the internet.","Upload your videos and share them with friends and family online.","This phone can store up to 20 hours of video.","a security video of the attack","This article and the accompanying video takes you through each stage step by step.","Their teacher showed them a video about the Inuit.","He posted a video on his website","An amateur video of the crash failed to reveal the cause.","You can view and share video clips on this website."],"opposite":"","synonyms":""},{"def":"a short film made by a pop or rock band to be shown with a song when it is played on television or online","examples":["The group's new video will be released next month.","The band are in Iceland doing a video shoot."],"opposite":"","synonyms":""},{"def":"a type of magnetic tape used in the past for recording moving pictures and sound; a box containing this tape, also called a video cassette","examples":["on video The movie was released on video later that year.","The thief was caught on video as he pocketed watches and rings.","They used to sell both blank and pre-recorded videos."],"opposite":"","synonyms":""},{"def":"a copy of a film, programme, etc. recorded on videotape","examples":["We used to rent videos nearly every weekend."],"opposite":"","synonyms":""},{"def":"a piece of equipment used, especially in the past, to record and play films and TV programmes on video","examples":["I never even learned to programme the video."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["music video","video card","video diary","video game","video nasty","video arcade","video camera","video jockey","Video Nation","video cassette recorder","video cards","video games","video cameras","video diaries","video jockeys","video nasties"]},{"pos":"verb","level":"","meanings":[{"def":"to record moving pictures and sound, either using a digital method of storing data or (in the past) using videotape","examples":["Videoing students can be a useful teaching exercise."],"opposite":"","synonyms":""},{"def":"to record a television programme using a vcr (= video cassette recorder)","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]