[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/v/vie/viewe/viewer__us_1.mp3","phonsUS":"/ˈvjuːər/","level":"B1","meanings":[{"def":"a person watching television or a video on the internet","examples":["The programme attracted millions of viewers.","British television viewers saw him this week in a BBC documentary.","The average American TV viewer spends five hours a day watching the small screen.","an attempt to attract younger viewers","Her performance has grabbed the attention of 100 million YouTube viewers.","viewer of something a regular viewer of the show","BBC viewers saw the prime minister lose his cool on last night's ‘Question Time’.","Hundreds of viewers called in to complain after the show.","It is estimated that four million viewers watched the programme.","Many producers have a low opinion of the average viewer's intelligence.","More than six million viewers tuned in to see the game.","Most cable viewers have a few channels that they watch regularly.","TV viewers saw the giant funnel of a tornado speeding across the fields.","The announcer informed viewers that programmes would be running late.","The announcer informed viewers that the game had been postponed.","The evening news is to change its serious image in a bid to attract more viewers.","The first series is probably the one best remembered by fans and casual viewers alike.","The new sitcom has been a big hit with viewers.","The presenter's style may alienate some viewers.","Viewers can vote for their favourite/​favorite performer.","We want to present viewers with something they haven't seen before.","While fewer people are attending football matches, armchair viewers are growing in number.","a major new drama series that looks set to shock television viewers","attempts to lure younger viewers to the channel"],"opposite":"","synonyms":""},{"def":"a person who looks at or considers something","examples":["Some of her art is intended to shock the viewer.","Many informed viewers of the current political scene are becoming critical of the government."],"opposite":"","synonyms":""},{"def":"a device for looking at slides (= photographs on special film), for example a small box with a light in it","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]