[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/v/vio/viole/violence__us_1.mp3","phonsUS":"/ˈvaɪələns/","level":"B2","meanings":[{"def":"violent behaviour that is intended to hurt or kill somebody","examples":["Police do not think this killing was a random act of violence.","violence against somebody He condemned the protesters' use of violence against the police.","domestic violence (= between family members)","These people live under a constant threat of violence.","Our organization works with victims of violence.","Why do they always have to resort to violence?","Violence broke out inside the prison last night.","Violence erupted between police and demonstrators.","Is there too much sex and violence on TV?","Charlie was threatening violence against them both.","Children who witness violence between parents often develop problems.","Don't buy toys that glorify violence.","Hatred breeds violence.","He had a short temper and was prone to outbursts of violence.","In spite of sporadic violence, polling was largely orderly.","It was a predictable death for a man who had lived a life of violence.","Letters poured in complaining about the gratuitous violence on the show.","Observers have warned that the violence could escalate into armed conflict.","Political violence killed 29 people last week.","She had suffered years of violence and abuse.","TV violence threatens the health and welfare of young people.","The demonstration was marred by violence.","The enthusiasm of the protest spilled over into violence.","The former leader of the terrorist group has called for an end to the violence.","The peasants believed their only choice was to resort to violence.","The police are bracing themselves for an outbreak of violence.","There are fears of fresh violence if the strike continues.","There was surprisingly little graphic violence in the film.","They use their religion to justify violence","Troops were called in to quell the violence.","UN peacekeepers are struggling to contain the escalating violence.","Under no circumstances should police use violence against protesters.","We are all capable of violence in certain circumstances.","We have to make people realize that violence only begets more violence.","We need to bring an end to the deadly violence in the region.","a refuge for victims of domestic violence","a wave of violence against women","attempts to rescue the country from endemic violence","people who inflict violence on animals","the men of violence who start wars","violence among football supporters","violence among young men","violence between rival groups","violence perpetrated by the army","violence towards ethnic minorities","violence within the family"],"opposite":"","synonyms":""},{"def":"physical or emotional force and energy","examples":["The violence of her feelings surprised him.","the violence of the eruption","He reacted to the idea with some violence."],"opposite":"","synonyms":""},{"def":"to damage something or have a bad effect on it","examples":["This version of the play does violence to Shakespeare's text."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"do violence to something","def":"to damage something or have a bad effect on it","examples":["This version of the play does violence to Shakespeare's text."]}],"phrasal":[],"related":["non-violence"]}]