[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/v/vis/visio/vision__us_1.mp3","phonsUS":"/ˈvɪʒn/","level":"B2","meanings":[{"def":"the ability to see; the area that you can see from a particular position","examples":["to have good/perfect/poor/blurred/normal vision","Cats have good night vision.","Her vision was still blurry.","The disease causes a gradual loss of peripheral vision.","He glimpsed something on the edge of his vision.","He looked up the street, but there was no one in sight.","Leave any valuables in your car out of sight.","The lake soon came into view.","The couple moved outside her field of vision (= total area you can see from a particular position).","Her vision cleared and she realized Niall was standing beside her.","I can read without glasses, but my distance vision is poor.","She was aware of shapes moving across her field of vision.","The eye test shows she has perfect vision.","The high driving position gives excellent all-round vision.","The rain prevented her having clear vision of the road ahead.","The tears blurred her vision."],"opposite":"","synonyms":"sight"},{"def":"an idea or a picture in your imagination","examples":["Our job is to guide a client and develop a strategic vision.","vision of somebody/something He had a vision of a world in which there would be no wars.","The word conjures up visions of home and family.","The film's vision of the future is bleak.","vision of doing something He harboured visions of becoming party leader some day.","vision of somebody/something doing something I had visions of us getting hopelessly lost.","vision for somebody/something These two men share a similar vision for the country.","He had a very specific vision for the future.","They share a common vision for the development of health services.","The word ‘island’ conjures up a vision of a relaxing summer holiday.","a vision for the future","an alternative vision of society","an apocalyptic vision of the end of civilization","The name ‘Las Vegas’ conjures up a vision of casinos.","The engineers had a clear vision of what they wanted to achieve.","The company needs to develop a global vision.","He outlined his vision for the new economic order.","The new leader set about imposing his vision on the party."],"opposite":"","synonyms":""},{"def":"a dream or similar experience, especially of a religious kind","examples":["in a vision The idea came to her in a vision.","He had visions regularly.","vision of somebody/something She claimed she saw a vision of the Virgin Mary.","A young girl in the town experienced a prophetic vision.","As he approached, the vision faded and there was no one there."],"opposite":"","synonyms":""},{"def":"the ability to think about or plan the future with great imagination and intelligence","examples":["She had vision and determination.","a leader of vision","He's a competent politician, but he lacks vision.","a statesman of great vision","His plans for the country's future show a remarkable breadth of vision."],"opposite":"","synonyms":""},{"def":"a person of great beauty or who shows the quality mentioned","examples":["She was a vision in white lace.","a vision of loveliness"],"opposite":"","synonyms":""},{"def":"the picture on a television or cinema screen","examples":["We apologize for the loss of vision."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["double vision","tunnel vision","vision mixer","20/20 vision","field of vision","twenty-twenty vision","vision mixers","line of vision","fields of vision","twenty-twenty-vision"]}]