[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/v/vis/visit/visit__us_1.mp3","phonsUS":"/ˈvɪzɪt/","level":"A1","meanings":[{"def":"to go to see a person or a place for a period of time","examples":["My parents are coming to visit me next week.","to visit friends/family","It looks like a lovely place to visit.","to visit a country/city/town","to visit a museum/shrine","to visit a hospital/an office","to visit a home/house","She went to visit relatives in Wales.","The Prime Minister is visiting Japan at the moment.","You should visit your dentist at least twice a year.","This is an area rarely visited by Europeans.","I first visited New York in 1991.","He is planning to visit China later this month.","The best time to visit is during the winter dry season.","A million people are expected to visit the museum over the next 12 months.","We've just been to visit my grandparents.","Be sure to visit us next time you're in London.","I visited her in hospital.","Jason invited us to visit his ranch.","Next time you visit the States you'll have to come and see us.","She's gone to visit her mother in Texas.","The President will be visiting six European capitals.","The shops are a major reason for visiting the city.","The president recently visited Athens.","She regularly visits the cemetery to tend the grave of her son."],"opposite":"","synonyms":""},{"def":"to go to a website on the internet","examples":["For more information, visit our website.","to visit a site/page"],"opposite":"","synonyms":""},{"def":"to stay somewhere for a short time","examples":["We don't live here. We're just visiting.","visit something Ships visit the island occasionally.","The lake is also visited by seals in the summer."],"opposite":"","synonyms":""},{"def":"to make an official visit to somebody, for example to perform checks or give advice","examples":["Government inspectors are visiting schools in the area.","Council officers will be visiting premises to inspect safety arrangements."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["visit on","visit upon","visit with"],"related":["visit on","visit upon","visit with","flying visit","return visit","conjugal visit","courtesy visit","visit with somebody","visit something on somebody/something","visit something upon somebody/something"]},{"pos":"noun","level":"A1","meanings":[{"def":"an occasion or a period of time when somebody goes to see a place or person and spends time there","examples":["a two-day/three-day visit","the prime minister's surprise visit to the troops","an official/state visit","visit to somebody/something It's my first visit to New York.","If you have time, pay a visit to the local museum.","The family made a visit to England in the summer of 1923.","a visit to the doctor","His visits home were limited to Christmas.","visit from somebody We had a visit from the police last night.","visit by somebody Arranegments are being made for a visit by a member of the royal family.","(British English) a home visit (= when your doctor visits you)","a brief/recent visit","on/during a visit The team reported on deficiencies found during the site visit.","Regular visits to the dentist are important.","Is this a social visit, or is it business?","They're on an exchange visit to France.","Following this initial visit, she will return to Montserrat in June.","Following her letter of complaint, she received a personal visit from the store manager.","He offered her a drink to try to prolong her visit.","He was forced to cut short a visit to North America.","How many doctors are still able to make home visits?","I think it's time we paid him a little visit.","I'd been looking forward to my cousin's visit for ages.","If you're staying in Rome, Ostia is well worth a visit.","On one of her regular visits home, she told her parents she was engaged.","Pay us a visit next time you're in town.","She enjoyed the frequent visits of her grandchildren.","The President has been briefed in preparation for his forthcoming visit to Russia.","The visit signalled the normalization of relations between the two countries.","We had a visit from somebody collecting for charity.","We received a letter announcing a visit from government inspectors.","We used to go on school visits to museums and historical buildings.","While on holiday in Italy, the prime minister paid a courtesy visit to his opposite number in Rome.","You should receive a home visit from your midwife within a month.","a visit to the dentist","Allow three hours for your visit.","Enjoy your visit!","Is this a social visit or are you here on business?","Is this your first visit to New York?","She was making one of her frequent visits to London.","The inspectors paid a surprise visit to the factory.","The prime minister is on an official visit to Jamaica.","They received a visit from the party leader.","We had to cut short our visit and fly home."],"opposite":"","synonyms":""},{"def":"an occasion when somebody looks at a website on the internet","examples":["visit to something Visits to our website have doubled in a year.","The site now gets about 600,000 visits a day."],"opposite":"","synonyms":""},{"def":"an occasion when two or more people meet to talk in an informal way","examples":["He thought back to his visit with the doctor."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]