[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/v/vis/visit/visitor__us_1.mp3","phonsUS":"/ˈvɪzɪtər/","level":"A1","meanings":[{"def":"a person who visits a person or place","examples":["We've got visitors coming this weekend.","Do you get many visitors?","The theme park attracts 2.5 million visitors a year.","visitor to something She's a frequent visitor to the US.","We have been regular visitors to the island for 20 years.","visitor from something The festival draws visitors from all over the world.","a visitor centre/attraction","First-time visitors to Spain are often surprised by how late people eat.","I could see he was expecting visitors.","Pick up a free map of the town from the visitor centre.","The college only admits visitors in organized groups.","The festival brings 5 000 visitors to the town every year.","The front room was used mainly for entertaining visitors.","The lack of facilities in the town may deter the casual visitor.","The latest crime figures are likely to put off prospective visitors to the city.","The museum gives visitors a glimpse of the composer's life.","The town has much to interest the visitor.","Visitors are invited to browse around the farm site.","Visitors flocked to see the show.","Visitors from Ireland will find much that reminds them of home.","He introduced his companion, a visitor from the US.","He is still in hospital and is not well enough to receive visitors.","He was a frequent visitor to the house in Wimpole Street.","I'm expecting visitors this evening.","The castle is the main attraction for visitors.","The family rarely had visitors.","The hotel is popular with business visitors and tourists.","The mild climate allows visitors to enjoy golf all year round.","The palace is open to visitors from April to September.","There has been a drop in visitor numbers.","There was nowhere in the house for them to entertain visitors.","They publish a guide to Europe for overseas visitors.","Visitors flock to the town every summer.","When I arrived home there was an unexpected visitor waiting for me.","You can watch a film about the history of the site in the visitor centre.","You've got a visitor!"],"opposite":"","synonyms":""},{"def":"a person who looks at a website on the internet","examples":["How can we attract more visitors to our website?"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["health visitor","prison visitor"]}]