[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/v/vol/volum/volume__us_2_rr.mp3","phonsUS":"/ˈvɑːljəm/","level":"B2","meanings":[{"def":"the amount of space that an object or a substance fills; the amount of space that a container has","examples":["volume of something How do you measure the volume of a gas?","In the experiment, lighted candles were put under jars of different volumes.","Patients showed an improvement in lung volume.","Wait until the dough doubles in volume before kneading it again.","They sell screws and nails by volume.","the total volume of the containers","two gallons in volume","The volume of the ocean basins has fluctuated over time.","What volume of water would be needed to fill the aquarium?"],"opposite":"","synonyms":""},{"def":"the amount of something","examples":["volume of something the sheer volume (= large amount) of business","New roads are being built to cope with the increased volume of traffic.","Sales volumes fell 0.2% in June.","The total volume of exports fell by 14.5 per cent.","an attempt to increase the volume of trade","powerful computers that can handle large volumes of data","This work has grown in volume recently.","Due to the volume of mail Mary receives, she may not be able to respond to individual inquiries.","We were attracting a volume of business that, frankly, we could not handle.","We had to work hard to keep up with the sheer volume of business.","These cars are still being produced, but in much smaller volumes than before.","The paperwork has grown in volume recently.","New roads are being built to cope with the high volumes of traffic.","He managed to get through a considerable volume of work.","The sheer volume of fiction produced is staggering.","Sales volume has doubled since 1999.","Sales have doubled in volume."],"opposite":"","synonyms":""},{"def":"the amount of sound that is produced by a television, radio, etc.","examples":["to turn the volume up/down","at a volume This music is best played at very high volume.","The song has been recorded at a low volume.","He adjusted the volume on his phone.","The car stereo was on at full volume.","the volume control on the television","Make sure the volume control is in the middle between the ‘low’ and ‘high’ settings.","Move the slider upwards to increase the volume level.","She turned down the volume on the car stereo."],"opposite":"","synonyms":""},{"def":"a book that is part of a series of books","examples":["an encyclopedia in 20 volumes","The encyclopedia is a huge work, running to 20 volumes.","a companion volume to the one on African wildlife"],"opposite":"","synonyms":""},{"def":"a book","examples":["a library of over 50 000 volumes","She published her first book, a slim volume of poetry, at the age of sixteen.","Her poems are now available in a single volume.","Only a library would have this rare volume.","a forty-page, glossy volume about the company's products","a library full of bound volumes","a volume of short stories","a volume on ancient history","a slim/​thick volume"],"opposite":"","synonyms":""},{"def":"a series of different issues of the same magazine, especially all the issues for one year","examples":["‘New Scientist’ volume 142, number 3"],"opposite":"","synonyms":""},{"def":"to tell you a lot about something/somebody, without the need for words","examples":["His achievement speaks volumes for his determination.","What you wear speaks volumes about you."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"speak volumes (about/for something/somebody)","def":"to tell you a lot about something/somebody, without the need for words","examples":["His achievement speaks volumes for his determination.","What you wear speaks volumes about you."]}],"phrasal":[],"related":[]}]