[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/v/vol/volun/volunteer__us_1.mp3","phonsUS":"/ˌvɑːlənˈtɪr/","level":"B1","meanings":[{"def":"a person who does a job without being paid for it","examples":["Schools need volunteers to help children to read.","She does volunteer work at an orphanage.","volunteer for/with something She was a volunteer for the Red Cross before training as a nurse.","Volunteers from various organizations are working to save the lives of the earthquake victims.","a volunteer firefighter","volunteer helpers/carers","The Centre is run by a group of dedicated volunteers.","He worked as a volunteer for Oxfam.","The office is staffed by unpaid volunteers.","The support our volunteers provide cannot be measured in purely practical terms."],"opposite":"","synonyms":""},{"def":"a person who offers to do something without being forced to do it","examples":["Are there any volunteers to help clear up?","For my next trick, I'll need a volunteer from the audience.","The company is looking for volunteers to take part in a trial.","Hundreds of volunteers have come forward to offer their help.","No volunteers came forward.","The charity is appealing for volunteers to take elderly patients to and from hospital.","The local community provided volunteers to repair the road.","We can't get any volunteers to help in the gardens."],"opposite":"","synonyms":""},{"def":"a person who chooses to join the armed forces without being forced to join","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Ulster Volunteer Force","Volunteer Reserve Forces"]},{"pos":"verb","level":"B1","meanings":[{"def":"to offer to do something without being forced to do it or without getting paid for it","examples":["He has been volunteering for 11 years now.","volunteer to do something Jill volunteered to organize a petition.","I volunteered to help clean up the beach.","volunteer for something Several staff members volunteered for early retirement.","volunteer as something He volunteered as a translator for Spanish-speaking patients.","volunteer something Workers volunteer their time, as no funds are available to pay professional staff.","volunteer something as something He volunteered his services as a driver.","volunteer something for something She has been volunteering her computer skills for the foundation.","Barbara has kindly volunteered to lead the session.","David graciously volunteered to model for the art class.","We volunteered as witnesses."],"opposite":"","synonyms":""},{"def":"to suggest something or tell somebody something without being asked","examples":["volunteer something to volunteer advice","Nobody asked her, and she didn't volunteer any information.","+ speech ‘I could lend you some books,’ he volunteered."],"opposite":"","synonyms":""},{"def":"to join the army, etc. without being forced to","examples":["He wasn't conscripted. He volunteered.","volunteer for something to volunteer for military service","I volunteered for service in the Air Force.","volunteer to do something More than a hundred thousand Irish men and women volunteered to serve in the British armed forces during World War II."],"opposite":"","synonyms":""},{"def":"to suggest somebody for a job or an activity, even though they may not want to do it","examples":["volunteer somebody (for/as something) They volunteered me for the job of interpreter.","volunteer somebody to do something Her dad had volunteered her to help put away the equipment."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]