[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/v/vot/vote_/vote__us_1.mp3","phonsUS":"/vəʊt/","level":"B1","meanings":[{"def":"a formal choice that you make in an election or at a meeting in order to choose somebody or decide something","examples":["to win/lose votes","You can cast your vote at the local polling station.","He took 53% of the votes in the election.","They've started opening the ballot boxes and counting the votes.","No candidate gained a majority of the votes in the first round.","The Tory candidate received only 4203 votes.","vote for/against somebody/something There were 21 votes for and 17 against the motion, with 2 abstentions.","The motion was passed by 6 votes to 3.","The Green candidate won over 3 000 of the 14 000 votes cast.","Everyone's vote counts.","The chairperson has the deciding vote.","It's a cynical attempt to get votes at the next election.","They do not yet have the votes needed to pass the bill.","The party received its lowest number of votes since 1935.","He won the seat thanks to Polish block votes.","My vote will go to the party that addresses crime.","The bill was passed by a single vote.","They want to persuade voters to change their vote.","Votes are still being counted.","Mr Olsen was approved by a vote of 51–47.","a vote for the government","an overwhelming vote in favour of autonomy","factors that could swing the vote against the president"],"opposite":"","synonyms":""},{"def":"an occasion when a group of people vote on something","examples":["to win/lose a vote","vote on something to have/take/hold a vote on an issue","vote in favour of something We saw today a decisive vote in favour of (= for) industrial action.","The issue was put to the vote.","The vote was unanimous.","vote to do something He called on the government to delay the vote to authorize miltary action.","Decisions have to be ratified by a majority vote.","Who did you vote for in the last election?","They took a vote on who should go first.","They suffered a defeat at the polls.","The leader will be chosen by secret ballot.","They took a vote on who should be their new leader.","I think it's time to put this issue to the vote.","When will we know the outcome of the vote?","We should put the resolution to the vote.","We took a quick vote to decide on a leader.","Let's take a vote on the issue.","Any senator can force a vote on virtually any proposal.","Members are elected by direct vote.","Members of Parliament will have a free vote on this bill.","The law was ratified by popular vote.","a vote on the new law"],"opposite":"","synonyms":"election"},{"def":"the right to vote, especially in political elections","examples":["In Britain and the US, people get the vote at 18.","How many years is it since women have had the vote?","legislation to give prisoners the vote"],"opposite":"","synonyms":""},{"def":"the total number of votes in an election","examples":["She obtained 40% of the vote.","The party increased their share of the vote.","Our candidate polled only 10% of the vote.","The party's vote fell by 6%."],"opposite":"","synonyms":""},{"def":"the vote given by a particular group of people, or for a particular party, etc.","examples":["the student vote","the Labour vote","the Hispanic/Latino vote","Bush had courted the military vote.","the party that split the Republican vote","Ferrer got 84% of the Hispanic vote."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["vote in","vote off","vote out","free vote","vote bank","vote down","vote into","vote onto","block vote","postal vote","swing vote","casting vote","popular vote","protest vote","vote out of","vote through","alternative vote","electoral vote","vote of thanks"]},{"pos":"verb","level":"B1","meanings":[{"def":"to show formally by marking a paper, raising your hand, using a voting machine, etc. which person you want to win an election, or which plan or idea you support","examples":["How did you vote at the last election?","Only about half of the electorate bothered to vote.","vote for/against somebody/something to vote for a candidate/party/bill","Did you vote for or against her?","vote in favour of something Over 60% of members voted in favour of (= for) the motion.","vote on something We'll listen to the arguments on both sides and then vote on it.","About 1.8 million people voted in the election.","vote something We voted Democrat in the last election.","to vote yes/no","vote to do something The board voted unanimously not to file for bankruptcy.","The Senate voted overwhelmingly to retain sanctions.","Parliament voted to set up an independent inquiry into the matter.","vote that… The meeting voted that the town council should reject the scheme.","Everyone over 18 has the right to vote.","to be registered/eligible to vote","Her party voted with the government.","Parliament is to vote on tobacco advertising tomorrow.","She returned home in order to vote in the elections.","Stockholders have the right to vote on the proposal.","The Senate voted narrowly to continue funding the plan.","The committee voted in favour of the plan.","The committee voted unanimously to accept the plans.","The proposals were formally voted upon.","They all voted for the new tax.","They voted 15 to 2 to accept the offer.","They voted overwhelmingly against the proposal.","They voted yes to the agreement.","young people who are eligible to vote for the first time"],"opposite":"","synonyms":""},{"def":"to choose somebody/something for a position or an award by voting","examples":["He was voted most promising new director.","The College of Cardinals voted him Pope.","The New York Film Critics Circle voted it their Best Picture of the Year."],"opposite":"","synonyms":""},{"def":"to say that something is good or bad","examples":["The event was voted a great success."],"opposite":"","synonyms":""},{"def":"to agree to give somebody/yourself something by voting","examples":["The directors have just voted themselves a huge pay increase."],"opposite":"","synonyms":""},{"def":"to suggest something or support a suggestion that somebody has made","examples":["I vote (that) we go out to eat."],"opposite":"","synonyms":""},{"def":"to show what you think about something by going or not going somewhere","examples":["Shoppers voted with their feet and avoided the store."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"vote with your feet","def":"to show what you think about something by going or not going somewhere","examples":["Shoppers voted with their feet and avoided the store."]}],"phrasal":["vote down","vote in","vote into","vote off","vote onto","vote out","vote out of","vote through"],"related":[]}]