[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/wag/wage_/wage__us_1.mp3","phonsUS":"/weɪdʒ/","level":"B2","meanings":[{"def":"a regular amount of money that you earn, usually every week or every month, for work or services","examples":["wage/wages of something wages of £300 a week","a weekly wage of £300","an hourly/a daily/a monthly wage","Workers in these stores earn a good wage.","We all hope we can find a job that pays a decent wage.","Wages were paid on Fridays.","They are prepared to work for wages well below the legal minimum.","The average wage for unskilled workers is very low.","on… wages There are extra benefits for people on low wages.","Workers have been on strike for higher wages since October.","Tax and insurance are deducted from your wages.","low/minimum wage earners","wage cuts","a wage increase of 3%","(British English also) a wage rise of 3%","wage demands/claims/settlements","The staff have agreed to a voluntary wage freeze (= a situation in which wages are not increased for a time).","people on low incomes","a weekly wage of £200","The job offers good rates of pay.","a rise in average earnings for factory workers","Full employment pushed up wages.","He busked to supplement his meagre wages.","He made a good wage as a trader.","How can you live on such a low wage?","Markets set the wages.","Real wages fell last year, when inflation is taken into account.","Semi-skilled tradesmen began to demand higher wages.","She earns a good wage at the factory.","Staff shortages have put an upward pressure on wages.","The government promised greater tax cuts in return for continued wage restraints.","The prevailing wage is generally determined by local union rates.","The store argues that it offers competitive wages.","The union submitted a wage claim for a 9% rise.","They docked his wages for arriving at work two hours late.","Women's wages were lower than men's.","a basic wage of £100 a week plus tips","my life as a corporate wage slave","the wage gap between men and women","to receive reimbursement for lost wages","wage differentials between large and small companies","He gets a weekly wage of £300.","He receives weekly wages of £300."],"opposite":"","synonyms":"income"}],"idioms":[],"phrasal":[],"related":["wage gap","living wage","wage earner","wage packet","wage slave","minimum wage","wage slaves","wage earners"]},{"pos":"verb","level":"","meanings":[{"def":"to begin and continue a war, a battle, etc.","examples":["wage something The rebels have waged a guerrilla war since 2007.","He made the decision to wage war.","wage something against/on somebody/something He alleged that a press campaign was being waged against him."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]