[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/wak/wake_/wake__us_1.mp3","phonsUS":"/weɪk/","level":"A1","meanings":[{"def":"to stop sleeping; to make somebody stop sleeping","examples":["I always wake early in the summer.","Tom woke with a start and lifted his head.","wake up What time do you usually wake up in the morning?","I woke up an hour earlier than I wanted to.","wake to something (formal) They woke to a clear blue sky.","I woke to the sound of heavy rain outside.","wake from something (formal) She had just woken from a deep sleep.","wake up to do something He woke up to find himself alone in the house.","wake to do something The woman woke to see the defendant in her bedroom.","wake somebody I was woken by the sound of someone moving around.","wake somebody up Try not to wake the baby up.","Any minute now she'd wake up to find herself at home safe in bed.","Be careful not to wake the children!","She had just woken up from a deep sleep.","She had woken even earlier than usual."],"opposite":"","synonyms":""},{"def":"to make somebody remember something or feel something again","examples":["The incident woke memories of his past sufferings."],"opposite":"","synonyms":""},{"def":"used to tell somebody to become aware of what is really happening in a situation, especially when this is something unpleasant","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"wake up and smell the coffee","def":"used to tell somebody to become aware of what is really happening in a situation, especially when this is something unpleasant","examples":[]}],"phrasal":["wake up","wake up to"],"related":["wake up","wake up to","Finnegans Wake","wake-up call","Hereward the Wake","wake-up calls","wake somebody","wake up to something","wake up and smell the coffee","in the wake of somebody/something"]},{"pos":"noun","level":"","meanings":[{"def":"an occasion before or after a funeral when people gather to remember the dead person, traditionally held the night before the funeral to watch over the body before it is buried","examples":[],"opposite":"","synonyms":""},{"def":"the track that a boat or ship leaves behind on the surface of the water","examples":[],"opposite":"","synonyms":""},{"def":"coming after or following somebody/something","examples":["There have been demonstrations on the streets in the wake of the recent bomb attack.","A group of reporters followed in her wake.","The storm left a trail of destruction in its wake."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in the wake of somebody/something","def":"coming after or following somebody/something","examples":["There have been demonstrations on the streets in the wake of the recent bomb attack.","A group of reporters followed in her wake.","The storm left a trail of destruction in its wake."]}],"phrasal":[],"related":[]}]