[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/wan/wande/wander__us_1.mp3","phonsUS":"/ˈwɑːndər/","level":"B2","meanings":[{"def":"to walk slowly around or to a place, often without any particular sense of purpose or direction","examples":["+ adv./prep. She wandered aimlessly around the streets.","We wandered back towards the car.","wander something The child was found wandering the streets alone.","Don't go wandering all over the house!","He just wandered in one day and asked for a job.","He wandered into a bar and ordered a drink.","One day she wandered further afield.","Simply wandering is a pleasure in itself.","The cattle are allowed to wander freely.","They found him wandering around aimlessly.","Visitors are free to wander through the gardens and woods.","Cattle and sheep wander freely on the hilltops.","During the day I would wander the streets, asking passers-by for a few cents.","He was found wandering in the road late one night.","She had spent her life wandering from place to place.","They spent a couple of hours wandering through the markets."],"opposite":"","synonyms":""},{"def":"to move away from the place where you ought to be or the people you are with","examples":["wander away/off The child wandered off and got lost.","How could you let him wander off like that?","wander from/off something They had wandered from the path into the woods."],"opposite":"","synonyms":""},{"def":"to stop being directed on something and to move without much control to other ideas, subjects, etc.","examples":["It's easy to be distracted and let your attention wander.","Try not to let your mind wander.","wander away, back, to, etc. something Her thoughts wandered back to her youth.","Don’t wander off the subject—keep to the point.","Lisa let her mind wander a little.","His attention was beginning to wander.","My thoughts wandered from the exam questions to my interview the next day."],"opposite":"","synonyms":""},{"def":"to move slowly from looking at one thing to looking at another thing or in other directions","examples":["She let her gaze wander.","+ adv./prep. His eyes wandered towards the photographs on the wall."],"opposite":"","synonyms":""},{"def":"to go in a curve instead of following a straight course","examples":["The road wanders along through the hills."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"","meanings":[{"def":"a short walk in or around a place, usually with no special purpose","examples":["I went to the park and had a wander around."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]