[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/war/war__/war__us_1.mp3","phonsUS":"/wɔːr/","level":"A2","meanings":[{"def":"a situation in which two or more countries or groups of people fight against each other over a period of time","examples":["the Second World War","the threat of (a) nuclear war","to win/lose a/the war","war between A and B the war between England and Scotland","war with somebody England's war with Scotland","war against somebody The war against Spain lasted 18 years.","war on somebody It was the year Britain declared war on Germany.","(formal) In the Middle Ages England waged war on France.","He returned home to the US at the end of the war.","Social and political problems led to the outbreak (= the beginning) of war.","Where were you living when war broke out?","The government does not want to go to war (= start a war) unless all other alternatives have failed.","The two countries fought a short but bloody war.","My grandfather fought in the war.","Her husband was killed during the war.","at war How long have they been at war?","a war hero/veteran","More troops are being despatched to the war zone.","(formal) the theatre of war (= the area in which fighting takes place)","It's in memory of the soldiers who gave their lives during the war.","He wore his raincoat all day, even though it was sunny.","Both candidates have distinguished war records.","Congress has made a formal declaration of war.","Every available resource went towards the war effort.","He took part in the Vietnam War.","He was wounded twice during the course of the war.","In times of war, troops were billeted in the mill.","My grandfather fought in the Korean War.","Six years of total war had left no citizen untouched.","The Spartans were persuaded to make war on Athens.","The US declared war on Japan.","The United States entered the war in 1917.","The country has long been a theatre/​theater of war.","The country was now in a state of war.","The country went to war in 1914.","The crisis took Europe to the brink of war.","The outcome of the war was far from certain.","The terrorists were charged with waging war against the state.","The war raged for nearly two years.","These aircraft are designed to take troops and weapons to any theatre of war in the shortest time possible.","Unexploded mines were a big danger to civilians in the aftermath of the war.","a country at war","a war of liberation","critiques of the mainstream media's war coverage","killed in war","talks to prevent the war from escalating","the Greek war for independence","the Soviet war machine","the shortage of food during the war years","the war against the French","the war correspondent of a daily newspaper","war between Iran and Iraq","The USA declared war on Germany in 1917.","The two countries were at war for eight years.","When war broke out he became separated from his family."],"opposite":"","synonyms":""},{"def":"a situation in which there is aggressive competition between groups, companies, countries, etc.","examples":["war with somebody The US threatened a trade war with Europe after the breakdown of the talks.","war against/on somebody They launched a trade war against France."],"opposite":"","synonyms":""},{"def":"a fight or an effort over a long period of time to get rid of or stop something unpleasant","examples":["war on somebody/something The government has declared war on drug dealers.","Our two countries work together in fighting the war on terrorism.","war against somebody/something We seem to be winning the war against crime.","a war against drug abuse","the campaign for parliamentary reform","an advertising campaign","She finally won the legal battle for compensation.","the endless battle between man and nature","the struggle for independence","the struggle between good and evil","the drive for greater efficiency","a drive to reduce energy consumption","the war against crime","Workers won their fight to stop compulsory redundancies."],"opposite":"","synonyms":"campaign"},{"def":"in some situations any type of behaviour is acceptable to get what you want","examples":[],"opposite":"","synonyms":""},{"def":"to have been injured in a fight or an accident","examples":["You look like you've been in the wars—who gave you that black eye?"],"opposite":"","synonyms":""},{"def":"an attempt to defeat your opponents by putting pressure on them so that they lose courage or confidence","examples":["The union has been fighting a war of nerves with the management over pay."],"opposite":"","synonyms":""},{"def":"a bitter argument over a period of time between two or more people or groups","examples":["the political war of words over tax"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"all’s fair in love and war","def":"in some situations any type of behaviour is acceptable to get what you want","examples":[]},{"idiom":"have been in the wars","def":"to have been injured in a fight or an accident","examples":["You look like you've been in the wars—who gave you that black eye?"]},{"idiom":"a war of nerves","def":"an attempt to defeat your opponents by putting pressure on them so that they lose courage or confidence","examples":["The union has been fighting a war of nerves with the management over pay."]},{"idiom":"a war of words","def":"a bitter argument over a period of time between two or more people or groups","examples":["the political war of words over tax"]}],"phrasal":[],"related":["cold war","post-war","pre-war","turf war","war cry","war game","war-torn","war zone","civil war","class war","price war","proxy war","war bride","war chest","war crime","war dance","war widow","world war","phoney war","war gaming"]}]