[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/war/warn_/warn__us_1.mp3","phonsUS":"/wɔːrn/","level":"B1","meanings":[{"def":"to tell somebody about something, especially something dangerous or unpleasant that is likely to happen, so that they can avoid it","examples":["warn somebody I tried to warn him, but he wouldn't listen.","If you're thinking of getting a dog, be warned—they take a lot of time and money.","warn about/against somebody/something Security experts warned about the problems months ago.","warn somebody about/against somebody/something He warned us against pickpockets.","warn somebody of something Officials warned the pilot of an anonymous threat.","He has been warned of the danger he is in.","warn of something Police have warned of possible delays.","warn somebody about something He is warning youngsters about the dangers of fireworks.","warn that… Aid agencies have repeatedly warned that a humanitarian catastrophe is imminent.","warn somebody that… She was warned that if she did it again she would lose her job.","warn somebody what, how, etc… I had been warned what to expect.","warn (somebody) + speech ‘Beware of pickpockets,’ she warned (him).","Look out! There's a car coming.","Be careful. It can be quite dangerous on that path.","Watch out. That's not a very safe place at night.","Make sure you keep hold of your bag.","I wouldn't do that if I were you.","I thought I should warn him about the risks involved.","This is the first time I've worn this suit.","She was wearing a worn old leather jacket.","Having been duly warned that I would get nowhere with my application, I went right ahead and applied anyway.","I did try to warn you.","I must warn you that some of these animals are extremely dangerous.","I thought I should warn her about it.","No one had warned us about the unbearable heat.","She claimed doctors had failed to warn her of the risks involved.","The report warns of the dangers of obesity.","They warned us of the risks involved.","You will get better—but be warned, it may be a long process.","The commander had been warned of the attack."],"opposite":"","synonyms":""},{"def":"to strongly advise somebody to do or not to do something in order to avoid danger or punishment","examples":["warn against/about (doing) something The guidebook warns against walking alone at night.","warn somebody against/about (doing) something He hit the other child, despite being warned about the consequences of such behaviour.","warn somebody to do something He warned Billy to keep away from his daughter.","warn somebody ‘I’m warning you!’ said James, losing his patience.","They were warned not to climb the mountain in such bad weather.","We were warned against drinking the local water.","We were specifically warned against buying the house.","The chancellor bluntly warned the Cabinet to axe public spending or face higher taxes.","My mother constantly warned me not to go into teaching."],"opposite":"","synonyms":""},{"def":"to give somebody an official warning after they have broken a rule","examples":["The referee warned him for dangerous play."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":["warn off"],"related":["warn off","warn somebody off (something)"]}]