[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/war/warra/warrant__us_1_rr.mp3","phonsUS":"/ˈwɔːrənt/","level":"C1","meanings":[{"def":"a legal document that is signed by a judge and gives the police authority to do something","examples":["an arrest warrant","warrant for something They issued a warrant for her arrest.","warrant to do something They had a warrant to search the house.","In certain circumstances, police may enter premises without a warrant.","The commissioner has issued a warrant for her arrest.","The police served a warrant on him.","Federal agents tried to serve arrest warrants on him for firearms offences.","The police arrived with a warrant to search the house."],"opposite":"","synonyms":""},{"def":"a document that gives you the right to receive money, services, etc.","examples":["the issue of warrants for equity shares"],"opposite":"","synonyms":""},{"def":"an acceptable reason for doing something","examples":["There is no warrant for such criticism."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["death warrant","royal warrant","search warrant","warrant officer","chief warrant officer","master warrant officer","warrant officers","chief warrant officers","I/I’ll warrant (you)"]},{"pos":"verb","level":"C1","meanings":[{"def":"to make something necessary or appropriate in a particular situation","examples":["warrant something Further investigation is clearly warranted.","The TV appearance was so brief that it hardly warranted comment.","They do not consider the case serious enough to warrant a government enquiry.","warrant (somebody/something) doing something The situation scarcely warrants their/them being dismissed."],"opposite":"","synonyms":""},{"def":"used to tell somebody that you are sure of something and that they can be sure of it too","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"I/I’ll warrant (you)","def":"used to tell somebody that you are sure of something and that they can be sure of it too","examples":[]}],"phrasal":[],"related":[]}]