[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/wav/wave_/wave__us_1.mp3","phonsUS":"/weɪv/","level":"A2","meanings":[{"def":"a raised line of water that moves across the surface of the sea, ocean, etc.","examples":["Huge waves were breaking on the shore.","Surfers flocked to the beach to ride the waves.","the gentle sound of waves lapping","The wind made little waves on the pond.","in the waves Children were playing in the waves.","on the waves Seagulls bobbed on the waves.","All you could hear was the lapping of the waves.","He swam headlong into the oncoming wave.","I could hear the waves crash against the rocks.","She loved surfing the giant waves of the sea.","The waves hit the rocks with huge energy.","There were seagulls bobbing on the waves.","These boats aren't strong enough to withstand rogue waves.","We watched the waves breaking on the shore.","the gentle sound of waves lapping the sand","the roar of ocean waves"],"opposite":"","synonyms":""},{"def":"the form that some types of energy such as heat, sound, light, etc. take as they move","examples":["electromagnetic/gravity/ultrasonic waves"],"opposite":"","synonyms":""},{"def":"a movement of your arm and hand from side to side","examples":["with a wave She declined the offer with a wave of her hand.","With a wave and a shout he ran down the road to meet us.","He gave us a wave as the bus drove off.","She managed a wave to her disappointed supporters as she left.","He dismissed her thanks with a quick wave of the hand.","I returned his wave and started to walk towards him.","She gave a dismissive wave of her hand.","He gave a wave as the bus moved off.","She sent him away with a wave of her hand."],"opposite":"","synonyms":""},{"def":"a continuous movement that looks like a wave on the sea, made by a large group of people, especially people watching a sports game, when one person after another stands up, raises their arms, and then sits down again","examples":[],"opposite":"","synonyms":""},{"def":"a sudden increase in a particular activity or feeling","examples":["wave of something Insurgents launched a wave of attacks against the security forces.","Wave after wave of attacks rocked the city.","a wave of protests/strikes/scandals","a wave of violence/unrest","There has been a new wave of bombings since the peace talks broke down.","A wave of fear swept over him.","A wave of panic spread through the crowd.","in waves Guilt and horror flooded her in waves.","in a wave Exhaustion hit him in a wave.","Three hundred employees lost their jobs in the latest wave of redundancies.","A wave of relief washed over him as he saw that the children were safe.","Hearing the tune again sent waves of longing through her.","How do we catch the next great wave of innovation?","I feel a wave of panic flow through me.","The attack unleashed a wave of terror in the city.","The news sent a wave of relief through the crowd.","This tendency has generated a new wave of company mergers.","With the fall of the Bastille in 1789, a wave of euphoria swept Europe.","swept along on a wave of critical acclaim","the current wave of business scandals","A wave of violence swept the country.","I experienced a huge wave of emotion when I saw her.","Suddenly a wave of guilt washed over her."],"opposite":"","synonyms":""},{"def":"a large number of things or people suddenly appearing or arriving somewhere","examples":["Wave after wave of aircraft passed overhead.","The war generated waves of refugees.","We saw a wave of tanks coming over the horizong.","The article drove waves of traffic to their website.","New waves of displaced people began arriving.","Wave after wave of soldiers rushed the perimeter.","a wave of immigration in the 1950s"],"opposite":"","synonyms":""},{"def":"if a person’s hair has a wave or waves, it is not straight but slightly curly","examples":[],"opposite":"","synonyms":""},{"def":"the sea","examples":["life on the waves (= life at sea)"],"opposite":"","synonyms":""},{"def":"a situation in which somebody is very successful, happy, etc.","examples":["They’ve been on the crest of the wave ever since their election victory.","She is on the crest of a wave at the moment following her Olympic success.","They are riding the crest of the wave at the moment."],"opposite":"","synonyms":""},{"def":"to be very active in a way that makes people notice you, and that may sometimes cause problems","examples":[],"opposite":"","synonyms":""},{"def":"to enjoy or be supported by the particular situation or quality mentioned","examples":["Schools are riding a wave of renewed public interest."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"the crest of a/the wave","def":"a situation in which somebody is very successful, happy, etc.","examples":["They’ve been on the crest of the wave ever since their election victory.","She is on the crest of a wave at the moment following her Olympic success.","They are riding the crest of the wave at the moment."]},{"idiom":"make waves","def":"to be very active in a way that makes people notice you, and that may sometimes cause problems","examples":[]},{"idiom":"ride a/the wave of something","def":"to enjoy or be supported by the particular situation or quality mentioned","examples":["Schools are riding a wave of renewed public interest."]}],"phrasal":[],"related":["new wave","wave off","long wave","wave away","wave down","crime wave","medium wave","radio wave","shock wave","short wave","sound wave","tidal wave","wave aside","Mexican wave","wave equation","wave machine","longitudinal wave","permanent wave","transverse wave"]},{"pos":"verb","level":"B1","meanings":[{"def":"to move your hand or arm from side to side in the air in order to attract attention, say hello, etc.","examples":["The people on the bus waved and we waved back.","wave at/to somebody Why did you wave at him?","He waved to the crowd as they greeted him.","wave something The driver leaped out, waving his fist and swearing.","wave something about/around A man in the water was shouting and waving his arms around frantically.","wave something at somebody She waved her hand dismissively at the housekeeper.","wave somebody something My mother was crying as I waved her goodbye.","wave something to somebody My mother was crying as I waved goodbye to her.","He turned to wave to his mother.","He waved a hand at her to shut her up.","He waved a hand vaguely in the air.","She waved cheerfully and he waved back.","She smiled and waved slightly.","They stood by the side of the road and waved frantically.","They waved to us as we passed.","We waved at the people on the shore.","people waving goodbye to their friends and relatives","He was waving at us from the other platform.","She waved cheerfully as she set off.","Wave goodbye to Daddy."],"opposite":"","synonyms":""},{"def":"to show where something is, show somebody where to go, etc. by moving your hand in a particular direction","examples":["wave + adv./prep. She waved vaguely in the direction of the house.","wave somebody/something + adv./prep. ‘He's over there,’ said Ali, waving a hand towards some trees.","I showed my pass to the security guard and he waved me through.","She waved me away impatiently.","The guards waved us on.","She waved him to a seat.","I tried to approach, but he waved me away.","The referee waved play on."],"opposite":"","synonyms":""},{"def":"to hold something in your hand and move it from side to side","examples":["wave something Crowds lined the route, waving flags and cheering.","to wave banners/placards/signs","wave something + adv./prep. ‘I'm rich!’ she exclaimed, waving the money under his nose.","The officer started waving his gun at the crowd."],"opposite":"","synonyms":""},{"def":"to move freely and gently, for example in the wind, while one end or side is held in position","examples":["The flag waved in the breeze.","The protesters marched past, their banners waving.","The dog's tail waved gently.","Clean white sheets waved and billowed on the line.","reeds waving gently in the breeze"],"opposite":"","synonyms":""},{"def":"to be slightly curly","examples":["His hair waves naturally."],"opposite":"","synonyms":""},{"def":"to make somebody’s hair slightly curly","examples":["She's had her hair waved."],"opposite":"","synonyms":""},{"def":"to show your support for your country, an organization or an idea to encourage or persuade others to do the same","examples":[],"opposite":"","synonyms":""},{"def":"used to talk about something that is likely to make somebody very angry","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"fly/show/wave the flag","def":"to show your support for your country, an organization or an idea to encourage or persuade others to do the same","examples":[]},{"idiom":"like waving a red flag in front of a bull","def":"used to talk about something that is likely to make somebody very angry","examples":[]}],"phrasal":["wave aside","wave away","wave down","wave off"],"related":[]}]