[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/way/way__/way__us_1.mp3","phonsUS":"/weɪ/","level":"A1","meanings":[{"def":"a method, style or manner of doing something","examples":["I prefer to do things the easy way.","I love him and I think he feels the same way.","way to do something I'm sure we can find a way to make this work.","Using the subway is the only way to avoid the traffic.","(informal, disapproving) That's no way to speak to your mother!","way of doing something I'm not happy with this way of working.","way (that)… It's not what you say, it's the way that you say it.","I hate the way she always criticizes me.","I told you we should have done it my way!","in the… way She dresses in the same way as her sister.","Infectious diseases can be acquired in several ways.","In this way, we can track the storms as they move across the ocean.","in the way (that)… It works in the way you'd expect.","New technology has radically changed the way in which this work is done.","in a way that… She writes in a way that is easy to understand.","I generally get what I want one way or another (= by some means).","That's not the right way to hold a pair of scissors.","Artists began to invent new ways of painting.","Most people are creative in one way or another.","You'll have to close everything down and restart your computer. It's the only way.","to look at ways of improving language teaching","I like the way (that) you did that.","There are several possible ways of dealing with this problem.","They were asked to come up with ways of working more efficiently.","This is the best way of keeping in touch with friends while you're away.","What way would you use?","You won't impress the judges that way.","a unique way of settling disputes","a sure-fire way to get him to do whatever I want","a cost-effective way to boost performance","Do you remember? Or, put another way, do you know?","God works in mysterious ways.","I chose a different way of collecting data.","I would think of some clever way to get myself out of this situation.","One way or another, I'm going to make it.","Students develop those skills in myriad ways.","The best way to open it is with pliers.","The most important way to stop accidental drownings is by education.","There are a number of ways to overcome this problem.","There is no subtle way to tell someone that you no longer want them.","They believe he'll figure out a way to make it work.","They've explored every possible way of dealing with the problem.","We are searching for innovative and creative ways to solve the many problems facing us.","They have never contributed in any meaningful way to our civilization.","We did it the old-fashioned way.","We expect computers to react a certain way, in certain situations.","They see the project as a way of helping poor families.","The only way to avoid GM ingredients is to buy certified organic food.","University changed the way I viewed the world.","I don't agree with his way of thinking.","The problem can be seen in a variety of ways."],"opposite":"","synonyms":""},{"def":"a particular manner or style of behaviour","examples":["in a… way They grinned at her in a friendly way.","It was not his way to admit that he had made a mistake.","Don't worry, if she seems quiet—it's just her way.","He was showing off, as is the way with adolescent boys.","He has a way of staring at you that is very unnerving.","She worked hard to act in an honest way.","‘Hi there,’ said Tom in a friendly way.","She's behaving in a very mysterious way.","She spoke in a way that put everyone at their ease.","He was a handsome man in a sinister sort of way.","Try to approach this in a sensible way.","I could tell he liked her from the way he looked at her."],"opposite":"","synonyms":""},{"def":"the typical way of behaving and living of a particular group of people","examples":["After ten years I'm used to the strange British ways.","She always said that the old ways were the best."],"opposite":"","synonyms":""},{"def":"a route or road that you take in order to reach a place","examples":["to ask somebody the way","Do you know the way?","way to… Can you tell me the way to Leicester Square?","way from… to… the best/quickest/shortest way from A to B","We went the long way round.","Can you tell me the way out of here?","He showed us the way.","She asked him the way to the station.","The way across the fields is longer but pleasanter.","The way through the woods is quicker.","We walked along the covered way to the science building.","the easiest way from my house to yours","I didn't know the way and I had no map.","I stopped to ask the way.","I think they must have gone the long way round.","Is this the right way to the station?","The quickest way to the house is through the woods.","We parted ways once we went off to college.","They've led the way in achieving political and social reforms.","I'll be with you every step of the way."],"opposite":"","synonyms":""},{"def":"the route along which somebody/something is moving; the route that somebody/something would take if there was nothing stopping them/it","examples":["Get out of my way! I'm in a hurry.","Riot police with shields were blocking the demonstrators' way.","along the way Unfortunately they ran into a snowstorm along the way.","+ adv./prep. We fought our way through the dense vegetation.","(figurative) We will eventually find a way out of the crisis.","A fallen tree blocked the way.","He couldn't find a way through the bracken.","He had to navigate his way through the city's one-way streets.","He edged his way along the wall.","She fought her way up to the top of the company.","We saw a dreadful accident along the way.","A fallen tree was blocking their way.","They had to fight their way through the crowd.","They inched their way along the tunnel.","Could you please get those boxes out of my way?","The procession snaked its way through the town.","(figurative) The withdrawal of troops should clear the way for a peace settlement.","The river wound its way through the valley.","The climber inched his way up the sheer cliff face.","She bluffed her way through the exam.","The street wove its way through the hills."],"opposite":"","synonyms":""},{"def":"a road, path or street for travelling along","examples":["There's a way across the fields."],"opposite":"","synonyms":""},{"def":"used in the names of streets","examples":["106 Headley Way"],"opposite":"","synonyms":""},{"def":"a particular direction; in a particular direction","examples":["Which way did they go?","We just missed a car coming the other way.","Look both ways (= look left and right) before crossing the road.","Make sure that sign's the right way up.","The pipe could be moved a few inches either way.","Kids were running this way and that (= in all directions).","They decided to split the money four ways (= between four different people).","(figurative) Which way (= for which party) are you going to vote?","He looked my way, but didn't seem to recognize me.","Walk this way, please.","I went the opposite way.","There's a huge storm heading this way.","They've gone the wrong way.","He narrowly avoided a car coming the other way.","Try it the other way around.","Which way up does this box go?"],"opposite":"","synonyms":""},{"def":"a means of going into or leaving a place, such as a door or gate","examples":["the way in/out","They escaped out the back way."],"opposite":"","synonyms":""},{"def":"a distance or period of time between two points","examples":["A little way up on the left is the Museum of Modern Art.","We had to go a long way before we found a place to eat.","September was a long way off.","You came all this way to see us?","(figurative) The area's wine industry still has a way to go to full maturity.","(North American English, informal) We still have a ways to go.","It's quite a way from my house to the shops.","Your birthday is still some way off."],"opposite":"","synonyms":""},{"def":"an area, a part of a country, etc.","examples":["over/down… way I think he lives somewhere over Greenwich way.","down your/my way I'll stop by and see you next time I'm down your way."],"opposite":"","synonyms":""},{"def":"a particular aspect of something","examples":["I have changed in every way.","It's been quite a day, one way and another (= for several reasons).","They're alike in more ways than one.","They're different in every way.","Can I help you in any way?"],"opposite":"","synonyms":""},{"def":"a particular condition or state","examples":["in a… way The economy's in a bad way.","I don't know how we're going to manage, the way things are.","The way things are going, I think that's achievable.","She is content with the way things are."],"opposite":"","synonyms":""},{"def":"on the other side of the street, etc.","examples":["Music blared from the open window of the house across the way."],"opposite":"","synonyms":""},{"def":"during the whole journey/period of time","examples":["She didn't speak a word to me all the way back home.","the whole way to Arizona","This bus doesn't go all the way so you'll have to change.","I watched the movie the whole way through."],"opposite":"","synonyms":""},{"def":"completely; as much as it takes to achieve what you want","examples":["I'm fighting him all the way.","You can feel that the audience is with her all the way."],"opposite":"","synonyms":""},{"def":"as you make progress with something","examples":["You'll learn something along the way."],"opposite":"","synonyms":""},{"def":"used to say that things often happen in a particular way, especially when it is not convenient","examples":[],"opposite":"","synonyms":""},{"def":"however you choose to look at a situation","examples":[],"opposite":"","synonyms":""},{"def":"to behave or do things in a particular manner because it is part of your character","examples":["It's not his fault he's so pompous—he was born that way."],"opposite":"","synonyms":""},{"def":"to be easy compared with what came before","examples":["It's all downhill from here. We'll soon be finished."],"opposite":"","synonyms":""},{"def":"to become worse or less successful","examples":["It's been all downhill for his career since then, with four defeats in five games.","I started work as a journalist and it was downhill all the way for my health."],"opposite":"","synonyms":""},{"def":"to be easy compared with what came before","examples":["It's downhill all the way from here. We'll soon be finished."],"opposite":"","synonyms":""},{"def":"to become worse or less successful","examples":["I started work as a journalist and it was downhill all the way for my health.","It's been all downhill for his career since then, with four defeats in five games."],"opposite":"","synonyms":""},{"def":"to have habits or opinions that you have had for a long time and that you do not want to change","examples":["Grandma is so set in her ways."],"opposite":"","synonyms":""},{"def":"to have nearly achieved something and be going to achieve it soon","examples":["She is well on the way to recovery.","He is well on the way to establishing himself among the top ten players in the world."],"opposite":"","synonyms":""},{"def":"by a great amount","examples":["He was the best by a long way."],"opposite":"","synonyms":""},{"def":"used to introduce a comment or question that is not directly related to what you have been talking about","examples":["By the way, I found that book you were looking for.","What's the time, by the way?","Oh by the way, if you see Jackie, tell her I'll call her this evening."],"opposite":"","synonyms":""},{"def":"by a route that includes the place mentioned","examples":["The artist recently arrived in Paris from Bulgaria by way of Vienna.","She came to TV by way of drama school."],"opposite":"","synonyms":""},{"def":"as a form of something; for something; as a means of something","examples":["He received £600 by way of compensation from the company.","She rolled her eyes by way of an answer and left."],"opposite":"","synonyms":""},{"def":"to start to live or behave in a different way from before","examples":["He was in trouble with the police as a teenager but now he’s completely changed his ways.","Your father is unlikely to change his ways now."],"opposite":"","synonyms":""},{"def":"to gradually achieve something or move somewhere by being determined and using a lot of effort","examples":["She clawed her way to the top of her profession.","Slowly, he clawed his way out from under the collapsed building."],"opposite":"","synonyms":""},{"def":"to remove things that are stopping the progress or movement of something","examples":["The ruling could clear the way for extradition proceedings."],"opposite":"","synonyms":""},{"def":"to happen to you by chance, or when you were not expecting it","examples":["He took the first job that came his way.","Have any interesting articles come your way recently?"],"opposite":"","synonyms":""},{"def":"to have two opposite effects or results","examples":[],"opposite":"","synonyms":""},{"def":"used to say that it does not matter which one of two possibilities happens, is chosen or is true","examples":["Was it his fault or not? Either way, an explanation is due.","We could meet today or tomorrow—I don't mind one way or the other."],"opposite":"","synonyms":""},{"def":"in all directions","examples":["Her hair tumbled every which way."],"opposite":"","synonyms":""},{"def":"to move along carefully, for example when it is dark, by touching walls, objects, etc.","examples":[],"opposite":"","synonyms":""},{"def":"to be careful about how you do things, usually because you are in a situation that you are not familiar with","examples":["She was new in the job, still feeling her way."],"opposite":"","synonyms":""},{"def":"to discover the right route (to a place)","examples":["I hope you can find your way home."],"opposite":"","synonyms":""},{"def":"to come to a place or a situation by chance or without intending to","examples":["He eventually found his way into acting."],"opposite":"","synonyms":""},{"def":"to become used to doing something/to lose the habit of doing something","examples":["The women had got into the way of going up on the deck every evening."],"opposite":"","synonyms":""},{"def":"to prevent somebody from doing something; to prevent something from happening","examples":["He wouldn't allow emotions to get in the way of him doing his job."],"opposite":"","synonyms":""},{"def":"to get or do what you want, especially when somebody has tried to stop you","examples":["She always gets her own way in the end."],"opposite":"","synonyms":""},{"def":"to break or fall down","examples":["The pillars gave way and a section of the roof collapsed.","Her numb leg gave way beneath her and she stumbled clumsily."],"opposite":"","synonyms":""},{"def":"to stop resisting somebody/something; to agree to do something that you do not want to do","examples":["He refused to give way on any of the points."],"opposite":"","synonyms":""},{"def":"to allow somebody/something to be or go first","examples":["Give way to traffic already on the roundabout."],"opposite":"","synonyms":""},{"def":"to allow yourself to be very strongly affected by something, especially an emotion","examples":["Flinging herself on the bed, she gave way to helpless misery."],"opposite":"","synonyms":""},{"def":"to be replaced by something","examples":["The storm gave way to bright sunshine.","As he drew nearer, his anxiety gave way to relief."],"opposite":"","synonyms":""},{"def":"to have full sexual intercourse with somebody","examples":[],"opposite":"","synonyms":""},{"def":"to have known each other for a long time","examples":["We go back a long way, he and I."],"opposite":"","synonyms":""},{"def":"to last a long time","examples":["She seems to make her money go a long way.","A small amount of this paint goes a long way (= covers a large area).","(ironic) I find that a little of Jerry's company can go a long way (= I quickly get tired of being with him)."],"opposite":"","synonyms":""},{"def":"to help very much/a little in achieving something","examples":["The new law goes a long way towards solving the problem."],"opposite":"","synonyms":""},{"def":"to make a special effort to do something","examples":["He would always go out of his way to be friendly towards her.","She went out of her way to help them."],"opposite":"","synonyms":""},{"def":"to do as you choose, especially when somebody has advised you against it","examples":["It's best to let her go her own way if you don't want a fight.","He's always gone his own way when it comes to design."],"opposite":"","synonyms":""},{"def":"to end a relationship with somebody","examples":["When the business was sold they went their separate ways.","They decided to go their separate ways after being together for five years.","When we finished school, we all went our separate ways."],"opposite":"","synonyms":""},{"def":"to go in a different direction from somebody you have been travelling with","examples":[],"opposite":"","synonyms":""},{"def":"to travel in the same direction as somebody","examples":["I'm going your way—I'll walk with you.","I'm going your way, so we can walk together.","She was going my way, so we talked as we walked."],"opposite":"","synonyms":""},{"def":"to go well for you; to be in your favour","examples":["By the third round he knew the fight was going his way."],"opposite":"","synonyms":""},{"def":"to die","examples":[],"opposite":"","synonyms":""},{"def":"by having an unpleasant experience or by making mistakes","examples":["She won't listen to my advice so she'll just have to learn the hard way.","He learned about the dangers of drugs the hard way."],"opposite":"","synonyms":""},{"def":"to have made a lot of progress","examples":["We've come a long way since the early days of the project.","The study of genes has come a long way in recent years."],"opposite":"","synonyms":""},{"def":"to be a sensible person","examples":[],"opposite":"","synonyms":""},{"def":"to have or want to have the advantages of two different situations or ways of behaving that are impossible to combine","examples":["You can't have it both ways. If you can afford to go out all the time, you can afford to pay off some of your debts."],"opposite":"","synonyms":""},{"def":"used to say in an angry way that although you are not happy about something that somebody has said, you are not going to argue","examples":["Oh OK, then. Have it your own way!"],"opposite":"","synonyms":""},{"def":"to have something arranged in the way that you want, even though other people want it to be arranged differently","examples":["The German team weren't going to let the English have everything their own way."],"opposite":"","synonyms":""},{"def":"to need to make a lot of progress before you can achieve something","examples":["She still has a long way to go before she's fully fit."],"opposite":"","synonyms":""},{"def":"used to say that something often happens in a particular way, especially when it is out of your control","examples":["First love affairs have a way of not working out.","Fate has a way of changing the best of plans."],"opposite":"","synonyms":""},{"def":"to be good at dealing with somebody/something","examples":["He has a way with small children.","She has a way with words (= is very good at expressing herself)."],"opposite":"","synonyms":""},{"def":"to persuade somebody to have sex with you","examples":[],"opposite":"","synonyms":""},{"def":"used to explain what you would do if you had total control over something","examples":["If I had my way, smoking would be banned completely."],"opposite":"","synonyms":""},{"def":"of any type","examples":["I don't approve of violence in any shape or form.","I can't stand insects in any shape or form.","I do not condone bullying in any way, shape or form."],"opposite":"","synonyms":""},{"def":"on a large/small scale","examples":["The new delivery service has taken off in a big way.","Many people are investing in a small way in the stock market.","He then started spending money in a big way."],"opposite":"","synonyms":""},{"def":"(to be/become) pregnant","examples":[],"opposite":"","synonyms":""},{"def":"used to show that a statement has more than one meaning","examples":["With the first goal he used his head in more ways than one."],"opposite":"","synonyms":""},{"def":"used to say what normally happens in a particular situation","examples":["In the ordinary way, she's not a nervous person."],"opposite":"","synonyms":""},{"def":"how and when you want to, even though this might annoy other people","examples":["He always does the work, but in his own sweet time.","She just ignores all the criticism and continues on her own sweet way."],"opposite":"","synonyms":""},{"def":"to some extent; not completely","examples":["In a way it was one of our biggest mistakes.","It's more interesting, in some ways, to watch what's going on behind the scenes here.","In a certain way, all of that is true."],"opposite":"","synonyms":""},{"def":"in a manner that is appropriate to or typical of a person or thing but that may seem unusual to other people","examples":["I expect she does love you in her own way.","The building is very attractive in its own way.","He was attractive in his own way."],"opposite":"","synonyms":""},{"def":"stopping somebody from moving or doing something","examples":["You'll have to move—you're in my way.","I left them alone, as I felt I was in the way.","There were several rocks in the way."],"opposite":"","synonyms":""},{"def":"used in questions and negative sentences to talk about the types of something that are available","examples":["There isn't much in the way of entertainment in this place."],"opposite":"","synonyms":""},{"def":"to avoid somebody","examples":["Let's keep out of her way while she's in such a bad mood."],"opposite":"","synonyms":""},{"def":"to be familiar with a place, subject, etc.","examples":[],"opposite":"","synonyms":""},{"def":"to make a lot of money easily and feel very pleased about it","examples":[],"opposite":"","synonyms":""},{"def":"to get yourself into or out of a situation by lying","examples":[],"opposite":"","synonyms":""},{"def":"to deliberately avoid seeing somebody/something","examples":["Prison officers know what's going on, but look the other way."],"opposite":"","synonyms":""},{"def":"to become lost","examples":["We lost our way in the dark.","She lost her way in the fog."],"opposite":"","synonyms":""},{"def":"to forget or move away from the purpose or reason for something","examples":["I feel that the project has lost its way.","This project seems to have lost its way."],"opposite":"","synonyms":""},{"def":"to allow somebody/something to pass; to allow somebody/something to take the place of somebody/something","examples":["Make way for the Lord Mayor!","Tropical forest is felled to make way for grassland."],"opposite":"","synonyms":""},{"def":"to move or get somewhere; to make progress","examples":["Will you be able to make your own way to the airport (= get there without help, a ride, etc.)?","Is this your plan for making your way in the world?"],"opposite":"","synonyms":""},{"def":"to stop behaving badly","examples":[],"opposite":"","synonyms":""},{"def":"(to take/find) an acceptable course of action that avoids two extreme positions","examples":[],"opposite":"","synonyms":""},{"def":"used to show that you are certain about something","examples":["It was the wrong decision—there are no two ways about it."],"opposite":"","synonyms":""},{"def":"used to say that there is no possibility that you will do something or that something will happen","examples":["‘Do you want to help?’ ‘No way!’","No way am I going to drive them there.","There's no way we could afford that sort of money."],"opposite":"","synonyms":""},{"def":"during the journey","examples":["He stopped for breakfast on the way.","She grabbed her camera and bag on her way out.","We didn't stop on the way north.","They bought some supplies on the way.","We stopped for a drink on the way home.","On the way back, he invited me to his home for drinks."],"opposite":"","synonyms":""},{"def":"going or coming","examples":["I'd better be on my way (= I must leave) soon.","The letter should be on its way to you.","Then he went off on his merry way."],"opposite":"","synonyms":""},{"def":"not yet born","examples":["They've got three kids and one on the way."],"opposite":"","synonyms":""},{"def":"to make it possible for somebody to do something or for something to happen","examples":["The agreement could open the way for the country to pay off its debts."],"opposite":"","synonyms":""},{"def":"in the opposite position, direction or order","examples":["I think it should go on the other way round."],"opposite":"","synonyms":""},{"def":"the opposite situation","examples":["I didn't leave you. It was the other way round (= you left me)."],"opposite":"","synonyms":""},{"def":"in a safe place where somebody/something cannot be hurt or injured or do any damage to somebody/something","examples":["She put the knife in a drawer, out of harm’s way.","I prefer the children to play in the garden where they’re out of harm’s way."],"opposite":"","synonyms":""},{"def":"no longer stopping somebody from moving or doing something","examples":["I moved my legs out of the way so that she could get past.","I didn't say anything until Dad was out of the way."],"opposite":"","synonyms":""},{"def":"finished; dealt with","examples":["Our region is poised for growth once the election is out of the way."],"opposite":"","synonyms":""},{"def":"used in negative sentences to mean ‘unusual’","examples":["She had obviously noticed nothing out of the way."],"opposite":"","synonyms":""},{"def":"not on the route that you planned to take","examples":["I'd love a ride home—if it's not out of your way.","The supermarket is a bit out of my way.","The library is slightly out of my way."],"opposite":"","synonyms":""},{"def":"a point at which two people or groups of people decide to separate","examples":["These events led to a final parting of the ways."],"opposite":"","synonyms":""},{"def":"to create a situation in which somebody will be able to do something or something can happen","examples":["This decision paved the way for changes in employment rights for women."],"opposite":"","synonyms":""},{"def":"to make enough money to pay what it costs to keep it going","examples":["The bridge is still not paying its way."],"opposite":"","synonyms":""},{"def":"to pay for everything yourself without having to rely on anyone else’s money","examples":[],"opposite":"","synonyms":""},{"def":"to walk carefully, choosing the safest, driest, etc. place to put your feet","examples":["She picked her way delicately over the rough ground.","We picked our way carefully over the jagged rocks."],"opposite":"","synonyms":""},{"def":"to make somebody annoyed or angry, often without intending to, by doing or saying something that offends them","examples":["She tends to rub people up the wrong way."],"opposite":"","synonyms":""},{"def":"to realize or admit that you have done something wrong and decide to change your behaviour","examples":["Will they realize the error of their ways before it is too late?"],"opposite":"","synonyms":""},{"def":"to find that it is possible or convenient to do something","examples":["Small builders cannot see their way clear to take on many trainees."],"opposite":"","synonyms":""},{"def":"to get an idea of what is likely to happen before deciding what to do","examples":[],"opposite":"","synonyms":""},{"def":"to do something first so that other people can follow","examples":[],"opposite":"","synonyms":""},{"def":"to make it easier for somebody/something to develop or make progress","examples":["These negotiations are intended to smooth the path to a peace treaty.","We’re trying to smooth the way for women who want to resume their careers."],"opposite":"","synonyms":""},{"def":"to (not) prevent somebody from doing something","examples":["If you believe you can make her happy, I won't stand in your way.","He wanted to go to college and would let nothing stand in his way."],"opposite":"","synonyms":""},{"def":"to be bisexual (= sexually attracted to both men and women)","examples":[],"opposite":"","synonyms":""},{"def":"to end a difficult situation by choosing the simplest solution even if it is not the best one","examples":["He took the easy way out and didn’t go to the meeting.","She took the easy way out and paid someone to write the article for her."],"opposite":"","synonyms":""},{"def":"to be offended by a remark that was not intended to be offensive","examples":["She always takes things the wrong way."],"opposite":"","synonyms":""},{"def":"to make excuses and give reasons for not doing something; to manage to get yourself out of a difficult situation","examples":["I managed to talk my way out of having to give a speech."],"opposite":"","synonyms":""},{"def":"that is the situation and we cannot change it, so we must accept it","examples":[],"opposite":"","synonyms":""},{"def":"there are many different ways to achieve something","examples":[],"opposite":"","synonyms":""},{"def":"in my opinion","examples":[],"opposite":"","synonyms":""},{"def":"having started","examples":["Preparations are well under way for a week of special events in May."],"opposite":"","synonyms":""},{"def":"a plan of action that is likely to be successful","examples":["Personal electronic health records are the way forward for effective healthcare in the future."],"opposite":"","synonyms":""},{"def":"something that allows you to join a group of people, an industry, etc. that it is difficult to join, or to understand something that it is difficult to understand","examples":[],"opposite":"","synonyms":""},{"def":"the typical pattern of behaviour of a person or group","examples":["the American way of life","She loved the Spanish way of life and immediately felt at home there.","the beliefs and practices of the Hindu way of life"],"opposite":"","synonyms":""},{"def":"the way that most people behave; the way that things happen, which you cannot change","examples":["The rich and powerful make the decisions—that's the way of the world."],"opposite":"","synonyms":""},{"def":"used to say that somebody else has either to agree with your opinion or to leave","examples":[],"opposite":"","synonyms":""},{"def":"the methods and materials available for doing something","examples":["ways and means of raising money","Newspapers have ways and means of getting hold of secret information."],"opposite":"","synonyms":""},{"def":"used to tell somebody that you are pleased about something they have done","examples":["Good work, guys! Way to go!","Way to go! I wish I could do that!"],"opposite":"","synonyms":""},{"def":"the way to make somebody like or love you","examples":["The way to a man's heart is through his stomach (= by giving him good food)."],"opposite":"","synonyms":""},{"def":"if you really want to do something then you will find a way of doing it","examples":[],"opposite":"","synonyms":""},{"def":"a series of victories or successes","examples":["He'll look to continue his winning ways with a victory in Mexico on 16 February."],"opposite":"","synonyms":""},{"def":"to do something from beginning to end, especially when it takes a lot of time or effort","examples":["She worked her way through the pile of documents."],"opposite":"","synonyms":""},{"def":"to have a job or series of jobs while studying, travelling, etc. in order to pay for your education, etc.","examples":[],"opposite":"","synonyms":""},{"def":"to move regularly to a more senior position in a company","examples":["He worked his way up from messenger boy to account executive."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"across the way","def":"on the other side of the street, etc.","examples":["Music blared from the open window of the house across the way."]},{"idiom":"all the way","def":"during the whole journey/period of time","examples":["She didn't speak a word to me all the way back home.","the whole way to Arizona","This bus doesn't go all the way so you'll have to change.","I watched the movie the whole way through.","I'm fighting him all the way.","You can feel that the audience is with her all the way."]},{"idiom":"along the way","def":"as you make progress with something","examples":["You'll learn something along the way."]},{"idiom":"(that’s/it’s) always the way","def":"used to say that things often happen in a particular way, especially when it is not convenient","examples":[]},{"idiom":"any way you slice it","def":"however you choose to look at a situation","examples":[]},{"idiom":"be/be born/be made that way","def":"to behave or do things in a particular manner because it is part of your character","examples":["It's not his fault he's so pompous—he was born that way."]},{"idiom":"be (all) downhill | be downhill all the way","def":"to be easy compared with what came before","examples":["It's all downhill from here. We'll soon be finished.","It's been all downhill for his career since then, with four defeats in five games.","I started work as a journalist and it was downhill all the way for my health."]},{"idiom":"be downhill all the way | be (all) downhill","def":"to be easy compared with what came before","examples":["It's downhill all the way from here. We'll soon be finished.","I started work as a journalist and it was downhill all the way for my health.","It's been all downhill for his career since then, with four defeats in five games."]},{"idiom":"be set in your ways","def":"to have habits or opinions that you have had for a long time and that you do not want to change","examples":["Grandma is so set in her ways."]},{"idiom":"be well on the way to something/doing something","def":"to have nearly achieved something and be going to achieve it soon","examples":["She is well on the way to recovery.","He is well on the way to establishing himself among the top ten players in the world."]},{"idiom":"by a long way","def":"by a great amount","examples":["He was the best by a long way."]},{"idiom":"by the way","def":"used to introduce a comment or question that is not directly related to what you have been talking about","examples":["By the way, I found that book you were looking for.","What's the time, by the way?","Oh by the way, if you see Jackie, tell her I'll call her this evening."]},{"idiom":"by way of something","def":"by a route that includes the place mentioned","examples":["The artist recently arrived in Paris from Bulgaria by way of Vienna.","She came to TV by way of drama school."]},{"idiom":"by way of/in the way of something","def":"as a form of something; for something; as a means of something","examples":["He received £600 by way of compensation from the company.","She rolled her eyes by way of an answer and left."]},{"idiom":"change your ways","def":"to start to live or behave in a different way from before","examples":["He was in trouble with the police as a teenager but now he’s completely changed his ways.","Your father is unlikely to change his ways now."]},{"idiom":"claw your way back, into something, out of something, to something, etc.","def":"to gradually achieve something or move somewhere by being determined and using a lot of effort","examples":["She clawed her way to the top of her profession.","Slowly, he clawed his way out from under the collapsed building."]},{"idiom":"clear the way (for something/for something to happen)","def":"to remove things that are stopping the progress or movement of something","examples":["The ruling could clear the way for extradition proceedings."]},{"idiom":"come your way","def":"to happen to you by chance, or when you were not expecting it","examples":["He took the first job that came his way.","Have any interesting articles come your way recently?"]},{"idiom":"cut both/two ways","def":"to have two opposite effects or results","examples":[]},{"idiom":"either way | one way or the other","def":"used to say that it does not matter which one of two possibilities happens, is chosen or is true","examples":["Was it his fault or not? Either way, an explanation is due.","We could meet today or tomorrow—I don't mind one way or the other."]},{"idiom":"every which way","def":"in all directions","examples":["Her hair tumbled every which way."]},{"idiom":"feel your way","def":"to move along carefully, for example when it is dark, by touching walls, objects, etc.","examples":["She was new in the job, still feeling her way."]},{"idiom":"find your way (to…)","def":"to discover the right route (to a place)","examples":["I hope you can find your way home."]},{"idiom":"find your/its way (to/into…)","def":"to come to a place or a situation by chance or without intending to","examples":["He eventually found his way into acting."]},{"idiom":"get into/out of the way of (doing) something","def":"to become used to doing something/to lose the habit of doing something","examples":["The women had got into the way of going up on the deck every evening."]},{"idiom":"get in the way of","def":"to prevent somebody from doing something; to prevent something from happening","examples":["He wouldn't allow emotions to get in the way of him doing his job."]},{"idiom":"get/have your own way","def":"to get or do what you want, especially when somebody has tried to stop you","examples":["She always gets her own way in the end."]},{"idiom":"give way","def":"to break or fall down","examples":["The pillars gave way and a section of the roof collapsed.","Her numb leg gave way beneath her and she stumbled clumsily."]},{"idiom":"give way (to somebody/something)","def":"to stop resisting somebody/something; to agree to do something that you do not want to do","examples":["He refused to give way on any of the points.","Give way to traffic already on the roundabout."]},{"idiom":"give way to something","def":"to allow yourself to be very strongly affected by something, especially an emotion","examples":["Flinging herself on the bed, she gave way to helpless misery.","The storm gave way to bright sunshine.","As he drew nearer, his anxiety gave way to relief."]},{"idiom":"go all the way (with somebody)","def":"to have full sexual intercourse with somebody","examples":[]},{"idiom":"go back a long way","def":"to have known each other for a long time","examples":["We go back a long way, he and I."]},{"idiom":"go a long way","def":"to last a long time","examples":["She seems to make her money go a long way.","A small amount of this paint goes a long way (= covers a large area).","(ironic) I find that a little of Jerry's company can go a long way (= I quickly get tired of being with him)."]},{"idiom":"go a long/some way towards doing something","def":"to help very much/a little in achieving something","examples":["The new law goes a long way towards solving the problem."]},{"idiom":"go out of your way (to do something)","def":"to make a special effort to do something","examples":["He would always go out of his way to be friendly towards her.","She went out of her way to help them."]},{"idiom":"go your own way","def":"to do as you choose, especially when somebody has advised you against it","examples":["It's best to let her go her own way if you don't want a fight.","He's always gone his own way when it comes to design."]},{"idiom":"go your separate ways","def":"to end a relationship with somebody","examples":["When the business was sold they went their separate ways.","They decided to go their separate ways after being together for five years.","When we finished school, we all went our separate ways."]},{"idiom":"go somebody’s way","def":"to travel in the same direction as somebody","examples":["I'm going your way—I'll walk with you.","I'm going your way, so we can walk together.","She was going my way, so we talked as we walked.","By the third round he knew the fight was going his way."]},{"idiom":"go the way of all flesh","def":"to die","examples":[]},{"idiom":"the hard way","def":"by having an unpleasant experience or by making mistakes","examples":["She won't listen to my advice so she'll just have to learn the hard way.","He learned about the dangers of drugs the hard way."]},{"idiom":"have come a long way","def":"to have made a lot of progress","examples":["We've come a long way since the early days of the project.","The study of genes has come a long way in recent years."]},{"idiom":"have your head screwed on (the right way)","def":"to be a sensible person","examples":[]},{"idiom":"have/want it both ways","def":"to have or want to have the advantages of two different situations or ways of behaving that are impossible to combine","examples":["You can't have it both ways. If you can afford to go out all the time, you can afford to pay off some of your debts."]},{"idiom":"have it your own way!","def":"used to say in an angry way that although you are not happy about something that somebody has said, you are not going to argue","examples":["Oh OK, then. Have it your own way!"]},{"idiom":"have it/things/everything your own way","def":"to have something arranged in the way that you want, even though other people want it to be arranged differently","examples":["The German team weren't going to let the English have everything their own way."]},{"idiom":"have a long way to go","def":"to need to make a lot of progress before you can achieve something","examples":["She still has a long way to go before she's fully fit."]},{"idiom":"have a way of doing something","def":"used to say that something often happens in a particular way, especially when it is out of your control","examples":["First love affairs have a way of not working out.","Fate has a way of changing the best of plans."]},{"idiom":"have a way with somebody/something","def":"to be good at dealing with somebody/something","examples":["He has a way with small children.","She has a way with words (= is very good at expressing herself)."]},{"idiom":"have your (wicked) way with somebody","def":"to persuade somebody to have sex with you","examples":[]},{"idiom":"if I had my way","def":"used to explain what you would do if you had total control over something","examples":["If I had my way, smoking would be banned completely."]},{"idiom":"in any (way,) shape or form","def":"of any type","examples":["I don't approve of violence in any shape or form.","I can't stand insects in any shape or form.","I do not condone bullying in any way, shape or form."]},{"idiom":"in a big/small way","def":"on a large/small scale","examples":["The new delivery service has taken off in a big way.","Many people are investing in a small way in the stock market.","He then started spending money in a big way."]},{"idiom":"(be/get) in the family way","def":"(to be/become) pregnant","examples":[]},{"idiom":"in more ways than one","def":"used to show that a statement has more than one meaning","examples":["With the first goal he used his head in more ways than one."]},{"idiom":"in the ordinary way","def":"used to say what normally happens in a particular situation","examples":["In the ordinary way, she's not a nervous person."]},{"idiom":"in your own sweet time/way","def":"how and when you want to, even though this might annoy other people","examples":["He always does the work, but in his own sweet time.","She just ignores all the criticism and continues on her own sweet way."]},{"idiom":"in a way | in one way | in some ways","def":"to some extent; not completely","examples":["In a way it was one of our biggest mistakes.","It's more interesting, in some ways, to watch what's going on behind the scenes here.","In a certain way, all of that is true."]},{"idiom":"in her, his, its, etc. (own) way","def":"in a manner that is appropriate to or typical of a person or thing but that may seem unusual to other people","examples":["I expect she does love you in her own way.","The building is very attractive in its own way.","He was attractive in his own way."]},{"idiom":"in the/somebody’s way","def":"stopping somebody from moving or doing something","examples":["You'll have to move—you're in my way.","I left them alone, as I felt I was in the way.","There were several rocks in the way."]},{"idiom":"in the way of something","def":"used in questions and negative sentences to talk about the types of something that are available","examples":["There isn't much in the way of entertainment in this place."]},{"idiom":"keep/stay out of somebody’s way","def":"to avoid somebody","examples":["Let's keep out of her way while she's in such a bad mood."]},{"idiom":"know your way around","def":"to be familiar with a place, subject, etc.","examples":[]},{"idiom":"laugh all the way to the bank","def":"to make a lot of money easily and feel very pleased about it","examples":[]},{"idiom":"lie your way into/out of something","def":"to get yourself into or out of a situation by lying","examples":[]},{"idiom":"look the other way","def":"to deliberately avoid seeing somebody/something","examples":["Prison officers know what's going on, but look the other way."]},{"idiom":"lose your way","def":"to become lost","examples":["We lost our way in the dark.","She lost her way in the fog.","I feel that the project has lost its way.","This project seems to have lost its way."]},{"idiom":"make way (for somebody/something)","def":"to allow somebody/something to pass; to allow somebody/something to take the place of somebody/something","examples":["Make way for the Lord Mayor!","Tropical forest is felled to make way for grassland."]},{"idiom":"make your way (to/towards something)","def":"to move or get somewhere; to make progress","examples":["Will you be able to make your own way to the airport (= get there without help, a ride, etc.)?","Is this your plan for making your way in the world?"]},{"idiom":"mend your ways","def":"to stop behaving badly","examples":[]},{"idiom":"(steer, take, etc.) a middle course | (find, etc.) a/the middle way","def":"(to take/find) an acceptable course of action that avoids two extreme positions","examples":[]},{"idiom":"(there are) no two ways about it","def":"used to show that you are certain about something","examples":["It was the wrong decision—there are no two ways about it."]},{"idiom":"(there is) no way","def":"used to say that there is no possibility that you will do something or that something will happen","examples":["‘Do you want to help?’ ‘No way!’","No way am I going to drive them there.","There's no way we could afford that sort of money."]},{"idiom":"on the/its/your way","def":"during the journey","examples":["He stopped for breakfast on the way.","She grabbed her camera and bag on her way out.","We didn't stop on the way north.","They bought some supplies on the way.","We stopped for a drink on the way home.","On the way back, he invited me to his home for drinks.","I'd better be on my way (= I must leave) soon.","The letter should be on its way to you.","Then he went off on his merry way.","They've got three kids and one on the way."]},{"idiom":"open the way for somebody/something (to do something)","def":"to make it possible for somebody to do something or for something to happen","examples":["The agreement could open the way for the country to pay off its debts."]},{"idiom":"the other way round","def":"in the opposite position, direction or order","examples":["I think it should go on the other way round.","I didn't leave you. It was the other way round (= you left me)."]},{"idiom":"out of harm’s way","def":"in a safe place where somebody/something cannot be hurt or injured or do any damage to somebody/something","examples":["She put the knife in a drawer, out of harm’s way.","I prefer the children to play in the garden where they’re out of harm’s way."]},{"idiom":"out of the way","def":"no longer stopping somebody from moving or doing something","examples":["I moved my legs out of the way so that she could get past.","I didn't say anything until Dad was out of the way.","Our region is poised for growth once the election is out of the way.","She had obviously noticed nothing out of the way."]},{"idiom":"out of your way","def":"not on the route that you planned to take","examples":["I'd love a ride home—if it's not out of your way.","The supermarket is a bit out of my way.","The library is slightly out of my way."]},{"idiom":"a/the parting of the ways","def":"a point at which two people or groups of people decide to separate","examples":["These events led to a final parting of the ways."]},{"idiom":"pave the way (for somebody/something)","def":"to create a situation in which somebody will be able to do something or something can happen","examples":["This decision paved the way for changes in employment rights for women."]},{"idiom":"pay its way","def":"to make enough money to pay what it costs to keep it going","examples":["The bridge is still not paying its way."]},{"idiom":"pay your way","def":"to pay for everything yourself without having to rely on anyone else’s money","examples":[]},{"idiom":"pick your way (across, along, among, over, through something)","def":"to walk carefully, choosing the safest, driest, etc. place to put your feet","examples":["She picked her way delicately over the rough ground.","We picked our way carefully over the jagged rocks."]},{"idiom":"rub somebody up the wrong way","def":"to make somebody annoyed or angry, often without intending to, by doing or saying something that offends them","examples":["She tends to rub people up the wrong way."]},{"idiom":"see, realize, etc. the error of your ways","def":"to realize or admit that you have done something wrong and decide to change your behaviour","examples":["Will they realize the error of their ways before it is too late?"]},{"idiom":"see your way (clear) to doing something/to do something","def":"to find that it is possible or convenient to do something","examples":["Small builders cannot see their way clear to take on many trainees."]},{"idiom":"see which way the wind is blowing","def":"to get an idea of what is likely to happen before deciding what to do","examples":[]},{"idiom":"show the way","def":"to do something first so that other people can follow","examples":[]},{"idiom":"smooth the path/way","def":"to make it easier for somebody/something to develop or make progress","examples":["These negotiations are intended to smooth the path to a peace treaty.","We’re trying to smooth the way for women who want to resume their careers."]},{"idiom":"(not) stand in somebody’s way","def":"to (not) prevent somebody from doing something","examples":["If you believe you can make her happy, I won't stand in your way.","He wanted to go to college and would let nothing stand in his way."]},{"idiom":"swing both ways","def":"to be bisexual (= sexually attracted to both men and women)","examples":[]},{"idiom":"take the easy way out","def":"to end a difficult situation by choosing the simplest solution even if it is not the best one","examples":["He took the easy way out and didn’t go to the meeting.","She took the easy way out and paid someone to write the article for her."]},{"idiom":"take something the wrong way","def":"to be offended by a remark that was not intended to be offensive","examples":["She always takes things the wrong way."]},{"idiom":"talk your way out of something/of doing something","def":"to make excuses and give reasons for not doing something; to manage to get yourself out of a difficult situation","examples":["I managed to talk my way out of having to give a speech."]},{"idiom":"that’s the way the cookie crumbles","def":"that is the situation and we cannot change it, so we must accept it","examples":[]},{"idiom":"there’s more than one way to skin a cat","def":"there are many different ways to achieve something","examples":[]},{"idiom":"to my way of thinking","def":"in my opinion","examples":[]},{"idiom":"under way","def":"having started","examples":["Preparations are well under way for a week of special events in May."]},{"idiom":"the way forward","def":"a plan of action that is likely to be successful","examples":["Personal electronic health records are the way forward for effective healthcare in the future."]},{"idiom":"a way into something","def":"something that allows you to join a group of people, an industry, etc. that it is difficult to join, or to understand something that it is difficult to understand","examples":[]},{"idiom":"a/the/somebody’s way of life","def":"the typical pattern of behaviour of a person or group","examples":["the American way of life","She loved the Spanish way of life and immediately felt at home there.","the beliefs and practices of the Hindu way of life"]},{"idiom":"the way of the world","def":"the way that most people behave; the way that things happen, which you cannot change","examples":["The rich and powerful make the decisions—that's the way of the world."]},{"idiom":"my way or the highway","def":"used to say that somebody else has either to agree with your opinion or to leave","examples":[]},{"idiom":"ways and means","def":"the methods and materials available for doing something","examples":["ways and means of raising money","Newspapers have ways and means of getting hold of secret information."]},{"idiom":"way to go!","def":"used to tell somebody that you are pleased about something they have done","examples":["Good work, guys! Way to go!","Way to go! I wish I could do that!"]},{"idiom":"the way to somebody’s heart","def":"the way to make somebody like or love you","examples":["The way to a man's heart is through his stomach (= by giving him good food)."]},{"idiom":"where there’s a will there’s a way","def":"if you really want to do something then you will find a way of doing it","examples":[]},{"idiom":"winning ways","def":"a series of victories or successes","examples":["He'll look to continue his winning ways with a victory in Mexico on 16 February."]},{"idiom":"work your way through something","def":"to do something from beginning to end, especially when it takes a lot of time or effort","examples":["She worked her way through the pile of documents."]},{"idiom":"work your way through college, round the world, etc.","def":"to have a job or series of jobs while studying, travelling, etc. in order to pay for your education, etc.","examples":[]},{"idiom":"work your way up","def":"to move regularly to a more senior position in a company","examples":["He worked his way up from messenger boy to account executive."]}],"phrasal":[],"related":["each way","one-way","part-way","two-way","way out","way-out","Fosse Way","Milky Way","third way","three-way","way station","four-way stop","one-way mirror","right of way","two-way mirror","out-of-the-way","Pennine Way","silent way","Icknield Way"]},{"pos":"adverb","level":"B2","meanings":[{"def":"very far; by a large amount","examples":["She finished the race way ahead of the other runners.","children who are way behind in reading skills","I must be going home; it's way past my bedtime.","The price is way above what we can afford.","They live way out in the suburbs.","I guessed that there would be a hundred people there, but I was way out (= wrong by a large amount).","This skirt is way too short.","The project is going way beyond our expectations."],"opposite":"","synonyms":""},{"def":"very","examples":["Things just got way difficult.","I'm way glad to hear that."],"opposite":"","synonyms":""},{"def":"a long time ago","examples":["I first met him way back in the 80s.","Way back, when he was a boy, he had lived on a farm in Wales."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"way back (in…)","def":"a long time ago","examples":["I first met him way back in the 80s.","Way back, when he was a boy, he had lived on a farm in Wales."]}],"phrasal":[],"related":[]}]