[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/wea/weake/weaken__us_1.mp3","phonsUS":"/ˈwiːkən/","level":"C1","meanings":[{"def":"to make somebody/something less strong or powerful; to become less strong or powerful","examples":["The team has been weakened by injury.","The new evidence weakens the case against her.","This new story has severely weakened the President’s position.","His authority is steadily weakening.","The British pound continued to weaken against the dollar.","The division of Germany had served to weaken the party.","The military was badly weakened by the sanctions.","The regime was fatally weakened by the unrest and violence.","a move designed to weaken the rebels","exchange rates that dramatically weakened the dollar"],"opposite":"","synonyms":""},{"def":"to make something less physically strong; to become less physically strong","examples":["The explosion had weakened the building's foundations.","His health was weakened by overwork.","She felt her legs weaken.","The explosion had weakened the building's foundations considerably.","She felt her legs weaken further as she climbed higher up the slope.","He began to weaken as his opponent continued the onslaught."],"opposite":"","synonyms":""},{"def":"to become or make somebody become less determined or certain about something","examples":["You must not agree to do it. Don't weaken.","weaken something Nothing could weaken his resolve to continue.","The judgement serves to weaken public confidence in the courts.","She felt herself beginning to weaken in the face of his persuasion."],"opposite":"","synonyms":""},{"def":"to become less strong","examples":["The storm eventually weakened."],"opposite":"","synonyms":""},{"def":"to become less strong; to make a currency or economy less strong","examples":["weaken (against something) The dollar has weakened against the euro.","weaken something measures that could weaken the economy"],"opposite":"strengthen","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]