[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/wea/wealt/wealth__us_1.mp3","phonsUS":"/welθ/","level":"B2","meanings":[{"def":"a large amount of money, property, etc. that a person or country owns","examples":["the desire to gain wealth and power","He has pledged to redistribute the country's vast oil wealth.","Their aim is to keep taxes low enough to encourage wealth creation.","a person of wealth and influence","The purpose of industry is to create wealth.","His personal wealth is estimated at around $100 million.","the distribution of wealth in Britain","He has no family with whom he can share his wealth.","He lost his wealth through poor investment.","He's never flaunted his wealth.","It is a country of fabulous wealth.","Rising employment and household wealth are bolstering spending.","She enjoys enormous wealth and material pleasures.","She is a woman of untold wealth.","She wants to protect their new-found wealth.","The average family increased its net wealth by 50% between 1989 and 2001.","a redistribution of wealth through taxation","a tax on inherited wealth","the accumulated wealth from his business","the great oil wealth of the region","the kind of capital that generates new wealth","the pursuit of instant wealth","the total wealth of the global economy","She called for a redistribution of wealth and power in society.","There will undoubtedly be new taxes on corporate wealth."],"opposite":"","synonyms":""},{"def":"the state of being rich","examples":["Good education often depends on wealth.","The new rich elite publicly flaunted their wealth.","wealth of somebody/something the relative wealth of the nation"],"opposite":"","synonyms":""},{"def":"a large amount of something","examples":["The website provides a wealth of information.","The new manager brings a great wealth of experience to the job.","Switzerland has an enormous wealth of beautiful old buildings.","This chapter contains a wealth of information in a very concise form.","The country's strong economy was built on its mineral wealth.","The region possesses a vast natural wealth, particularly of timber."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["wealth tax","Wealth of Nations","wealth taxes"]}]