[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/wea/weapo/weapon__us_2.mp3","phonsUS":"/ˈwepən/","level":"B1","meanings":[{"def":"an object such as a knife, gun, bomb, etc. that is used for fighting or attacking somebody","examples":["Modern nuclear weapons are much more destructive than either biological or chemical weapons.","a lethal/deadly weapon","The police still haven't found the murder weapon.","Police believed the men were carrying weapons.","She was convicted of possessing an offensive weapon.","Two officers fired their weapons.","with a weapon A lone gunman opened fire with an automatic weapon.","‘Load your weapons!’ Barrett ordered.","A massive weapons cache was uncovered.","Drop your weapons, or he dies!","He was charged with assault with a deadly weapon.","She pleaded guilty to carrying an offensive weapon.","The armed men lowered their weapons and stepped aside.","The assault forces used heavy weapons, including anti-tank rockets and mortars.","The guards began to draw their weapons.","a ban on the use of tactical nuclear weapons","arrested for carrying a concealed weapon","nuclear weapons proliferation","states that have acquired nuclear weapons","the illegal transfer of weapons technology to hostile countries","14 people were killed when men armed with automatic weapons opened fire on the crowd.","Almost any bladed or sharply pointed article is potentially a lethal weapon."],"opposite":"","synonyms":""},{"def":"something such as knowledge, words, actions, etc. that can be used to attack or fight against somebody/something","examples":["Education is the only weapon to fight the spread of the disease.","Guilt is the secret weapon for the control of children.","She used humour and wit as weapons against her enemies.","The team's secret weapon was their new young defender.","The workers' ultimate weapon was the strike.","This relaxation technique can serve as an effective weapon against stress."],"opposite":"","synonyms":""},{"def":"to be something that has both advantages and disadvantages","examples":["Fame is a double-edged sword."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be a double-edged/two-edged sword/weapon","def":"to be something that has both advantages and disadvantages","examples":["Fame is a double-edged sword."]}],"phrasal":[],"related":["biological weapon","chemical weapon","weapon of mass destruction","be a double-edged/two-edged sword/weapon"]}]