[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/wea/weave/weave__us_1.mp3","phonsUS":"/wiːv/","level":"C1","meanings":[{"def":"to make cloth, a carpet, a basket, etc. by crossing threads or narrow pieces of material across, over and under each other by hand or on a machine called a loom","examples":["weave A from B The baskets are woven from strips of willow.","weave B into A The strips of willow are woven into baskets.","weave something together threads woven together","weave (something) Most spiders weave webs that are almost invisible.","She is skilled at spinning and weaving.","The carpet was specially woven to commemorate the 1 000th anniversary of the cathedral's foundation.","The threads are woven together."],"opposite":"","synonyms":""},{"def":"to make something by twisting flowers, pieces of wood, etc. together","examples":["She deftly wove the flowers into a garland."],"opposite":"","synonyms":""},{"def":"to move along by running and changing direction continuously to avoid things that are in your way","examples":["+ adv./prep. She was weaving in and out of the traffic.","He hurried on, weaving through the crowd.","The road weaves through a range of hills.","weave your way + adv./prep. He had to weave his way through the milling crowds."],"opposite":"","synonyms":""},{"def":"to put facts, events, details, etc. together to make a story or a closely connected whole","examples":["weave (something into) something to weave a narrative","weave something together The biography weaves together the various strands of Einstein's life.","Comedy and tragedy are inextricably woven into her fiction.","Hall skilfully weaves the historical research into a gripping narrative.","The author seamlessly weaves together the stories of three people's lives.","The whisky is inextricably woven into Scotland's history, customs and culture.","The author weaves the narrative around the detailed eyewitness accounts."],"opposite":"","synonyms":""},{"def":"to perform or behave in a way that is attractive or interesting, or that makes somebody behave in a particular way","examples":["Will Hegerberg be able to weave her magic against Italy on Wednesday?"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"weave your magic | weave a spell (over somebody)","def":"to perform or behave in a way that is attractive or interesting, or that makes somebody behave in a particular way","examples":["Will Hegerberg be able to weave her magic against Italy on Wednesday?"]}],"phrasal":[],"related":["weave your magic","weave a spell (over somebody)"]},{"pos":"noun","level":"","meanings":[{"def":"the way in which threads are arranged in a piece of cloth that has been woven; the pattern that the threads make","examples":["a close/fine/rough weave"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]