[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/wei/weigh/weight__us_1.mp3","phonsUS":"/weɪt/","level":"A2","meanings":[{"def":"how heavy somebody/something is, which can be measured in, for example, kilograms or pounds","examples":["in weight It is about 76 kilos in weight.","by weight Bananas are sold by weight.","weight of… In the wild, this fish can reach a weight of 5lbs.","She is trying to lose weight (= become less heavy and less fat).","He’s put on/gained weight (= become heavier and fatter) since he gave up smoking.","No more for me. I have to watch my weight.","He has now shed the extra weight.","Body fat increases rapidly as body weight increases.","The point is to achieve permanent weight loss.","Stress can cause weight gain.","Sam has a weight problem (= is too fat).","You won't have to wait long—the next train is in five minutes.","It was an anxious wait, but finally she found out that she'd passed.","He has lost a lot of weight.","Weight the tablecloth down so that it doesn't move or blow away.","I should soon be down to my target weight of 70 kilos.","I won't have any cake—I have to watch my weight.","People's body weight can fluctuate during the day."],"opposite":"","synonyms":""},{"def":"the fact of being heavy","examples":["weight of somebody/something The pillars have to support the weight of the roof.","I just hoped the branch would take my weight.","under the weight He staggered a little under the weight of his backpack.","The table collapsed under their weight.","Don't put any weight on that ankle for at least a week.","I was worried that the branch wouldn't take my weight.","Many buildings collapsed under the weight of rain-soaked ash and mud.","She tried to be quiet, but the stairs creaked under her weight.","The arch bears the weight of the bridge above.","The boy was staggering beneath the weight of a pile of boxes.","She misjudged the weight of the book.","He nervously shifted his weight from foot to foot.","He threw his weight at the door and it burst open.","Stand with your legs apart and your weight evenly distributed.","The doctor told me not to put my weight on this ankle for a month."],"opposite":"","synonyms":""},{"def":"an object that is heavy","examples":["The doctor said he should not lift heavy weights.","Heavy weights should be lifted with a straight back.","Consider adding weight training and aerobic exercises to your routine."],"opposite":"","synonyms":""},{"def":"an object used to keep something in position or as part of a machine","examples":["weights on a fishing line"],"opposite":"","synonyms":""},{"def":"a great responsibility or worry","examples":["The full weight of responsibility falls on her.","The news was certainly a weight off my mind (= I did not have to worry about it any more).","Finally telling the truth was a great weight off my shoulders.","He was buckling under the weight of his responsibilities."],"opposite":"","synonyms":""},{"def":"importance, influence or strength","examples":["The many letters of support added weight to the campaign.","The President has now offered to lend his weight to the project.","Your opinion carries weight with the boss.","How can you ignore the sheer weight of medical opinion?","The weight of evidence against her is overwhelming.","They attach too much weight to academic achievement.","The new evidence added considerable weight to the prosecution's case.","Sir Leon lent his weight to the Tory campaign yesterday.","America's economic weight","Environmental considerations were given due weight in making the decision.","Her opinion seemed to carry little weight in the company."],"opposite":"","synonyms":""},{"def":"a unit or system of units by which weight is measured","examples":["tables of weights and measures","imperial/metric weight"],"opposite":"","synonyms":""},{"def":"a piece of metal that is known to weigh a particular amount and is used to measure the weight of something, or lifted by people to improve their strength and as a sport","examples":["a set of weights","a light/heavy weight","She lifts weights as part of her training.","He does a lot of weight training."],"opposite":"","synonyms":""},{"def":"to have influence with somebody","examples":["My views don't carry much weight with the boss."],"opposite":"","synonyms":""},{"def":"used to say that there is too much of something","examples":["The table groaned under the weight of the biggest buffet they had ever seen."],"opposite":"","synonyms":""},{"def":"to work as hard as everyone else in a job, an activity, etc.","examples":[],"opposite":"","synonyms":""},{"def":"to be or try to be more successful than others in doing something that normally requires more skill, experience, money, etc. than you have","examples":["This player seems to be able to constantly punch above his weight.","He punched above his weight as the party’s foreign affairs spokesman."],"opposite":"","synonyms":""},{"def":"to sit down and rest, especially when you are tired","examples":["Come and sit down and take the weight off your feet for a while."],"opposite":"","synonyms":""},{"def":"to use your position of authority or power in an aggressive way in order to achieve what you want","examples":["She was a good manager, who didn’t find it necessary to throw her weight around."],"opposite":"","synonyms":""},{"def":"to use all your influence and power to support something","examples":["The government has thrown its weight behind the anti-pollution campaign."],"opposite":"","synonyms":""},{"def":"the combined power, strength or influence of a group","examples":["They won the argument by sheer weight of numbers."],"opposite":"","synonyms":""},{"def":"very useful or valuable","examples":["A good mechanic is worth his weight in gold."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"carry weight (with somebody)","def":"to have influence with somebody","examples":["My views don't carry much weight with the boss."]},{"idiom":"groan under the weight of something","def":"used to say that there is too much of something","examples":["The table groaned under the weight of the biggest buffet they had ever seen."]},{"idiom":"pull your weight","def":"to work as hard as everyone else in a job, an activity, etc.","examples":[]},{"idiom":"punch above your weight","def":"to be or try to be more successful than others in doing something that normally requires more skill, experience, money, etc. than you have","examples":["This player seems to be able to constantly punch above his weight.","He punched above his weight as the party’s foreign affairs spokesman."]},{"idiom":"take the weight off your feet","def":"to sit down and rest, especially when you are tired","examples":["Come and sit down and take the weight off your feet for a while."]},{"idiom":"throw your weight about/around","def":"to use your position of authority or power in an aggressive way in order to achieve what you want","examples":["She was a good manager, who didn’t find it necessary to throw her weight around."]},{"idiom":"throw/put your weight behind something","def":"to use all your influence and power to support something","examples":["The government has thrown its weight behind the anti-pollution campaign."]},{"idiom":"weight of numbers","def":"the combined power, strength or influence of a group","examples":["They won the argument by sheer weight of numbers."]},{"idiom":"worth your/its weight in gold","def":"very useful or valuable","examples":["A good mechanic is worth his weight in gold."]}],"phrasal":[],"related":["dead weight","weight belt","atomic weight","weight training","Weight Watchers™","birth weight","weight belts","weight of numbers","pull your weight","punch above your weight","carry weight (with somebody)","take the weight off your feet","worth your/its weight in gold","groan under the weight of something","lend support, weight, credence, etc. to something"]},{"pos":"verb","level":"","meanings":[{"def":"to attach a weight to something in order to keep it in the right position or make it heavier","examples":["The fishing nets are weighted with lead.","The body had been weighted down with stones.","You won't have to wait long—the next train is in five minutes.","It was an anxious wait, but finally she found out that she'd passed.","He has lost a lot of weight.","Weight the tablecloth down so that it doesn't move or blow away."],"opposite":"","synonyms":""},{"def":"to give different values to things to show how important you think each of them is compared with the others","examples":["be weighted The results of the survey were weighted to allow for variations in the sample.","Each of these factors should be weighted according to their relative importance.","a weighted vote (= one that is worth more than a single vote)","(North American English) a weighted grade (= given at school for a course that is more advanced or harder and so has a higher value)"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]