[{"pos":"exclamation","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/wel/welco/welcome__us_2.mp3","phonsUS":"/ˈwelkəm/","level":"A1","meanings":[{"def":"used as a greeting to tell somebody that you are pleased that they are there","examples":["Welcome home!","welcome to something Welcome to Oxford!","Good evening everybody. Welcome to the show!"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["welcome mat","welcome to country","Welcome to Country","you’re welcome","outstay/overstay your welcome","lay, put, roll, etc. out the welcome mat (for somebody)"]},{"pos":"verb","level":"A1","meanings":[{"def":"to say hello to somebody in a friendly way when they arrive somewhere","examples":["welcome somebody They were at the door to welcome us.","to welcome a visitor/guest","welcome somebody to something It is a pleasure to welcome you to our home.","welcome somebody + adv./prep. The whole family turned out to welcome him back."],"opposite":"","synonyms":""},{"def":"to be pleased that somebody has come or has joined an organization, activity, etc.","examples":["welcome somebody They welcomed the new volunteers with open arms (= with enthusiasm).","We are always pleased to welcome new members.","welcome somebody to something We are delighted to welcome you to our company.","welcome somebody into something The new immigrants have been welcomed into the community.","The school is preparing to welcome the new intake of students.","If you visit our town you will be warmly welcomed.","He welcomed us into the club."],"opposite":"","synonyms":""},{"def":"to be pleased to receive or accept something","examples":["to welcome a decision/move","Women's rights campaigners welcomed the news.","I warmly welcome this announcement.","We welcome the opportunity to work with the government to develop better services locally.","I'd welcome any suggestions.","In general, the changes they had made were to be welcomed.","We welcome input from our readers.","Economists cautiously welcomed the president's initiative.","Foreign bankers and economists cautiously welcomed the minister's initiative.","Many companies have warmly welcomed these changes in legislation.","The proposals have been widely welcomed.","We positively welcome applications from all sections of the community."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"adjective","level":"A1","meanings":[{"def":"accepted or wanted somewhere","examples":["I'll go, then. I know when I'm not welcome.","+ adv./prep. They were anxious to make us feel welcome in their home.","Children are always welcome at the hotel.","Our neighbours made us welcome as soon as we arrived.","I had the feeling we were not welcome at the meeting.","Children are always welcome at the hotel.","New members are welcome to the club.","Poetry Reading. Tonight at 8 p.m. Admission free. All are welcome.","a welcome guest/visitor","They made us very welcome in their home.","Visitors are always welcome.","You would be a most welcome guest."],"opposite":"","synonyms":""},{"def":"that you are pleased to have, receive, etc.","examples":["Her book is a welcome addition to the literature on late Victorian Britain.","It was a welcome return to form for the current world champion.","Your letter was very welcome.","a welcome sight","welcome news","The fine weather made a welcome change.","The 1% rate cut is extremely welcome.","He made it plain that Holman's interest in his business affairs was not entirely welcome."],"opposite":"","synonyms":""},{"def":"used to say that you are happy for somebody to do something if they want to","examples":["Everyone is welcome to attend, but places are limited.","You're welcome to join us for dinner tomorrow.","You're more than welcome to come with us.","They're welcome to stay here as long as they like.","You're welcome to use the pool.","You are perfectly welcome to stay here: I can't offer five-star accommodation, that's all.","You are perfectly welcome to stay here, if you don't mind the mess."],"opposite":"","synonyms":""},{"def":"used to say that you are very happy for somebody to have something because you definitely do not want it","examples":["It's an awful job. If you want it, you're welcome to it!"],"opposite":"","synonyms":""},{"def":"used as a polite reply when somebody thanks you for something","examples":["‘Thanks for your help.’ ‘You're welcome.’"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"you’re welcome","def":"used as a polite reply when somebody thanks you for something","examples":["‘Thanks for your help.’ ‘You're welcome.’"]}],"phrasal":[],"related":[]},{"pos":"noun","level":"A2","meanings":[{"def":"something that you do or say to somebody when they arrive, especially something that makes them feel you are happy to see them","examples":["to get/receive a welcome","Thank you for your warm welcome.","The winners were given an enthusiastic welcome when they arrived home.","He returned to a hero’s welcome.","a speech/smile of welcome","She was asked to say a few words of welcome.","I wish to extend a very warm welcome to the team.","welcome to something It was a nice welcome to a strange new city.","A big welcome to our special guest, James Greenan.","A warm welcome awaits you at this family-run hotel.","She got a hero's welcome on her return from the Olympics.","She held out her arms in welcome.","Thank you for those words of welcome.","The audience gave the band a rousing welcome.","They received a cold welcome to their new home.","Ellen received a hero's welcome on returning to her home town.","Her wrinkled face broke into a smile of welcome."],"opposite":"","synonyms":""},{"def":"the way that people react to something, which shows their opinion of it","examples":["This new comedy deserves a warm welcome.","The proposals were given a cautious welcome by the trade unions.","The proposals have been given a broad welcome by green campaigners.","The proposal received a cautious welcome from the Opposition."],"opposite":"","synonyms":""},{"def":"to stay somewhere as a guest longer than you are wanted","examples":["Sensing that he had outstayed his welcome, he quickly said his goodbyes and left."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"outstay/overstay your welcome","def":"to stay somewhere as a guest longer than you are wanted","examples":["Sensing that he had outstayed his welcome, he quickly said his goodbyes and left."]}],"phrasal":[],"related":[]}]