[{"pos":"pronoun, determiner","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/whi/which/which__us_1.mp3","phonsUS":"/wɪtʃ/","level":"A1","meanings":[{"def":"used in questions to ask somebody to be exact about one or more people or things from a limited number","examples":["Which is better exercise—swimming or tennis?","Which way is the wind blowing?","Which would you prefer—chocolate cake or carrot cake?","He was turned into a rat by a wicked witch."],"opposite":"","synonyms":""},{"def":"used to be exact about the thing or things that you mean","examples":["Houses which overlook the lake cost more.","It was a crisis for which she was totally unprepared."],"opposite":"","synonyms":""},{"def":"used to give more information about something","examples":["His best movie, which won several awards, was about the life of Gandhi.","Your claim ought to succeed, in which case the damages will be substantial."],"opposite":"","synonyms":""},{"def":"used to talk about recognizing the difference between one person or thing and another","examples":["The twins are so alike I can't tell which is which."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"which is which","def":"used to talk about recognizing the difference between one person or thing and another","examples":["The twins are so alike I can't tell which is which."]}],"phrasal":[],"related":["Which?","which?","every which way","see which way the wind is blowing","know which side your bread is buttered"]},{"pos":"","level":"","meanings":[{"def":"a British organization that tests the quality of products and publishes the results each month in its magazine Which? and on its website. This helps people to choose the best products and also gives the organization influence, which it uses to protect the interests of people who buy goods or use services. The organization was formed in 1957 by the Consumers' Association.","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]