[{"pos":"adjective","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/wil/willi/willing__us_1.mp3","phonsUS":"/ˈwɪlɪŋ/","level":"B2","meanings":[{"def":"not objecting to doing something; having no reason for not doing something","examples":["Many consumers are willing to pay more for organic food","She seemed willing to accept my explanation.","He's still trying to find a lawyer willing to take his case.","I'm willing to give you the benefit of the doubt.","I'm willing to bet that she knows where he is.","He's quite willing to do anything to win.","I'm perfectly willing to discuss the problem.","They are willing and able to share their knowledge and experience.","We're ready and willing to do everything necessary to meet this challenge.","He showed himself willing to take a risk.","He's quite willing to do the same for you.","I'm more than willing to get involved.","She finally found someone willing to lend her some money.","She is always willing to help.","They appear willing to talk to us.","They keep a list of people willing to work nights.","He's willing to go to extreme lengths to find them.","Would you be willing to help me with my essay?","Unemployment can be defined as the number of people who are willing and able to work, but who cannot find jobs."],"opposite":"","synonyms":""},{"def":"ready or pleased to help and not needing to be persuaded; done or given in an enthusiastic way","examples":["a willing participant/accomplice","a willing buyer/seller","She's very willing.","willing helpers/volunteers","her willing acceptance of the responsibility","their willing participation in the plan","Willing hands pulled him to safety.","willing support/consent"],"opposite":"unwilling","synonyms":""},{"def":"to show that you are ready to help, work hard, etc. if necessary","examples":[],"opposite":"","synonyms":""},{"def":"you intend to do good things but you are too lazy, weak or busy to actually do them","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"show willing","def":"to show that you are ready to help, work hard, etc. if necessary","examples":[]},{"idiom":"the spirit is willing (but the flesh is weak)","def":"you intend to do good things but you are too lazy, weak or busy to actually do them","examples":[]}],"phrasal":[],"related":["God willing","show willing","the spirit is willing (but the flesh is weak)"]}]