[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/wil/will_/will__us_1.mp3","phonsUS":"/wɪl/","level":"","meanings":[{"def":"to want or like","examples":["Call it what you will, it's still a problem."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["Will","ill will","free will","will-call","living will","Rogers","Will and Grace","will-o’-the-wisp","it will","will power","will-o’-the-wisps","at will","that will do","with a will","accidents will happen","boys will be boys","it will cost you"]},{"pos":"verb","level":"","meanings":[{"def":"to use the power of your mind to do something or to make something happen","examples":["will something As a child he had thought he could fly, if he willed it enough.","will somebody/something to do something She willed her eyes to stay open.","He willed himself not to panic."],"opposite":"","synonyms":""},{"def":"to intend or want something to happen","examples":["They thought they had been victorious in battle because God had willed it."],"opposite":"","synonyms":""},{"def":"to formally give your property or possessions to somebody after you have died, by means of a will","examples":["will somebody something Joe had willed them everything he possessed.","will something (to somebody) Joe had willed everything he possessed to them."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"modal verb","level":"A1","meanings":[{"def":"used for talking about or predicting the future","examples":["You'll be in time if you hurry.","How long will you be staying in Paris?","Fred said he'd be leaving soon.","By next year all the money will have been spent.","Salt can heal wounds.","Her heel caught in the stairs and she tumbled down.","He'll arrive in a minute!"],"opposite":"","synonyms":""},{"def":"used for asking somebody to do something","examples":["Will you send this letter for me, please?","You'll water the plants while I'm away, won't you?","I asked him if he wouldn't mind calling later."],"opposite":"","synonyms":""},{"def":"used for inviting somebody to do something","examples":["Will you join us for lunch?"],"opposite":"","synonyms":""},{"def":"used for showing that somebody is willing to do something","examples":["I'll check this letter for you, if you want.","They won't lend us any more money.","He wouldn't come—he said he was too busy.","We said we would keep them."],"opposite":"","synonyms":""},{"def":"used for ordering somebody to do something","examples":["You'll do it this minute!","Will you be quiet!"],"opposite":"","synonyms":""},{"def":"used for stating what you think is probably true","examples":["That'll be the doctor now.","You'll have had dinner already, I suppose."],"opposite":"","synonyms":""},{"def":"used for stating what is generally true","examples":["If it's made of wood it will float.","Engines won't run without lubricants."],"opposite":"","synonyms":""},{"def":"used for stating what is true or possible in a particular case","examples":["This jar will hold a kilo.","The door won't open!"],"opposite":"","synonyms":""},{"def":"used for talking about habits","examples":["She'll listen to music, alone in her room, for hours.","He would spend hours on the telephone."],"opposite":"","synonyms":""},{"def":"used in questions with I for making offers or suggestions","examples":["Will I call back later?"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"noun","level":"B1","meanings":[{"def":"the ability to control your thoughts and actions in order to achieve what you want to do; a strong and determined desire to do something that you want to do","examples":["to have a strong will","to have an iron will/a will of iron","Her decision to continue shows great strength of will.","The matter became a battle of wills between the king and the barons.","The meeting turned out to be a clash of wills.","will to do something The government lacked the political will to reform the tax system.","In spite of what happened, he never lost the will to live.","His unassuming manner concealed an iron will.","I was driven by the pure will to survive.","It requires an act of will to make myself go running in the morning.","She gradually regained the will to live.","She has a very strong will.","She's lost the will to try and change things.","With a great effort of will he resisted her pleas.","her indomitable will to win"],"opposite":"","synonyms":""},{"def":"what somebody wants to happen in a particular situation","examples":["They governed according to the will of the people.","He thought he was doing the will of God.","against somebody's will I was forced to sign the agreement against my will.","I don't want to go against your will.","Much against my will, I let him go.","She always wants to impose her will on other people (= to get what she wants).","(formal) It is God's will.","She came of her own will (= because she wanted to), not forced by Antony.","My father didn't want me to leave home, and I didn't like to go against his will.","Is that the general will, that we keep the present voting arrangements?","They were taught to obey their father's will without question.","the collective/​general/​majority/​national/​popular/​public will","She usually manages to impose her will on the rest of the group."],"opposite":"","synonyms":""},{"def":"a legal document that says what is to happen to somebody’s money and property after they die","examples":["I ought to make a will.","in your will My father left me the house in his will.","She did not leave a will.","On March 25, 1616 William Shakespeare revised his last will and testament.","by will Some things cannot be given away by will (= in a will).","Under her father's will, she gets $5 000 a year.","They succeeded in getting the will overturned.","Two people must witness your signature or your will is not valid.","The family decided to contest the will in court.","She was moved when her neighbour remembered her in his will.","She left no will and was unmarried.","Remarriage would revoke all previous wills.","She left me some money in her will.","My aunt remembered me in her will.","Have you made your will?","His lawyer drew up the will."],"opposite":"","synonyms":""},{"def":"having the type of will mentioned","examples":["a strong-willed young woman","weak-willed greedy people"],"opposite":"","synonyms":""},{"def":"whenever or wherever you like","examples":["They were able to come and go at will.","She believes employers should have the right to hire and fire at will."],"opposite":"","synonyms":""},{"def":"if you really want to do something then you will find a way of doing it","examples":[],"opposite":"","synonyms":""},{"def":"used to say that you cannot do something, even though you really want to","examples":["With the best will in the world I could not describe him as a good father."],"opposite":"","synonyms":""},{"def":"in a willing and enthusiastic way","examples":["They set to work with a will."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"at will","def":"whenever or wherever you like","examples":["They were able to come and go at will.","She believes employers should have the right to hire and fire at will."]},{"idiom":"where there’s a will there’s a way","def":"if you really want to do something then you will find a way of doing it","examples":[]},{"idiom":"with the best will in the world","def":"used to say that you cannot do something, even though you really want to","examples":["With the best will in the world I could not describe him as a good father."]},{"idiom":"with a will","def":"in a willing and enthusiastic way","examples":["They set to work with a will."]}],"phrasal":[],"related":[]},{"pos":"","level":"","meanings":[{"def":"a first name for boys, short for William","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]