[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/win/windo/window__us_1.mp3","phonsUS":"/ˈwɪndəʊ/","level":"A1","meanings":[{"def":"an opening in the wall or roof of a building, car, etc., usually covered with glass, that allows light and air to come in and people to see out; the glass in a window","examples":["out of the window She looked out of the window.","through the window He saw her through the rear window of the car.","to open/close the window","the bedroom/kitchen/car window","a broken window","The burglars smashed a window to get in.","All the windows blew out with the force of the blast.","All the windows in the prison are barred.","He was standing at the window waiting for us.","How does the window open?","I rolled down the window to ask for directions.","I sat by the window to get some air.","It was raining so hard I could scarcely see out of the window.","No light showed in any of the blank windows of the house.","She gazed out of the window at the falling snow.","The windows all steam up when you have a shower.","The windows glinted in the sunlight.","The windows of the house stared bleakly down at her.","The windows rattle when a train goes past.","There was a vase of flowers in the window.","There was evidence that the window had been forced.","They threw a brick through the window.","We caught sight of him in the window as we passed.","a studio with windows looking out on the park","Keep all doors and windows closed.","a stained glass window","There was a view of the sky through open windows.","She could see a field of sunflowers just outside her window.","The flat has windows onto streets on two sides.","A bullet shattered the window to her room.","We get our windows cleaned every two months."],"opposite":"","synonyms":""},{"def":"the glass at the front of a shop and the area behind it where goods are shown to the public","examples":["in the window I saw the dress I wanted in the window.","a window display","I found her looking in the window of a department store.","There was a sign in the window advertising for staff."],"opposite":"","synonyms":""},{"def":"a small area of something that you can see through, for example to talk to somebody or read something on the other side","examples":["There was a long line of people at the box-office window.","We tapped on the window to get their attention.","The address must be clearly visible through the window of the envelope."],"opposite":"","synonyms":""},{"def":"an area within a frame on a computer screen, in which a particular program is operating or in which information of a particular type is shown","examples":["to create/open a window","Click on the window to make it active.","If you close a couple of windows, the screen will be less cluttered.","When you click on a link, a separate browser window opens for the new page."],"opposite":"","synonyms":""},{"def":"a way of seeing and learning about something","examples":["Television is a sort of window on the world.","It gave me an intriguing window into the way people live."],"opposite":"","synonyms":""},{"def":"a time when there is an opportunity to do something, although it may not last long","examples":["We now have a small window of opportunity in which to make our views known.","Do you have a window next Monday?"],"opposite":"","synonyms":""},{"def":"to stop existing; to disappear completely","examples":["As soon as the kids arrived, order went out of the window."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"fly/go out (of) the window","def":"to stop existing; to disappear completely","examples":["As soon as the kids arrived, order went out of the window."]}],"phrasal":[],"related":["bay window","oval window","rose window","sash window","shop window","window box","window seat","window tax","dormer window","French window","round window","store window","storm window","window ledge","window shade","window washer","lattice window","picture window","window cleaner"]}]