[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/win/winne/winner__us_2.mp3","phonsUS":"/ˈwɪnər/","level":"A2","meanings":[{"def":"a person, a team, an animal, etc. that wins something","examples":["The lucky winner gets an all-expenses-paid trip to Sydney.","an award winner","a medal/prize winner","a raffle/jackpot winner","the winner of a prize/an award","The winners of the competition will be announced next month.","There are no winners in a divorce (= everyone suffers).","They were decisively beaten by the eventual winners, Spain.","A panel of celebrity judges will pick the winners.","Several factors make the difference between winners and losers.","the 2018 World Cup winners","Johnson rode his 48th winner of the year.","Labour was the clear winner in Scotland.","This year's competition winners will be announced on November 13.","Barcelona look likely winners of the Spanish League.","Brazil, five-times winners of the World Cup","Bush was declared the winner of the election.","France were impressive 3–0 winners over Portugal.","He backed the winner and won £70.","She didn't win every race, but she was the overall winner.","She emerged as the clear winner.","She is a regular winner in local road races.","She is the most likely winner of the contest.","She was the lucky winner of that week's biggest lottery prize.","The winner will be chosen from the five architects who get through the first round.","The winner will receive a prize of $500.","There were no big winners in this week's lottery.","They were joint winners of the cup.","Who are the real winners in these elections?","With three teams finishing on 40 points, there was no outright winner.","a bronze medal winner","the winner of the race","England were comfortable winners against Australia last night.","He was declared the winner of the country's first presidential election.","He's a three-time World Cup winner and Olympic champion.","His first novel was an award winner and a bestseller."],"opposite":"","synonyms":""},{"def":"a thing or person that is successful or likely to be successful","examples":["I think your idea is a winner.","onto a winner The design is very good. We could be onto a winner (= we may do or produce something successful).","The Chardonnay, also at £6.99, is a real winner.","The film is predicted to be a sound box-office success rather than a runaway winner.","The park is a sure winner for a good day out."],"opposite":"","synonyms":""},{"def":"a goal or point that causes a team or a person to win a game","examples":["Morgan scored the winner after 20 minutes."],"opposite":"","synonyms":""},{"def":"to choose a horse, etc. that you think is most likely to win a race","examples":["He's very good at picking winners."],"opposite":"","synonyms":""},{"def":"to make a very good choice","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"pick a winner","def":"to choose a horse, etc. that you think is most likely to win a race","examples":["He's very good at picking winners."]}],"phrasal":[],"related":["prize winner","pick a winner"]}]