[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/wis/wisdo/wisdom__us_1.mp3","phonsUS":"/ˈwɪzdəm/","level":"B2","meanings":[{"def":"the ability to make sensible decisions and give good advice because of the experience and knowledge that you have","examples":["She was known to be a woman of great wisdom.","Do you have any more words of wisdom for us?","He is too lacking in worldly wisdom to be a politician.","Consultants are too often seen as the source of all wisdom.","Do you have any wisdom to impart on this subject?","He entertained the audience for two hours with his wit and wisdom.","The former world champion imparted a few words of wisdom to the young runners.","Children need to feel that their parents are in control; they don't have the experience or wisdom to know best.","I was not quite so lacking in worldly wisdom as to accept this invitation from a complete stranger."],"opposite":"","synonyms":""},{"def":"how sensible something is","examples":["I question the wisdom of giving a child so much money.","It's easy enough to see what we should have done, with the wisdom of hindsight.","The latest unemployment figures prove the wisdom of the government's policy.","Several people questioned the wisdom of building in that particular spot.","Many commentators doubted the political wisdom of introducing a new tax."],"opposite":"","synonyms":""},{"def":"the knowledge that a society or culture has gained over a long period of time","examples":["the collective wisdom of our people","You cannot just ignore the accumulated wisdom of a whole culture.","Traditional wisdom was passed on from generation to generation.","the accumulated wisdom of generations","We need to combine ancient wisdom and modern knowledge.","Those who seek wisdom at the shrine will find it.","They would go to the holy shrines to seek wisdom.","She devoted her life to the pursuit of wisdom.","The monks dedicate their lives to prayer and the pursuit of wisdom."],"opposite":"","synonyms":""},{"def":"the view or belief that most people hold","examples":["Conventional wisdom has it that riots only ever happen in cities.","Conventional wisdom has it that all sense of community has gone, but that is not the case where I live.","The received wisdom is that the book is always better than the film.","Contrary to conventional wisdom, stress is not always a bad thing.","Popular wisdom has it that higher oil prices are bad for economic growth."],"opposite":"","synonyms":""},{"def":"used when you are saying that you do not understand why somebody has done something","examples":["The government in its wisdom has decided to support the ban.","In their infinite wisdom they have decided to close the main road during the holiday season.","In their infinite wisdom, the council closed the swimming pool for the school holidays.","In their infinite wisdom, they closed the swimming pool at the busiest time of year."],"opposite":"","synonyms":""},{"def":"a wise remark","examples":["Thank you for those pearls of wisdom.","students eager to catch pearls of wisdom from the professor's lips","They would treat these pearls of wisdom with some scepticism.","His journals are full of dubious pearls of homespun wisdom."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"conventional/received/popular wisdom","def":"the view or belief that most people hold","examples":["Conventional wisdom has it that riots only ever happen in cities.","Conventional wisdom has it that all sense of community has gone, but that is not the case where I live.","The received wisdom is that the book is always better than the film.","Contrary to conventional wisdom, stress is not always a bad thing.","Popular wisdom has it that higher oil prices are bad for economic growth."]},{"idiom":"in his/her/its, etc. (infinite) wisdom","def":"used when you are saying that you do not understand why somebody has done something","examples":["The government in its wisdom has decided to support the ban.","In their infinite wisdom they have decided to close the main road during the holiday season.","In their infinite wisdom, the council closed the swimming pool for the school holidays.","In their infinite wisdom, they closed the swimming pool at the busiest time of year."]},{"idiom":"a pearl of wisdom","def":"a wise remark","examples":["Thank you for those pearls of wisdom.","students eager to catch pearls of wisdom from the professor's lips","They would treat these pearls of wisdom with some scepticism.","His journals are full of dubious pearls of homespun wisdom."]}],"phrasal":[],"related":["wisdom tooth","Seven Pillars of Wisdom","wisdom teeth","a pearl of wisdom","conventional/received/popular wisdom"]}]