[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/wis/wish_/wish__us_1.mp3","phonsUS":"/wɪʃ/","level":"A2","meanings":[{"def":"to want something to happen or to be true even though it is unlikely or impossible","examples":["wish (that)… I wish I were taller.","(British English also) I wish I was taller.","I wish I hadn't eaten so much.","‘Where is he now?’ ‘I only wish I knew!’","I wish you wouldn't leave your clothes all over the floor.","She really wished she’d stayed on at college.","He sat by the phone, wishing it would ring. ‘That’ is nearly always left out, especially in speech.","wish somebody/something/yourself + adj. He's dead and it's no use wishing him alive again.","wish somebody/something/yourself + adv./prep. She wished herself a million miles away.","Do you wish (that) you had a better job?","I wish he were here tonight.","I heartily wished that I had stayed at home.","I really wish I could go to America.","When I see the kids playing football, I almost wish I was their age again.","I only wish I had more time for research.","I just wish they were here to see me now."],"opposite":"","synonyms":""},{"def":"to want to do something; to want something to happen","examples":["You may stay until morning, if you wish.","‘I’d rather not talk now.’ ‘(Just) as you wish.’","wish to do something This course is designed for people wishing to update their computer skills.","I wish to speak to the manager.","I don't wish (= I don't mean) to be rude, but could you be a little quieter?","wish somebody something She could not believe that he wished her harm.","wish somebody/something to do something He was not sure whether he wished her to stay or go.","He did not wish it to be known that he was buying a present for his father.","I wish to thank my production team for all their support.","An employee, who wished to remain anonymous, gave details of the secret deal.","I also wish to express my gratitude to my colleagues.","They had an opportunity to sign up if they wished to participate.","There will be special fees for residents who wish to use the facilities.","Any farmers wishing to join the scheme should contact Kathryn Payne.","I never wish to see such horrific scenes again.","The final point I wish to make is about funding.","You can dance all night if you so wish."],"opposite":"","synonyms":""},{"def":"to think very hard that you want something, especially something that can only be achieved by good luck or magic","examples":["If you wish really hard, maybe you'll get what you want.","wish for something It's no use wishing for the impossible.","He has everything he could possibly wish for.","We couldn't have wished for a nicer hotel (= the hotel was exactly what we wanted).","wish for somebody/something to do something She shut her eyes and wished for him to get better."],"opposite":"","synonyms":""},{"def":"to say that you hope that somebody will be happy, lucky, etc.","examples":["wish somebody something I wished her a happy birthday.","Wish me luck!","wish somebody well We wish them both well in their retirement.","We wish you every success.","I sincerely wish him well in his future.","We wish him a speedy recovery."],"opposite":"","synonyms":""},{"def":"used to say that something is impossible or very unlikely, although you wish it were possible","examples":["‘You'll have finished by tomorrow.’ ‘I wish!’","A job at the BBC? You wish!"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"I/you wish!","def":"used to say that something is impossible or very unlikely, although you wish it were possible","examples":["‘You'll have finished by tomorrow.’ ‘I wish!’","A job at the BBC? You wish!"]}],"phrasal":["wish away","wish on"],"related":["wish on","wish away","wish list","death wish","wish lists","wish something away","wish somebody/something on somebody","your wish is my command","the wish is father to the thought"]},{"pos":"noun","level":"A2","meanings":[{"def":"used especially in a letter, email or card to say that you hope that somebody will be happy, well or successful","examples":["Give my good wishes to the family.","wish for something We all send our best wishes for the future.","With best wishes (= for example, at the end of a letter)","Give my best wishes to Alison.","Thanks to all those who sent well wishes.","With best wishes for a happy birthday.","I send best wishes for a speedy recovery.","Thanks for all the birthday wishes.","I would like to extend my warmest wishes to all of the staff."],"opposite":"","synonyms":""},{"def":"an attempt to make something happen by thinking hard about it, especially in stories when it often happens by magic","examples":["Throw some money in the fountain and make a wish.","The genie granted him three wishes.","The prince's wish came true.","If you're the one who finds the hidden box, you get a wish.","Lo and behold, on Christmas Day their wishes came true.","The good fairy granted her three wishes.","When you see a black cat, you have to make a wish.","I hope all your birthday wishes come true."],"opposite":"","synonyms":""},{"def":"a desire or a feeling that you want to do something or have something","examples":["wish to do something She expressed a wish to be alone.","He had no wish to start a fight.","His dearest wish (= what he wants most of all) is to see his grandchildren again.","wish for something I can understand her wish for secrecy.","wish that… It was her dying wish that I should have it.","He was denied his dying wish to be reconciled with his son.","I have no wish to cause any trouble among them.","In his wish to be as helpful as possible, he was forever asking her what she wanted.","She fulfilled her deepest wish when she flew solo for the first time.","She has expressed a wish to seek asylum here.","She has expressed a wish to visit the Houses of Parliament.","a wish for peace"],"opposite":"","synonyms":""},{"def":"a thing that you want to have or to happen","examples":["He refused to carry out her wishes.","I'm sure that you will get your wish.","against somebody's wishes She married against her parents' wishes.","Her father will not speak to her, because she married against his wishes.","In accordance with his wishes, his ashes were scattered at sea.","We need to update our equipment if we are to meet customers' wishes.","It is vital for schools to respect the wishes of parents.","She eventually went against her family's wishes and published her autobiography.","The committee rode roughshod over the wishes of union members.","She flew into a rage if the staff didn't obey her wishes.","She's always wanted to be an actress, and I'm sure she'll get her wish.","The Government blatantly ignored the wishes of the public.","The change to the constitution reflects the wishes of the people who voted in the referendum.","the child's detention against parental wishes","The department will definitely try to fulfil your wishes.","I create my design according to the wishes of the client.","They had entered the war against the wishes of the majority of the population.","Most of the stories in the book represent childhood wish fulfilment.","It was her expressed wish not to be kept alive by a machine.","It is my sincere wish that the council act on the decision."],"opposite":"","synonyms":""},{"def":"wishing for something does not make it happen","examples":[],"opposite":"","synonyms":""},{"def":"used to say that you are ready to do whatever somebody asks you to do","examples":[],"opposite":"","synonyms":""},{"def":"we believe a thing because we want it to be true","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"if wishes were horses, beggars would/might ride","def":"wishing for something does not make it happen","examples":[]},{"idiom":"your wish is my command","def":"used to say that you are ready to do whatever somebody asks you to do","examples":[]},{"idiom":"the wish is father to the thought","def":"we believe a thing because we want it to be true","examples":[]}],"phrasal":[],"related":[]}]