[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/wit/witne/witness__us_2.mp3","phonsUS":"/ˈwɪtnəs/","level":"B2","meanings":[{"def":"a person who sees something happen and is able to describe it to other people","examples":["He failed to interview a key witness.","witness to something Police have appealed for witnesses to the accident.","We have a witness to the killing.","According to witnesses, the man jumped out of his vehicle and attacked the other driver.","She gave a witness statement to the police.","Mark had to go into the witness protection programme to escape the violence.","A judicial investigation was ordered, but witnesses were threatened and none would testify.","According to witnesses, the thief escaped through the bedroom window.","Police have so far failed to trace any witnesses to the attack.","She was the only witness to identify Peters as the attacker.","The police are appealing for witnesses.","Two witnesses came forward with evidence.","Witnesses reported that the suspect was a white male.","He was charged with conspiracy to suborn witnesses."],"opposite":"","synonyms":""},{"def":"a person who gives evidence in court","examples":["a defence/prosecution witness","He was hired to be an expert witness in the trial.","to appear as (a) witness for the defence/prosecution","The defence called their first witness.","Several witnesses testified that there had been two gunmen.","Police have appealed for witnesses to the accident.","According to observers, the plane exploded shortly after take-off.","A crowd of onlookers gathered at the scene of the crash.","Police asked passers-by if they had witnessed the accident.","Three innocent bystanders were killed in the crossfire.","He was placed on a witness protection scheme.","He was subpoenaed as a witness in a bankruptcy case.","She appeared as a character witness.","She went into a witness protection program.","The jury convicted him on two counts of witness tampering.","The next witness took the stand.","the defence's chief witness","She appeared as a witness for the prosecution.","As the last person to see her alive, he was a material witness in the case."],"opposite":"","synonyms":"witness"},{"def":"a person who is present when an official document is signed and who also signs it to prove that they saw this happen","examples":["He was one of the witnesses at our wedding.","The will was signed in the presence of two witnesses.","witness to something There was no witness to her signature.","When you sign the contract you'll need a witness.","the marriage contract is signed in front of witnesses","Would you be willing to act as a witness to my signature when I sign my will?"],"opposite":"","synonyms":""},{"def":"evidence of a person’s strong religious beliefs, that they show by what they say and do in public","examples":[],"opposite":"","synonyms":""},{"def":"to provide evidence of the truth of something","examples":["The crowd of mourners at his funeral bore witness to the great affection in which he was held.","The ancient temples bear silent witness to the passing dynasties."],"opposite":"","synonyms":""},{"def":"to see something take place","examples":["He has been witness to a terrible murder.","a witness to murder"],"opposite":"","synonyms":""},{"def":"to show that something is true; to provide evidence for something","examples":["His good health is a witness to the success of the treatment."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"bear/give witness (to something)","def":"to provide evidence of the truth of something","examples":["The crowd of mourners at his funeral bore witness to the great affection in which he was held.","The ancient temples bear silent witness to the passing dynasties."]},{"idiom":"be (a) witness to something","def":"to see something take place","examples":["He has been witness to a terrible murder.","a witness to murder","His good health is a witness to the success of the treatment."]}],"phrasal":[],"related":["witness box","hostile witness","Jehovah’s Witness","witness tampering","witness stand","witness boxes","witness intimidation","bear/give witness (to something)"]},{"pos":"verb","level":"B2","meanings":[{"def":"to see something happen (typically a crime or an accident)","examples":["to witness an accident/a murder/an attack","Police have appealed for anyone who witnessed the incident to contact them.","We are now witnessing an unprecedented increase in violent crime.","She was shocked by the violent scenes she had witnessed.","The novel is based on an event that he himself had witnessed.","I couldn’t bear to witness their suffering.","We had witnessed one of the most outstanding theatrical performances of the decade.","It's one of the strongest pieces of dance theatre I've ever witnessed.","The first thing I noticed about the room was the smell.","Please note (that) the office will be closed on Monday.","The tests are designed to detect the disease early.","Have you observed any changes lately?","The police observed a man enter the bank.","Police have appealed for anyone who witnessed the incident to contact them."],"opposite":"","synonyms":"notice"},{"def":"to be the place, period, organization, etc. in which particular events take place","examples":["Recent years have witnessed a growing social mobility.","The retail trade is witnessing a sharp fall in sales.","The last century witnessed an unprecedented increase in violent crime."],"opposite":"","synonyms":""},{"def":"to be present when an official document is signed and sign it yourself to prove that you saw this happen","examples":["to witness a signature","The document was witnessed by a lawyer."],"opposite":"","synonyms":""},{"def":"to be a sign or proof of something","examples":["witness to something The huge attendance figures for the exhibition witness to a healthy interest in modern art.","as witnessed by something There has been increasing interest in her life and work, as witnessed by the publication of two new biographies."],"opposite":"","synonyms":""},{"def":"used when giving an example that proves something you have just said","examples":["Authentic Italian cooking is very healthy—witness the low incidence of heart disease in Italy."],"opposite":"","synonyms":""},{"def":"to speak to people about your strong religious beliefs","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]