[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/won/wonde/wonder__us_2.mp3","phonsUS":"/ˈwʌndər/","level":"B1","meanings":[{"def":"to think about something and try to decide what is true, what will happen, what you should do, etc.","examples":["‘Why do you want to know?’ ‘No particular reason. I was just wondering.’","wonder who, where, etc… I wonder who she is.","I was just beginning to wonder where you were.","You have to wonder just what he sees in her.","I can't help wondering whether I'm missing something here.","Have you ever wondered what your cat really thinks of you?","I always wondered why you never got married.","I'm still wondering how that could have happened.","I sometimes wonder where all this is going to end.","I often wonder what became of him.","wonder about somebody/something We were wondering about next April for the wedding.","+ speech ‘Where's Natasha?’ he wondered aloud.","‘Why do you ask?’ ‘I just wondered.’","I wonder why he left his job.","‘What should I do now?’ she wondered.","He's behaving so strangely. It makes you wonder whether he's in trouble somehow.","His obvious hunger made her wonder how long he had been up and about.","I can't help wondering if he lost on purpose.","I couldn't help but wonder what he was thinking.","I sometimes wonder who's crazier, him or me.","I wondered uneasily if anything had happened to the children.","I wondered vaguely whether Robert could be the murderer.","You're probably wondering what all the fuss is about.","By the end you are left wondering what on earth the film is trying to say.","We'd wondered about you as a possible team member."],"opposite":"","synonyms":""},{"def":"used as a polite way of asking a question or asking somebody to do something","examples":["I wonder if you can help me.","I was wondering whether you'd like to come to a party."],"opposite":"","synonyms":""},{"def":"to be very surprised by something","examples":["wonder (at something) She wondered at her own stupidity.","(British English, informal) He's gone and left us to do all the work, I shouldn't wonder (= I wouldn't be surprised if he had).","wonder (that)… I wonder (that) he didn’t hurt himself jumping over that wall.","I don't wonder you're tired. You've had a busy day."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["boy wonder","Wonder Bread™","Golden Wonder™","a chinless wonder","a nine days’ wonder","it’s a wonder (that)…","(it’s) no/little/small wonder (that)…","(it’s) small/little/no wonder (that)…"]},{"pos":"noun","level":"B1","meanings":[{"def":"a feeling of surprise and pleasure that you have when you see or experience something beautiful, unusual or unexpected","examples":["He retained a childlike sense of wonder.","in wonder She gazed down in wonder at the city spread below her.","His eyes were filled with wonder at the sights before him.","Neville shook his head in wonder at it all","She held her breath with wonder and delight.","The children's faces were full of wonder as they gazed up at the Christmas tree.","There aren't any words to express properly all the wonder that I feel."],"opposite":"","synonyms":""},{"def":"something that fills you with surprise and pleasure","examples":["The temple, built in 1403, is an architectural wonder.","wonder of something The Grand Canyon is one of the natural wonders of the world.","the wonders of modern technology","the Seven Wonders of the World (= the seven most impressive structures of the ancient world)","That's the wonder of poetry—you're always discovering something new.","technological wonders","The Canyon is one of the natural wonders of the world.","Iceland is full hot springs and other natural wonders.","Iceland is full hot springs, beautifully coloured rocks, and other natural wonders.","Now it is your turn to discover the wonder of Bermuda.","Thanks to the wonders of modern science, many common diseases will soon be things of the past.","The palace has been described as the eighth wonder of the world.","The restored painting is a wonder to behold.","It's all become possible, thanks to the wonders of modern technology."],"opposite":"","synonyms":""},{"def":"a person who is very clever at doing something; a person or thing that seems very good or effective","examples":["Dita, you're a wonder! I would never have thought of doing that.","Have you seen the boy wonder play yet?","a new wonder drug","We always go to her for the flowers. She's a wonder!","The club's new boy wonder scored two goals in the second half.","the new boy wonder of French football","She was determined to prove she was no seven-day wonder whose promise would remain unfulfilled.","The band aren't the one-hit wonders some had feared: their second album contains some great rap music.","The band was a one-hit wonder in the '80s—no one has heard of them since.","The public thinks we're a bunch of gutless wonders.","Cortisone was hailed as a wonder drug for a whole host of skin problems."],"opposite":"","synonyms":""},{"def":"a young, upper-class person who is considered weak and stupid","examples":[],"opposite":"","synonyms":""},{"def":"to have a very good effect on somebody/something","examples":["The news has done wonders for our morale.","The change of diet has done wonders for my skin."],"opposite":"","synonyms":""},{"def":"it is surprising or strange","examples":["It’s a wonder (that) more people weren’t hurt."],"opposite":"","synonyms":""},{"def":"a person or thing that makes people excited for a short time but does not last very long","examples":[],"opposite":"","synonyms":""},{"def":"it is not surprising","examples":["It is little wonder (that) she was so upset.","(informal) No wonder you're tired—you've been walking for hours.","No wonder you're still single—you never go out!"],"opposite":"","synonyms":""},{"def":"a phrase used to express surprise and pleasure at something","examples":["‘I've cleaned my room.’ ‘Wonders will never cease!’"],"opposite":"","synonyms":""},{"def":"to achieve very good results","examples":["Her new diet and exercise programme has worked wonders for her."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"a chinless wonder","def":"a young, upper-class person who is considered weak and stupid","examples":[]},{"idiom":"do wonders (for somebody/something)","def":"to have a very good effect on somebody/something","examples":["The news has done wonders for our morale.","The change of diet has done wonders for my skin."]},{"idiom":"it’s a wonder (that)…","def":"it is surprising or strange","examples":["It’s a wonder (that) more people weren’t hurt."]},{"idiom":"a nine days’ wonder","def":"a person or thing that makes people excited for a short time but does not last very long","examples":[]},{"idiom":"(it’s) no/little/small wonder (that)…","def":"it is not surprising","examples":["It is little wonder (that) she was so upset.","(informal) No wonder you're tired—you've been walking for hours.","No wonder you're still single—you never go out!"]},{"idiom":"wonders will never cease","def":"a phrase used to express surprise and pleasure at something","examples":["‘I've cleaned my room.’ ‘Wonders will never cease!’"]},{"idiom":"work wonders","def":"to achieve very good results","examples":["Her new diet and exercise programme has worked wonders for her."]}],"phrasal":[],"related":[]}]