[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/wor/word_/word__us_1.mp3","phonsUS":"/wɜːrd/","level":"A1","meanings":[{"def":"a single unit of language that means something and can be spoken or written","examples":["Do not write more than 200 words.","Do you know the words to this song?","word for something What's the Spanish word for ‘table’?","He was a true friend in all senses of the word.","Tell me what happened in your own words.","I could hear every word they were saying.","without speaking/uttering a word","He couldn't find the words to thank her enough.","Words fail me (= I cannot express how I feel).","There are no words to say how sorry we are.","I can't remember her exact words.","Angry is not the word for it—I was furious.","I can never put my feelings into words.","Do not write more than 200 words.","He uses a lot of long words.","technical/​legal/​scientific terms","‘Old man’ is a slang term for ‘father’.","Who coined the phrase ‘fake news’?","He tends to use a lot of slang expressions that I’ve never heard before.","‘Let the cat out of the bag’ is an idiom meaning to tell a secret by mistake.","‘Necessary’ is one of the most commonly misspelt words in English.","‘Technology’ comes from the Greek word ‘techne’.","‘Window’ derives from a Norse word meaning ‘eye of the wind’.","Bold words denote chapter headings.","By emphasizing particular words you can change the meaning.","Don't waffle in your essay just to get the right word count.","He chatters away at about 200 words per minute.","He enunciated the word with extreme care.","She kept shouting the word ‘No!’","He types 80 words per minute.","She uses big words to impress people.","He uses lots of long words.","She whispered the word to me.","He wrote down a few key words to help him remember what to say.","His exact words were, ‘There's nothing we can do about it.’","How is this word pronounced?","I couldn't find the right word to express the concept.","I daren't even mention the word ‘money’ to him.","I find even everyday words difficult to spell.","I found several misspelled words and grammatical errors.","I knew he'd been drinking because he was slurring his words.","I misheard the word ‘sick’ as ‘thick’.","I'm not sure what he said but the word sounded like ‘bull’.","It's a slang word meaning ‘boy’ or ‘person’.","People who overeat are not addicts in the true sense of the word.","Rearrange the letters to form a word.","She had memorized all the words to the song.","He looked the word up in the dictionary.","She deleted ‘girl’ and substituted the word ‘woman’.","She used loaded words like ‘bully’ when describing his actions.","He was so furious, he almost spat the words out: ‘You idiot!’","Spanish has no word for ‘understatement’.","The audience mouthed the words to all the songs.","The book uses simple words and pictures to explain complex processes.","The children are asked to think of rhyming words.","The look in her eyes filled in the unspoken words in her sentence.","The word ‘synergy’ combines ‘synthesis’ and ‘energy’.","The same word can carry numerous meanings.","The students had to retell the story in their own words.","The word ‘cruise’ conjures up images of a luxury.","The word ‘e-commerce’ was coined to refer to business done over the internet.","The word has two meanings.","The words at the end of the lines all rhyme.","These students have very poor word-recognition skills.","We didn't say a single word to each other all day.","We never heard anyone say an unkind word about her.","We recall the words of Martin Luther King, ‘Free at last’.","What's a word beginning with ‘c’ that means ‘a small wood’?","What's the French word for ‘snail’?","Words can't express how happy I am.","You can't always find the right word when you're translating.","You said we were about to make a big mistake, and never was a truer word spoken!","a more polite word for the same thing","a word that is often misused","words describing body parts","The word ‘politics’ is derived from a Greek word meaning ‘city’.","I was angry when I read these words.","The joke depended on the two meanings of the word 'star'.","The use of the word 'organic' is prohibited on products not covered by the Organic Foods Production Act."],"opposite":"","synonyms":"word"},{"def":"a thing that you say; a remark or statement","examples":["Have a word with Pat and see what she thinks.","Could I have a quick word with you (= speak to you quickly)?","A word of warning: read the instructions very carefully.","words of love/encouragement","She left without a word (= without saying anything).","I don't believe a word of his story (= I don't believe any of it).","a man of few words (= who doesn’t talk very much)","I'd like to say a few words about future plans.","Remember—not a word to (= don't tell) Peter about any of this.","He never breathed a word of this to me.","(British English) We've been married twenty years and there's never been a cross word between us (= we have never argued or been angry with each other).","Thank you for those kind words.","He wanted to tell her how he felt about her, but the words stuck in his throat.","Her last words were for her children.","She had some harsh words to say about her colleagues.","Her parting words were ‘I'll be back’.","Her teacher's words echoed in her ears.","His words conjured up a strange picture in her mind.","Her words were drowned out by the roar of the engine.","He was nervous, and his words came out in a rush.","He whispered a few words of prayer.","I don't believe a word of what she said.","I let my words hang in the air. Maggie was no fool: she must realize I meant it.","I listened to his words of wisdom.","I've had a few words with John, and he's quite happy for you to stay.","The words lingered in his mind long after they were spoken.","Those were her very words.","Don't breathe a word to anyone about what I've told you!","And now a word from our sponsors…","A word to the wise: just because it's a bargain doesn't mean you have to buy it.","He tried to calm her with soothing words.","Before we begin, I'd like to say a few words about who I am.","Despite all their fine words, the council have never done anything to improve road safety.","Despite his brave words, I don't believe he can save the factory from closure.","Every word he utters is considered sacred.","His words faded to silence as he saw she didn't believe him.","Her words fell into the silence like stones.","He chose his words carefully when commenting on her work.","She whispered words of comfort in his ear.","He never says a harsh word about his experiences.","the immortal words of Neil Armstrong as he stepped onto the moon","She felt angry at how the journalist had twisted her words.","He had blurted the words out before he realized it.","She could feel her temper boiling as his words sank in.","He ruined her self-confidence with a few well-chosen words.","Seconds after uttering the fateful words ‘this is easy!’ he crashed.","Nobody's uttered a word to me about it.","No polite words of gratitude came.","In her speech she echoed the President's words.","a word of advice/​caution","The government's promises on nurses' pay turned out to be weasel words.","Mark my words, this film will win an Oscar.","She instantly regretted her words.","He has given us a warning, and we should heed his words.","She was charmed by his friendly smile and polite words.","I usually exchange a few words with him when I see him.","I want to say a few words about Christina.","Those mocking words haunted me for years.","They exchanged whispered words of love.","The manager had a quiet word with Alison, and she gave him no more problems.","The advertising uses words and images to influence the public.","He hasn't a good word to say for anybody.","They show charity in word and deed.","She said the magic word, ‘Abracadabra!’.","the truth behind his words","Repeat the words after me.","You simply haven't understood a word I've said.","She left without a word of thanks.","Her choice of words is significant.","There are hardly words to describe how we all feel.","I don't have a bad word to say about her."],"opposite":"","synonyms":""},{"def":"a promise or guarantee that you will do something or that something will happen or is true","examples":["I give you my word that this won't happen again.","I give you my word of honour (= my sincere promise)…","We never doubted her word.","We only have his word for it that the cheque is in the post.","to keep your word (= do what you promised)","He promised to help and was as good as his word (= did what he promised).","He's a man of his word (= he does what he promises).","I trusted her not to go back on her word (= break her promise).","I can't prove it—you'll have to take my word for it (= believe me).","You needn't worry about him not paying you back—he's a man of his word.","I give you my word of honour I will not forget what I owe you.","She was as good as her word.","She won't go to the police. You can take my word for it.","They claimed that the minister had gone back on her word.","We only have his word for it that he wasn't there that night.","You can trust me. You know I always keep my word.","You gave me your word of honour.","We only have her word for it that she sent the payment.","True to his word, he returned next day.","She gave him her solemn word that she would give up drugs.","He gave me a promise, and I'm willing to trust his word.","Once he has made a promise, he never goes back on his word.","I'm sorry I doubted your word.","If it's your word against the police officer's, the jury are going to believe him.","I haven't seen his work, but I'll take his word for it that it's finished.","She gave me her word of honour that she wouldn't tell anyone."],"opposite":"","synonyms":""},{"def":"a piece of information or news","examples":["There's been no word from them since before Christmas.","She sent word that she would be late.","If word gets out about the affair, he will have to resign.","Word has it that she's leaving.","The word is they've split up.","He likes to spread the word about the importance of healthy eating.","Word that he had died spread fast.","We soon got word of his arrival.","We didn't get word of her arrest until the next day.","The word on the street is there's going to be a takeover.","Health workers spread the word about the benefits of immunization.","He sent word to his family that his captors were treating him well."],"opposite":"","synonyms":""},{"def":"the Bible and its teachings","examples":[],"opposite":"","synonyms":""},{"def":"what a person actually does means more than what they say they will do","examples":[],"opposite":"","synonyms":""},{"def":"to argue with somebody or speak rudely to them","examples":[],"opposite":"","synonyms":""},{"def":"to be a subject or an idea that people think is bad or morally wrong","examples":["Profit is not a dirty word around here.","Work is a dirty word to Frank."],"opposite":"","synonyms":""},{"def":"to be so surprised, confused, etc. that you do not know what to say","examples":[],"opposite":"","synonyms":""},{"def":"in a way that cannot be expressed in words","examples":["We were bored beyond words."],"opposite":"","synonyms":""},{"def":"because people tell each other and not because they read about it","examples":["The news spread by word of mouth.","The restaurant does not advertise, but relies on word of mouth for custom."],"opposite":"","synonyms":""},{"def":"to admit that what you said was wrong","examples":["When he told her she would fail, she swore she would make him eat his words."],"opposite":"","synonyms":""},{"def":"people sometimes say Famous last words! when they think somebody is being too confident about something that is going to happen","examples":["‘Everything's under control.’ ‘Famous last words!’"],"opposite":"","synonyms":""},{"def":"from the very beginning","examples":[],"opposite":"","synonyms":""},{"def":"(not) to be able to say anything because somebody else is speaking too much","examples":["When Mary starts talking, no one else can get a word in edgeways.","I wanted to tell you that she'd phoned, but you were talking so much I couldn't get a word in edgeways.","I wanted to tell you, but I couldn't get a word in."],"opposite":"","synonyms":""},{"def":"to listen with great attention to somebody you admire","examples":["The journalists hung on his every word as he spoke of his ordeal."],"opposite":"","synonyms":""},{"def":"to speak to somebody privately about something","examples":["Can I have a word in your ear about tomorrow's presentation?"],"opposite":"","synonyms":""},{"def":"to have an argument with somebody","examples":["We've had words.","Words were exchanged."],"opposite":"","synonyms":""},{"def":"used to introduce an explanation of something","examples":["They asked him to leave—in other words he was fired.","They're letting me go—in other words, I've been sacked.","Some poems are mnemonics, i.e. they are designed to help you remember something.","Some poems are mnemonics, that is to say, they are designed to help you remember something.","Mnemonic poems, that is poems designed to help you remember something, are an excellent way to learn lists.","A limerick’s rhyme scheme is A–A–B–B–A. In other words, the first, second, and fifth lines all rhyme with one another, while the third and fourth lines have their own rhyme.","In this exercise the reader is encouraged to work out the meaning, or rather the range of meanings, of the poem.","This is a poem about death, or, more precisely, dying.","He says his poems deal with ‘the big issues’, by which he means love, loss, grief and death."],"opposite":"","synonyms":""},{"def":"(not) in exactly the same words as somebody says were used","examples":["‘Did she say she was sorry?’ ‘Not in so many words.’","He didn't approve of the plan and said so in as many words.","They told me in so many words that I was no longer needed."],"opposite":"","synonyms":""},{"def":"used for giving a very short, usually negative, answer or comment","examples":["‘Would you like to help us?’ ‘In a word, no.’"],"opposite":"","synonyms":""},{"def":"using very simple language","examples":["Could you say that again in words of one syllable?"],"opposite":"","synonyms":""},{"def":"the last comment or decision about something","examples":["He always has to have the last word in any argument.","I’m willing to wait one more week, and that’s my final word on the subject.","The Chairman always has the last word on financial decisions."],"opposite":"","synonyms":""},{"def":"the most recent, fashionable, advanced, etc. thing","examples":["These apartments are the last word in luxury."],"opposite":"","synonyms":""},{"def":"used to tell somebody to say nothing about something and keep it secret","examples":[],"opposite":"","synonyms":""},{"def":"to never say anything good about somebody/something","examples":["Nobody had a good word to say about him."],"opposite":"","synonyms":""},{"def":"to say something in a direct way even though it might offend other people","examples":["They were severely criticized by the chairman, who was not a man to mince his words.","He doesn't mince his words when he talks about his ex-boss."],"opposite":"","synonyms":""},{"def":"used to emphasize that a particular word or phrase is the most important one in a sentence","examples":["I was in love with her—‘was’ being the operative word.","He seemed nice. But ‘seemed’ was the operative word."],"opposite":"","synonyms":""},{"def":"the humorous use of a word or phrase that can have two different meanings","examples":[],"opposite":"","synonyms":""},{"def":"what is published in books, newspapers, etc.","examples":["the power of the printed word"],"opposite":"","synonyms":""},{"def":"to praise somebody to somebody else in order to help them get a job, etc.","examples":["If you run into the boss, put in a good word for me!"],"opposite":"","synonyms":""},{"def":"to suggest that somebody has said something when in fact they have not","examples":["He felt after the interview that the police officers had been trying to put words into his mouth."],"opposite":"","synonyms":""},{"def":"to give an order; to make a request","examples":["Just say the word, and I'll go."],"opposite":"","synonyms":""},{"def":"to believe exactly what somebody says or promises","examples":["He said I could stay at his house any time, so I took him at his word."],"opposite":"","synonyms":""},{"def":"to say what somebody else was going to say","examples":["I was about to say we should cancel the trip, but she took the words right out of my mouth."],"opposite":"","synonyms":""},{"def":"extremely funny, silly, ridiculous, etc.","examples":[],"opposite":"","synonyms":""},{"def":"a bitter argument over a period of time between two or more people or groups","examples":["the political war of words over tax"],"opposite":"","synonyms":""},{"def":"to choose your words carefully so that you say exactly what you mean","examples":["He spoke slowly, weighing his words."],"opposite":"","synonyms":""},{"def":"used to show that you are surprised about something","examples":[],"opposite":"","synonyms":""},{"def":"in exactly the same words or (when translated) words with exactly the same meaning","examples":["She repeated their conversation word for word to me.","a word-for-word translation","He repeated word for word what the boy had said to him."],"opposite":"","synonyms":""},{"def":"somebody’s promise can be relied on completely","examples":[],"opposite":"","synonyms":""},{"def":"used to show that you are giving the general meaning of what somebody has said rather than the exact words","examples":["He told me to leave—or words to that effect."],"opposite":"","synonyms":""},{"def":"language expressed in writing rather than in speech","examples":["the permanence of the written word"],"opposite":"","synonyms":""}],"idioms":[{"idiom":"actions speak louder than words","def":"what a person actually does means more than what they say they will do","examples":[]},{"idiom":"bandy words (with somebody)","def":"to argue with somebody or speak rudely to them","examples":[]},{"idiom":"be a dirty word","def":"to be a subject or an idea that people think is bad or morally wrong","examples":["Profit is not a dirty word around here.","Work is a dirty word to Frank."]},{"idiom":"be lost for words","def":"to be so surprised, confused, etc. that you do not know what to say","examples":[]},{"idiom":"beyond words","def":"in a way that cannot be expressed in words","examples":["We were bored beyond words."]},{"idiom":"by word of mouth","def":"because people tell each other and not because they read about it","examples":["The news spread by word of mouth.","The restaurant does not advertise, but relies on word of mouth for custom."]},{"idiom":"eat your words","def":"to admit that what you said was wrong","examples":["When he told her she would fail, she swore she would make him eat his words."]},{"idiom":"famous last words","def":"people sometimes say Famous last words! when they think somebody is being too confident about something that is going to happen","examples":["‘Everything's under control.’ ‘Famous last words!’"]},{"idiom":"(right) from the word go","def":"from the very beginning","examples":[]},{"idiom":"(not) get a word in (edgeways)","def":"(not) to be able to say anything because somebody else is speaking too much","examples":["When Mary starts talking, no one else can get a word in edgeways.","I wanted to tell you that she'd phoned, but you were talking so much I couldn't get a word in edgeways.","I wanted to tell you, but I couldn't get a word in."]},{"idiom":"hang on somebody’s words/on somebody’s every word","def":"to listen with great attention to somebody you admire","examples":["The journalists hung on his every word as he spoke of his ordeal."]},{"idiom":"have a word in somebody’s ear","def":"to speak to somebody privately about something","examples":["Can I have a word in your ear about tomorrow's presentation?"]},{"idiom":"have/exchange words (with somebody) (about something)","def":"to have an argument with somebody","examples":["We've had words.","Words were exchanged."]},{"idiom":"in other words","def":"used to introduce an explanation of something","examples":["They asked him to leave—in other words he was fired.","They're letting me go—in other words, I've been sacked.","Some poems are mnemonics, i.e. they are designed to help you remember something.","Some poems are mnemonics, that is to say, they are designed to help you remember something.","Mnemonic poems, that is poems designed to help you remember something, are an excellent way to learn lists.","A limerick’s rhyme scheme is A–A–B–B–A. In other words, the first, second, and fifth lines all rhyme with one another, while the third and fourth lines have their own rhyme.","In this exercise the reader is encouraged to work out the meaning, or rather the range of meanings, of the poem.","This is a poem about death, or, more precisely, dying.","He says his poems deal with ‘the big issues’, by which he means love, loss, grief and death."]},{"idiom":"(not) in so/as many words","def":"(not) in exactly the same words as somebody says were used","examples":["‘Did she say she was sorry?’ ‘Not in so many words.’","He didn't approve of the plan and said so in as many words.","They told me in so many words that I was no longer needed."]},{"idiom":"in a word","def":"used for giving a very short, usually negative, answer or comment","examples":["‘Would you like to help us?’ ‘In a word, no.’"]},{"idiom":"in words of one syllable","def":"using very simple language","examples":["Could you say that again in words of one syllable?"]},{"idiom":"the last/final word (on something)","def":"the last comment or decision about something","examples":["He always has to have the last word in any argument.","I’m willing to wait one more week, and that’s my final word on the subject.","The Chairman always has the last word on financial decisions."]},{"idiom":"the last word (in something)","def":"the most recent, fashionable, advanced, etc. thing","examples":["These apartments are the last word in luxury."]},{"idiom":"mum’s the word!","def":"used to tell somebody to say nothing about something and keep it secret","examples":[]},{"idiom":"not have a good word to say for somebody/something","def":"to never say anything good about somebody/something","examples":["Nobody had a good word to say about him."]},{"idiom":"not mince (your) words","def":"to say something in a direct way even though it might offend other people","examples":["They were severely criticized by the chairman, who was not a man to mince his words.","He doesn't mince his words when he talks about his ex-boss."]},{"idiom":"the operative word","def":"used to emphasize that a particular word or phrase is the most important one in a sentence","examples":["I was in love with her—‘was’ being the operative word.","He seemed nice. But ‘seemed’ was the operative word."]},{"idiom":"a play on words","def":"the humorous use of a word or phrase that can have two different meanings","examples":[]},{"idiom":"the printed word/page","def":"what is published in books, newspapers, etc.","examples":["the power of the printed word"]},{"idiom":"put in a (good) word for somebody","def":"to praise somebody to somebody else in order to help them get a job, etc.","examples":["If you run into the boss, put in a good word for me!"]},{"idiom":"put words into somebody’s mouth","def":"to suggest that somebody has said something when in fact they have not","examples":["He felt after the interview that the police officers had been trying to put words into his mouth."]},{"idiom":"say/give the word","def":"to give an order; to make a request","examples":["Just say the word, and I'll go."]},{"idiom":"take somebody at their word","def":"to believe exactly what somebody says or promises","examples":["He said I could stay at his house any time, so I took him at his word."]},{"idiom":"take the words right out of somebody’s mouth","def":"to say what somebody else was going to say","examples":["I was about to say we should cancel the trip, but she took the words right out of my mouth."]},{"idiom":"too funny, silly, ridiculous, etc. for words","def":"extremely funny, silly, ridiculous, etc.","examples":[]},{"idiom":"a war of words","def":"a bitter argument over a period of time between two or more people or groups","examples":["the political war of words over tax"]},{"idiom":"weigh your words","def":"to choose your words carefully so that you say exactly what you mean","examples":["He spoke slowly, weighing his words."]},{"idiom":"(upon) my word","def":"used to show that you are surprised about something","examples":[]},{"idiom":"word for word","def":"in exactly the same words or (when translated) words with exactly the same meaning","examples":["She repeated their conversation word for word to me.","a word-for-word translation","He repeated word for word what the boy had said to him."]},{"idiom":"somebody’s word is their bond","def":"somebody’s promise can be relied on completely","examples":[]},{"idiom":"words to that effect","def":"used to show that you are giving the general meaning of what somebody has said rather than the exact words","examples":["He told me to leave—or words to that effect."]},{"idiom":"the written word","def":"language expressed in writing rather than in speech","examples":["the permanence of the written word"]}],"phrasal":[],"related":["C-word","F-word","boo word","wh-word","code word","word list","dirty word","multi-word","spoken word","swear word","taboo word","weasel word","word break","word class","word family","word search","content word","function word"]},{"pos":"verb","level":"","meanings":[{"def":"to write or say something using particular words","examples":["be worded How was the letter worded (= what did it say exactly)?","He issued a very strongly worded statement denying any involvement in the plot.","It's the same sentiment, though worded rather differently.","We need to word our question carefully.","a poorly worded request that resulted in confusion"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"exclamation","level":"","meanings":[{"def":"used to show that you accept or agree with what somebody has just said","examples":[],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]}]