[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/wor/world/world__us_1.mp3","phonsUS":"/wɜːrld/","level":"A1","meanings":[{"def":"the earth, with all its countries, peoples and natural features","examples":["a map of the world","French is spoken in many parts of the world.","in the world Which is the largest city in the world?","around/round the world to sail around the world","all over the world She has been all over the world.","throughout the world Their products are sold throughout the world.","They travelled the world for pleasure.","He's the world's highest paid entertainer.","a meeting of world leaders","campaigning for world peace","the world economy","world markets/trade","the world premiere of the movie","At this age, babies are starting to take an interest in the world around them.","Communist parties were formed on a world scale after the Russian Revolution.","Fast food outlets seem to be taking over the world.","He is on a quest to rid the world of evil.","In today's globalized world, telecommunications have broken down boundaries.","It's an interesting part of the world.","Many people imagine the world ending with an explosion.","One of these days, humankind will destroy the world.","People throughout the world will be watching the big game on television.","She had brought six children into the world.","Technology has remade the world.","The band are about to embark on a six-month world tour.","The ceremony was watched live by millions around the world.","The country became an important player on the world stage.","The movie had its world premiere at the Toronto Film Festival.","They believe that God created the world.","This is an imperfect world, and we have to compromise.","We come into the world with nothing.","World oil prices continue to rise.","a meeting of the major world powers","different ways of looking at the world"],"opposite":"","synonyms":""},{"def":"used before another noun to describe one of the most important people or things of their type in the world","examples":["the world champion/championship/record/title","As of October, her world ranking was No.1.","the major world religions","He has never before featured in the top ten world rankings.","He is at the head of a world media empire.","He was easily beaten by the reigning world champion.","She shattered the world record for the 200 metres.","The Portuguese team looked like world beaters in last night's game."],"opposite":"","synonyms":""},{"def":"a particular part of the earth; a particular group of countries or people; a particular period of history and the people of that period","examples":["the Arab world","In the Western world, there is a different attitude to marriage.","in the … world farmers in the developing world","The book has sold 12 million copies in the English-speaking world and has been translated into six languages.","in the modern/ancient world","The motto was inscribed on buildings throughout the Roman world.","a medieval map of the known world","Heads of state from all over the Arab world gathered for the conference.","In the ancient world, the jobs of miller and baker were usually combined.","These tribesmen are proud survivors of a vanishing world.","the industrialized and developing worlds"],"opposite":"","synonyms":""},{"def":"the people or things belonging to a particular group or connected with a particular interest, job, etc.","examples":["the animal/plant/insect world","the business/corporate world","She is a popular figure in the art world.","the world of something the world of politics/business/sport","the world of music/art/fashion","stars from the sporting and artistic worlds","He entered the world of politics in 1997.","He's well known in the fashion world.","In the world of finance there is little room for sentiment."],"opposite":"","synonyms":""},{"def":"everything that exists of a particular kind; a particular kind of life or existence","examples":["the natural world (= animals, plants, minerals, etc.)","the physical/material world","They are a couple in the real world as well as in the movie.","The island is a world of brilliant colours and dramatic sunsets.","They had little contact with the outside world (= people and places that were not part of their normal life).","I like living in the country because I'm interested in the natural world.","In the real world things don't always happen like they do in books.","Mediums claim to receive messages from the spirit world.","The movie is set in a bizarre post-apocalyptic world."],"opposite":"","synonyms":""},{"def":"our society and the way people live and behave; the people in the world","examples":["We live in a rapidly changing world.","Young people always think they are going to change the world.","It's not your job to save the world.","He's too young to understand the ways of the world (= how the world works).","The whole world was waiting for news of the astronauts.","She felt that the world was against her.","The eyes of the world are on the President (= many people around the world are waiting to see what the President will do).","News of the incident was slow to reach the wider world.","The bombing alienated world opinion.","The news of the assassination shook the world.","The wider world learned of his illness months after he told his family.","Throughout his time in prison he had no contact with the outside world.","He likes to sit outside his front door and watch the world go by.","a young writer who is taking the world by storm","He just wanted to shut himself away from the rest of the world.","scientists of world renown","Sweden leads the world in safety legislation.","She was determined to show the world that she was no loser.","She thinks the world revolves around her and her schedule.","She tends to divide the world into ‘winners’ and ‘losers’.","I'm sure we'll meet again. It's a very small world in this profession.","Aren't you interested in the world outside your window?","He was so happy to leave school, he felt ready to take on the world.","He wanted to tell the world how happy he was.","He seems to think that the world owes him a living.","For the first time since the death of her parents, she felt able to face the world.","He closed his eyes and tried to shut out the world.","Astronomers across the world will be watching the night sky.","He felt ready to take on the world when he finished college.","There is a whole other world outside school.","Can you imagine a world without possessions?","the new world order marked by American dominance"],"opposite":"","synonyms":""},{"def":"a way of life where possessions and physical pleasures are important, rather than spiritual values","examples":["monks and nuns renouncing the world"],"opposite":"","synonyms":""},{"def":"a person’s environment, experiences, friends and family, etc.","examples":["Parents are the most important people in a child's world.","When his wife died, his entire world was turned upside down.","Children often have their own private world.","His world fell apart when his wife died.","She has to deal with the day-to-day world of bills, schools, and problems.","She lives in her own inner world.","We come from different worlds."],"opposite":"","synonyms":""},{"def":"an environment that is imagined or constructed, for example in a computer game","examples":["Computer games create whole virtual worlds.","The game comprises four separate worlds, each split into six levels.","You're living in a fantasy world!","Show business gave him the chance to escape into another world.","She enjoys creating imaginary worlds for children."],"opposite":"","synonyms":""},{"def":"a planet like the earth","examples":["There may be other worlds out there."],"opposite":"","synonyms":""},{"def":"the state of human existence","examples":["this world and the next (= life on earth and existence after death)"],"opposite":"","synonyms":""},{"def":"to be loved by and very important to somebody","examples":[],"opposite":"","synonyms":""},{"def":"to be giving all your attention to something so that you do not notice what is happening around you","examples":["When he’s listening to music he’s lost to the world."],"opposite":"","synonyms":""},{"def":"the benefits of two or more completely different situations that you can enjoy at the same time","examples":["If you enjoy the coast and the country, you'll get the best of both worlds on this walk.","Maybe in the best of all possible worlds things would be different."],"opposite":"","synonyms":""},{"def":"to be completely different in attitudes, opinions, etc.","examples":["Although they are twins, they are worlds apart in their attitude to life."],"opposite":"","synonyms":""},{"def":"a situation or society that changes in a way that is meant to improve people’s lives but is often a source of extra problems","examples":["the brave new world of technology","the architects' vision of a brave new world of pristine concrete"],"opposite":"","synonyms":""},{"def":"to become less/more important or successful in society","examples":[],"opposite":"","synonyms":""},{"def":"to be born","examples":[],"opposite":"","synonyms":""},{"def":"in a deep sleep","examples":[],"opposite":"","synonyms":""},{"def":"to make somebody feel much better; to improve something","examples":["A change of job would do you the world of good."],"opposite":"","synonyms":""},{"def":"exactly as if…; exactly like somebody/something","examples":["She behaved for all the world as if nothing unusual had happened.","He looked for all the world like a schoolboy caught stealing apples."],"opposite":"","synonyms":""},{"def":"to be very successful and admired","examples":[],"opposite":"","synonyms":""},{"def":"used to emphasize something and to show that you are surprised or annoyed","examples":["What in the world did they think they were doing?"],"opposite":"","synonyms":""},{"def":"used to say that something is what you would like to happen or what should happen, but you know it cannot","examples":["In an ideal world we would be recycling and reusing everything.","In a perfect world no one would need to pay for healthcare.","In an ideal world, I'd like to work just three days a week."],"opposite":"","synonyms":""},{"def":"used to emphasize what you are saying","examples":["There's nothing in the world I'd like more than to visit New York.","Don't rush—we've got all the time in the world.","You look as if you haven't got a care in the world!","He felt he was the luckiest man in the whole world.","She told him he was her only friend in the whole wide world."],"opposite":"","synonyms":""},{"def":"if you are in a world of your own, you are so concerned with your own thoughts that you do not notice what is happening around you","examples":["I tapped on the window to get her attention but she was in a world of her own."],"opposite":"","synonyms":""},{"def":"used to express your surprise when you meet somebody you know in an unexpected place, or when you are talking to somebody and find out that you both know the same person","examples":[],"opposite":"","synonyms":""},{"def":"a person with a lot of experience of life, who is not easily surprised or shocked","examples":[],"opposite":"","synonyms":""},{"def":"not the worst thing that could happen to somebody","examples":["Failing one exam is not the end of the world.","It won't be the end of the world if you don't get the job."],"opposite":"","synonyms":""},{"def":"used to say that you would never do something","examples":["I wouldn't hurt you for the world."],"opposite":"","synonyms":""},{"def":"used to refer to people of a particular type","examples":["We all envy the Bill Gateses of this world (= the people who are as rich and successful as Bill Gates)."],"opposite":"","synonyms":""},{"def":"very happy or proud","examples":[],"opposite":"","synonyms":""},{"def":"used to emphasize how good, beautiful, etc. something is","examples":["The meal was out of this world."],"opposite":"","synonyms":""},{"def":"to make promises that will be impossible to keep","examples":["Politicians promise the earth before an election, but things are different afterwards."],"opposite":"","synonyms":""},{"def":"to travel widely and gain wide experience","examples":["As a young man, he wanted to see the world before he settled down."],"opposite":"","synonyms":""},{"def":"to be very successful and admired by other people","examples":["He's never going to set the world on fire with his paintings."],"opposite":"","synonyms":""},{"def":"to talk about how the world could be changed to be a better place","examples":["We stayed up all night, setting the world to rights."],"opposite":"","synonyms":""},{"def":"a state in which things are strange, mysterious or secret; a state that exists on the dividing line between two things","examples":["the twilight world of the occult","The dissidents lived in a twilight world of hushed voices and secret meetings.","the twilight zone between living and merely existing","They lived in the twilight zone on the fringes of society."],"opposite":"","synonyms":""},{"def":"to relax and watch people in a public place","examples":["We sat outside a cafe, watching the world go by.","I love just watching the world go by."],"opposite":"","synonyms":""},{"def":"the way that most people behave; the way that things happen, which you cannot change","examples":["The rich and powerful make the decisions—that's the way of the world."],"opposite":"","synonyms":""},{"def":"used to express dislike, surprise or shock, especially at changes in people’s attitudes or behaviour","examples":["When I listen to the news these days, I sometimes wonder what the world is coming to."],"opposite":"","synonyms":""},{"def":"used to say that you cannot do something, even though you really want to","examples":["With the best will in the world I could not describe him as a good father."],"opposite":"","synonyms":""},{"def":"everyone; a large number of people","examples":[],"opposite":"","synonyms":""},{"def":"used to emphasize how different two things are","examples":["His new luxury mansion was a world away from the tiny house where he was born."],"opposite":"","synonyms":""},{"def":"there is no limit to the opportunities open to you","examples":["With talent like that, the world is her oyster."],"opposite":"","synonyms":""},{"def":"used to emphasize how much difference there is between two things","examples":["There's a world of difference between liking someone and loving them."],"opposite":"","synonyms":""},{"def":"everywhere in the world","examples":["People are basically the same the world over.","Scientists the world over have been waiting for this breakthrough."],"opposite":"","synonyms":""},{"def":"a situation in which you have all the possible disadvantages at the same time","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be all the world to somebody","def":"to be loved by and very important to somebody","examples":[]},{"idiom":"be lost to the world","def":"to be giving all your attention to something so that you do not notice what is happening around you","examples":["When he’s listening to music he’s lost to the world."]},{"idiom":"the best of both worlds/all possible worlds","def":"the benefits of two or more completely different situations that you can enjoy at the same time","examples":["If you enjoy the coast and the country, you'll get the best of both worlds on this walk.","Maybe in the best of all possible worlds things would be different."]},{"idiom":"be worlds apart","def":"to be completely different in attitudes, opinions, etc.","examples":["Although they are twins, they are worlds apart in their attitude to life."]},{"idiom":"(a) brave new world","def":"a situation or society that changes in a way that is meant to improve people’s lives but is often a source of extra problems","examples":["the brave new world of technology","the architects' vision of a brave new world of pristine concrete"]},{"idiom":"come/go down/up in the world","def":"to become less/more important or successful in society","examples":[]},{"idiom":"come into the world","def":"to be born","examples":[]},{"idiom":"dead to the world","def":"in a deep sleep","examples":[]},{"idiom":"do somebody/something the world of good","def":"to make somebody feel much better; to improve something","examples":["A change of job would do you the world of good."]},{"idiom":"for all the world as if/though… | for all the world like somebody/something","def":"exactly as if…; exactly like somebody/something","examples":["She behaved for all the world as if nothing unusual had happened.","He looked for all the world like a schoolboy caught stealing apples."]},{"idiom":"have the world at your feet","def":"to be very successful and admired","examples":[]},{"idiom":"how, why, etc. in the world","def":"used to emphasize something and to show that you are surprised or annoyed","examples":["What in the world did they think they were doing?"]},{"idiom":"in an ideal/a perfect world","def":"used to say that something is what you would like to happen or what should happen, but you know it cannot","examples":["In an ideal world we would be recycling and reusing everything.","In a perfect world no one would need to pay for healthcare.","In an ideal world, I'd like to work just three days a week."]},{"idiom":"in the world","def":"used to emphasize what you are saying","examples":["There's nothing in the world I'd like more than to visit New York.","Don't rush—we've got all the time in the world.","You look as if you haven't got a care in the world!","He felt he was the luckiest man in the whole world.","She told him he was her only friend in the whole wide world."]},{"idiom":"(be/live) in a world of your own","def":"if you are in a world of your own, you are so concerned with your own thoughts that you do not notice what is happening around you","examples":["I tapped on the window to get her attention but she was in a world of her own."]},{"idiom":"it’s a small world","def":"used to express your surprise when you meet somebody you know in an unexpected place, or when you are talking to somebody and find out that you both know the same person","examples":[]},{"idiom":"a man/woman of the world","def":"a person with a lot of experience of life, who is not easily surprised or shocked","examples":[]},{"idiom":"not the end of the world","def":"not the worst thing that could happen to somebody","examples":["Failing one exam is not the end of the world.","It won't be the end of the world if you don't get the job."]},{"idiom":"not for (all) the world","def":"used to say that you would never do something","examples":["I wouldn't hurt you for the world."]},{"idiom":"the… of this world","def":"used to refer to people of a particular type","examples":["We all envy the Bill Gateses of this world (= the people who are as rich and successful as Bill Gates)."]},{"idiom":"on top of the world","def":"very happy or proud","examples":[]},{"idiom":"out of this world","def":"used to emphasize how good, beautiful, etc. something is","examples":["The meal was out of this world."]},{"idiom":"promise (somebody) the earth/moon/world","def":"to make promises that will be impossible to keep","examples":["Politicians promise the earth before an election, but things are different afterwards."]},{"idiom":"see the world","def":"to travel widely and gain wide experience","examples":["As a young man, he wanted to see the world before he settled down."]},{"idiom":"set the world on fire","def":"to be very successful and admired by other people","examples":["He's never going to set the world on fire with his paintings."]},{"idiom":"set/put the world to rights","def":"to talk about how the world could be changed to be a better place","examples":["We stayed up all night, setting the world to rights."]},{"idiom":"a/the twilight world (of something) | the twilight zone","def":"a state in which things are strange, mysterious or secret; a state that exists on the dividing line between two things","examples":["the twilight world of the occult","The dissidents lived in a twilight world of hushed voices and secret meetings.","the twilight zone between living and merely existing","They lived in the twilight zone on the fringes of society."]},{"idiom":"watch the world go by","def":"to relax and watch people in a public place","examples":["We sat outside a cafe, watching the world go by.","I love just watching the world go by."]},{"idiom":"the way of the world","def":"the way that most people behave; the way that things happen, which you cannot change","examples":["The rich and powerful make the decisions—that's the way of the world."]},{"idiom":"what is the world coming to?","def":"used to express dislike, surprise or shock, especially at changes in people’s attitudes or behaviour","examples":["When I listen to the news these days, I sometimes wonder what the world is coming to."]},{"idiom":"with the best will in the world","def":"used to say that you cannot do something, even though you really want to","examples":["With the best will in the world I could not describe him as a good father."]},{"idiom":"(all) the world and his wife","def":"everyone; a large number of people","examples":[]},{"idiom":"a world away (from something)","def":"used to emphasize how different two things are","examples":["His new luxury mansion was a world away from the tiny house where he was born."]},{"idiom":"the world is your oyster","def":"there is no limit to the opportunities open to you","examples":["With talent like that, the world is her oyster."]},{"idiom":"a/the world of difference","def":"used to emphasize how much difference there is between two things","examples":["There's a world of difference between liking someone and loving them."]},{"idiom":"the (whole) world over","def":"everywhere in the world","examples":["People are basically the same the world over.","Scientists the world over have been waiting for this breakthrough."]},{"idiom":"the worst of all (possible) worlds","def":"a situation in which you have all the possible disadvantages at the same time","examples":[]}],"phrasal":[],"related":["old-world","world war","First World","real-world","world-class","world music","world power","world view","world-weary","Disney World","virtual world","world-beater","world-beating","world English","world-famous","BBC World News","Gardeners' World","New World","Old World","World Cup"]}]