[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/wor/worry/worry__us_2.mp3","phonsUS":"/ˈwɜːri/","level":"A2","meanings":[{"def":"to keep thinking about unpleasant things that might happen or about problems that you have","examples":["Don't worry. We have plenty of time.","Stop worrying, Dad—it'll be fine.","worry about somebody/something Don't worry about me. I'll be all right.","He's always worrying about his weight.","Never mind—it's nothing to worry about.","That's not something you need to worry about.","worry about doing something You can stay here tonight, so you don't have to worry about walking home in the dark.","worry over somebody/something There's no point in worrying over things you can't change.","worry for somebody/something She's my sister, and I worry for her safety.","She began to worry for her friend.","worry (that)… I worry that I won't get into college.","Don't bother Harry—he has enough to worry about as it is.","Don't worry about me, I'll be fine.","Don't worry too much about it.","I can't help worrying about the future.","She worries a lot about crime.","We can't help worrying for your safety.","You do worry unnecessarily, you know.","You worry too much."],"opposite":"","synonyms":""},{"def":"to make somebody/yourself anxious about somebody/something","examples":["worry somebody/yourself What worries me is how I am going to get another job.","That prospect worried investors.","worry somebody/yourself about somebody/something Don't worry yourself about it—I'll deal with it.","worry somebody/yourself + adj. about somebody/something He's worried himself sick (= become extremely anxious) about his daughter.","worry somebody/yourself + adj. Where have you been? I've been worrying myself silly (= been extremely anxious) all evening.","it worries somebody that… It worries me that he hasn't come home yet.","it worries somebody to do something It worried me to think what might happen.","Don't let it worry you unduly.","What really worries me is what we do if there's nobody there."],"opposite":"","synonyms":""},{"def":"to annoy or upset somebody","examples":["worry somebody The noise never seems to worry her.","worry somebody with something Don't keep worrying him with a lot of silly questions.","I didn't want to worry you with all the details.","Don't worry the driver with unnecessary requests."],"opposite":"","synonyms":""},{"def":"to attack animals, especially sheep, by running after and/or biting them","examples":[],"opposite":"","synonyms":""},{"def":"it is not important; it does not matter","examples":["Not to worry—I can soon fix it.","Not to worry—no harm done."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"not to worry","def":"it is not important; it does not matter","examples":["Not to worry—I can soon fix it.","Not to worry—no harm done."]}],"phrasal":["worry at"],"related":["worry at","worry beads","don't worry","worry at something","be out of your mind with worry, etc.","be worried sick; be sick with worry"]},{"pos":"noun","level":"B1","meanings":[{"def":"the state of worrying about something","examples":["The threat of losing their jobs is a constant source of worry to them.","A heart attack can be brought on by stress and worry.","worry about something Levels of worry about crime had fallen by a third.","with worry to be frantic with worry","She couldn't sleep with worry.","He was sick with worry about everything.","Her mother's poor health caused her considerable worry.","I didn't know where he was and I was frantic with worry.","Money is a constant source of worry.","She gave her parents unnecessary worry when she forgot to call them.","Take the worry out of flying with our travel insurance offer.","The fact that she heard nothing from him only increased her worry.","There is no immediate cause for worry.","He claims the illness was caused by stress and worry."],"opposite":"","synonyms":""},{"def":"something that worries you","examples":["You need have no worries—everything's been taken care of.","worry about/over something worries about the future","worry about/over doing something She expressed some worries about working with him.","worry for/to somebody Mugging is a real worry for many old people.","worry (that)… There was the nagging worry that he wouldn't be able to match his past successes.","My only worry is that…","The biggest worry is that further stock market falls might dent consumer confidence.","money/financial worries","The news of his release from prison added further to her worries.","Students should discuss any problems or worries they have with their course tutors.","For years, the government has dismissed our worries as unfounded.","His mother's health is an enormous worry to him.","I had a nagging worry that we weren't going to get there.","It was a relief to share my secret worries with him.","Most of Nigel's worries proved groundless.","My greatest worry is that he'll do something stupid.","My immediate worry is money.","Paying the mortgage is a big worry for many people.","She wanted to enjoy her retirement without being beset by financial worries.","That year he had major health worries.","The dollar has fallen to a new low amid worries that the American economy is heading for trouble.","The earth tremors prompted worries of a second major earthquake.","The money side of things has been a constant worry.","The staff all work very hard—we've got no worries on that account.","These worries plagued him constantly.","They will not have worries over money.","Try and forget your worries for a little while.","When he lost his job, the size of his flat was the least of his worries."],"opposite":"","synonyms":""},{"def":"it’s not a problem; it’s all right (often used as a reply when somebody thanks you for something)","examples":["No worries—there's plenty of time."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"no worries!","def":"it’s not a problem; it’s all right (often used as a reply when somebody thanks you for something)","examples":["No worries—there's plenty of time."]}],"phrasal":[],"related":[]}]