[{"pos":"modal verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/wou/would/would__us_8_rr.mp3","phonsUS":"/wʊd/","level":"A1","meanings":[{"def":"used in polite offers or invitations","examples":["Would you like a sandwich?","Would you have dinner with me on Friday?"],"opposite":"","synonyms":""},{"def":"used to say what you like, love, hate, etc.","examples":["would like, love, hate, prefer, etc. something I'd love a coffee.","would like, etc. to do something I'd be only too glad to help.","would like, etc. somebody to do something I'd hate you to think I was criticizing you.","would rather do something I'd rather come with you.","would rather somebody did something I'd rather you came with us."],"opposite":"","synonyms":""},{"def":"used as the past form of will when reporting what somebody has said or thought","examples":["He said he would be here at eight o'clock (= His words were: ‘I will be there at eight o'clock.’).","She asked if I would help.","They told me that they probably wouldn't come."],"opposite":"","synonyms":""},{"def":"used for talking about the result of an event that you imagine","examples":["She'd look better with shorter hair.","If you went to see him, he would be delighted.","Hurry up! It would be a shame to miss the beginning of the play.","She'd be a fool to accept it (= if she accepted)."],"opposite":"","synonyms":""},{"def":"used for describing a possible action or event that did not in fact happen, because something else did not happen first","examples":["If I had seen the advertisement in time, I would have applied for the job.","They would never have met if she hadn't gone to Emma's party."],"opposite":"","synonyms":""},{"def":"used for saying why somebody does something","examples":["so that somebody/something would do something She burned the letters so that her husband would never read them.","in order that somebody/something would do something He worked hard in order that he would pass all his exams."],"opposite":"","synonyms":""},{"def":"used for saying what you want to happen","examples":["I wish that you'd be quiet for a minute."],"opposite":"","synonyms":""},{"def":"used to show that somebody/something was not willing or refused to do something","examples":["She wouldn't change it, even though she knew it was wrong.","My car wouldn't start this morning."],"opposite":"","synonyms":""},{"def":"used to ask somebody politely to do something","examples":["Would you mind leaving us alone for a few minutes?","Would you open the door for me, please?"],"opposite":"","synonyms":""},{"def":"used to give opinions that you are not certain about","examples":["I would imagine the job will take about two days.","I'd say he was about fifty."],"opposite":"","synonyms":""},{"def":"used to give advice","examples":["I wouldn't have any more to drink, if I were you."],"opposite":"","synonyms":""},{"def":"used for talking about things that often happened in the past","examples":["When my parents were away, my grandmother would take care of me.","He'd always be the first to offer to help."],"opposite":"","synonyms":""},{"def":"used for talking about behaviour that you think is typical","examples":["‘She said it was your fault.’ ‘Well, she would say that, wouldn't she? She's never liked me.’"],"opposite":"","synonyms":""},{"def":"used to express a strong wish","examples":["Would that he had lived to see it.","He can speak three languages.","She will try and visit tomorrow.","You must find a job.","You ought to stop smoking.","I used to smoke but I gave up two years ago.","Can I invite Mary?","Should I have invited Mary?","I said I’d (I would) be late.","He’d (he would) have liked to have been an actor.","I’d (I would) really prefer tea.","We should really go and visit them soon.","You should have seen it!"],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["would-be","it would","would love","would like to meet","would rather… (than)","would you believe (it)?","as chance would have it","how would you like it?","as luck would have it","Would you care for something?","chance would be a fine thing","Would you care to do something?","I, etc. would just as soon do something","if wishes were horses, beggars would/might ride","a rose by any other name would smell as sweet","what do/would you say (to something/doing something)","I, etc. would sooner do something (than something else)","wild horses would not drag somebody somewhere, make somebody do something, etc."]}]