[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/wou/wound/wound__us_2.mp3","phonsUS":"/wuːnd/","level":"B2","meanings":[{"def":"an injury to part of the body, especially one in which a hole is made in the skin using a weapon","examples":["a gunshot/stab wound","a bullet/knife/shrapnel wound","a head/leg wound","an old war wound","The nurse cleaned the wound.","The wound healed slowly.","He died of his wounds.","wound to something He suffered a fatal wound to the abdomen.","He died from the wounds he had received to his chest.","He died of gunshot wounds to the head.","He had deep wounds in his chest.","He had suffered multiple stab wounds to his chest.","His old war wounds still ached in certain weathers.","It was a clean wound, and it healed quickly.","She suffered numerous slash and puncture wounds to her arms and upper body.","The President's self-inflicted wounds have called his credibility into question.","The animal died from an infected wound.","a fatal gunshot wound","He proudly showed us his war wounds.","She survived, despite receiving severe stab wounds."],"opposite":"","synonyms":""},{"def":"mental or emotional pain caused by something unpleasant that has been said or done to you","examples":["Seeing him again opened up old wounds.","They say that time heals all wounds.","After a serious argument, it can take some time for the wounds to heal.","The incident remains a festering wound."],"opposite":"","synonyms":""},{"def":"to spend time trying to get your strength or confidence back after a defeat or a disappointing experience","examples":["Leeds are still licking their wounds after their humiliating defeat by Grimsby."],"opposite":"","synonyms":""},{"def":"to remind somebody of something unpleasant that happened or existed in the past","examples":["His comments have served only to reopen old wounds."],"opposite":"","synonyms":""},{"def":"to make a difficult experience even more difficult for somebody","examples":[],"opposite":"","synonyms":""}],"idioms":[{"idiom":"lick your wounds","def":"to spend time trying to get your strength or confidence back after a defeat or a disappointing experience","examples":["Leeds are still licking their wounds after their humiliating defeat by Grimsby."]},{"idiom":"reopen old wounds","def":"to remind somebody of something unpleasant that happened or existed in the past","examples":["His comments have served only to reopen old wounds."]},{"idiom":"rub salt into the wound | rub salt into somebody’s wounds","def":"to make a difficult experience even more difficult for somebody","examples":[]}],"phrasal":[],"related":[]},{"pos":"verb","level":"B2","meanings":[{"def":"to injure part of the body, especially by making a hole in the skin using a weapon","examples":["He had been wounded in the arm.","The driver was seriously wounded in the shooting.","Two soldiers were wounded in yesterday's fighting.","She was fatally wounded in the attack.","His leg had been badly wounded in the helicopter crash.","He injured his knee playing hockey.","Three people were injured in the crash.","50 people were seriously wounded in the attack.","Did you hurt yourself?","Don’t strain your eyes by reading in poor light.","One reporter was wounded in the leg.","She was fatally wounded in a car crash.","About 50 people were seriously wounded in the attack.","He was mortally wounded by an assassin.","Police fired on demonstrators, killing thirteen and wounding fourteen others."],"opposite":"","synonyms":"injure"},{"def":"to hurt somebody’s feelings","examples":["She had been deeply wounded by his remarks.","Friends say he has been wounded by the criticism.","Their indifference wounded him.","You wounded his pride.","It seemed to me I had wounded her ego."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":[]},{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/wou/wound/wound__us_3.mp3","phonsUS":"/waʊnd/","level":"","meanings":[],"idioms":[],"phrasal":[],"related":[]}]