[{"pos":"verb","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/wri/write/write__us_1.mp3","phonsUS":"/raɪt/","level":"A1","meanings":[{"def":"to make letters or numbers on a surface, especially using a pen or a pencil","examples":["In some countries children don't start learning to read and write until they are six.","write in something Please write in pen on both sides of the paper.","write with something I haven't got anything to write with.","write something Write your name at the top of the paper.","The teacher wrote the answers on the board.","The ‘b’ had been wrongly written as a ‘d’.","Children must learn to write neatly.","I write with an old fashioned pen.","She was busily writing in a notebook.","She wrote in Arabic.","The words were written in red.","Please write clearly in black ink.","We teach children to write when they are about six.","Write your answer out again on a new sheet of paper."],"opposite":"","synonyms":""},{"def":"to produce something in written form so that people can read, perform or use it, etc.","examples":["write something to write a novel/song/computer program","to write an article/essay","Who was ‘The Grapes of Wrath’ written by?","Which opera did Verdi write first?","He hopes to write a book about his experiences one day.","She had to write a report on the project.","The text is very well written.","The play was originally written for British television.","write about something I wanted to travel and then write about it.","write for something He writes for the ‘New Yorker’ (= works as a writer).","No decision has been made at the time of writing.","write somebody something She wrote him several poems.","After ‘Tom Sawyer’, Twain went on to write several other classic books.","Doris writes with verve and wit.","He has been commissioned to write a history of the town.","She has written extensively on the subject.","He set out to write a short book on taxation.","He writes on political issues.","Her novel was written under the pseudonym Currer Bell.","She was inspired to write the poem by a visit to the cathedral.","The role was written specifically for Rita Hayworth.","a journalist who writes about problems in the developing world","an art critic who writes regularly in the French daily ‘Le Figaro’","history written from the perspective of the losers","Someone had written a slogan on the wall.","Students will be expected to write their own computer programs.","She wrote a list on the back of an old envelope.","He wrote in his journal.","She writes a column for ‘The New York Times’.","the ability to write clearly in plain English","The film was written and directed by Tim Robbins.","He has written a very positive review of the film.","She wrote an article for the respected journal Science.","The children wrote stories about their pets.","She was asked to write a short piece of music for the orchestra.","Students were required to write two research papers.","He wrote scripts for stage, screen and radio.","I have written a few blog posts in the last couple of months.","This is his only novel written for children."],"opposite":"","synonyms":""},{"def":"to put information, a message of good wishes, etc. in a letter or an email and send it to somebody","examples":["Bye! Don't forget to write.","I'm writing to enquire about language courses.","write to somebody She wrote to him in France.","write something to somebody I wrote a letter to the Publicity Department.","write somebody something I wrote the Publicity Department a letter.","write that… She wrote that they were all fine.","write somebody (North American English) Write me while you're away.","write somebody that… (North American English) He wrote me that he would be arriving Monday.","write doing something They wrote thanking us for the present.","He wrote to the editor of the newspaper.","He still writes to me regularly.","She wrote me a postcard from Spain."],"opposite":"","synonyms":""},{"def":"to state the information or the words mentioned","examples":["write that… The author writes that this theory has now been disproved.","write of something Ancient historians wrote of a lost continent beneath the ocean.","She wrote of her life in Africa.","+ speech ‘Of all my books,’ wrote Dickens, ‘I like this the best.’"],"opposite":"","synonyms":""},{"def":"to put information in the appropriate places on a form","examples":["write something (out) to write (out) a cheque","write somebody something The doctor wrote her a prescription for more antibiotics.","write somebody out something I'll write you out a receipt."],"opposite":"","synonyms":""},{"def":"to record data in the memory of a computer","examples":["An error was reported when he tried to write data to the file for the first time."],"opposite":"","synonyms":""},{"def":"to work correctly or in the way mentioned","examples":["This pen won't write."],"opposite":"","synonyms":""},{"def":"to be very obvious to other people from the expression on somebody’s face","examples":["Guilt was written all over his face."],"opposite":"","synonyms":""},{"def":"to show clearly the quality mentioned or the influence of the person mentioned","examples":["It was a performance with star quality written all over it.","This essay has got Mike written all over it."],"opposite":"","synonyms":""},{"def":"not especially good; ordinary","examples":["The team’s performance was nothing to write home about."],"opposite":"","synonyms":""},{"def":"having no value, especially legally, or because one of the people involved has no intention of doing what they said they would","examples":[],"opposite":"","synonyms":""},{"def":"used when you are stating that there is nothing more that can be said about something or that something is completely finished","examples":["We were doing well but we ran out of money and that’s all she wrote."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"be written all over somebody’s face","def":"to be very obvious to other people from the expression on somebody’s face","examples":["Guilt was written all over his face."]},{"idiom":"have something/somebody written all over it/somebody","def":"to show clearly the quality mentioned or the influence of the person mentioned","examples":["It was a performance with star quality written all over it.","This essay has got Mike written all over it."]},{"idiom":"nothing (much) to write home about","def":"not especially good; ordinary","examples":["The team’s performance was nothing to write home about."]},{"idiom":"not worth the paper it’s written/printed on","def":"having no value, especially legally, or because one of the people involved has no intention of doing what they said they would","examples":[]},{"idiom":"that’s all she wrote","def":"used when you are stating that there is nothing more that can be said about something or that something is completely finished","examples":["We were doing well but we ran out of money and that’s all she wrote."]}],"phrasal":["write away","write back","write down","write in","write into","write off","write out","write up"],"related":["write in","write-in","write up","write-up","write off","write-off","write out","read-write","write away","write back","write-back","write down","write-down","write into","write-protect","write-in candidate","write-ins","write-ups","write-downs","write-offs"]}]