[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/w/wri/writi/writing__us_4.mp3","phonsUS":"/ˈraɪtɪŋ/","level":"A1","meanings":[{"def":"the activity of writing, in contrast to reading, speaking, etc.","examples":["Our son’s having problems with his reading and writing (= at school)","a writing case (= containing paper, pens, etc.)","Every morning the children do writing."],"opposite":"","synonyms":""},{"def":"the activity of writing books, articles, etc., especially as a job","examples":["Only later did she discover a talent for writing.","I wanted to try out a new style of writing.","creative writing","feminist/travel writing","He is leaving the band to concentrate on his writing.","the process of writing for publication","The class takes a student-centred approach to creative writing.","Housman's description of the writing of poetry","The book aims to teach effective essay writing.","Students do most of their academic writing in English.","His writing style is well suited to this subject matter."],"opposite":"","synonyms":""},{"def":"books, articles, etc. in general","examples":["The review is a brilliant piece of writing.","the composer's fine writing for the piano","an anthology of writing about jazz","Her early writing was concerned with the French Revolution.","the evaluation of student writing","You find a greater use of the passive in scientific writing.","You find more technical words in scientific writing."],"opposite":"","synonyms":""},{"def":"words that have been written or painted on something","examples":["There was writing all over the desk."],"opposite":"","synonyms":""},{"def":"the particular way in which somebody forms letters when they write","examples":["Who's this from? I don't recognize the writing.","I can't read your writing.","I didn't recognize the writing.","The list was in Elizabeth's writing.","He has very neat writing.","He's got very neat writing."],"opposite":"","synonyms":""},{"def":"a group of pieces of writing, especially by a particular person or on a particular subject","examples":["His experiences in India influenced his later writings.","the writings of Hegel","writings on something His writings on complex subjects are clear and definitive.","Christians share some of their sacred writings with the Jews.","Her influence has been greatest through her writings.","Her name crops up frequently in writings about the Renaissance.","Her writings reflect the breadth of her interests.","His writings on the history of art were published by Greenway and Settle.","His writings provide us with a first-hand account of the civil war.","His writings range from ancient to contemporary art, and include a study of Giorgione's paintings.","Ruskin's Collected Writings","a collection of writings by artists","The book is a collection of writings on death by various authors."],"opposite":"","synonyms":""},{"def":"in the form of a letter, document, etc. (that gives proof of something)","examples":["All telephone reservations must be confirmed in writing.","Could you put your complaint in writing?","You must get it in writing.","This agreement has to be confirmed in writing.","The arrangement was never put into writing."],"opposite":"","synonyms":""},{"def":"used when you are describing a situation in which there are signs that something is going to have problems or that it is going to be a failure","examples":["It is amazing that not one of them saw the writing on the wall."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"in writing","def":"in the form of a letter, document, etc. (that gives proof of something)","examples":["All telephone reservations must be confirmed in writing.","Could you put your complaint in writing?","You must get it in writing.","This agreement has to be confirmed in writing.","The arrangement was never put into writing."]},{"idiom":"the writing is on the wall | see the writing on the wall","def":"used when you are describing a situation in which there are signs that something is going to have problems or that it is going to be a failure","examples":["It is amazing that not one of them saw the writing on the wall."]}],"phrasal":[],"related":["writing desk","writing paper","automatic writing","mirror writing","writing desks","the writing is on the wall","see the writing on the wall"]}]