[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/y/yar/yard_/yard__us_1.mp3","phonsUS":"/jɑːrd/","level":"B1","meanings":[{"def":"a piece of land next to or around your house where you can grow flowers, fruit, vegetables, etc., usually with a lawn (= an area of grass)","examples":["They have a gorgeous old oak tree in their front yard.","My next-door neighbor was watering her yard.","He entered the yard through the back gate.","I've landscaped my tiny front yard with tall grasses.","Most of the yard was covered with leaves.","She was standing in the yard.","The front yard is fenced for privacy.","We crossed the yard to my house.","the huge bay window overlooking the yard","I had to cut the grass in the yard.","Two houses in the street had yard signs, one for Trump and one for Clinton.","The outside yard was decorated with orange lights."],"opposite":"","synonyms":""},{"def":"an area outside a building, usually with a hard surface and a surrounding wall","examples":["The prisoners were made to line up in the prison yard.","The children were playing in the yard at the front of the school.","I left our school yard at recess and ran home.","The prisoners were taken to the exercise yard.","The yard was enclosed by a high wire fence.","kids playing in the school yard","They rode out of the stable yard."],"opposite":"","synonyms":""},{"def":"an area of land used for a special purpose or business","examples":["a boat yard","a chocolate/​cigarette/​clothing factory","a nuclear power plant","a manufacturing plant","a cotton/​paper/​textile/​woollen mill","a brickworks","a steelworks","Raw materials were carried to the works by barge.","a shipyard","a car repair workshop","an iron foundry","a construction yard","wood from a lumber yard","The steam tug was on her way to the breaker's yard at the end of her naval service."],"opposite":"","synonyms":"factory"},{"def":"a unit for measuring length, equal to 3 feet (36 inches) or 0.9144 of a metre","examples":["They still live within yards of each other.","a beautiful white dress with yards and yards of fabric","The accident happened less than 50 yards from his home."],"opposite":"","synonyms":""},{"def":"a long piece of wood fastened to a mast that supports a sail on a boat or ship","examples":[],"opposite":"","synonyms":""},{"def":"used to say that if you allow some people a small amount of freedom or power they will see you as weak and try to take a lot more","examples":[],"opposite":"","synonyms":""},{"def":"everything, or a situation which includes everything","examples":["When Dan cooks dinner he always goes the whole nine yards, with three courses and a choice of dessert."],"opposite":"","synonyms":""}],"idioms":[{"idiom":"give somebody an inch (and they’ll take a mile/yard)","def":"used to say that if you allow some people a small amount of freedom or power they will see you as weak and try to take a lot more","examples":[]},{"idiom":"the whole nine yards","def":"everything, or a situation which includes everything","examples":["When Dan cooks dinner he always goes the whole nine yards, with three courses and a choice of dessert."]}],"phrasal":[],"related":["Yard","yard sale","livery yard","timber yard","salvage yard","Scotland Yard","50-yard line","knacker’s yard","marshalling yard","New Scotland Yard","Elegy Written in a Country Church Yard","yard sales","give somebody an inch (and they’ll take a mile/yard)"]}]