[{"pos":"noun","pronUS":"https://www.oxfordlearnersdictionaries.com/media/english/us_pron/y/you/youth/youth__us_1.mp3","phonsUS":"/juːθ/","level":"B1","meanings":[{"def":"the time of life when a person is young, especially the time before a child becomes an adult","examples":["in somebody's youth He had been a talented musician in his youth.","She regrets that she spent her youth travelling and not studying.","to relive/recapture your youth","He joked that being good at cards was the sign of a misspent youth (= having wasted his time when he was young).","He played football throughout his youth.","He started going clubbing in his early youth.","He wasted his youth in front of a computer screen.","His lack of qualifications was taken as a sign of a misspent youth.","I haven't danced since my youth!","She contracted the disease during her youth.","She saw it as a chance to relive her misspent youth.","She spent much of her youth in Hong Kong.","nostalgia for her lost youth"],"opposite":"","synonyms":""},{"def":"the quality or state of being young","examples":["She brings to the job a rare combination of youth and experience.","His youth gives him an advantage over the other runners.","Her extreme youth was against her.","Though no longer in the first flush of youth she's still remarkably energetic.","You still have your youth—that's the main thing.","from youth to maturity","in search of eternal youth"],"opposite":"","synonyms":""},{"def":"young people considered as a group","examples":["the nation’s youth","Many people think the youth of today are not taught proper standards of behaviour.","training for unemployed youth","an increase in youth unemployment","contemporary youth culture","a youth worker (= somebody who works with young people)","Youth and adults tend to see things very differently.","the aspirations of modern youth","youth outreach programs run by the charity","a program to educate our youth on the causes of health problems","a crackdown on youth crime","a club for the gilded youth of London","The website targets unemployed youth.","The Royal Family is facing an uncertain future, according to the nation's youth."],"opposite":"","synonyms":""},{"def":"a young man","examples":["The fight was started by a gang of youths.","A 17-year-old youth has been arrested.","She's going out with some spotty youth.","He was a callow youth when he joined the newspaper."],"opposite":"","synonyms":""}],"idioms":[],"phrasal":[],"related":["youth club","youth court","youth custody","youth hostel","youth hostelling","Fountain of Youth","National Youth Orchestra","Youth Hostels Association","National Academy for Gifted and Talented Youth","youth clubs","youth courts","youth hostels"]}]